[
  {
    "question_text": "Which of the following best defines 'drag' as discussed in the section?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The force exerted by a fluid opposing the motion of an object.",
      "B. The gravitational force acting on an object.",
      "C. The friction between two solid surfaces.",
      "D. The force required to accelerate an object from rest."
    ],
    "correct_answer": "A. The force exerted by a fluid opposing the motion of an object.",
    "explanation": "Drag is the frictional force that fluids (air, water, etc.) exert on objects moving through them, which opposes the motion and causes energy loss.",
    "topic": "Fluid Friction",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen068"
  },
  {
    "question_text": "Which factors affect the frictional force (drag) experienced by an object moving through a fluid?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. The speed of the object relative to the fluid.",
      "B. The shape of the object.",
      "C. The nature (or viscosity) of the fluid.",
      "D. All of the above."
    ],
    "correct_answer": "D. All of the above.",
    "explanation": "Drag depends on multiple factors: the object’s speed, its shape, and the properties of the fluid it is moving through. Each factor influences how much energy is lost due to fluid friction.",
    "topic": "Fluid Friction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen069"
  },
  {
    "question_text": "Why are vehicles, such as aeroplanes, designed with streamlined shapes?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. To increase static friction with the ground.",
      "B. To maximize fluid friction for better control.",
      "C. To reduce the drag force and minimize energy loss.",
      "D. To make them visually appealing only."
    ],
    "correct_answer": "C. To reduce the drag force and minimize energy loss.",
    "explanation": "Streamlined shapes allow the fluid (air or water) to flow over the surface more smoothly, reducing the frictional drag and consequently the energy loss during motion.",
    "topic": "Fluid Friction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen070"
  },
  {
    "question_text": "The design of an aeroplane is inspired by the shape of birds because:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Birds cannot fly without a streamlined shape.",
      "B. Their streamlined shapes help minimize drag in a fluid.",
      "C. They mimic static friction patterns observed in nature.",
      "D. It improves only the aesthetic value of the aeroplane."
    ],
    "correct_answer": "B. Their streamlined shapes help minimize drag in a fluid.",
    "explanation": "Both birds and aeroplanes have streamlined shapes that reduce the resistance (drag) experienced when moving through fluids, leading to more efficient motion.",
    "topic": "Fluid Friction",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen071"
  },
  {
    "question_text": "Define fluid friction.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Fluid friction is the force of friction exerted by fluids (such as air and water) on objects moving through them.",
    "explanation": "In science, fluids include both liquids and gases. As an object moves through a fluid, the fluid molecules interact with its surface, creating a frictional force known as drag.",
    "topic": "Fluid Friction",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen072"
  },
  {
    "question_text": "Explain how fluid friction (drag) causes energy loss in moving objects.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Fluid friction, or drag, opposes the motion of objects moving through a fluid, converting some of their kinetic energy into other forms (such as heat), which results in energy loss.",
    "explanation": "When an object moves through a fluid, it must overcome the resistance provided by the fluid's frictional force. This work done against drag means that energy is continually expended to maintain motion, causing a loss of useful kinetic energy.",
    "topic": "Fluid Friction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen073"
  },
  {
    "question_text": "List two examples from nature where streamlined design helps reduce drag.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Birds and fishes are two examples; their bodies have evolved streamlined shapes to reduce fluid friction when moving through air and water, respectively.",
    "explanation": "The streamlined shapes of birds and fishes ensure that they lose less energy while moving through their respective fluids. This natural adaptation has even inspired the design of vehicles such as aeroplanes.",
    "topic": "Fluid Friction",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen074"
  },
  {
    "question_text": "Describe the relationship between an object's shape and the drag force it experiences in a fluid. How does a streamlined shape contribute to this relationship?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An object's shape heavily influences the drag force because it determines how smoothly a fluid flows around it. A streamlined shape minimizes disturbances in the fluid flow, reducing the drag force. In contrast, a blunt or irregular shape causes more turbulent flow and greater energy loss.",
    "explanation": "When a fluid flows over a streamlined body, it adheres closely to its surface with minimal separation, thereby reducing friction. This efficient flow minimizes the energy required to push the fluid out of the way, resulting in lower drag. Tireless research and observations of nature have led to better understanding of fluid dynamics, ultimately guiding the design of high-speed vehicles.",
    "topic": "Fluid Friction",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen075"
  },
  {
    "question_text": "Discuss how observations of birds and fishes have influenced the design of modern vehicles to reduce fluid friction. Include in your answer the benefits of a streamlined design.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Observations of birds and fishes have shown that naturally evolved streamlined shapes reduce drag and improve efficiency in fluid environments. Engineers have adopted these principles for designing vehicles like aeroplanes and cars. The streamlined design minimizes disturbances in the fluid, leading to decreased drag force, increased energy efficiency, and improved performance. By reducing the energy lost against fluid friction, vehicles can achieve higher speeds and better fuel economy.",
    "explanation": "Nature serves as an excellent model for efficient designs. Birds and fishes have had millions of years to refine their shapes to move easily through air and water. This natural selection has given rise to forms that reduce drag and resist deceleration. Modern engineers emulate these designs to create vehicles that require less power to overcome drag, thereby boosting performance and reducing energy consumption.",
    "topic": "Fluid Friction",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen076"
  },
  {
    "question_text": "True or False: Fluid friction is also known as drag.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True. Fluid friction is commonly referred to as drag, as it is the force resisting motion through fluids.",
    "explanation": "The term 'drag' is widely used in science and engineering to describe the frictional force exerted by a fluid on an object in motion.",
    "topic": "Fluid Friction",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen077"
  },
  {
    "question_text": "True or False: The frictional force on an object in a fluid increases as its speed decreases. If false, provide the correct relationship.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. In reality, the drag (fluid friction) typically increases with an increase in the object's speed relative to the fluid.",
    "explanation": "Drag is related to the speed at which an object moves through a fluid. Generally, higher speeds disrupt the fluid flow more, resulting in higher frictional resistance.",
    "topic": "Fluid Friction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen078"
  },
  {
    "question_text": "True or False: Designing vehicles with streamlined shapes is solely for aesthetic purposes. If false, explain the primary reason for such designs.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. The primary reason for designing vehicles with streamlined shapes is to reduce fluid friction (drag), thereby improving energy efficiency and performance.",
    "explanation": "Although aesthetics can be a factor in design, the major driving force behind streamlined shapes in vehicles is to ensure minimal resistance from the surrounding air or water. This leads to lower energy consumption and enhanced functionality.",
    "topic": "Fluid Friction",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hesc109",
    "section_id": "07_section_9_6",
    "question_id": "cbse_viii_hesc1dd_c109_gen079"
  }
]