[
  {
    "question_text": "In the experiment where a thin glass tube is inserted into the dark zone of a candle flame and a matchstick is brought near the other end, what phenomenon is observed at the free end of the tube?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) A small spark is generated",
      "B) A continuous flame appears",
      "C) The tube shatters due to heat",
      "D) No visible change occurs"
    ],
    "correct_answer": "B) A continuous flame appears. The flame forms because unburnt wax vapours travel through the tube and ignite when they come into contact with the matchstick's flame.",
    "explanation": "This observation demonstrates that the innermost dark zone of a candle flame contains unburnt wax vapours. When these vapours travel through the tube and meet an ignition source, they burn, forming a continuous flame.",
    "topic": "Structure of a Candle Flame",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen054"
  },
  {
    "question_text": "Which zone of a candle flame is the hottest?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Innermost dark zone",
      "B) Middle yellow luminous zone",
      "C) Outermost blue non-luminous zone",
      "D) The entire flame is of equal temperature"
    ],
    "correct_answer": "C) Outermost blue non-luminous zone. This zone exhibits complete combustion and reaches the highest temperatures.",
    "explanation": "Although the inner zones exhibit partial combustion, the outermost blue region is where combustion is complete, thereby making it the hottest part of the candle flame.",
    "topic": "Temperature Zones in a Flame",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen055"
  },
  {
    "question_text": "Why does the experiment using the glass tube and matchstick demonstrate that substances that vaporise during burning produce flames?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) The wax cools down and forms a flame",
      "B) The wax vapours travel and ignite at the free end of the tube",
      "C) The matchstick emits chemicals that react with the glass",
      "D) The tube itself heats up to produce light"
    ],
    "correct_answer": "B) The wax vapours travel and ignite at the free end of the tube. The Experiment shows that the wax, when heated, vaporises and these vapours, when ignited, form a flame.",
    "explanation": "The process of combustion in a candle involves the vaporisation of the wax. When these unburnt wax vapours exit the tube, they mix with oxygen and are ignited by the matchstick, forming a visible flame.",
    "topic": "Combustion and Vaporisation in Flames",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen056"
  },
  {
    "question_text": "Which of the following substances does NOT produce a flame because it does not vapourise during burning?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A) Wax",
      "B) Kerosene oil",
      "C) Charcoal",
      "D) Molten paraffin"
    ],
    "correct_answer": "C) Charcoal. Unlike wax and kerosene, charcoal does not vapourise and therefore does not contribute to the flame formation.",
    "explanation": "Charcoal remains solid and does not go into a vapor phase during burning; hence it does not produce a flame in the same manner as substances that vapourise, such as wax or kerosene.",
    "topic": "Combustion of Different Materials",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen057"
  },
  {
    "question_text": "Define 'unburnt wax vapours' as observed in the innermost dark zone of a candle flame.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Unburnt wax vapours are gaseous forms of wax that result from the melting and gentle vaporisation of the wax near the heated wick. These vapours have not undergone complete combustion.",
    "explanation": "When a candle burns, the heat causes wax to melt and then vaporise. The innermost dark zone contains these unburnt wax vapours, which are yet to combust until they meet enough oxygen or an ignition source.",
    "topic": "Phase Change in Combustion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen058"
  },
  {
    "question_text": "Describe the observation when a clean glass slide is held in the luminous (yellow) zone of a candle flame. What does this indicate about that particular region of the flame?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A circular, blackish ring forms on the slide, indicating the deposition of unburnt carbon particles. This signifies that the yellow luminous zone is a region of incomplete combustion.",
    "explanation": "The blackish deposit is due to small, unburnt carbon particles produced during partial combustion. The visible ring confirms that the luminous part of the flame does not burn the fuel completely.",
    "topic": "Incomplete Combustion and Carbon Deposition",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen059"
  },
  {
    "question_text": "Why do goldsmiths use the outermost zone of a flame to melt metals like gold and silver?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Goldsmiths use the outermost blue zone because it is the hottest part of the flame, capable of delivering sufficient heat to melt metals with high melting points.",
    "explanation": "The outermost zone experiences complete combustion and achieves the highest temperatures. This makes it ideal for melting metal, as it ensures efficient heat transfer and a quick rise to the required melting temperature.",
    "topic": "Real-world Applications of Combustion",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen060"
  },
  {
    "question_text": "Describe the step-by-step process of Activity 4.5 as conducted in the study of candle flame structure, and explain how the observations support the conclusion that vapourisation of substances produces flames.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The experiment starts by lighting a candle and inserting a thin glass tube into the dark, innermost zone of the flame using tongs. A lighted matchstick is then brought near the free end of the tube. Soon after, a flame appears at the end of the tube, indicating that wax vapours have travelled from the inner zone through the tube and ignited. This observation confirms that the unburnt wax vapours are responsible for flame production. Additionally, introducing a glass slide into the luminous zone results in a blackish ring due to the deposition of carbon, further illustrating differences in combustion across flame zones.",
    "explanation": "This detailed description explains the experimental design which divides the candle flame into different zones. The appearance of a flame at the tube’s end, due to vaporised wax, demonstrates that fuel in the gas phase contributes to combustion. The observation on the glass slide corroborates the nature of the yellow zone as one where incomplete combustion occurs, depositing carbon particles.",
    "topic": "Experimental Methods in Combustion Analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen061"
  },
  {
    "question_text": "Discuss the significance of temperature variations within the different zones of a candle flame, and explain how these properties are utilized in various real-world applications such as metal melting and chemical reactions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The temperature in a candle flame varies with the zone: the innermost dark zone (lowest temperature) contains unburnt wax vapours, the middle yellow luminous zone has moderate temperature due to partial combustion, and the outermost blue zone is the hottest because of complete combustion. These temperature variations are critical in determining the chemical reactions that occur in each zone. In real-world applications, such as metal melting in goldsmithing, the hottest outer zone is harnessed to provide the high heat necessary to reach the melting points of metals like gold and silver. Moreover, understanding these variations aids in optimizing combustion for industrial burners and chemical reactors, ensuring efficiency and safety.",
    "explanation": "This analysis emphasizes the relationship between combustion efficiency and temperature distribution within the flame. Recognizing that the complete combustion zone (blue) offers the highest temperature helps in designing processes that require intense heat, such as metallurgy and high-temperature chemical synthesis.",
    "topic": "Temperature Distribution and Applications in Combustion",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen062"
  },
  {
    "question_text": "True or False: The innermost zone of a candle flame contains fully combusted wax and emits bright light. If false, provide the correct statement.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. The innermost zone of a candle flame contains unburnt wax vapours and does not emit bright light due to incomplete combustion.",
    "explanation": "The innermost, dark zone is characterized by unburnt wax vapours. Because the combustion here is incomplete, it does not produce significant light compared to other zones where combustion is more complete.",
    "topic": "Candle Flame Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen063"
  },
  {
    "question_text": "True or False: The formation of a blackish ring on a glass slide held in the luminous zone suggests complete combustion of the fuel. If this statement is false, provide the correct explanation.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. The blackish ring indicates the deposition of unburnt carbon particles, which results from incomplete combustion in the luminous zone.",
    "explanation": "Incomplete combustion in the yellow luminous zone produces small carbon particles that settle on surfaces, such as a glass slide, as a blackish ring. Complete combustion would leave little to no residue.",
    "topic": "Incomplete Combustion and Residue Formation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen064"
  },
  {
    "question_text": "Design an experiment to investigate how varying the wick length in a candle affects the temperature distribution across the flame. Include details on experimental setup, variables to measure, method of data collection, and potential expected outcomes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A possible experimental design would include using candles with different wick lengths while keeping other properties (such as candle size and wax type) constant. The setup would involve a thermocouple or infrared thermometer to measure temperature at different zones of the flame, specifically in the innermost, middle, and outermost zones. Data collection would be done by recording temperatures at fixed intervals and under controlled conditions (no wind, constant ambient temperature). The independent variable is wick length, while dependent variables are the measured temperatures in each zone. It is expected that longer wick lengths might produce a larger flame with altered temperature gradients, possibly due to changes in fuel vaporisation rates and oxygen availability.",
    "explanation": "This experimental design enables investigation into the relationship between wick length and flame temperature distribution. Using precise temperature measurement tools and maintaining control over external factors allows for an accurate representation of how wick length influences combustion efficiency and the resultant heat distribution.",
    "topic": "Experimental Design in Combustion Studies",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_viii_hesc1dd_c104_gen065"
  }
]