[
  {
    "question_text": "Fill in the blanks: (a) Friction opposes the _____________ between the surfaces in contact with each other. (b) Friction depends on the _____________ of surfaces. (c) Friction produces __________. (d) Sprinkling of powder on the carrom board ________ friction. (e) Sliding friction is ___________ than the static friction.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "a: relative motion; b: nature or roughness; c: heat; d: reduces; e: less",
    "explanation": "Friction opposes the relative motion between contacting surfaces, which depends on the nature or roughness of the surfaces. When surfaces rub against each other, friction produces heat. Sprinkling powder on a carrom board reduces the friction between the board and the striker, and once an object is in motion, sliding friction is typically less than static friction because the micro-contacts have less time to form strong bonds.",
    "topic": "Force of Friction and Factors Affecting Friction",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex001"
  },
  {
    "question_text": "Four children were asked to arrange the forces due to rolling, static, and sliding frictions in decreasing order. Their arrangements are given below. Choose the correct arrangement.",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "rolling, static, sliding",
      "rolling, sliding, static",
      "static, sliding, rolling",
      "sliding, static, rolling"
    ],
    "correct_answer": "static, sliding, rolling",
    "explanation": "Static friction is the force that must be overcome to initiate motion and is generally greater than the sliding friction encountered once an object is moving. Rolling friction is even lower compared to sliding friction due to the reduced contact area and the nature of rolling motion. Therefore, the decreasing order is: static > sliding > rolling.",
    "topic": "Friction Forces",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex002"
  },
  {
    "question_text": "Alida runs her toy car on a dry marble floor, wet marble floor, newspaper, and towel spread on the floor. Determine the force of friction acting on the car on these different surfaces in increasing order.",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "wet marble floor, dry marble floor, newspaper and towel",
      "newspaper, towel, dry marble floor, wet marble floor",
      "towel, newspaper, dry marble floor, wet marble floor",
      "wet marble floor, dry marble floor, towel, newspaper"
    ],
    "correct_answer": "wet marble floor, dry marble floor, towel, newspaper",
    "explanation": "A wet marble floor provides a lubricated, smoother surface that minimizes friction. The dry marble floor, though smooth, has a higher friction force than its wet counterpart. Among the two rough surfaces, the towel generally has a texture that produces more friction than marble but may be lower than that of newspaper if the newspaper surface is crinkled or uneven. Based on the expected experimental observations and reasoning, the increasing order of friction is: wet marble floor < dry marble floor < towel < newspaper.",
    "topic": "Factors Affecting Friction",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex003"
  },
  {
    "question_text": "Suppose your writing desk is tilted a little and a book placed on it starts sliding down. Show the direction of the frictional force acting on the book.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The frictional force acts upward along the inclined surface, opposite to the direction of the book's motion.",
    "explanation": "Friction always opposes the motion or the attempted motion of an object. In this case, as the book slides down due to gravity, the frictional force acts upward, along the plane of the desk, to oppose its downward motion.",
    "topic": "Force of Friction (Static and Sliding Friction)",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex004"
  },
  {
    "question_text": "You spill a bucket of soapy water on a marble floor accidentally. Would it make it easier or more difficult for you to walk on the floor? Why?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "It would make it more difficult to walk because the soapy water reduces the friction between your shoes and the floor, making the surface slippery.",
    "explanation": "Friction between your shoes and the floor is essential for traction. When soapy water is present, it acts as a lubricant, reducing the friction dramatically and making the surface very slippery, which increases the chance of slipping.",
    "topic": "Friction and Lubrication",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex005"
  },
  {
    "question_text": "Explain why sportsmen use shoes with spikes.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sportsmen use shoes with spikes to increase friction and ensure a firm grip on various surfaces. The spikes penetrate softer surfaces or provide additional grip on hard surfaces, thereby minimizing slippage and improving performance.",
    "explanation": "Spiked shoes are designed to enhance traction by increasing the effective contact area and engaging with surface irregularities. This increased friction prevents slipping and stabilizes the athlete during rapid movements, turns, and stops. The design directly uses the principle that a rougher contact interface produces higher friction, vital in dynamic sports settings.",
    "topic": "Increasing Friction",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex006"
  },
  {
    "question_text": "Iqbal has to push a lighter box and Seema has to push a similar heavier box on the same floor. Who will have to apply a larger force and why?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Seema will have to apply a larger force because the heavier box has a greater weight, resulting in a larger normal force and consequently a higher frictional force that needs to be overcome.",
    "explanation": "The frictional force is directly proportional to the normal force (Friction = μN). A heavier box increases the normal force, which in turn increases the friction that must be overcome to initiate and sustain motion. Hence, more force is required to move the heavier box.",
    "topic": "Friction and Normal Force",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex007"
  },
  {
    "question_text": "Explain why sliding friction is less than static friction.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sliding friction is less than static friction because, when an object is stationary, the microscopic surface irregularities have sufficient time to interlock firmly, creating strong resistance to the initiation of motion. Once the object is in motion, these contacts have less time to form, and many of the interlocking points break, resulting in reduced frictional force.",
    "explanation": "Static friction must be overcome to initiate motion due to complete interlocking of microscopic irregularities between surfaces. When the object starts sliding, the continuous breaking and reforming of these contacts—and the reduced time for interlocking—leads to lower frictional forces. This difference explains why initiating motion is more difficult than maintaining it.",
    "topic": "Static vs. Sliding Friction",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex008"
  },
  {
    "question_text": "Give examples to show that friction is both a friend and a foe.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Examples of friction as a friend include: the grip of your shoes while walking, the traction of vehicle tires on the road, and the ability to write with chalk on a blackboard. Examples of friction as a foe include: the wear and tear of mechanical parts (like ball bearings or shoe soles), the energy loss in moving machinery due to heat generation, and the difficulty in moving heavy objects when excessive friction is present.",
    "explanation": "Friction is beneficial because it provides grip and traction which are necessary for everyday activities such as walking, writing, or driving safely. However, it can also be detrimental by causing the wear of materials and energy loss (through heat production) in machines, thereby reducing efficiency and increasing maintenance costs.",
    "topic": "Dual Role of Friction",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex009"
  },
  {
    "question_text": "Explain why objects moving in fluids must have special shapes.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Objects moving in fluids are given streamlined or special shapes to reduce the drag (fluid friction) they encounter. These shapes minimize the frontal area and turbulence, allowing the object to move more smoothly and with less energy loss.",
    "explanation": "When an object moves through a fluid (which includes gases and liquids), it experiences a frictional force known as drag that depends on its shape, speed, and the nature of the fluid. Streamlined shapes reduce the resistance by allowing the fluid to flow more smoothly around the object. This principle is applied in engineering designs of vehicles, aircraft, and even in nature with birds and fishes, which have evolved streamlined bodies.",
    "topic": "Fluid Friction and Drag",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex010"
  },
  {
    "question_text": "Extended Learning 1: What role does friction play in the sport of your choice? Collect pictures of that sport in action where friction is either supporting it or opposing it, and display these pictures with proper captions on the bulletin board. Explain your observations.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The role of friction in sports is critical; for example, in football, friction between the players’ cleats and the field ensures traction for quick movements and turns. In contrast, in sports like ice hockey, reduced friction on the ice allows for gliding. The observations should detail how friction supports activities like acceleration, deceleration, and stability, while also sometimes opposing motion.",
    "explanation": "Friction can be a friend by providing the necessary grip to start, stop, or change direction in sports. It can also be a foe when excessive friction impedes smooth motion or when surfaces become unexpectedly slippery. This investigation encourages an analysis of real-world applications of friction and enhances creative thinking and observation skills.",
    "topic": "Real-World Applications of Friction in Sports",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex011"
  },
  {
    "question_text": "Extended Learning 2: Imagine that friction suddenly vanishes. How would life be affected? List ten situations where the absence of friction would have a significant impact.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Without friction, everyday activities would become extremely challenging or impossible. For instance, walking would be nearly impossible because the feet or shoes wouldn’t grip the surface; vehicles wouldn’t be able to start, stop, or turn safely; objects would continue moving indefinitely once set in motion; writing with a pen or chalk would be difficult; and numerous machines would lose efficiency due to the lack of intended friction. A list of ten such specific scenarios should be provided.",
    "explanation": "Friction is essential for providing the necessary resistance to motion in our daily lives. Its absence would lead to a cascade of problems from safety issues (like slipping and uncontrolled motion) to complete system failures in transportation and machinery. This problem requires evaluating the critical role friction plays on multiple scales and encourages imaginative thinking about its importance.",
    "topic": "Consequences of Absence of Friction",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex012"
  },
  {
    "question_text": "Extended Learning 3: Visit a shop that sells sports shoes and observe the soles of shoes meant for various sports. Describe your observations.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The observations should include that different sports shoes have sole designs tailored to the specific frictional demands of the sport. For example, running shoes often have flexible, cushioned soles designed for moderate friction, while football or cleated shoes have aggressive tread patterns to increase grip on grassy surfaces.",
    "explanation": "The design of shoe soles reflects the need to either maximize or optimize friction. Such designs may include spikes, grooves, or textured patterns that enhance traction, reduce slippage, or improve energy absorption. Observing these details allows students to connect theoretical knowledge of friction to practical applications in sports equipment design.",
    "topic": "Design and Friction in Sports Equipment",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex013"
  },
  {
    "question_text": "Extended Learning 4: Construct a toy using a matchbox tray, a ball pen refill fixed with pins, and a thread as described. After assembling, suspend the matchbox by the thread, then tighten the thread and observe what happens. Explain your observations and relate them to friction.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "As the toy is suspended, it initially falls due to gravity. When the thread is tightened, the increased tension alters the configuration and may increase the contact forces between moving parts, resulting in a change in the frictional forces acting on the system. The observation may include a slowing down or stabilization of the motion due to the enhanced friction created by the new configuration. The explanation should detail how friction plays a role in energy dissipation in the system.",
    "explanation": "This activity involves understanding how friction can be manipulated by altering contact forces within a system. When the thread is tightened, it not only changes the potential energy but also how the various parts – such as the matchbox tray and pen refill assembly – interact. The interlocking surface irregularities result in an increased resistance to motion (friction), thereby reducing the speed or halting the descent. This practical demonstration ties the theoretical concept of friction to a real-world experimental setup.",
    "topic": "Experimental Demonstration of Friction Effects",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "hesc109",
    "question_id": "cbse_viii_hesc1dd_c109_ex014"
  }
]