[
  {
    "question_text": "MCQ: When two identical balloons are rubbed with a woollen cloth and then hung so that they can move freely without touching each other, what is observed?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. They attract each other",
      "B. They repel each other",
      "C. One moves upward while the other moves downward",
      "D. They remain motionless"
    ],
    "correct_answer": "B. They repel each other",
    "explanation": "When both balloons are rubbed with the woollen cloth, they acquire the same type of charge (conventionally positive). Like charges repel each other, causing the balloons to move away from each other.",
    "topic": "Electrostatics – Charge Interaction",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen028"
  },
  {
    "question_text": "MCQ: If a plastic straw is rubbed with a polythene cloth, which charge does it typically acquire?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Positive charge",
      "B. Negative charge",
      "C. Neutral charge",
      "D. Alternating charges"
    ],
    "correct_answer": "B. Negative charge",
    "explanation": "When a plastic straw is rubbed with polythene, electrons are transferred such that the straw typically gains extra electrons, ending up with a negative charge.",
    "topic": "Electrostatic Charging",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen029"
  },
  {
    "question_text": "MCQ: When a charged pen refill is placed on a stand and a similarly charged refill is brought near it, what will be the interaction between the two?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. They attract each other",
      "B. They repel each other",
      "C. They form an electric circuit",
      "D. No observable effect"
    ],
    "correct_answer": "B. They repel each other",
    "explanation": "Since both refills have been charged in the same way by rubbing with polythene, they hold like charges, which repel each other.",
    "topic": "Electrostatic Forces",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen030"
  },
  {
    "question_text": "MCQ: In the experiment where a charged balloon and a charged refill interact, which of the following best explains the attraction between them?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. The charges on the balloon and refill are the same",
      "B. The balloon and refill are electrically neutral",
      "C. They have opposite types of charge",
      "D. The effect of gravitational force is dominant"
    ],
    "correct_answer": "C. They have opposite types of charge",
    "explanation": "According to the basic principles of electrostatics, unlike charges attract. Even though similar materials were used in making charged objects, the experiment demonstrated an attraction, indicating that one of them acquired an opposite charge.",
    "topic": "Electrostatic Interaction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen031"
  },
  {
    "question_text": "Short Answer: Define static electricity and explain how it differs from an electric current.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Static electricity is the accumulation of electric charges on the surface of objects, which do not flow on their own. In contrast, an electric current is a flow of electric charges, such as electrons, through a conductor.",
    "explanation": "Static electricity involves stationary charges that appear due to friction or induction, whereas an electric current involves the continuous movement of charges in a circuit, producing energy effects such as light or heat.",
    "topic": "Electrostatics vs. Electric Current",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen032"
  },
  {
    "question_text": "Short Answer: What are the two types of electric charges and which fundamental rule governs how these charges interact?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The two types of electric charges are positive and negative. The fundamental rule governing their interaction is that like charges repel and opposite charges attract.",
    "explanation": "This basic principle of electrostatics explains many everyday phenomena and underpins the behavior of charged particles in various scientific and technological contexts.",
    "topic": "Types of Charges",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen033"
  },
  {
    "question_text": "Short Answer: Describe what happens when a glass rod is rubbed with silk, in terms of charge movement and resulting charge designation.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When a glass rod is rubbed with silk, electrons are transferred from the glass to the silk, leaving the glass rod positively charged and the silk negatively charged.",
    "explanation": "This process is a classic demonstration of charge transfer due to friction. The convention designates the glass rod as positive, and this phenomenon is a cornerstone in the study of static electricity.",
    "topic": "Electrostatic Charging",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen034"
  },
  {
    "question_text": "Short Answer: In Activity 12.3, why is it important that the charged refill in a tumbler is not touched by hand when approaching another charged object?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It is important because touching the charged refill with your hand can neutralize or alter its charge due to the conductivity of the human body, which can lead to erroneous observations.",
    "explanation": "Any interference with the charged object, like touching, could cause transfer of charges, thus compromising the experimental outcome and the accurate demonstration of electrostatic principles.",
    "topic": "Experimental Method in Electrostatics",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen035"
  },
  {
    "question_text": "Long Answer: Explain the process of charging by friction and describe the experimental observations that support the concepts of like charges repelling and unlike charges attracting as demonstrated in Activity 12.3.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Charging by friction involves rubbing two objects together, which causes electrons to be transferred from one object to the other. In Activity 12.3, when both balloons are rubbed with a woollen cloth, they acquire the same charge and hence repel one another, demonstrating that like charges repel. Similarly, when two refills rubbed with polythene are brought near each other, they repel due to carrying the same charge. However, when a charged balloon interacts with a charged refill, the observation of attraction (as noted in the text) suggests that the two objects carry opposite charges, thereby illustrating the principle that unlike charges attract.",
    "explanation": "This detailed process shows how friction causes electrons to be transferred, leading to observable forces between objects. The experiments demonstrate two fundamental electrostatic principles: like charges repel and unlike charges attract. These observations are crucial for understanding static electricity and its applications.",
    "topic": "Frictional Charging and Electrostatic Interactions",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen036"
  },
  {
    "question_text": "Long Answer: Compare and contrast static electricity with electric current, including how they are generated and their applications in everyday life.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Static electricity is generated when charges accumulate on the surface of objects, typically caused by friction (such as rubbing a balloon with wool). In contrast, an electric current is a flow of charges through a conductor, as seen in electrical circuits powering appliances. Static electricity is observed in everyday phenomena like hair standing up or small sparks when touching a metal object, whereas electric current is used in lighting, heating, and powering devices. The generation of static electricity involves the transfer of electrons between objects, while electric current involves a continuous, directional movement of electrons driven by a potential difference.",
    "explanation": "This comparison highlights the differences in charge movement and applications. Static electricity is transient and localized, often resulting from simple interactions such as friction, whereas electric current is controlled and harnessed for practical applications in technology and daily life.",
    "topic": "Static Electricity vs. Electric Current",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen037"
  },
  {
    "question_text": "True/False: When two objects have been charged by rubbing with the same material, they always attract each other.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False; objects charged by the same material typically acquire like charges, which repel each other.",
    "explanation": "When two objects are charged by the same method (e.g., both rubbed with wool or polythene), they usually end up with the same type of charge. According to electrostatic principles, like charges repel.",
    "topic": "Charge Interaction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen038"
  },
  {
    "question_text": "True/False: The phenomenon of static electricity can lead to the creation of an electric current if the charges start moving without any external influence.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False; while static electricity refers to stationary charges, an electric current is defined by the movement of charges. Charges in static electricity remain without spontaneous flow unless acted upon by an external force.",
    "explanation": "Static charges remain stationary because there is no continuous pathway or sufficient energy to make them move continuously. Once movement occurs, it is classified as an electric current.",
    "topic": "Electrostatics vs. Electric Current",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hesc112",
    "section_id": "04_section_12_3",
    "question_id": "cbse_viii_hesc1dd_c112_gen039"
  }
]