[
  {
    "question_text": "When you bring a burning matchstick near a gas stove and turn on the gas knob, what type of combustion is observed?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Spontaneous Combustion",
      "B. Rapid Combustion",
      "C. Explosion",
      "D. Slow Combustion"
    ],
    "correct_answer": "B. Rapid Combustion",
    "explanation": "The gas burns rapidly when ignited, producing heat and light, which is characteristic of rapid combustion.",
    "topic": "Rapid Combustion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen028"
  },
  {
    "question_text": "Which of the following substances is known to burn in air at room temperature, indicating spontaneous combustion?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Methane",
      "B. Phosphorus",
      "C. Hydrogen",
      "D. Carbon Dioxide"
    ],
    "correct_answer": "B. Phosphorus",
    "explanation": "Phosphorus can burn spontaneously in air at room temperature without needing an external ignition source.",
    "topic": "Spontaneous Combustion",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen029"
  },
  {
    "question_text": "A cracker explodes with a sudden production of heat, light, and sound due to a rapid chemical reaction that liberates gas. Which of the following statements is true regarding this reaction?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. The reaction is slow and requires an external flame at all times.",
      "B. The reaction is an explosion, and pressure applied can also cause it.",
      "C. The reaction is an example of spontaneous combustion.",
      "D. The reaction produces only heat with no light or sound."
    ],
    "correct_answer": "B. The reaction is an explosion, and pressure applied can also cause it.",
    "explanation": "An explosion involves a sudden release of energy in the form of heat, light, and sound, and it can occur due to both ignition and pressure.",
    "topic": "Explosion",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen030"
  },
  {
    "question_text": "Define 'rapid combustion' and provide an example from everyday life.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Rapid combustion is a type of burning that occurs quickly with a rapid release of heat and light; an example is the burning of gas on a stove.",
    "explanation": "Rapid combustion involves a fast chemical reaction that quickly produces energy in the form of heat and light, such as when igniting gas in household stoves.",
    "topic": "Rapid Combustion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen031"
  },
  {
    "question_text": "Explain what is meant by 'spontaneous combustion' and list two examples of where it might occur.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Spontaneous combustion refers to a phenomenon where a substance unexpectedly bursts into flames without an apparent ignition source. Examples include spontaneous combustion of coal dust in mines and forest fires initiated by the sun’s heat or lightning.",
    "explanation": "Spontaneous combustion happens when conditions favor a self-heating process that eventually leads to ignition without any external spark. Coal dust in mines and specific forest conditions are common scenarios.",
    "topic": "Spontaneous Combustion",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen032"
  },
  {
    "question_text": "What is an 'explosion' in terms of chemical reactions, and what are the key products of this reaction?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An explosion is a rapid chemical reaction that produces a large amount of gas, heat, light, and sound. The rapid discharge of these products leads to the explosive effect.",
    "explanation": "In an explosion, the swift formation and release of gas, along with a burst of heat and light, result in a sudden and forceful expansion. This is common in firecrackers and other explosive devices.",
    "topic": "Explosion",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen033"
  },
  {
    "question_text": "Describe why ensuring campfires are completely extinguished after use is critical in preventing spontaneous forest fires.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Ensuring campfires are completely extinguished is crucial because any remaining embers or smoldering materials can lead to spontaneous combustion, potentially igniting surrounding vegetation and resulting in forest fires.",
    "explanation": "When campfires are not properly extinguished, residual heat can trigger the self-heating process in nearby dry leaves or wood, sparking a forest fire. This preventive measure is essential for forest safety.",
    "topic": "Forest Fire Prevention / Spontaneous Combustion",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen034"
  },
  {
    "question_text": "Compare and contrast rapid combustion, spontaneous combustion, and explosion, highlighting the conditions under which each occurs.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Rapid combustion occurs quickly when an ignition source, such as a flame, initiates the burning process (e.g., gas stove ignition). Spontaneous combustion happens without an obvious external trigger, often due to self-heating in conditions like coal dust accumulation or forest scenarios. An explosion is characterized by a sudden reaction that produces a burst of gas, heat, light, and sound, and can be triggered by an ignition or by applying external pressure as in the case of firecrackers.",
    "explanation": "This answer distinguishes between the three reactions based on their initiation methods and outcomes: rapid combustion needs an external spark, spontaneous combustion arises from internal self-heating of materials, and explosions involve a violent reaction resulting from rapid gas expansion.",
    "topic": "Combustion Types",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen035"
  },
  {
    "question_text": "Design an experiment to investigate the effect of applied pressure on the explosion of a cracker. Describe the setup, procedure, and expected observations.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An experiment can be designed using a controlled setup where crackers are placed in a pressure chamber with adjustable pressure. The procedure would involve incrementally increasing the external pressure applied to the cracker and recording the ignition point and reaction intensity. Safety precautions, such as remote triggering and protective barriers, must be implemented. It is expected that increased pressure could lower the ignition threshold, potentially triggering an explosion even without a traditional ignition source.",
    "explanation": "The experiment requires a systematic approach to vary pressure levels while monitoring the response of the cracker. Detailed observations would help in understanding the relationship between applied pressure and the rate or intensity of the explosive reaction, contributing to safer handling procedures in real-life applications.",
    "topic": "Explosion / Pressure Effects",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen036"
  },
  {
    "question_text": "Discuss safety precautions that should be taken to prevent spontaneous combustion in coal mines and forests.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Safety precautions include regular monitoring of coal dust and using appropriate ventilation systems in mines to prevent dust accumulation. In forests, strict measures such as ensuring campfires are fully extinguished, educating the public on fire safety, and monitoring weather conditions can help prevent spontaneous forest fires. Additionally, the removal of flammable debris in both settings reduces risks.",
    "explanation": "By addressing the sources of spontaneous combustion, such as coal dust accumulation and unattended campfires, these precautions mitigate the conditions necessary for a self-heating reaction, thereby preventing potential fires.",
    "topic": "Safety in Combustion",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen037"
  },
  {
    "question_text": "True or False: The ignition of a gas stove is an example of an explosion due to the sudden release of gases.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. It is an example of rapid combustion.",
    "explanation": "The ignition of a gas stove is characterized by rapid combustion, where gas burns quickly. An explosion involves a more violent and uncontrolled rapid reaction with an excessive release of gases and pressure.",
    "topic": "Rapid Combustion vs Explosion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen038"
  },
  {
    "question_text": "True or False: Phosphorus can spontaneously combust at room temperature.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Phosphorus is a substance known to burn in air at room temperature, and this is an example of spontaneous combustion.",
    "topic": "Spontaneous Combustion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen039"
  },
  {
    "question_text": "True or False: Spontaneous forest fires are always a result of natural phenomena such as lightning and solar heat. If false, please correct the statement.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False. Although natural phenomena can trigger forest fires, most are due to human carelessness, such as unattended campfires.",
    "explanation": "While lightning and intense solar heat can cause forest fires, the majority of incidents are related to human actions. Correct identification of the cause is essential for forest fire prevention.",
    "topic": "Forest Fire Causes",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hesc104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hesc1dd_c104_gen040"
  }
]