[
  {
    "question_text": "What is the chemical formula of ozone?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The chemical formula of ozone is O₃.",
    "explanation": "Ozone is composed of three oxygen atoms, hence its formula is O₃.",
    "topic": "Ozone Layer",
    "bloom_level": "Remember"
  },
  {
    "question_text": "Which reaction sequence correctly represents the formation of ozone (O₃) in the atmosphere?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "O₂ + UV radiation → 2O",
      "O₂ → 2O",
      "O₂ + UV radiation → 2O; O + O₂ → O₃",
      "O₃ → 3O"
    ],
    "correct_answer": "O₂ + UV radiation → 2O; O + O₂ → O₃",
    "explanation": "UV radiation splits O₂ into two free oxygen atoms, which then react with O₂ to form O₃.",
    "topic": "Ozone Layer",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Which of the following chemicals are primarily responsible for the depletion of the ozone layer?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Chlorofluorocarbons (CFCs)",
      "Carbon dioxide (CO₂)",
      "Methane (CH₄)",
      "Sulfur dioxide (SO₂)"
    ],
    "correct_answer": "Chlorofluorocarbons (CFCs)",
    "explanation": "CFCs are synthetic chemicals that release chlorine atoms in the stratosphere, which catalyze the breakdown of ozone.",
    "topic": "Ozone Layer",
    "bloom_level": "Remember"
  },
  {
    "question_text": "What was the main objective of the 1987 United Nations Environment Programme (UNEP) agreement regarding ozone depletion?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "To freeze the production of chlorofluorocarbons (CFCs) at 1986 levels globally.",
    "explanation": "The UNEP agreement aimed to halt the increase of CFC production, which was causing ozone depletion.",
    "topic": "Ozone Layer",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Evaluate whether the regulations to control CFC emissions have been successful in reducing ozone depletion, and discuss changes in the size of the ozone hole in recent years.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Since the implementation of CFC regulations, such as the Montreal Protocol, there has been a gradual recovery of the ozone layer. Scientific observations indicate that the size of the ozone hole has been decreasing over recent years, demonstrating the success of these measures in reducing ozone-depleting substances in the atmosphere.",
    "explanation": "The decrease in CFC emissions has led to a reduction in chlorine and bromine atoms that destroy ozone. Consequently, satellite data and ground-based measurements show a shrinking and thinning ozone layer, particularly over the Antarctic region.",
    "topic": "Ozone Layer",
    "bloom_level": "Evaluate"
  },
  {
    "question_text": "Define biodegradability and explain the difference between biodegradable and non-biodegradable substances.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Biodegradability refers to the ability of a substance to be broken down by biological processes, such as by bacteria or enzymes. Biodegradable substances can decompose naturally, while non-biodegradable substances persist in the environment without being broken down biologically.",
    "explanation": "Biodegradable materials are broken down by living organisms, whereas non-biodegradable materials do not undergo such decomposition, leading to long-term persistence in the environment.",
    "topic": "Managing Garbage",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Which of the following materials is non-biodegradable?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Vegetable peels",
      "Paper",
      "Plastic",
      "Milk cartons"
    ],
    "correct_answer": "Plastic",
    "explanation": "Plastic is a synthetic material that does not easily break down biologically, making it non-biodegradable.",
    "topic": "Managing Garbage",
    "bloom_level": "Remember"
  },
  {
    "question_text": "How long can typical plastic materials persist in the environment?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Typical plastics can persist in the environment for hundreds to thousands of years.",
    "explanation": "Plastics are highly durable and resistant to natural degradation processes, often lasting centuries in the environment.",
    "topic": "Managing Garbage",
    "bloom_level": "Remember"
  },
  {
    "question_text": "Analyze the impact of biodegradable plastics on the environment compared to conventional plastics.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Biodegradable plastics break down more easily through biological processes, reducing long-term environmental persistence compared to conventional plastics. This can decrease pollution and lower the burden on waste management systems. However, the effectiveness of biodegradable plastics depends on appropriate disposal conditions, such as industrial composting facilities. Additionally, the production of biodegradable plastics may involve different resources and energy inputs, which can have their own environmental impacts. Overall, while biodegradable plastics offer advantages in reducing environmental persistence, their benefits are maximized when combined with proper disposal and waste management practices.",
    "explanation": "Biodegradable plastics are designed to decompose via microorganisms, thereby minimizing long-term pollution. In contrast, conventional plastics persist and contribute to environmental degradation. Nonetheless, factors like production methods, required disposal conditions, and lifecycle impacts must be considered to fully assess their environmental benefits.",
    "topic": "Managing Garbage",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "Calculate the number of ozone (O₃) molecules produced from 2 molecules of O₂ under the influence of UV radiation, based on the ozone formation reactions.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "2 molecules of O₃ are produced from 2 molecules of O₂.",
    "explanation": "Each O₂ molecule, when split by UV radiation, produces 2 atoms of oxygen (O). Therefore, 2 O₂ molecules produce a total of 4 O atoms. These 4 O atoms can react with 2 additional O₂ molecules to form 2 O₃ molecules. Hence, from 2 O₂ molecules, 2 O₃ molecules are produced.",
    "topic": "Ozone Layer",
    "bloom_level": "Apply"
  }
]