[
  {
    "question_text": "Which of the following groups contain only biodegradable items?\n1. Grass, flowers, and leather\n2. Grass, wood, and plastic\n3. Fruit peels, cake, and lime juice\n4. Cake, wood, and grass",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Grass, flowers, and leather",
      "Grass, wood, and plastic",
      "Fruit peels, cake, and lime juice",
      "Cake, wood, and grass"
    ],
    "correct_answer": "Fruit peels, cake, and lime juice",
    "explanation": "Option 3 is correct because all items listed (fruit peels, cake, and lime juice) are biodegradable, meaning they can be broken down by microorganisms over time. Option 1 includes leather, which may not easily biodegrade depending on its processing. Option 2 includes plastic, which is non-biodegradable. Option 4, while containing biodegradable items, may include wood which takes longer to decompose, making option 3 the most accurate choice.",
    "topic": "Biodegradable and Non-biodegradable Substances",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Which of the following constitute a food chain?\n1. Grass, wheat, and mango\n2. Grass, goat, and human\n3. Goat, cow, and elephant\n4. Grass, fish, and goat",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Grass, wheat, and mango",
      "Grass, goat, and human",
      "Goat, cow, and elephant",
      "Grass, fish, and goat"
    ],
    "correct_answer": "Grass, goat, and human",
    "explanation": "Option 2 is correct because it represents a clear food chain: grass (producer) is eaten by goats (primary consumers), which in turn are eaten by humans (secondary consumers). Option 1 doesn't show a predator-prey relationship. Option 3 jumps between different levels without a clear progression. Option 4 mixes different environments and does not form a coherent chain.",
    "topic": "Food Chains and Webs",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Which of the following are environment-friendly practices?\n1. Carrying cloth bags to put purchases in while shopping\n2. Switching off unnecessary lights and fans\n3. Walking to school instead of getting your mother to drop you on her scooter\n4. All of the above",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Carrying cloth bags to put purchases in while shopping",
      "Switching off unnecessary lights and fans",
      "Walking to school instead of getting your mother to drop you on her scooter",
      "All of the above"
    ],
    "correct_answer": "All of the above",
    "explanation": "Option 4 is correct as all the listed practices are environment-friendly. Carrying cloth bags reduces plastic waste, switching off unnecessary electrical appliances saves energy, and walking instead of using vehicles reduces carbon emissions.",
    "topic": "Environment-friendly Practices",
    "bloom_level": "Remember"
  },
  {
    "question_text": "What will happen if we kill all the organisms in one trophic level?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "If all organisms in one trophic level are killed, it disrupts the food chain, leading to a collapse of dependent trophic levels. Producers or consumers may face starvation, reducing biodiversity and destabilizing the ecosystem.",
    "explanation": "Killing all organisms in a trophic level removes a critical link in the food chain. For example, if all primary consumers are removed, secondary consumers lose their food source, potentially leading to their decline or extinction. This imbalance can cause cascading effects throughout the ecosystem, reducing biodiversity and ecosystem stability.",
    "topic": "Food Chains and Webs",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "Will the impact of removing all the organisms in a trophic level be different for different trophic levels? Can the organisms of any trophic level be removed without causing any damage to the ecosystem?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Yes, the impact varies depending on the trophic level removed. Removing producers (like plants) has a more profound effect as all consumers depend on them, potentially collapsing multiple levels. Removing consumers affects only the levels above them, but can still disrupt the balance. No trophic level can be removed without causing some damage, as each level plays a vital role in maintaining ecosystem stability.",
    "explanation": "Different trophic levels have varying levels of influence on the ecosystem. Producers are foundational, converting solar energy into chemical energy, supporting all other levels. Removing them deprives all consumers of their energy source. Primary consumers rely directly on producers, while secondary and tertiary consumers depend on other consumers. Thus, removing any level leads to disruptions: removing producers affects all dependent levels, whereas removing consumers primarily affects higher trophic levels. In all cases, some form of ecosystem damage occurs, highlighting the interdependence of all trophic levels.",
    "topic": "Food Chains and Webs",
    "bloom_level": "Evaluate"
  },
  {
    "question_text": "What is biological magnification? Will the levels of this magnification be different at different levels of the ecosystem?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Biological magnification is the process where harmful chemicals concentrate and accumulate as they move up each trophic level in an ecosystem. Yes, the levels of magnification increase at higher trophic levels due to the accumulation of toxins from each preceding level.",
    "explanation": "Biological magnification occurs because each trophic level consumes multiple organisms from the level below, leading to the accumulation of toxins like pesticides. As energy flows up the food chain, the concentration of these toxins becomes higher in predators at higher levels. This is why top predators, including humans, often have the highest levels of these harmful substances in their bodies.",
    "topic": "Biological Magnification",
    "bloom_level": "Understand"
  },
  {
    "question_text": "What are the problems caused by the non-biodegradable wastes that we generate?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Non-biodegradable wastes persist in the environment for long periods, leading to pollution of land and water bodies. They can harm wildlife, enter the food chain causing health issues in animals and humans, occupy landfill space, and contribute to environmental degradation.",
    "explanation": "Non-biodegradable wastes like plastics do not break down naturally, accumulating in the environment. This leads to littering, blocking waterways, harming animals that ingest or become entangled in them, and degrading natural habitats. Additionally, these wastes can introduce toxic substances into ecosystems, disrupting food chains and posing health risks to living organisms.",
    "topic": "Biodegradable and Non-biodegradable Substances",
    "bloom_level": "Understand"
  },
  {
    "question_text": "If all the waste we generate is biodegradable, will this have no impact on the environment?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "No, even if all waste is biodegradable, excessive waste can still deplete natural resources, cause habitat disruption, and generate greenhouse gases during decomposition. Proper waste management is still necessary to minimize environmental impact.",
    "explanation": "While biodegradable waste breaks down naturally, managing large volumes is essential to prevent overconsumption of resources like soil and water, reduce methane emissions from decomposition, and avoid disrupting ecosystems. Additionally, improper decomposition can lead to issues like water contamination and soil nutrient imbalances.",
    "topic": "Waste Disposal and Management",
    "bloom_level": "Evaluate"
  },
  {
    "question_text": "Why is damage to the ozone layer a cause for concern? What steps are being taken to limit this damage?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Damage to the ozone layer increases harmful ultraviolet (UV) radiation reaching Earth's surface, leading to health issues like skin cancer and environmental problems such as harming crops and aquatic life. Steps to limit this damage include banning the production of chlorofluorocarbons (CFCs), enforcing international agreements like the Montreal Protocol, and promoting the use of ozone-friendly alternatives in refrigeration and manufacturing.",
    "explanation": "The ozone layer acts as a protective shield against UV radiation. Its depletion results in higher UV exposure, increasing risks of skin cancer, cataracts, and weakening the immune system in humans. Environmental impacts include damage to phytoplankton, essential for aquatic food webs, and reduced crop yields. To address this, global efforts like the Montreal Protocol have successfully reduced the use of ozone-depleting substances (ODS). Additionally, research and development of alternative chemicals and technologies that do not harm the ozone layer continue to be essential in mitigating further damage.",
    "topic": "Ozone Layer Depletion",
    "bloom_level": "Analyze"
  }
]