[
  {
    "question_text": "Why are some substances biodegradable and some non-biodegradable?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Some substances are biodegradable because they can be broken down by biological processes involving microorganisms, enzymes, or other biological agents. In contrast, non-biodegradable substances resist decomposition due to their complex molecular structures or synthetic nature, making them difficult or impossible for organisms to break down.",
    "explanation": "Biodegradable substances possess molecular structures that microorganisms, such as bacteria and fungi, can easily decompose using enzymes. These substances typically originate from natural sources and can integrate back into the ecosystem without causing long-term harm. On the other hand, non-biodegradable substances often have stable chemical bonds or are synthetically manufactured, which makes them resistant to microbial attack. As a result, they persist in the environment for extended periods, leading to accumulation and potential ecological issues.",
    "topic": "Biodegradable and Non-Biodegradable Substances",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Give any two ways in which biodegradable substances would affect the environment.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Biodegradable substances contribute to the natural recycling of nutrients in the ecosystem and reduce the accumulation of waste in the environment.",
    "explanation": "Firstly, biodegradable substances are broken down by microorganisms into simpler compounds, which can be absorbed by plants and used as nutrients, thereby maintaining soil fertility and supporting plant growth. This natural recycling process helps sustain the ecosystem's balance. Secondly, because they decompose relatively quickly, biodegradable substances prevent the accumulation of waste in landfills and natural habitats, minimizing pollution and reducing the environmental footprint of human activities.",
    "topic": "Impact of Biodegradable Substances on the Environment",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Give any two ways in which non-biodegradable substances would affect the environment.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Non-biodegradable substances persist in the environment for long periods, leading to pollution and habitat disruption. Additionally, they can accumulate in living organisms, causing health issues and disrupting ecological balance.",
    "explanation": "Non-biodegradable substances do not decompose easily, resulting in their accumulation in various environmental compartments such as soil, water, and air. This persistence leads to pollution, which can degrade natural habitats and harm wildlife. Furthermore, when these substances enter the food chain, they can bioaccumulate in organisms, leading to toxic effects and health problems in both wildlife and humans. The long-term presence of non-biodegradable waste also burdens waste management systems and contributes to the degradation of natural landscapes.",
    "topic": "Impact of Non-Biodegradable Substances on the Environment",
    "bloom_level": "Understand"
  }
]