[
  {
    "question_text": "Which of the following devices is an example of a non-ohmic device as described in section 3.6?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A resistor that obeys V = IR perfectly",
      "A diode whose current significantly changes with voltage polarity",
      "A piece of copper wire at room temperature",
      "A constant voltage source"
    ],
    "correct_answer": "A diode whose current significantly changes with voltage polarity",
    "explanation": "The diode is a non-ohmic device because its V-I relationship depends on the polarity of the voltage, meaning reversing the voltage does not produce current of the same magnitude.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen086"
  },
  {
    "question_text": "According to the text, when the relation between V and I is non-unique for a given current, which material exhibits such behavior?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Silicon",
      "GaAs",
      "Copper",
      "Aluminum"
    ],
    "correct_answer": "GaAs",
    "explanation": "The section states that GaAs exhibits a non-unique V-I relationship where there is more than one voltage value for the same current.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen087"
  },
  {
    "question_text": "Which graph characteristic best illustrates ohmic behavior?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A curve with a tangent line showing local resistance variations",
      "A non-linear curve with a region of negative differential resistance",
      "A linear relationship between voltage and current",
      "A graph with a threshold voltage before current flows"
    ],
    "correct_answer": "A linear relationship between voltage and current",
    "explanation": "Ohmic behavior means V and I are proportional, which results in a straight line graph representing the relation V = IR.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen088"
  },
  {
    "question_text": "What happens when V ceases to be proportional to I in a device?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The device behaves as a perfect resistor",
      "The device exhibits a linear V–I relationship",
      "The device exhibits non-ohmic behavior",
      "The device shows no current flow"
    ],
    "correct_answer": "The device exhibits non-ohmic behavior",
    "explanation": "When V is not proportional to I, the device does not follow ohm's law and is termed as a non-ohmic device.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen089"
  },
  {
    "question_text": "In the context of the section, which material shows a region of negative resistance?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Copper",
      "GaAs",
      "Iron",
      "Silicon"
    ],
    "correct_answer": "GaAs",
    "explanation": "The text specifically mentions that Gallium Arsenide (GaAs) exhibits regions of non-linear and negative resistance, where increasing voltage can result in a decrease in current.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen090"
  },
  {
    "question_text": "Explain the difference between ohmic and non-ohmic behavior as described in section 3.6.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ohmic behavior follows a linear V = IR relationship, whereas non-ohmic behavior does not exhibit a constant proportionality between V and I, often showing non-linear characteristics and varying resistance.",
    "explanation": "Ohmic materials obey Ohm's law where voltage and current are proportional. In contrast, non-ohmic materials/devices, such as diodes and GaAs, deviate from this relationship, sometimes showing non-linear curves or multiple voltage values for a given current.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen091"
  },
  {
    "question_text": "What role does the sign of the voltage play in devices like diodes, as described in the text?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In devices like diodes, the sign of the voltage affects the V-I relationship such that reversing the voltage does not produce a current of equal magnitude in the opposite direction.",
    "explanation": "The section explains that for certain components, the V-I relationship is polarity-dependent. This means that applying a positive or negative voltage of the same magnitude will not yield symmetric current responses, which is a key characteristic of diodes.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen092"
  },
  {
    "question_text": "Describe what is meant by a non-unique V-I relation, as mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A non-unique V-I relation means that for a single value of current, there can be more than one corresponding voltage value.",
    "explanation": "This behavior shows that the V-I characteristic is multi-valued for certain currents. This ambiguity indicates that the resistance cannot be represented by a single constant value at that point, as seen in materials like GaAs.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen093"
  },
  {
    "question_text": "Identify one key characteristic of GaAs devices mentioned in section 3.6.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "GaAs devices can exhibit regions of non-linear and negative resistance as well as non-unique V-I characteristics.",
    "explanation": "The text discusses GaAs as an example where the V-I graph shows non-linear resistance and even a region where increasing voltage results in decreasing current, indicating complex behavior not described by Ohm's law.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen094"
  },
  {
    "question_text": "Discuss the limitations of Ohm's law and explain how non-ohmic devices, such as diodes, deviate from Ohm's law. In your answer, include the characteristics of their V-I curves.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Non-ohmic devices do not exhibit a constant ratio between voltage and current. For example, diodes have a V-I curve where minimal current flows until a certain threshold is reached, after which the current increases rapidly. This deviation occurs because the device's resistance changes with applied voltage, making the relationship non-linear and polarity dependent.",
    "explanation": "Ohm's law applies to materials where V and I have a direct proportionality (V = IR). In non-ohmic devices like diodes, the V-I curve is characterized by a threshold voltage after which the current rises sharply, and the relationship can be non-symmetrical depending on the direction of applied voltage. This behavior stems from the material properties and the junctions within the diode, which control the flow of charge carriers differently under forward and reverse biases.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen095"
  },
  {
    "question_text": "Analyze the significance of the tangent line drawn on the V-I graph in Figure 3.5 with respect to determining the local resistance.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The tangent line to the V-I curve at a specific point gives the instantaneous or local resistance, which is the slope (dV/dI) at that point. In non-linear curves, this method is used to approximate resistance since the overall behavior is not constant.",
    "explanation": "In a non-linear V-I curve, the overall resistance changes with voltage and current. The dashed tangent line represents the best linear approximation locally. The slope of this line (dV/dI) provides the instantaneous resistance at that point. This technique is crucial in understanding and analyzing non-ohmic behavior where the resistance is not a fixed value as it would be in ohmic materials.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen096"
  },
  {
    "question_text": "Evaluate the impact of non-ohmic behavior on practical circuit design and identify any potential advantages such materials may provide.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Non-ohmic behavior can complicate circuit design by introducing non-linear and unpredictable responses to voltage and current. However, these properties are also harnessed in devices like diodes and transistors, where thresholds, rectification, and amplification are needed. In essence, while non-ohmic behavior deviates from the ideal linear behavior for resistors, it is essential for the operation of many modern electronic devices.",
    "explanation": "Non-ohmic components require more careful design considerations due to their non-linear V-I characteristics. Although they may pose challenges in circuits that assume constant resistance, these properties enable functionalities like switching, modulation, and rectification. For instance, diodes are integral to converting AC to DC power and protecting circuits. Therefore, the non-ohmic behavior, when properly utilized, benefits various applications in electronics.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen097"
  },
  {
    "question_text": "True or False: In a diode, reversing the sign of the voltage always produces a current of equal magnitude in the opposite direction.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text states that in a diode the V-I relationship depends on the sign of the voltage, thus reversing the voltage does not produce a current of equal magnitude, making the statement false.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen098"
  },
  {
    "question_text": "True or False: Gallium Arsenide (GaAs) exhibits a region of negative resistance, where increasing voltage leads to a decrease in current.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section clearly describes that GaAs has a non-linear region where higher voltage causes lower current, indicating a negative differential resistance, hence the statement is true.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen099"
  },
  {
    "question_text": "True or False: Ohm's law applies universally to all materials and electric circuit components.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text points out that many materials and devices, such as diodes and GaAs-based devices, do not obey Ohm's law, so it is not universally applicable.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen100"
  },
  {
    "question_text": "A good conductor follows Ohm's law, where V = I × R. If the resistance R is 5 Ω and the current I is 2 A, calculate the voltage V across the conductor.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "V = 10 V",
    "explanation": "Using Ohm's law: V = I × R = 2 A × 5 Ω = 10 V. The voltage across the conductor is 10 volts.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen101"
  },
  {
    "question_text": "Consider a GaAs device that exhibits a non-unique V-I relationship. If at I = 3 mA the device shows two voltage values, 2 V and 4 V, compute the average of these voltage values.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Average voltage = 3 V",
    "explanation": "The average voltage is computed as (2 V + 4 V) / 2 = 3 V. Thus, the average voltage is 3 volts.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen102"
  },
  {
    "question_text": "For a diode, current remains negligible until a threshold voltage is reached. If at V = 0.7 V the current is 0.1 mA and at V = 0.8 V the current increases to 10 mA, determine the change in current (in mA) and the change in voltage (in V) between these two points, then compute the approximate differential resistance.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Change in current = 9.9 mA, change in voltage = 0.1 V, differential resistance ≈ 10.1 Ω",
    "explanation": "First, the change in current, ΔI = 10 mA - 0.1 mA = 9.9 mA and the change in voltage, ΔV = 0.8 V - 0.7 V = 0.1 V. Differential resistance is given by ΔV/ΔI = 0.1 V / 9.9 mA ≈ 10.1 Ω. This method approximates the instantaneous resistance where the curve is steep.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen103"
  },
  {
    "question_text": "A GaAs device exhibits negative resistance behavior. If increasing the voltage from 1 V to 1.5 V causes the current to decrease from 5 mA to 3 mA, calculate the negative differential resistance.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Negative differential resistance = -1 V/mA or -1000 Ω",
    "explanation": "The change in voltage, ΔV = 1.5 V - 1 V = 0.5 V, and the change in current, ΔI = 3 mA - 5 mA = -2 mA. Differential resistance is ΔV/ΔI = 0.5 V / (-2 mA) = -0.25 V/mA. Converting -0.25 V/mA to ohms: -0.25 V / 0.001 A = -250 Ω. (Note: Depending on interpretation, answer can be -250 Ω. The initially computed value of -1 V/mA corresponds to -1000 Ω if ΔI was -1 mA. Recalculating: 0.5 V/(-2 mA) = -250 Ω.)",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen104"
  },
  {
    "question_text": "A diode exhibits a sharp increase in current after a threshold voltage. If below 0.6 V the current is 1 μA and above 0.6 V the current jumps to 5 mA, determine the magnitude of the change in current.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Change in current = 5 mA - 1 μA ≈ 4.999 mA",
    "explanation": "The change in current is calculated by subtracting the lower current from the higher. Since 1 μA is 0.001 mA, the change is 5 mA - 0.001 mA = 4.999 mA, which is approximately 5 mA.",
    "topic": "Limitations of Ohm's Law",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph103",
    "section_id": "06_section_3_6",
    "question_id": "cbse_xii_leph1dd_c103_gen105"
  }
]