[
  {
    "question_text": "What did Maxwell introduce to address the inconsistency in Ampere's circuital law when dealing with capacitors carrying time-varying currents?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Displacement current",
      "Magnetic flux",
      "Electric potential",
      "Induced current"
    ],
    "correct_answer": "Displacement current",
    "explanation": "Maxwell suggested the existence of an additional term known as the displacement current. This term was introduced to modify Ampere's circuital law so that it remained valid even in situations involving a time-varying electric field, such as between the plates of a capacitor.",
    "topic": "Displacement current",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen001"
  },
  {
    "question_text": "Which phenomenon is described as coupled time-varying electric and magnetic fields that propagate in space?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Electromagnetic waves",
      "Sound waves",
      "Water waves",
      "Gravitational waves"
    ],
    "correct_answer": "Electromagnetic waves",
    "explanation": "Electromagnetic waves are described as coupled, time-varying electric and magnetic fields that move through space. This concept emerged from Maxwell's equations.",
    "topic": "Electromagnetic waves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen002"
  },
  {
    "question_text": "Maxwell's equations unified which three major domains of physics?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Electricity, magnetism, and light",
      "Mechanics, thermodynamics, and optics",
      "Quantum mechanics, relativity, and nuclear physics",
      "Electrochemistry, fluid dynamics, and acoustics"
    ],
    "correct_answer": "Electricity, magnetism, and light",
    "explanation": "Maxwell's work led to the unification of electricity, magnetism, and optics (light) by showing that light is an electromagnetic wave derived from his equations.",
    "topic": "Maxwell's equations",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen003"
  },
  {
    "question_text": "What is the approximate speed of light as predicted by Maxwell's equations and confirmed by optical measurements?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "3 x 10^8 m/s",
      "1.5 x 10^8 m/s",
      "2.5 x 10^6 m/s",
      "1 x 10^9 m/s"
    ],
    "correct_answer": "3 x 10^8 m/s",
    "explanation": "Maxwell's equations predict the speed of electromagnetic waves, which is very close to the speed of light measured by optical experiments, approximately 3 x 10^8 m/s.",
    "topic": "Electromagnetic waves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen004"
  },
  {
    "question_text": "Who experimentally demonstrated the existence of electromagnetic waves in 1885?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Hertz",
      "Maxwell",
      "Marconi",
      "Faraday"
    ],
    "correct_answer": "Hertz",
    "explanation": "Heinrich Hertz experimentally demonstrated the existence of electromagnetic waves in 1885, thereby confirming Maxwell's theoretical predictions.",
    "topic": "Electromagnetic waves history",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen005"
  },
  {
    "question_text": "Explain the concept of displacement current as introduced by Maxwell.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Displacement current is an additional term introduced by Maxwell to account for the changing electric field in regions (such as between capacitor plates) where there is no conduction current, ensuring the continuity of current in Ampere's law.",
    "explanation": "Maxwell introduced the displacement current to resolve an inconsistency in Ampere's law when applied to a capacitor with time-varying currents. It represents the effect of the time-varying electric field, thereby allowing the equations to be applied universally, even in regions where physical charge carriers are absent.",
    "topic": "Displacement current",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen006"
  },
  {
    "question_text": "Define Maxwell's equations and describe their significance in electromagnetism.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Maxwell's equations are a set of four partial differential equations that describe the behavior of electric and magnetic fields and their interactions with charges and currents. They unify the laws of electricity and magnetism and predict the existence of electromagnetic waves.",
    "explanation": "The equations mathematically express how electric and magnetic fields are generated and altered by charges and currents. They also implied that light is an electromagnetic wave, thereby bridging optics and electromagnetism.",
    "topic": "Maxwell's equations",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen007"
  },
  {
    "question_text": "List the key contributions of James Clerk Maxwell to the field of electromagnetism as described in the section.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Maxwell's contributions include deriving the thermal velocity distribution of molecules, unifying electricity and magnetism into a single framework through Maxwell's equations, predicting the existence of electromagnetic waves, and showing that light is an electromagnetic wave.",
    "explanation": "The section highlights Maxwell’s work on the unification of different branches of physics, especially electricity, magnetism, and light, and also notes his efforts in molecular theory.",
    "topic": "James Clerk Maxwell",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen008"
  },
  {
    "question_text": "What is the importance of the derivation that shows light is an electromagnetic wave?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The derivation unifies the domains of electricity, magnetism, and optics, and it provides a theoretical basis for understanding light as an electromagnetic phenomenon. This unification has far-reaching implications in both science and technology.",
    "explanation": "By showing that light is an electromagnetic wave, Maxwell's work not only bridged separate fields but also led to further technological developments such as wireless communication. It confirmed that the same fundamental laws apply to a broad range of physical phenomena.",
    "topic": "Electromagnetic waves, Maxwell's equations",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen009"
  },
  {
    "question_text": "Discuss the inconsistency encountered with Ampere's law when applied to a capacitor with a time-varying current, and explain how Maxwell's introduction of the displacement current resolves this issue.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The inconsistency arises because applying Ampere's law to a loop enclosing a capacitor appears to yield different currents depending on the surface chosen: one that passes through the wires (with conduction current) and one that spans the gap between capacitor plates (with no conduction current). Maxwell resolved this by introducing the displacement current, which represents the effect of a changing electric field between the plates. This term, when added to the conduction current, restores the continuity of current in Ampere's law and ensures that both surfaces give the same total current.",
    "explanation": "Ampere's circuital law originally considered only conduction current. However, in the case of a capacitor, no charge is physically crossing the gap. Maxwell's insight was to account for the rate of change of the electric field (or electric flux) in the gap, effectively treating it as a current (displacement current). This addition reconciles the law with the principle of continuity and conservation of charge and forms a cornerstone of Maxwell's equations.",
    "topic": "Displacement current, Ampere's law",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen010"
  },
  {
    "question_text": "Describe how Maxwell's equations unified electricity, magnetism, and optics, and explain the experimental confirmation of electromagnetic waves by Hertz.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Maxwell's equations unified the fields by demonstrating that electric and magnetic fields are interrelated and can generate one another when they change with time. This led to the prediction that these coupled fields propagate as electromagnetic waves. Hertz confirmed this prediction experimentally in 1885 by generating and detecting radio waves that behaved consistently with Maxwell's theory. This unification laid the groundwork for modern technologies such as radio, television, and wireless communication.",
    "explanation": "Maxwell's work established a set of equations showing that a time-varying electric field can induce a magnetic field and vice versa, leading to self-propagating electromagnetic waves. Hertz’s experiments provided tangible proof of these waves, validating Maxwell's theoretical framework and transforming our understanding and application of electromagnetic phenomena in technology.",
    "topic": "Maxwell's equations, Electromagnetic waves",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen011"
  },
  {
    "question_text": "Examine the impact of Maxwell's work on modern communication technologies. Discuss how his prediction of electromagnetic waves and Hertz's experimental verification played a role in technological advancements.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Maxwell’s prediction of electromagnetic waves, followed by Hertz’s experimental confirmation, laid the theoretical and experimental foundations for technologies such as radio, television, and wireless communication. By showing that light is an electromagnetic phenomenon, his work enabled the development of devices that transmit and receive information using electromagnetic signals, ultimately revolutionizing global communication.",
    "explanation": "Maxwell's equations not only unified fundamental aspects of physics but also led to the discovery of electromagnetic waves, which travel at the speed of light. The experimental work of Hertz then demonstrated that these waves could be generated and detected, paving the way for using electromagnetic radiation for communication purposes. This breakthrough has had a profound impact on modern society by enabling technologies ranging from radio broadcasting to telecommunications.",
    "topic": "Electromagnetic waves, Communication technology",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen012"
  },
  {
    "question_text": "According to Maxwell, a time-varying electric field can generate a magnetic field.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Maxwell argued that not only an electric current but also a time-varying electric field gives rise to a magnetic field, which is an essential aspect of his theory of electromagnetism.",
    "topic": "Displacement current, Maxwell's equations",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen013"
  },
  {
    "question_text": "Maxwell agreed with the idea that electricity is particulate in nature.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The section mentions that Maxwell did not agree with the idea that electricity was particulate, which was suggested by Faraday's laws of electrolysis.",
    "topic": "James Clerk Maxwell",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen014"
  },
  {
    "question_text": "The displacement current, introduced by Maxwell, has the same unit (amperes) as the conduction current.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Even though the displacement current does not involve the movement of charge carriers, it represents a time rate of change of the electric field and has dimensions of charge per unit time, which is measured in amperes, just like the conduction current.",
    "topic": "Displacement current",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen015"
  },
  {
    "question_text": "Using Maxwell's equations, the speed of electromagnetic waves is given by 1/square root(mu0 times epsilon0). If mu0 = 4π x 10^-7 H/m and epsilon0 = 8.85 x 10^-12 F/m, calculate the speed of electromagnetic waves in meters per second.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 3 x 10^8 m/s",
    "explanation": "Step 1: The speed of electromagnetic waves is c = 1/sqrt(mu0 x epsilon0). Substituting mu0 = 4π x 10^-7 H/m and epsilon0 = 8.85 x 10^-12 F/m, first calculate mu0 x epsilon0. Typically, using approximate values, the result comes out to be about 9 x 10^-9. Taking the square root gives 3 x 10^-4, and finally, c = 1/(3 x 10^-4) roughly equals 3 x 10^8 m/s. This shows consistency with the measured speed of light.",
    "topic": "Electromagnetic waves, Maxwell's equations",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen016"
  },
  {
    "question_text": "A capacitor with a capacitance of 10 μF experiences a rate of voltage change of 2000 V/s across its plates. Determine the displacement current between the plates.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "0.02 A",
    "explanation": "Displacement current I_d can be calculated by I_d = C x (dV/dt). Here, C = 10 μF = 10 x 10^-6 F and dV/dt = 2000 V/s. Multiplying, I_d = 10 x 10^-6 F x 2000 V/s = 0.02 A.",
    "topic": "Displacement current",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen017"
  },
  {
    "question_text": "An electromagnetic wave in free space has a frequency of 100 MHz. Calculate its wavelength using the speed of light c = 3 x 10^8 m/s.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "3 m",
    "explanation": "The wavelength λ is given by the formula λ = c/f. Here, f = 100 MHz = 100 x 10^6 Hz. Substituting the values, λ = (3 x 10^8 m/s) / (100 x 10^6 Hz) = 3 m.",
    "topic": "Electromagnetic waves",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen018"
  },
  {
    "question_text": "A radio wave has a wavelength of 1 x 10^6 m. Determine its frequency in Hertz using the speed of light c = 3 x 10^8 m/s.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "300 Hz",
    "explanation": "Frequency (f) can be found by the formula f = c/λ. Substituting in the given values, f = (3 x 10^8 m/s) / (1 x 10^6 m) = 300 Hz.",
    "topic": "Electromagnetic waves",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen019"
  },
  {
    "question_text": "If the rate of change of electric flux through a capacitor is 5 x 10^-3 V-m/s and the area of the capacitor plate is 0.2 m^2, calculate the displacement current density. (Hint: First find the rate of change of the electric field as dE/dt = (dΦ_E/dt)/Area and then multiply by epsilon0, where epsilon0 = 8.85 x 10^-12 F/m.)",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 2.21 x 10^-13 A/m^2",
    "explanation": "Step 1: Calculate dE/dt = (dΦ_E/dt)/Area = (5 x 10^-3 V-m/s) / (0.2 m^2) = 0.025 V/m-s. Step 2: Displacement current density J_d = epsilon0 x (dE/dt) = (8.85 x 10^-12 F/m) x (0.025 V/m-s) = 2.2125 x 10^-13 A/m^2, which is approximately 2.21 x 10^-13 A/m^2.",
    "topic": "Displacement current",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph108",
    "section_id": "01_section_8_1",
    "question_id": "cbse_xii_leph1dd_c108_gen020"
  }
]