[
  {
    "question_text": "Predict the direction of induced current in the situations described by the following figures: (a) to (f) as shown in Fig. 6.15. (The diagrams show cases such as a bar magnet moving relative to a solenoid, a changing current in one loop affecting another, and a decreasing magnetic field due to a current.)",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The induced current will always be in the direction that opposes the change in magnetic flux. For instance, when a North pole of a magnet approaches a loop, the induced current creates a magnetic field with its North pole facing the approaching magnet (and vice versa); for a decreasing field or a current change in a neighboring loop, Lenz's law similarly provides the qualitative direction.",
    "explanation": "According to Lenz's law, the induced current flows in such a direction that the magnetic field created by it opposes the change in magnetic flux. In the cases shown in Fig. 6.15, examine the direction of motion or change of the external magnetic field and then determine the polarity of the induced field required to oppose that change. The specific answer will depend on the details in each diagram, but the overall principle is that the induced magnetic field always opposes the flux change.",
    "topic": "Electromagnetic Induction; Lenz's Law",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph106",
    "question_id": "cbse_xii_leph1dd_c106_ex001"
  },
  {
    "question_text": "Use Lenz's law to determine the direction of induced current in the situations described in Fig. 6.16: (a) A wire of irregular shape turning into a circular shape; (b) A circular loop being deformed into a narrow straight wire.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In both cases, the induced current will flow such that the magnetic field created by it opposes the change in the loop’s effective area (and hence the magnetic flux). In (a), as the irregular wire becomes more circular, the flux increases; the induced current produces a field opposing that increase. In (b), as the circular loop is deformed into a narrow straight wire, the flux decreases; the induced current will try to maintain the original flux by producing a field in the same direction as the original field.",
    "explanation": "Lenz's law states that the induced current opposes the change in magnetic flux. In these deformation problems, the effective area (and thus the flux) is changing. For the irregular-to-circular change, an increase in flux is opposed by an induced current whose magnetic field opposes the enhanced flux. Conversely, when a circular loop becomes narrow, the reduction in flux is opposed by inducing a current that reinforces the original flux.",
    "topic": "Lenz's Law; Magnetic Flux",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph106",
    "question_id": "cbse_xii_leph1dd_c106_ex002"
  },
  {
    "question_text": "A long solenoid with 15 turns per cm has a small loop of area 2.0 cm² placed inside the solenoid, oriented normal to its axis. If the current carried by the solenoid changes steadily from 2.0 A to 4.0 A in 0.1 s, what is the induced emf in the loop while the current is changing?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 7.5 µV",
    "explanation": "Inside a solenoid, the magnetic field is B = μ₀ n I, with n = 15 turns/cm = 1500 turns/m. The induced emf in the loop is given by |ε| = A μ₀ n |dI/dt|. The area A is 2.0 cm² = 2.0 x 10⁻⁴ m². Given dI/dt = (4.0 A - 2.0 A)/0.1 s = 20 A/s and μ₀ = 4π x 10⁻⁷ H/m, we get: ε = (2.0 x 10⁻⁴) x (4π x 10⁻⁷) x 1500 x 20 ≈ 7.5 x 10⁻⁶ V (7.5 µV).",
    "topic": "Magnetic Flux; Faraday's Law",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph106",
    "question_id": "cbse_xii_leph1dd_c106_ex003"
  },
  {
    "question_text": "A rectangular wire loop of sides 8 cm and 2 cm with a small cut is moving out of a region of uniform magnetic field of magnitude 0.3 T (directed normal to the loop). (a) What is the emf developed across the cut if the loop moves with a speed of 1 cm/s in a direction normal to the longer side? (b) What is the emf if it moves normal to the shorter side? Also, for each case, for how long does the induced voltage last?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) Emf ≈ 0.24 mV lasting for about 2 s; (b) Emf ≈ 0.06 mV lasting for about 8 s.",
    "explanation": "The induced emf in a moving conductor is given by ε = B L v, where L is the length of the side perpendicular to the motion and v is the velocity. (a) When moving normal to the longer side (8 cm = 0.08 m), ε = 0.3 T × 0.08 m × 0.01 m/s = 2.4 × 10⁻⁴ V (0.24 mV). The duration is determined by the distance corresponding to the shorter side (2 cm = 0.02 m); time = 0.02 m / 0.01 m/s = 2 s. (b) When moving normal to the shorter side (2 cm = 0.02 m), ε = 0.3 T × 0.02 m × 0.01 m/s = 6 × 10⁻⁵ V (0.06 mV); the time corresponds to the longer side (8 cm = 0.08 m), so time = 0.08 m / 0.01 m/s = 8 s.",
    "topic": "Motional Electromotive Force",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph106",
    "question_id": "cbse_xii_leph1dd_c106_ex004"
  },
  {
    "question_text": "A 1.0 m long metallic rod is rotated with an angular frequency of 400 rad/s about an axis perpendicular to the rod, passing through one end. The other end of the rod remains in contact with a circular metallic ring. A constant and uniform magnetic field of 0.5 T, parallel to the axis, is present. Calculate the emf developed between the centre and the ring.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 100 V",
    "explanation": "For a rod rotating about one end in a uniform magnetic field, the induced motional emf is given by ε = (1/2) B ω L². Substituting B = 0.5 T, ω = 400 rad/s, and L = 1.0 m, we have: ε = 0.5 × 400 × (1)² / 2 = 100 V.",
    "topic": "Motional Electromotive Force",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph106",
    "question_id": "cbse_xii_leph1dd_c106_ex005"
  },
  {
    "question_text": "A horizontal straight wire 10 m long (extending from east to west) is falling with a speed of 5.0 m/s at right angles to the horizontal component of the earth's magnetic field, which has a magnitude of 0.30 × 10⁻⁴ Wb/m². (a) What is the instantaneous value of the emf induced in the wire? (b) What is the direction of the induced emf? (c) Which end of the wire is at higher electrical potential?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) Approximately 1.5 mV; (b) The emf is induced according to Fleming’s right-hand rule (with the direction given by v × B); (c) The end toward which the force on positive charges acts (typically the eastern end if the horizontal component of earth's field is directed from south to north) is at higher potential.",
    "explanation": "The magnitude of the induced emf is given by ε = B L v. Using B = 0.30 × 10⁻⁴ T (which is 3.0 × 10⁻⁵ T), L = 10 m, and v = 5.0 m/s, we find ε = 3.0 × 10⁻⁵ × 10 × 5 = 1.5 × 10⁻³ V (1.5 mV). For the direction, using the right-hand rule (with the velocity vector downward and the magnetic field horizontal), positive charges are deflected toward one end of the wire; in this assumed configuration, this causes the eastern end to be at a higher potential.",
    "topic": "Motional Electromotive Force; Faraday's Law",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph106",
    "question_id": "cbse_xii_leph1dd_c106_ex006"
  },
  {
    "question_text": "Current in a circuit falls from 5.0 A to 0.0 A in 0.1 s. If an average emf of 200 V is induced, give an estimate of the self-inductance of the circuit.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Approximately 4 H",
    "explanation": "Using Faraday’s law for self-induction, the induced emf is given by ε = L (dI/dt). Here, dI/dt = (0 - 5.0 A)/0.1 s = -50 A/s. Taking the magnitude, L = 200 V / 50 A/s = 4 H.",
    "topic": "Self-Inductance",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph106",
    "question_id": "cbse_xii_leph1dd_c106_ex007"
  },
  {
    "question_text": "A pair of adjacent coils has a mutual inductance of 1.5 H. If the current in one coil changes from 0 to 20 A in 0.5 s, what is the change of flux linkage with the other coil?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "30 Wb (Weber)",
    "explanation": "The change in flux linkage in the other coil is given by ΔΦ = M × ΔI. With M = 1.5 H and ΔI = 20 A, the change in flux linkage is 1.5 × 20 = 30 Wb.",
    "topic": "Mutual Inductance",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph106",
    "question_id": "cbse_xii_leph1dd_c106_ex008"
  }
]