[
  {
    "question_text": "Which of the following best explains why ortho nitrophenol is more acidic than ortho methoxyphenol?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The nitro group is an electron donating group",
      "The nitro group is an electron withdrawing group",
      "The methoxy group forms stronger intramolecular hydrogen bonds",
      "The methoxy group is larger in size"
    ],
    "correct_answer": "The nitro group is an electron withdrawing group",
    "explanation": "The nitro group is strongly electron withdrawing, which stabilizes the negative charge on the conjugate base after deprotonation, increasing the acidity of ortho nitrophenol. In contrast, the methoxy group is electron donating.",
    "topic": "Acidity of substituted phenols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen536"
  },
  {
    "question_text": "How does the electron withdrawing ability of the nitro group affect the conjugate base of ortho nitrophenol compared to the conjugate base of ortho methoxyphenol?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It destabilizes the conjugate base, making deprotonation less favorable",
      "It has no effect on the charge distribution in the conjugate base",
      "It stabilizes the conjugate base by delocalizing the negative charge",
      "It donates electrons to the conjugate base"
    ],
    "correct_answer": "It stabilizes the conjugate base by delocalizing the negative charge",
    "explanation": "The electron withdrawing nitro group stabilizes the conjugate base of ortho nitrophenol by delocalizing the negative charge, thereby enhancing its acidity.",
    "topic": "Electronic effects on acidity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen537"
  },
  {
    "question_text": "Which effect primarily accounts for the lower acidity of ortho methoxyphenol compared to ortho nitrophenol?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Inductive electron donation from the methoxy group",
      "Strong electron withdrawal by the methoxy group",
      "Steric hindrance between substituents",
      "Formation of an unstable conjugate base"
    ],
    "correct_answer": "Inductive electron donation from the methoxy group",
    "explanation": "The methoxy group is electron donating through induction and mesomeric effects, which decreases the stabilization of the conjugate base, resulting in lower acidity compared to ortho nitrophenol.",
    "topic": "Substituent effects on acidity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen538"
  },
  {
    "question_text": "Consider the resonance and inductive effects in ortho-substituted phenols. Which statement best demonstrates the reason ortho nitrophenol is more acidic?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "The nitro group withdraws electron density through resonance, while the methoxy group withdraws electron density through induction",
      "The nitro group withdraws electron density primarily through induction, stabilizing the conjugate base, whereas the methoxy group donates electron density through resonance",
      "Both nitro and methoxy groups donate electrons through resonance but the nitro group is bulkier, causing steric hindrance",
      "The methoxy group forms intramolecular hydrogen bonds which destabilize the conjugate base"
    ],
    "correct_answer": "The nitro group withdraws electron density primarily through induction, stabilizing the conjugate base, whereas the methoxy group donates electron density through resonance",
    "explanation": "The nitro group, through its strong inductive withdrawal, stabilizes the conjugate base by delocalizing negative charge, whereas the methoxy group donates electrons via resonance, thereby decreasing the stability of the conjugate base.",
    "topic": "Resonance and inductive effects in acidity",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen539"
  },
  {
    "question_text": "Define conjugate base stabilization and explain its relevance to the acidity of phenols.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Conjugate base stabilization refers to the stabilization of the negative charge that results from deprotonation. In phenols, factors that stabilize the conjugate base (such as electron withdrawing groups) increase acidity.",
    "explanation": "When a phenol loses a proton, it forms a conjugate base. The more stable this negative charge is (through delocalization or electron withdrawing effects), the stronger the acid. Electron withdrawing groups like nitro stabilize the negative charge better than electron donating groups like methoxy.",
    "topic": "Conjugate base stabilization",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen540"
  },
  {
    "question_text": "Explain how the electron donating effect of the methoxy group influences the acidity of ortho methoxyphenol.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The methoxy group donates electrons through resonance and inductive effects, which reduces the stability of the negative charge on the conjugate base, making deprotonation less favorable and decreasing the acidity.",
    "explanation": "Electron donation from the methoxy group adds electron density to the benzene ring and the oxygen atom of the phenolate ion, which destabilizes the conjugate base by increasing electron–electron repulsion. As a result, ortho methoxyphenol is less acidic than its nitro analogue.",
    "topic": "Substituent effects on acidity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen541"
  },
  {
    "question_text": "Discuss the role of steric effects and intramolecular hydrogen bonding in influencing the acidity of ortho-substituted phenols, specifically comparing nitro and methoxy groups.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Steric effects may hinder or facilitate intramolecular interactions. In ortho nitrophenol, the nitro group can form intramolecular hydrogen bonding that can either stabilize or slightly influence deprotonation, while the methoxy group may cause steric hindrance that prevents effective stabilization of the conjugate base.",
    "explanation": "While electronic effects are primary, steric hindrance and intramolecular hydrogen bonding also play a role. The nitro group may interact via hydrogen bonding with the hydroxyl proton, effectively stabilizing the molecule after deprotonation, whereas the bulkiness or orientation of the methoxy group might reduce such beneficial interactions.",
    "topic": "Steric and H-bond effects on acidity",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen542"
  },
  {
    "question_text": "Explain in detail how the electron withdrawing nitro group increases the acidity of ortho nitrophenol. Discuss the mechanism involved in stabilizing the conjugate base.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The electron withdrawing nitro group increases acidity by stabilizing the conjugate base through resonance and induction. When ortho nitrophenol loses a proton, the negative charge on the oxygen can be delocalized, and the -NO2 group, being strongly electron withdrawing, pulls electron density away. This inductive effect stabilizes the phenolate ion, lowering its energy and making deprotonation more favorable.",
    "explanation": "Upon deprotonation, ortho nitrophenol forms a phenolate ion where the negative charge is delocalized across the aromatic system. The nitro group, attached in the ortho position, withdraws electron density through a strong inductive effect and contributes to resonance stabilization. This dual stabilization mechanism lowers the energy of the conjugate base, leading to enhanced acidity. The interplay between the resonance delocalization and the inductive withdrawal is the key mechanism in this increased acidity.",
    "topic": "Mechanism of increased acidity in ortho nitrophenol",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen543"
  },
  {
    "question_text": "Compare and contrast the electronic and steric effects of nitro and methoxy substituents on the acidity of phenol. Propose an experimental approach to analyze these effects.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Ortho nitrophenol is more acidic due to the strong electron withdrawing capability of the nitro group, which stabilizes the conjugate base via both inductive and resonance effects. In contrast, the methoxy group donates electrons via resonance, destabilizing the conjugate base; in addition, its steric bulk may hinder intramolecular hydrogen bonding compared to the nitro group. An experimental approach might involve comparing the pKa values of these compounds using titration and spectroscopic techniques (such as UV-vis or NMR) to analyze the degree of conjugation and electronic distribution in the deprotonated forms.",
    "explanation": "The nitro group stabilizes the phenolate ion by withdrawing electron density, which is favorable for acidity. The methoxy group, however, increases electron density and destabilizes the conjugate base. An experiment could involve measuring the pKa via potentiometric titrations for both compounds under identical conditions, then using spectroscopic methods to detect differences in electron distribution. Additionally, computational studies could be used to model steric hindrance and its effect on the hydrogen bonding network.",
    "topic": "Comparative substituent effects on acidity",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen544"
  },
  {
    "question_text": "Ortho nitrophenol is less acidic than ortho methoxyphenol.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "This statement is false. Ortho nitrophenol is more acidic than ortho methoxyphenol because the nitro group is electron withdrawing, which stabilizes the conjugate base, whereas the methoxy group is electron donating.",
    "topic": "Acidity comparison of substituted phenols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen545"
  },
  {
    "question_text": "The electron withdrawing effect stabilizes the conjugate base of phenol, making it more acidic.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "This statement is true. Electron withdrawing groups, such as the nitro group in ortho nitrophenol, stabilize the negative charge of the conjugate base, thereby enhancing the acidity of the molecule.",
    "topic": "Electronic effects on conjugate base stability",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen546"
  },
  {
    "question_text": "Unsubstituted phenol has a pKa of approximately 10. If the nitro group lowers the pKa by 1.5 units and the methoxy group raises it by 0.5 unit, calculate the pKa values for ortho nitrophenol and ortho methoxyphenol, and determine the difference in their pKa.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The pKa of ortho nitrophenol is approximately 8.5, and that of ortho methoxyphenol is approximately 10.5. The difference in their pKa values is 2.0 units.",
    "explanation": "Starting with the pKa of unsubstituted phenol = 10, the nitro group lowers this value by 1.5 to give 8.5 for ortho nitrophenol. Conversely, the methoxy group raises the pKa by 0.5 to give 10.5 for ortho methoxyphenol. The difference between 10.5 and 8.5 is 2.0 units.",
    "topic": "Quantitative aspects of acidity",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen547"
  },
  {
    "question_text": "Using the Henderson-Hasselbalch equation, calculate the ratio of deprotonated to protonated forms for ortho nitrophenol (pKa 8.5) and ortho methoxyphenol (pKa 10.5) at pH 9.0.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For ortho nitrophenol, the ratio [A-]/[HA] is approximately 3.16, and for ortho methoxyphenol, it is approximately 0.032.",
    "explanation": "Using the Henderson-Hasselbalch equation: pH = pKa + log([A-]/[HA]). For ortho nitrophenol: 9.0 = 8.5 + log(r), so log(r) = 0.5, hence r = 10^0.5 ≈ 3.16. For ortho methoxyphenol: 9.0 = 10.5 + log(r), so log(r) = -1.5, hence r = 10^-1.5 ≈ 0.032.",
    "topic": "Application of Henderson-Hasselbalch equation in acidity",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen548"
  },
  {
    "question_text": "Given a measured acid dissociation constant (Ka) for ortho nitrophenol as 3.16 x 10^-9 at 25°C, calculate its pKa.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The pKa of ortho nitrophenol is approximately 8.5.",
    "explanation": "pKa is calculated using the formula pKa = -log(Ka). For Ka = 3.16 x 10^-9, pKa = -log(3.16 x 10^-9) ≈ 8.5.",
    "topic": "Acid dissociation constant calculations",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen549"
  },
  {
    "question_text": "For a 0.1 M solution of both ortho nitrophenol (pKa 8.5) and ortho methoxyphenol (pKa 10.5) at pH 7, calculate the percent ionization of each compound.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For ortho nitrophenol, the percent ionization is approximately 3.06%, and for ortho methoxyphenol, it is approximately 0.032%.",
    "explanation": "Using the Henderson-Hasselbalch relation, the ratio [A-]/[HA] for ortho nitrophenol at pH 7 is 10^(7-8.5) = 10^-1.5 ≈ 0.0316. The fraction ionized is 0.0316/(1 + 0.0316) ≈ 0.0306 or 3.06%. For ortho methoxyphenol, the ratio is 10^(7-10.5) = 10^-3.5 ≈ 0.000316, and the fraction ionized is 0.000316/(1 + 0.000316) ≈ 0.000316, or about 0.032%.",
    "topic": "Percent ionization in acid-base equilibrium",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "37_section_7_15",
    "question_id": "cbse_xii_lech2dd_c202_gen550"
  }
]