[
  {
    "question_text": "Which suffix is used in the common names of carboxylic acids?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "-ous acid",
      "-ic acid",
      "-ide",
      "-ate"
    ],
    "correct_answer": "-ic acid",
    "explanation": "Carboxylic acids are traditionally named with the suffix '-ic acid' when common names are used. This comes from their historical extraction from natural sources.",
    "topic": "Nomenclature",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen092"
  },
  {
    "question_text": "In the IUPAC naming system for aliphatic carboxylic acids, what suffix replaces the ending '-e' in the corresponding alkane name?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "-ane",
      "-ene",
      "-oic acid",
      "-yne"
    ],
    "correct_answer": "-oic acid",
    "explanation": "The IUPAC system names aliphatic carboxylic acids by replacing the final '-e' of the alkane with '-oic acid', reflecting the presence of the COOH group.",
    "topic": "Nomenclature",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen093"
  },
  {
    "question_text": "When numbering the carbon chain in carboxylic acids according to IUPAC rules, which carbon is assigned as carbon-1?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The methyl carbon",
      "The carbonyl carbon",
      "The carboxyl carbon",
      "The terminal carbon on the opposite end"
    ],
    "correct_answer": "The carboxyl carbon",
    "explanation": "In IUPAC nomenclature, the carbon of the carboxyl group (COOH) is always assigned as carbon-1, ensuring consistency in naming.",
    "topic": "Nomenclature",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen094"
  },
  {
    "question_text": "Which of the following corresponds to the IUPAC name 'butanoic acid'?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Acetic acid",
      "Propionic acid",
      "Butyric acid",
      "Benzoic acid"
    ],
    "correct_answer": "Butyric acid",
    "explanation": "Butanoic acid is the systematic IUPAC name for butyric acid, a four-carbon carboxylic acid.",
    "topic": "Nomenclature",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen095"
  },
  {
    "question_text": "Which resonance effect in the carboxyl group is responsible for the reduced electrophilicity of the carboxyl carbon?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Inductive effect from alkyl groups",
      "Resonance delocalization between the carbonyl and hydroxyl oxygens",
      "Hyperconjugation from adjacent C-H bonds",
      "Steric hindrance between bulky groups"
    ],
    "correct_answer": "Resonance delocalization between the carbonyl and hydroxyl oxygens",
    "explanation": "Resonance structures of the carboxyl group show that electron density is delocalized between the carbonyl and hydroxyl oxygens, reducing the electrophilicity of the carbonyl carbon.",
    "topic": "Structure of Carboxyl Group",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen096"
  },
  {
    "question_text": "Provide the IUPAC name for formic acid.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Methanoic acid",
    "explanation": "Formic acid, with the formula HCOOH, is known in the IUPAC system as methanoic acid. This naming follows the rule of replacing '-e' in 'methane' with '-oic acid'.",
    "topic": "Nomenclature",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen097"
  },
  {
    "question_text": "List two differences between common names and IUPAC names for carboxylic acids.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Common names are derived from natural sources and often end with '-ic acid', whereas IUPAC names are systematic, using the alkane root with the ending '-oic acid' and include rules for numbering.",
    "explanation": "Common names often reflect the compound's source (e.g., acetic acid from vinegar), while IUPAC names are structured and systematic, providing information like the number of carbons and substituent positions.",
    "topic": "Nomenclature",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen098"
  },
  {
    "question_text": "Explain why the carboxylic carbon in the carboxyl group is less electrophilic than a typical carbonyl carbon.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Due to resonance, the negative charge is delocalized between the carbonyl oxygen and the hydroxyl oxygen, which stabilizes the carboxyl carbon and reduces its electrophilicity.",
    "explanation": "The presence of resonance structures in carboxylic acids distributes the electron density over both oxygen atoms, making the carbon less electron-deficient compared to a typical carbonyl carbon, which lacks this stabilization.",
    "topic": "Structure of Carboxyl Group",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen099"
  },
  {
    "question_text": "What numbering rule is applied when naming compounds with multiple COOH groups in IUPAC nomenclature?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The carboxyl group is assigned carbon-1 and the positions of additional COOH groups are indicated by Arabic numerals along with a multiplicative prefix such as dicarboxylic acid, tricarboxylic acid, etc.",
    "explanation": "In compounds with multiple carboxyl groups, IUPAC rules require the carboxyl carbon to be numbered as 1 and subsequent positions to be clearly indicated along with prefixes like 'di-' or 'tri-' to show the number of carboxyl groups present.",
    "topic": "Nomenclature",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen100"
  },
  {
    "question_text": "Discuss the historical significance of common names for carboxylic acids and provide examples mentioned in the text.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Common names for carboxylic acids have historical significance because they were among the earliest organic compounds isolated from nature. For example, formic acid was named based on its extraction from ants (formica in Latin), acetic acid was derived from vinegar (acetum in Latin), and butyric acid from rancid butter (butyrum in Latin).",
    "explanation": "The common names are rooted in early chemical discoveries and reflect the natural sources of these acids. These names provide insight into the history of organic chemistry and reveal how early chemists categorized substances based on their origin before systematic IUPAC nomenclature was developed.",
    "topic": "Nomenclature",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen101"
  },
  {
    "question_text": "Compare and contrast the naming conventions for carboxylic acids with a single COOH group versus those with multiple COOH groups according to IUPAC rules.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For carboxylic acids with a single COOH group, the IUPAC name is formed by replacing the '-e' in the alkane name with '-oic acid' and numbering begins at the carboxyl carbon. For molecules with multiple COOH groups, the base alkyl chain is numbered with the carboxyl carbon as position 1, additional COOH groups are indicated by their positions using Arabic numerals, and a multiplicative prefix (such as di-, tri-) is added before 'carboxylic acid' in the name.",
    "explanation": "The key difference lies in the requirement for numbering and multiplicative prefixes when multiple carboxyl groups are present. A single COOH requires simple modification of the alkane, while multiple groups require clear indication of each position and the total number of groups, ensuring the structure is fully and unambiguously described.",
    "topic": "Nomenclature",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen102"
  },
  {
    "question_text": "Analyze the structure of the carboxyl group and explain how its resonance structures affect its geometric configuration and reactivity.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The carboxyl group (COOH) is planar with bond angles of about 120° due to the sp2 hybridization of the carbon atom. Resonance delocalization occurs between the carbonyl oxygen and the hydroxyl oxygen, resulting in a distribution of electron density that stabilizes the overall structure while reducing the electrophilicity of the carbon. This resonance effect limits the reactivity of the carbonyl carbon compared to other more electrophilic carbonyl compounds.",
    "explanation": "By sharing the negative charge between both oxygen atoms, resonance minimizes the electron deficiency on the carbon atom. The planarity and fixed bond angles are consequences of the hybridization state and resonance stabilization, which together influence the chemical behavior of carboxylic acids.",
    "topic": "Structure of Carboxyl Group",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen103"
  },
  {
    "question_text": "True or False: In IUPAC nomenclature, the carboxyl group is always assigned as carbon-1 in the carbon chain.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "According to IUPAC rules, the carbon of the carboxyl group (COOH) is always numbered as carbon-1. This rule ensures consistency in the structural representation and naming of carboxylic acids.",
    "topic": "Nomenclature",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen104"
  },
  {
    "question_text": "True or False: The IUPAC suffix for naming carboxylic acids is '-ic acid'.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In IUPAC nomenclature, carboxylic acids are named with the suffix '-oic acid', not '-ic acid'. The '-ic acid' suffix is used for common names.",
    "topic": "Nomenclature",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen105"
  },
  {
    "question_text": "True or False: Resonance in the carboxyl group delocalizes electrons equally between the carbonyl and hydroxyl oxygen atoms.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The resonance structures of the carboxyl group depict a delocalization of electrons between the carbonyl oxygen and the hydroxyl oxygen, effectively distributing the electron density in a more balanced manner.",
    "topic": "Structure of Carboxyl Group",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen106"
  },
  {
    "question_text": "Calculate the number of carbon atoms in hexanedioic acid, given its structure as HOOC-(CH2)4-COOH, and provide its common name.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hexanedioic acid contains 6 carbon atoms and its common name is adipic acid.",
    "explanation": "Hexanedioic acid has a total of 6 carbon atoms; 4 from the (CH2)4 segment and 1 carbon from each of the two COOH groups, which each contribute one carbon. The common name for hexanedioic acid is adipic acid. The calculation: 4 + 1 + 1 = 6 carbons.",
    "topic": "Nomenclature",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen107"
  },
  {
    "question_text": "Given the structure CH3CH2CH2COOH, determine its IUPAC and common names, and indicate the total number of carbon atoms as well as the position of the carboxyl group.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The compound has 4 carbon atoms. Its IUPAC name is butanoic acid, and its common name is butyric acid. The carboxyl group is on carbon-1.",
    "explanation": "The structure CH3CH2CH2COOH comprises a three-carbon chain (CH3, CH2, CH2) plus one carbon from the COOH group, totaling 4 carbons. According to IUPAC nomenclature, the COOH carbon is carbon-1, and the name becomes butanoic acid; its common name is butyric acid.",
    "topic": "Nomenclature",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen108"
  },
  {
    "question_text": "For the compound HOOC-(CH2)3-COOH (glutaric acid), calculate its molecular formula and describe the numbering with respect to the carboxyl groups.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The molecular formula of glutaric acid is C5H8O4. The carboxyl carbon in each COOH is assigned as carbon-1 and carbon-5 when numbering the chain from one end.",
    "explanation": "Glutaric acid has two COOH groups and a three-carbon chain between them. Count: each COOH contains 1 carbon (total 2) plus 3 from CH2 groups, giving 5 carbons. Hydrogens: Each COOH contributes 1 H (total 2) plus 3 CH2 groups contribute 6 H, so H8 overall. Oxygen: Each COOH has 2 oxygens (total 4). The numbering starts at one carboxyl group, making it carbon-1, and the other COOH falls on carbon-5.",
    "topic": "Nomenclature",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen109"
  },
  {
    "question_text": "If a compound contains three carboxyl groups attached to a propane backbone, write its IUPAC name using systematic nomenclature rules.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The IUPAC name for the compound is propane-1,2,3-tricarboxylic acid.",
    "explanation": "With three COOH groups attached to a propane chain, numbering starts at one end with the carboxyl group being carbon-1. The use of the multiplicative prefix 'tri-' indicates the presence of three carboxyl groups, leading to the IUPAC name propane-1,2,3-tricarboxylic acid.",
    "topic": "Nomenclature",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech203",
    "section_id": "08_section_8_6",
    "question_id": "cbse_xii_lech2dd_c203_gen110"
  }
]