[
  {
    "question_text": "Write IUPAC names of the following compounds and classify them into primary, secondary and tertiary amines. (i) (CH₃)₂CHNH₂, (ii) CH₃(CH₂)₂NH₂, (iii) CH₃NHCH(CH₃)₂, (iv) (CH₃)₃CNH₂, (v) C₆H₅NHCH₃, (vi) (CH₃CH₂)₂NCH₃, (vii) m-BrC₆H₄NH₂.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For example: (i) 2-Aminopropane (primary amine); (ii) Butan-1-amine (primary amine); (iii) N-Methylpropan-2-amine (secondary amine); (iv) 2-Aminobutane, actually tert-butylamine (primary amine); (v) N-Methylaniline (secondary amine); (vi) N-Methyldiethylamine (tertiary amine); (vii) meta-Bromoaniline (primary amine).",
    "explanation": "Each compound is named by applying IUPAC rules for amines. Primary amines have –NH₂ attached to one carbon, secondary ones have one hydrogen replaced by an alkyl/aryl group on nitrogen, and tertiary amines have no N–H bonds. For instance, (i) has two methyl groups attached to a CH center with –NH₂ making it 2-aminopropane, and (v) with a phenyl substituent and a methyl group gives N-methylaniline.",
    "topic": "Nomenclature of Amines",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex001"
  },
  {
    "question_text": "Give one chemical test to distinguish between the following pairs of compounds: (i) methylamine and dimethylamine, (ii) secondary and tertiary amines, (iii) ethylamine and aniline, (iv) aniline and benzylamine, (v) aniline and N-methylaniline.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A common test is the Hinsberg reaction. In this test, primary amines (and to some extent benzylamines) react with benzenesulphonyl chloride to form sulphonamides that are soluble in alkali, while tertiary amines do not react. Also, the carbylamine reaction is positive only for primary amines. Thus, using a combination of the Hinsberg test and the carbylamine reaction one can distinguish between these pairs.",
    "explanation": "The Hinsberg test differentiates amines based on their reactivity with benzenesulphonyl chloride. Primary amines form sulphonamides soluble in alkali, secondary give derivatives insoluble in alkali, and tertiary amines do not react. The carbylamine reaction (using CHCl₃ and alcoholic KOH) gives isocyanides only for primary amines. These tests together can distinguish between methylamine vs dimethylamine and others.",
    "topic": "Chemical Tests for Amines",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex002"
  },
  {
    "question_text": "Account for the following:\n(i) pK₍b₎ of aniline is more than that of methylamine.\n(ii) Ethylamine is soluble in water whereas aniline is not.\n(iii) Methylamine in water reacts with ferric chloride to precipitate hydrated ferric oxide.\n(iv) Although the amino group is ortho- and para-directing in aromatic electrophilic substitution reactions, aniline on nitration gives a substantial amount of meta-nitroaniline.\n(v) Aniline does not undergo Friedel-Crafts reaction.\n(vi) Diazonium salts of aromatic amines are more stable than those of aliphatic amines.\n(vii) Gabriel phthalimide synthesis is preferred for synthesising primary amines.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Answers include: (i) In aniline, the lone pair is delocalized into the aromatic ring and is less available for protonation, resulting in a higher pK₍b₎ than methylamine. (ii) Ethylamine readily forms hydrogen bonds with water due to its small hydrophobic part, whereas the larger aromatic ring in aniline reduces water solubility. (iii) Methylamine forms a complex with ferric chloride causing precipitation of hydrated ferric oxide. (iv) Under nitration conditions, protonation of the amino group occurs, forming anilinium ion which is meta-directing. (v) Aniline forms strong complexes with Lewis acids (e.g., AlCl₃), inhibiting Friedel-Crafts reactions. (vi) Aromatic diazonium salts benefit from resonance stabilization, making them more stable than aliphatic diazonium salts. (vii) Gabriel synthesis avoids over-alkylation and is effective for primary amines because aryl halides are unreactive toward the phthalimide anion.",
    "explanation": "Each part requires application of concepts such as resonance, hydrogen bonding, solvation, and reagent reactivity. The reduced basicity of aniline is due to lone pair delocalization, while solubility differences and reactivity with ferric chloride are related to structural effects. Electrophilic substitution behavior is explained by protonation and directing effects, and the stability of diazonium salts is a consequence of resonance. Finally, the limitations of alkylation are overcome by Gabriel synthesis.",
    "topic": "Properties and Reactions of Amines",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex003"
  },
  {
    "question_text": "Arrange the following:\n(i) In decreasing order of the pK₍b₎ values: C₂H₅NH₂, C₆H₅NHCH₃, (C₂H₅)₂NH and C₆H₅NH₂.\n(ii) In increasing order of basic strength: C₆H₅NH₂, C₆H₅N(CH₃)₂, (C₂H₅)₂NH and CH₃NH₂.\n(iii) In increasing order of basic strength:\n    (a) Aniline, p-nitroaniline and p-toluidine,\n    (b) C₆H₅NH₂, C₆H₅NHCH₃, C₆H₅CH₂NH₂.\n(iv) In decreasing order of basic strength in the gas phase: C₂H₅NH₂, (C₂H₅)₂NH, (C₂H₅)₃N and NH₃.\n(v) In increasing order of boiling point: C₂H₅OH, (CH₃)₂NH, C₂H₅NH₂.\n(vi) In increasing order of solubility in water: C₆H₅NH₂, (C₂H₅)₂NH, C₂H₅NH₂.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Based on provided data and discussion: (i) C₆H₅NH₂ < NH₃ < C₆H₅CH₂NH₂ < C₂H₅NH₂; (ii) C₆H₅NH₂ < C₂H₅NH₂ < (C₂H₅)₃N < (C₂H₅)₂NH; (iii) (a) Aniline < p-nitroaniline < p-toluidine, (b) C₆H₅NH₂ < C₆H₅NHCH₃ < C₆H₅CH₂NH₂; (iv) C₂H₅NH₂ > (C₂H₅)₂NH > (C₂H₅)₃N > NH₃; (v) C₂H₅OH < (CH₃)₂NH < C₂H₅NH₂; (vi) C₆H₅NH₂ < (C₂H₅)₂NH < C₂H₅NH₂.",
    "explanation": "These arrangements involve comparing basicity, boiling points and solubility based on factors such as inductive effect, hydrogen bonding and steric hindrance. For example, in the aqueous phase, primary amines tend to be more basic due to better solvation compared to tertiary amines, while in the gas phase the inductive effect dominates.",
    "topic": "Basicity and Physical Properties of Amines",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex004"
  },
  {
    "question_text": "How will you convert:\n(i) Ethanoic acid into methanamine,\n(ii) Hexanenitrile into 1-aminopentane,\n(iii) Methanol into ethanoic acid,\n(iv) Ethanamine into methanamine,\n(v) Ethanoic acid into propanoic acid,\n(vi) Methanamine into ethanamine,\n(vii) Nitromethane into dimethylamine,\n(viii) Propanoic acid into ethanoic acid?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A plausible answer: (i) Convert ethanoic acid to acetamide (using ammonia) and perform a Hofmann bromamide degradation to yield methanamine; (ii) Convert hexanenitrile to hexanamide by reduction followed by the Hofmann reaction to lose one carbon, yielding 1-aminopentane; (iii) Oxidize methanol (via formaldehyde and formic acid intermediates) and perform a chain extension or using controlled oxidation to form ethanoic acid; (iv) Convert ethanamine to ethanamide then subject it to Hofmann degradation to give methanamine; (v) Employ a chain homologation reaction (such as via malonic ester synthesis) to extend ethanoic acid to propanoic acid; (vi) Convert methanamine into its nitrile (by reaction with a one-carbon electrophile) and then reduce to ethanamine; (vii) Condensation and reduction of nitromethane (possibly forming intermediates that on further methylation yield dimethylamine); (viii) Use a decarboxylation method to shorten propanoic acid to ethanoic acid.",
    "explanation": "Each conversion involves either a chain extension or chain shortening reaction. Reactions such as the Hofmann bromamide degradation allow the transformation of amides to amines with one carbon less. Reduction of nitriles, oxidation of alcohols, and homologation reactions are commonly used in amine synthesis. The answer outlines a sequence of reactions based on known methods discussed in the chapter.",
    "topic": "Conversion Reactions and Preparation of Amines",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex005"
  },
  {
    "question_text": "Describe a method for the identification of primary, secondary and tertiary amines. Also write chemical equations of the reactions involved.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The Hinsberg test is commonly used. In this test, the amine is reacted with benzenesulphonyl chloride in the presence of an alkaline medium. Primary amines form N-alkylbenzenesulphonamides soluble in alkali, secondary amines form sulphonamides that are insoluble, and tertiary amines do not react. The general equations are: R–NH₂ + C₆H₅SO₂Cl → C₆H₅SO₂–NHR + HCl (primary amine), and similarly for secondary amines. Tertiary amines show no reaction.",
    "explanation": "The Hinsberg test exploits the differences in nucleophilicity and steric hindrance of the amine nitrogen. The solubility of the resulting sulphonamide in alkali further distinguishes primary and secondary amines. This method reliably distinguishes between the three classes based on their different reactivity with benzenesulphonyl chloride.",
    "topic": "Identification of Amines",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex006"
  },
  {
    "question_text": "Write short notes on the following:\n(i) Carbylamine reaction\n(ii) Diazotisation\n(iii) Hofmann's bromamide reaction\n(iv) Coupling reaction\n(v) Ammonolysis\n(vi) Acetylation\n(vii) Gabriel phthalimide synthesis.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Briefly: (i) Carbylamine reaction is the conversion of a primary amine with CHCl₃ and alcoholic KOH to form an isocyanide (with a foul odor); (ii) Diazotisation is the conversion of a primary aromatic amine to a diazonium salt using NaNO₂ and acid at 0–5°C; (iii) Hofmann's bromamide reaction converts an amide to an amine with one less carbon using Br₂ and NaOH; (iv) Coupling reaction involves the reaction of diazonium salts with activated aromatic compounds (like phenol or aniline) to form azo dyes; (v) Ammonolysis is the nucleophilic substitution of a halide by ammonia to form an amine; (vi) Acetylation of an amine (using acetic anhydride or acetyl chloride) protects the NH₂ group; (vii) Gabriel phthalimide synthesis prepares primary amines by alkylation of phthalimide followed by hydrolysis.",
    "explanation": "These short notes summarize important reactions and methods for amine synthesis and modification. Each reaction has a specific role: for instance, carbylamine reaction is used as a test for primary amines, while diazotisation is crucial for further substitution reactions on aromatic rings.",
    "topic": "Reactions Involving Amines",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex007"
  },
  {
    "question_text": "Accomplish the following conversions:\n(i) Nitrobenzene to benzoic acid\n(ii) Benzene to m-bromophenol\n(iii) Benzoic acid to aniline\n(iv) Aniline to 2,4,6-tribromofluorobenzene\n(v) Benzyl chloride to 2-phenylethanamine\n(vi) Chlorobenzene to p-chloroaniline\n(vii) Aniline to p-bromoaniline\n(viii) Benzamide to toluene\n(ix) Aniline to benzyl alcohol.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A sample answer: (i) Nitrobenzene can be reduced to aniline and then oxidized under controlled conditions to benzoic acid; (ii) Benzene can undergo electrophilic substitution (nitration followed by substitution) to yield m-bromophenol; (iii) Benzoic acid can be converted to benzoyl chloride and then subjected to amination to form aniline; (iv) Aniline is brominated (under controlled conditions) to yield 2,4,6-tribromofluorobenzene; (v) Benzyl chloride undergoes ammonolysis to give benzylamine which can then be extended to 2-phenylethanamine by reaction with CH₃Cl; (vi) Chlorobenzene can be converted to p-chloroaniline via nucleophilic aromatic substitution (often after catalyst activation); (vii) Aniline can be acetylated, brominated, and then hydrolyzed to yield p-bromoaniline; (viii) Benzamide can be reduced (via a dehydration route) to yield toluene; (ix) Aniline can be converted to benzyl alcohol through diazotisation followed by replacement with hydroxyl.",
    "explanation": "These transformations require multi-step sequences involving reduction, oxidation, nucleophilic substitution, and electrophilic aromatic substitution. Each conversion uses standard organic transformations discussed in the chapter, and a clear understanding of reaction conditions is required.",
    "topic": "Synthetic Conversions Involving Amines",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex008"
  },
  {
    "question_text": "Give the structures of A, B and C in the following reactions:\n(i) CH₃CH₂I → (NaCN) → A → (OH⁻ / Partial hydrolysis) → B → (NaOH + Br₂) → C\n(ii) C₆H₅N₂Cl⁻ → (CuCN) → A → (H₂O/H⁺) → B → (NH₃, Δ) → C\n(iii) CH₃CH₂Br → (KCN) → A → (LiAlH₄) → B → (HNO₂, 0°C) → C\n(iv) C₆H₅NO₂ → (Fe/HCl) → A → (NaNO₂ + HCl, 273K) → B → (H₂O/H⁺, Δ) → C\n(v) CH₃COOH → (NH₃, Δ) → A → (NaOBr) → B → (NaNO₂/HCl) → C\n(vi) C₆H₅NO₂ → (Fe/HCl) → A → (HNO₂, 273K) → B → (C₆H₅OH) → C.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A model answer would assign structures as follows: For (i), A is CH₃CH₂CN (ethyl cyanide), B is the corresponding imidate or partially hydrolyzed intermediate, and C is ethylamine after base treatment with Br₂; (ii) starting from benzenediazonium chloride, A is the cyanobenzene (via Sandmeyer reaction), B is the hydrolyzed product (benzoic acid or phenol depending on conditions), and C is the amine after treatment with ammonia; (iii) A is propionitrile from ethyl bromide, B is an intermediate reduced by LiAlH₄ to propylamine, and C is a product of a diazotisation reaction; (iv–vi) follow similar patterns where reduction of nitrobenzene forms aniline derivatives, which after diazotisation and subsequent reactions yield substituted aromatic compounds. (Note: The exact structures depend on reaction conditions and are determined by the sequence of nucleophilic substitutions, reductions, and diazotisation reactions.)",
    "explanation": "Each sequence involves multiple reaction steps such as nucleophilic substitution, reduction with LiAlH₄, and reactions involving nitrous acid. Structural determination requires understanding the transformation at each step, for example, conversion of an alkyl halide to a nitrile and then to an amine, or the Sandmeyer reaction from a diazonium salt.",
    "topic": "Reaction Mechanisms Involving Amines",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex009"
  },
  {
    "question_text": "An aromatic compound ‘A’ on treatment with aqueous ammonia and heating forms compound ‘B’ which on heating with Br₂ and KOH forms a compound ‘C’ of molecular formula C₆H₇N. Write the structures and IUPAC names of compounds A, B and C.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A plausible answer is: A is benzoyl chloride (C₆H₅COCl), which on treatment with aqueous ammonia yields benzamide (C₆H₅CONH₂) as compound B; subsequent Hofmann bromamide degradation (using Br₂ and KOH) converts benzamide into aniline (C₆H₅NH₂), which has the molecular formula C₆H₇N, as compound C.",
    "explanation": "Benzoyl chloride reacts with ammonia to form benzamide. In the Hofmann degradation, an amide loses a carbon (as carbon dioxide equivalent) and is converted to the corresponding amine. Here, benzamide (a seven-carbon compound) yields aniline (a six-carbon aromatic amine), consistent with the given formula.",
    "topic": "Synthetic Methods and Reaction Mechanisms (Hofmann Degradation)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex010"
  },
  {
    "question_text": "Complete the following reactions:\n(i) C₆H₅NH₂ + CHCl₃ + alc. KOH → ?\n(ii) C₆H₅N₂Cl + H₃PO₂ + H₂O → ?\n(iii) C₆H₅NH₂ + conc. H₂SO₄ → ?\n(iv) C₆H₅N₂Cl + C₂H₅OH → ?\n(v) C₆H₅NH₂ + Br₂ (aq) → ?\n(vi) C₆H₅NH₂ + (CH₃CO)₂O → ?\n(vii) C₆H₅N₂Cl⁻ --[(i) HBF₄ / (ii) NaNO₂/Cu, Δ]→ ?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Formation of phenyl isocyanide (C₆H₅NC) via the carbylamine reaction; (ii) Reduction of the diazonium salt to benzene; (iii) Formation of anilinium bisulfate salt; (iv) Reaction of the diazonium salt with ethanol to yield ethoxybenzene; (v) Formation of 2,4,6-tribromoaniline upon bromination; (vi) Formation of acetanilide; (vii) Depending on the conditions, replacement of the diazo group yields either aryl fluoride (via HBF₄) or a cyanobenzene derivative (via NaNO₂/Cu).",
    "explanation": "Each reaction is a classical transformation of an aromatic amine or its diazonium derivative. The carbylamine reaction (i) produces an isocyanide, reduction of diazonium salts (ii) yields benzene, and electrophilic substitution reactions (v) and acylation (vi) lead to characteristic products. In (vii) the choice of reagent determines the substituent introduced.",
    "topic": "Chemical Reactions of Amines",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex011"
  },
  {
    "question_text": "Why cannot aromatic primary amines be prepared by Gabriel phthalimide synthesis?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Aromatic primary amines cannot be prepared by Gabriel phthalimide synthesis because aryl halides (the starting materials for introducing the aromatic moiety) do not undergo nucleophilic substitution with the phthalimide anion due to their low reactivity and the stabilization provided by the aromatic ring.",
    "explanation": "The Gabriel synthesis is effective for aliphatic amines because aliphatic halides are sufficiently reactive toward nucleophilic attack by the phthalimide ion. In the case of aryl halides, the partial double bond character of the carbon–halogen bond and resonance stabilization inhibit the substitution reaction.",
    "topic": "Gabriel Phthalimide Synthesis",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex012"
  },
  {
    "question_text": "Write the reactions of (i) aromatic and (ii) aliphatic primary amines with nitrous acid.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Aromatic primary amines: C₆H₅NH₂ + NaNO₂ + 2HCl (0–5°C) → C₆H₅N₂⁺Cl⁻ + NaCl + 2H₂O. (ii) Aliphatic primary amines: R–NH₂ + HNO₂ → unstable aliphatic diazonium salt which decomposes to ROH (alcohol) + N₂ + HCl.",
    "explanation": "Aromatic primary amines form stable diazonium salts at low temperatures which can be isolated and further reacted, while aliphatic diazonium salts are unstable and decompose, typically forming alcohols after hydrolysis.",
    "topic": "Reactions with Nitrous Acid",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex013"
  },
  {
    "question_text": "Give plausible explanations for each of the following:\n(i) Why are amines less acidic than alcohols of comparable molecular masses?\n(ii) Why do primary amines have higher boiling points than tertiary amines?\n(iii) Why are aliphatic amines stronger bases than aromatic amines?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(i) Amines are less acidic than alcohols because the N–H bond is less polarized than the O–H bond due to the lower electronegativity of nitrogen compared to oxygen. (ii) Primary amines have higher boiling points because they can form more intermolecular hydrogen bonds (with two available N–H groups) than tertiary amines, which lack N–H bonds. (iii) Aliphatic amines are stronger bases than aromatic amines because in aromatic amines the lone pair on nitrogen is delocalized into the aromatic ring, making it less available for protonation.",
    "explanation": "The acidity and boiling point differences arise from the nature of the X–H bond (O–H vs. N–H) and the extent of intermolecular hydrogen bonding. In aromatic amines, resonance stabilization reduces the availability of the lone pair, thus decreasing basicity compared to aliphatic amines.",
    "topic": "Physical and Chemical Properties of Amines",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lech204",
    "question_id": "cbse_xii_lech2dd_c204_ex014"
  }
]