[
  {
    "question_text": "What are monosaccharides?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Monosaccharides are simple carbohydrates that cannot be hydrolyzed into simpler sugars. They are optically active polyhydroxy aldehydes or ketones.",
    "explanation": "Monosaccharides, such as glucose, fructose, and ribose, are the simplest form of carbohydrates with the general formula Cx(H2O)y. They cannot be broken down further by hydrolysis and are the building blocks for more complex carbohydrates.",
    "topic": "Carbohydrates - Monosaccharides",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex001"
  },
  {
    "question_text": "What are reducing sugars?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Reducing sugars are carbohydrates that have a free aldehyde (or in some cases ketone) group capable of reducing Fehling’s solution or Tollens’ reagent.",
    "explanation": "These sugars, typically all monosaccharides and some disaccharides (like maltose and lactose), can reduce specific chemical reagents due to the presence of an unbound carbonyl group. This reactivity is used to identify them in tests.",
    "topic": "Carbohydrates - Reducing Sugars",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex002"
  },
  {
    "question_text": "Write two main functions of carbohydrates in plants.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Carbohydrates in plants serve mainly as food storage (e.g., starch) and as structural components (e.g., cellulose).",
    "explanation": "Starch is a storage form of carbohydrate that provides energy, while cellulose forms the plant cell wall, giving the plant rigidity and structure.",
    "topic": "Carbohydrates - Functions",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex003"
  },
  {
    "question_text": "Classify the following into monosaccharides and disaccharides. Ribose, 2-deoxyribose, maltose, galactose, fructose and lactose.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Monosaccharides: Ribose, 2-deoxyribose, galactose, and fructose. Disaccharides: Maltose and lactose.",
    "explanation": "Ribose, 2-deoxyribose, galactose, and fructose are monosaccharides because they are single sugar units. Maltose and lactose consist of two monosaccharide units linked by glycosidic bonds, making them disaccharides.",
    "topic": "Carbohydrates - Classification",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex004"
  },
  {
    "question_text": "What do you understand by the term glycosidic linkage?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A glycosidic linkage is a covalent bond formed between two monosaccharide units through the elimination of a water molecule.",
    "explanation": "This type of bond, also known as an oxide linkage, connects the anomeric carbon of one sugar to a hydroxyl group of another, enabling the formation of disaccharides and polysaccharides.",
    "topic": "Carbohydrates - Disaccharides and Polysaccharides",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex005"
  },
  {
    "question_text": "What is glycogen? How is it different from starch?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Glycogen is a highly branched storage polysaccharide found in animals, whereas starch is the primary storage polysaccharide in plants. Glycogen has more frequent branch points (α-1,6 glycosidic bonds) compared to starch, which is composed of two components: amylose (a linear polymer with α-1,4 linkages) and amylopectin (a branched polymer with both α-1,4 and less frequent α-1,6 linkages).",
    "explanation": "Glycogen's structure, with its extensive branching, allows for rapid mobilization of glucose when needed by the body. Starch, being the plant storage form, exists as amylose and amylopectin, with amylopectin having fewer branch points than glycogen, which affects its solubility and rate of enzymatic breakdown.",
    "topic": "Carbohydrates - Polysaccharides",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex006"
  },
  {
    "question_text": "What are the hydrolysis products of (i) sucrose and (ii) lactose?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "For sucrose: Hydrolysis yields one molecule of D-(+)-glucose and one molecule of D-(–)-fructose. For lactose: Hydrolysis yields one molecule of D-(+)-glucose and one molecule of β-D-galactose.",
    "explanation": "Sucrose is a non-reducing disaccharide where the glycosidic bond involves the anomeric carbons of both glucose and fructose, whereas lactose, a reducing disaccharide, hydrolyzes into glucose and galactose.",
    "topic": "Carbohydrates - Disaccharides",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex007"
  },
  {
    "question_text": "What is the basic structural difference between starch and cellulose?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Starch is composed of α-D-glucose units, with amylose being linear and amylopectin branched, while cellulose is made of β-D-glucose units linked by β-1,4 glycosidic bonds, resulting in a linear, fibrous structure.",
    "explanation": "The difference in the configuration of the glycosidic bond and the form of glucose (alpha in starch, beta in cellulose) leads to differences in solubility and digestibility. Starch is readily digestible, whereas cellulose provides structural support in plants and is not digestible by humans.",
    "topic": "Carbohydrates - Polysaccharides",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex008"
  },
  {
    "question_text": "What happens when D-glucose is treated with the following reagents? (i) HI (ii) Bromine water (iii) HNO₃",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When D-glucose is treated with HI, it is reduced to n-hexane. Treatment with bromine water leads to oxidation forming gluconic acid, and on oxidation with HNO₃, D-glucose is converted into saccharic acid.",
    "explanation": "HI causes the reduction of glucose, demonstrating that all six carbons are in a straight chain. Bromine water oxidizes the aldehyde group to a carboxylic acid (gluconic acid), and further oxidation by HNO₃ produces a dicarboxylic acid (saccharic acid), indicating the presence of both primary and aldehyde groups.",
    "topic": "Carbohydrates - Reactions of Glucose",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex009"
  },
  {
    "question_text": "Enumerate the reactions of D-glucose which cannot be explained by its open chain structure.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The reactions that cannot be explained by the open chain structure of D-glucose include: (i) its failure to give a positive Schiff's test despite having an aldehyde group; (ii) its inability to form a hydrogensulphite addition product with NaHSO₃; (iii) the formation of glucose pentaacetate indicating that all hydroxyl groups are in different positions; and (iv) the existence of two distinct crystalline forms (α and β anomers) which suggest a cyclic hemiacetal formation.",
    "explanation": "The open chain form of glucose does not account for the fact that glucose does not show expected reactivity for free carbonyl groups. These observations led to the proposal of a cyclic structure, where an intramolecular reaction forms a hemiacetal, explaining the unique properties and the formation of two anomeric forms.",
    "topic": "Carbohydrates - Cyclic Structures",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex010"
  },
  {
    "question_text": "What are essential and non-essential amino acids? Give two examples of each type.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Essential amino acids cannot be synthesized by the body and must be obtained from the diet (e.g., leucine and lysine). Non-essential amino acids can be synthesized by the body (e.g., glycine and alanine).",
    "explanation": "Amino acids are classified based on whether the body can produce them. Essential amino acids are vital for protein synthesis and other functions, whereas non-essential amino acids are produced endogenously.",
    "topic": "Proteins - Amino Acids",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex011"
  },
  {
    "question_text": "Define the following as related to proteins (i) Peptide linkage (ii) Primary structure (iii) Denaturation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) A peptide linkage is a covalent bond between the carboxyl group of one amino acid and the amino group of another, formed by elimination of water. (ii) The primary structure of a protein is its unique sequence of amino acids. (iii) Denaturation is the process in which a protein loses its secondary and tertiary structure without breaking its primary structure, leading to loss of biological activity.",
    "explanation": "These fundamental definitions explain how proteins are structured and how certain conditions can disrupt the non-covalent interactions, leading to loss of function while the peptide bonds remain intact.",
    "topic": "Proteins - Structure and Denaturation",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex012"
  },
  {
    "question_text": "What are the common types of secondary structure of proteins?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The common types of secondary structure of proteins are the α-helix and β-pleated sheet structures.",
    "explanation": "These structures are formed by hydrogen bonding between the backbone amide and carbonyl groups of amino acids. The α-helix is a right-handed coil, while the β-pleated sheet consists of stretched out strands aligned side by side.",
    "topic": "Proteins - Secondary Structure",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex013"
  },
  {
    "question_text": "What type of bonding helps in stabilising the α-helix structure of proteins?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Hydrogen bonds help stabilise the α-helix structure of proteins.",
    "explanation": "In the α-helix, hydrogen bonds form between the –NH group of one amino acid and the >C=O group of an amino acid four residues earlier, providing stability to the helical structure.",
    "topic": "Proteins - Secondary Structure",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex014"
  },
  {
    "question_text": "Differentiate between globular and fibrous proteins.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Globular proteins are compact, roughly spherical, and usually water-soluble, performing various functions such as catalysis and regulation. Fibrous proteins are elongated, insoluble, and primarily serve structural functions.",
    "explanation": "The solubility and structural differences arise due to differences in folding. Globular proteins have a defined three-dimensional structure that supports dynamic functions, whereas fibrous proteins have extended structures ideal for providing strength and support.",
    "topic": "Proteins - Classification",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex015"
  },
  {
    "question_text": "How do you explain the amphoteric behaviour of amino acids?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Amino acids exhibit amphoteric behaviour because they contain both an acidic carboxyl group (–COOH) and a basic amino group (–NH₂), allowing them to act as either acids or bases.",
    "explanation": "At physiological pH, most amino acids exist as zwitterions, having a positively charged ammonium group (–NH₃⁺) and a negatively charged carboxylate group (–COO⁻), which enables them to react with both acids and bases.",
    "topic": "Proteins - Amino Acids",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex016"
  },
  {
    "question_text": "What are enzymes?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Enzymes are biological catalysts, most of which are globular proteins, that accelerate chemical reactions in living organisms without being consumed in the process.",
    "explanation": "They work by lowering the activation energy of reactions and are highly specific to their substrates, ensuring that biological processes occur efficiently under mild conditions.",
    "topic": "Enzymes",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex017"
  },
  {
    "question_text": "What is the effect of denaturation on the structure of proteins?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Denaturation causes the loss of a protein's secondary and tertiary structures while leaving its primary structure intact, leading to loss of biological activity.",
    "explanation": "Changes in conditions such as temperature or pH disrupt hydrogen bonds, disulphide linkages, and other interactions that maintain the protein's three-dimensional shape, thereby rendering the protein non-functional.",
    "topic": "Proteins - Denaturation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex018"
  },
  {
    "question_text": "How are vitamins classified? Name the vitamin responsible for the coagulation of blood.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Vitamins are classified into fat-soluble (A, D, E, and K) and water-soluble (B group vitamins and vitamin C). Vitamin K is responsible for blood coagulation.",
    "explanation": "Fat-soluble vitamins are stored in the liver and adipose tissues, while water-soluble vitamins need to be regularly supplied as they are excreted in urine. Vitamin K plays a crucial role in blood clotting by aiding in the synthesis of clotting factors.",
    "topic": "Vitamins",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex019"
  },
  {
    "question_text": "Why are vitamin A and vitamin C essential to us? Give their important sources.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Vitamin A is essential for vision, epithelial integrity, and immune function, and is commonly sourced from fish liver oil, carrots, butter, and milk. Vitamin C is required for collagen synthesis and as an antioxidant, and is abundantly found in citrus fruits, amla, and green leafy vegetables.",
    "explanation": "Both vitamins play crucial roles in maintaining health. The dietary sources mentioned provide sufficient amounts to prevent deficiencies such as night blindness (vitamin A deficiency) and scurvy (vitamin C deficiency).",
    "topic": "Vitamins",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex020"
  },
  {
    "question_text": "What are nucleic acids? Mention their two important functions.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Nucleic acids are long chain polymers of nucleotides that store and transmit genetic information and play a central role in protein synthesis.",
    "explanation": "DNA serves as the genetic blueprint for living organisms and is involved in heredity, while RNA participates in translating the genetic code into proteins through various types of RNA molecules.",
    "topic": "Nucleic Acids",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex021"
  },
  {
    "question_text": "What is the difference between a nucleoside and a nucleotide?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A nucleoside is composed of a nitrogenous base linked to a pentose sugar, whereas a nucleotide consists of a nucleoside with one or more phosphate groups attached.",
    "explanation": "The attachment of phosphate groups to a nucleoside forms a nucleotide, which is the basic building block of nucleic acids involved in energy transfer and genetic storage.",
    "topic": "Nucleic Acids - Structure",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex022"
  },
  {
    "question_text": "The two strands in DNA are not identical but are complementary. Explain.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The two strands of DNA are complementary because each base on one strand pairs specifically with a complementary base on the other strand (adenine with thymine and cytosine with guanine), ensuring that the sequence of one strand determines the sequence of the other.",
    "explanation": "Complementary base pairing allows for the accurate replication and repair of DNA. Although the strands have different sequences, their bases are matched in such a way that the overall structure of the double helix is maintained.",
    "topic": "Nucleic Acids - DNA Structure",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex023"
  },
  {
    "question_text": "Write the important structural and functional differences between DNA and RNA.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Structurally, DNA contains deoxyribose sugar and thymine, and is usually double-stranded, forming a double helix; RNA contains ribose sugar and uracil, and is typically single-stranded. Functionally, DNA stores genetic information, whereas RNA is involved in protein synthesis and gene expression.",
    "explanation": "The chemical differences between the sugars and the nitrogenous bases lead to distinct structures. DNA's stability makes it suitable for long-term storage of genetic information, while RNA's structure allows it to act as a messenger, catalyst, and adapter during protein synthesis.",
    "topic": "Nucleic Acids - Differences between DNA and RNA",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex024"
  },
  {
    "question_text": "What are the different types of RNA found in the cell?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The different types of RNA found in the cell include messenger RNA (mRNA), ribosomal RNA (rRNA), and transfer RNA (tRNA).",
    "explanation": "mRNA carries the genetic message from DNA to the ribosomes, rRNA forms the core of ribosome’s structure and catalyzes protein synthesis, and tRNA brings amino acids to the ribosome during translation.",
    "topic": "Nucleic Acids - RNA",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lech205",
    "question_id": "cbse_xii_lech2dd_c205_ex025"
  },
  {
    "question_text": "Which of the following statements best defines carbohydrates as described in the text?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Compounds with the formula Cₓ(H₂O)ᵧ that are always simple hydrates of carbon",
      "Optically active polyhydroxy aldehydes or ketones or compounds that yield such units on hydrolysis",
      "Organic compounds containing only carbon and water",
      "Simple sugars exclusively having the molecular formula C₆H₁₂O₆"
    ],
    "correct_answer": "Optically active polyhydroxy aldehydes or ketones or compounds that yield such units on hydrolysis",
    "explanation": "Carbohydrates are chemically defined as optically active polyhydroxy aldehydes or ketones or compounds that produce these units on hydrolysis, which distinguishes them from mere hydrates of carbon.",
    "topic": "Carbohydrates",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen001"
  },
  {
    "question_text": "Which of the following disaccharides is classified as a non-reducing sugar?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Maltose",
      "Lactose",
      "Sucrose",
      "Invert sugar"
    ],
    "correct_answer": "Sucrose",
    "explanation": "Sucrose is a non-reducing sugar because its glycosidic bond is formed between the anomeric carbons of glucose and fructose, leaving no free carbonyl group to reduce Fehling’s solution or Tollens’ reagent.",
    "topic": "Disaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen002"
  },
  {
    "question_text": "In glucose, the formation of a hemiacetal that results in a cyclic structure involves the formation of which of the following structures?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Furanose structure",
      "Pyranose structure",
      "Disaccharide bond",
      "Amylose chain formation"
    ],
    "correct_answer": "Pyranose structure",
    "explanation": "Glucose forms a six-membered cyclic hemiacetal structure known as the pyranose form, which results from the intramolecular attack of the C5–OH group on the aldehyde group at C1.",
    "topic": "Glucose Structure",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen003"
  },
  {
    "question_text": "Which acid is used for the commercial preparation of glucose from starch as mentioned in the section?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Concentrated HCl",
      "Dilute H₂SO₄",
      "Dilute HNO₃",
      "Concentrated H₂SO₄"
    ],
    "correct_answer": "Dilute H₂SO₄",
    "explanation": "Commercial production of glucose from starch involves hydrolysis with dilute H₂SO₄ under specific temperature and pressure conditions.",
    "topic": "Preparation of Glucose",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen004"
  },
  {
    "question_text": "The D and L notation in carbohydrate chemistry is determined by comparing the configuration of the sugar with which of the following compounds?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "D-Glucose",
      "Lactic acid",
      "Glyceraldehyde",
      "Fructose"
    ],
    "correct_answer": "Glyceraldehyde",
    "explanation": "The D and L configuration in carbohydrates is assigned by comparing the configuration of the lowest chiral center with that of glyceraldehyde, whose D-isomer (with OH on the right) serves as the reference.",
    "topic": "Stereochemistry of Carbohydrates",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen005"
  },
  {
    "question_text": "Explain the difference between monosaccharides and oligosaccharides in terms of their behavior on hydrolysis.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Monosaccharides are single sugar units that cannot be hydrolyzed further into simpler sugars, whereas oligosaccharides yield two to ten monosaccharide units upon hydrolysis.",
    "explanation": "Monosaccharides are the basic building blocks of carbohydrates and do not break down further by hydrolysis, while oligosaccharides undergo hydrolysis to produce a small number (between two and ten) of monosaccharide units.",
    "topic": "Classification of Carbohydrates",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen006"
  },
  {
    "question_text": "Describe the structural difference between α-D-(+)-glucose and β-D-(+)-glucose.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The difference lies in the configuration at the anomeric carbon (C1). In α-D-(+)-glucose, the OH group at C1 is positioned opposite to the CH₂OH group (trans configuration) in the cyclic form, while in β-D-(+)-glucose, the OH group at C1 is on the same side (cis configuration) as the CH₂OH group.",
    "explanation": "The key distinction between the α and β forms of glucose is the spatial orientation of the OH group at the anomeric carbon, which is a result of the intramolecular cyclization and results in different physical and chemical properties.",
    "topic": "Cyclic Structure of Glucose",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen007"
  },
  {
    "question_text": "What is the significance of the glycosidic linkage in disaccharides?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The glycosidic linkage is the bond formed between monosaccharide units via a dehydration reaction, and it determines whether the disaccharide is reducing or non-reducing based on the involvement of the anomeric carbons.",
    "explanation": "The formation of the glycosidic bond results in the linking of monosaccharides by the elimination of a water molecule. If the bond involves the free aldehyde or ketonic group, the sugar can reduce oxidizing agents; if not, it remains non-reducing, as seen with sucrose.",
    "topic": "Disaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen008"
  },
  {
    "question_text": "Why is sucrose considered a non-reducing sugar?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Sucrose is considered a non-reducing sugar because its glycosidic linkage is formed between the anomeric carbons of glucose and fructose, which involves the functional groups normally responsible for reducing properties. As a result, no free aldehyde or ketone group is available.",
    "explanation": "The involvement of the anomeric carbons in the glycosidic bond in sucrose prevents the formation of a free carbonyl group. Without this free group, sucrose cannot participate in the redox reactions that characterize reducing sugars.",
    "topic": "Disaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen009"
  },
  {
    "question_text": "Discuss the importance of carbohydrate structure in determining its reactivity and biological functions. In your answer, provide examples from the text to illustrate the roles of cyclic forms, glycosidic linkages, and stereochemistry.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The structure of carbohydrates, including their cyclic forms and specific glycosidic linkages, critically influences their reactivity and function. For example, the formation of cyclic hemiacetals in glucose (pyranose form) not only prevents the free aldehyde group from reacting in tests like Schiff's test but also determines the existence of anomers (α and β forms) with varying properties. Additionally, the type of glycosidic linkage in disaccharides such as sucrose versus maltose or lactose determines whether a sugar is reducing or non-reducing, which affects their chemical behavior and roles in metabolism. Stereochemistry, as exemplified by the D and L configuration determined by comparing with glyceraldehyde, further influences the interaction of carbohydrates with enzymes and other biomolecules.",
    "explanation": "This answer articulates the connection between carbohydrate structural features and their chemical behavior. It covers how cyclic structures, through hemiacetal formation, modify the reactivity of the -CHO group, how glycosidic linkages influence reducing properties, and how stereochemistry is essential for molecular recognition in biological systems.",
    "topic": "Importance and Structure of Carbohydrates",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen010"
  },
  {
    "question_text": "Compare and contrast the methods of preparing glucose from sucrose and starch. Describe the reaction conditions used and discuss the industrial significance of these methods.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Glucose can be prepared from sucrose by hydrolysis in an alcoholic solution using dilute acids like HCl or H₂SO₄, which results in an equimolar mixture of glucose and fructose. On the other hand, the extraction of glucose from starch involves hydrolysis using dilute H₂SO₄ at 393 K under pressure. The method using starch is particularly important in industrial settings due to the abundance and low cost of starch. The reaction conditions in both methods are designed to maximize yield and minimize by-products, with control over temperature, pressure, and acid concentration being crucial.",
    "explanation": "This answer compares the two major methods of glucose production by discussing the reaction medium, temperature, and pressure conditions. It emphasizes the industrial relevance of using starch as a starting material due to its availability and cost effectiveness, and explains the equimolar production of glucose and fructose from sucrose hydrolysis.",
    "topic": "Preparation of Glucose",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen011"
  },
  {
    "question_text": "Explain in detail the stereochemistry involved in assigning D and L configurations to monosaccharides. Use glyceraldehyde and glucose as examples in your explanation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The D and L configuration in monosaccharides is determined by comparing the configuration at the lowest chiral center of the sugar with that of D-(+)-glyceraldehyde. In glyceraldehyde, which has only one chiral center, the OH group in the D isomer is on the right side. For sugars like glucose, only the configuration at the lowest asymmetric carbon is considered. In D-(+)-glucose, the OH at the lowest chiral center is also on the right, which aligns with the D configuration. Thus, this method of comparison defines the stereochemistry of a wide variety of carbohydrates without referring to their optical rotation directly.",
    "explanation": "This answer explains that the D and L notation does not directly indicate optical activity but rather a comparative configuration with glyceraldehyde. It details how the spatial arrangement of the hydroxyl group at the lowest chiral center in glucose is compared to that in glyceraldehyde, and shows the importance of this method in carbohydrate stereochemistry.",
    "topic": "Stereochemistry of Carbohydrates",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen012"
  },
  {
    "question_text": "True or False: All monosaccharides, irrespective of being aldoses or ketoses, are reducing sugars.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Monosaccharides, whether they are aldoses or ketoses, possess a free carbonyl group that can reduce reagents like Fehling’s solution and Tollens’ reagent, classifying them as reducing sugars.",
    "topic": "Monosaccharides",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen013"
  },
  {
    "question_text": "True or False: Fructose is a dextrorotatory compound.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Although fructose and glucose share the same molecular formula, fructose is a laevorotatory compound (rotates plane-polarized light to the left), in contrast to the dextrorotatory nature of D-(+)-glucose.",
    "topic": "Monosaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen014"
  },
  {
    "question_text": "True or False: The cyclic hemiacetal formation in glucose involves the nucleophilic attack of the OH group at C4 on the aldehyde group at C1.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "In glucose, the cyclic hemiacetal formation occurs when the OH group at C5 attacks the aldehyde group at C1, not the OH at C4.",
    "topic": "Cyclic Structure of Glucose",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen015"
  },
  {
    "question_text": "A sample of pure starch is completely hydrolyzed to yield glucose. If you start with 342 g of starch (considered as a polymer of glucose units with the repeating unit C₆H₁₀O₅) and the molar mass of glucose (C₆H₁₂O₆) is 180 g/mol, calculate the number of moles of glucose produced assuming complete conversion.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 1.90 moles of glucose are produced.",
    "explanation": "Assuming that starch is composed entirely of glucose units, the hydrolysis reaction is: (C₆H₁₀O₅)ₙ + nH₂O → n C₆H₁₂O₆. The moles of glucose = mass / molar mass = 342 g / 180 g/mol ≈ 1.90 moles.",
    "topic": "Preparation of Glucose",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen016"
  },
  {
    "question_text": "In the hydrolysis of sucrose, one mole of sucrose (342 g) yields one mole of D-(+)-glucose and one mole of D-(–)-fructose. If you hydrolyze 342 g of sucrose, what is the total mass of invert sugar (the mixture of glucose and fructose) produced?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "360 g of invert sugar is produced.",
    "explanation": "One mole of sucrose (342 g) yields 1 mole of glucose (180 g) and 1 mole of fructose (180 g), giving a total = 180 g + 180 g = 360 g. Therefore, hydrolyzing 342 g of sucrose produces 360 g of invert sugar.",
    "topic": "Disaccharides",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen017"
  },
  {
    "question_text": "If 10.0 g of maltose (molar mass = 342 g/mol) is completely hydrolyzed to yield glucose, calculate the amount of glucose produced in grams and in moles. (Molar mass of glucose = 180 g/mol)",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 10.53 g of glucose, which is about 0.0585 moles.",
    "explanation": "First, calculate the moles of maltose: 10.0 g / 342 g/mol ≈ 0.02924 moles. Each mole of maltose yields 2 moles of glucose, so moles of glucose = 2 × 0.02924 ≈ 0.05848 moles. Mass of glucose = 0.05848 moles × 180 g/mol ≈ 10.53 g.",
    "topic": "Disaccharides",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen018"
  },
  {
    "question_text": "One mole of sucrose (342 g) undergoes hydrolysis with a 95% yield. Calculate the masses of D-(+)-glucose and D-(–)-fructose produced in this reaction.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 171 g of D-(+)-glucose and 171 g of D-(–)-fructose are produced.",
    "explanation": "Under complete hydrolysis, 1 mole of sucrose produces 1 mole of glucose (180 g) and 1 mole of fructose (180 g). With a 95% yield, the actual moles produced = 0.95 moles each. The mass of each sugar is 0.95 × 180 g/mol = 171 g. Thus, 171 g of glucose and 171 g of fructose are formed.",
    "topic": "Disaccharides",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "03_section_10_1",
    "question_id": "cbse_xii_lech2dd_c205_gen019"
  },
  {
    "question_text": "Which class of biological molecules primarily acts as biocatalysts in living organisms?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Carbohydrates",
      "Lipids",
      "Proteins",
      "Nucleic acids"
    ],
    "correct_answer": "Proteins",
    "explanation": "Enzymes, which are the biocatalysts in living organisms, are almost all globular proteins. They help in reducing activation energy and control biochemical reactions under mild conditions.",
    "topic": "Enzymes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen039"
  },
  {
    "question_text": "What is the common suffix used in the naming of enzymes?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "-ine",
      "-ate",
      "-ase",
      "-ol"
    ],
    "correct_answer": "-ase",
    "explanation": "Enzymes are generally named with the suffix '-ase'. For example, the enzyme that catalyzes the hydrolysis of maltose is called maltase.",
    "topic": "Enzymes Naming",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen040"
  },
  {
    "question_text": "Enzymes function by reducing which aspect of chemical reactions?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The temperature of the reaction",
      "The reaction time directly",
      "The magnitude of activation energy",
      "The reaction volume"
    ],
    "correct_answer": "The magnitude of activation energy",
    "explanation": "Enzymes lower the activation energy needed for reactions, which in turn increases the rate of reaction without altering the reactants and products.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen041"
  },
  {
    "question_text": "Which enzyme catalyzes the reaction: Maltose → 2 Glucose?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Maltose",
      "Maltase",
      "Sucrase",
      "Oxidoreductase"
    ],
    "correct_answer": "Maltase",
    "explanation": "Maltase is the enzyme that catalyzes the hydrolysis of maltose (C₁₂H₂₂O₁₁) into two molecules of glucose (C₆H₁₂O₆).",
    "topic": "Enzyme Specificity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen042"
  },
  {
    "question_text": "Enzymes that catalyze oxidation-reduction reactions are known as:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Hydrolases",
      "Ligases",
      "Oxidoreductases",
      "Isomerases"
    ],
    "correct_answer": "Oxidoreductases",
    "explanation": "Enzymes that catalyze oxidation-reduction reactions, where one substrate is oxidized while another is reduced, are named oxidoreductases, indicating their specific function.",
    "topic": "Enzymes Naming",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen043"
  },
  {
    "question_text": "Define a biocatalyst and provide an example based on the section content.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A biocatalyst is a biological molecule that speeds up chemical reactions in living organisms by lowering the activation energy; an example is the enzyme maltase.",
    "explanation": "Biocatalysts such as enzymes facilitate chemical reactions in living organisms under mild conditions. An example from the text is maltase, which catalyzes the conversion of maltose into glucose.",
    "topic": "Enzymes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen044"
  },
  {
    "question_text": "Explain the role of enzymes in biochemical reactions within the body.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Enzymes lower the activation energy required for biochemical reactions, allowing them to proceed rapidly and efficiently under physiological conditions.",
    "explanation": "Enzymes are crucial because they reduce activation energy which makes reactions occur faster, even under the mild conditions present in the body.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen045"
  },
  {
    "question_text": "List the two primary ways in which enzymes are named, as described in the section.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Enzymes are commonly named either after the substrate or compound they act upon (e.g., maltase for maltose) or after the type of reaction they catalyze (e.g., oxidoreductase for redox reactions).",
    "explanation": "The text explains that enzymes may be named after the substrate (such as maltase) or based on the type of chemical reaction they facilitate (such as oxidoreductase).",
    "topic": "Enzymes Naming",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen046"
  },
  {
    "question_text": "Briefly explain why only small quantities of enzymes are required to catalyze reactions in the body.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Enzymes are catalysts that are not consumed in the reaction; therefore, even a small amount can repeatedly catalyze many substrate molecules by lowering the activation energy.",
    "explanation": "Because enzymes are not used up during the reaction and function by lowering the activation energy, a little enzyme can interact with many substrate molecules, making them highly efficient.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen047"
  },
  {
    "question_text": "Discuss the mechanism by which enzymes lower the activation energy of reactions. Illustrate your answer with the example of sucrase-catalyzed hydrolysis of sucrose.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Enzymes lower the activation energy of a reaction by providing an alternative reaction pathway with a lower energy barrier. For example, in the case of sucrase-catalyzed hydrolysis of sucrose, the enzyme reduces the activation energy from 6.22 kJ/mol (in acid hydrolysis) to 2.15 kJ/mol. This reduction accelerates the reaction rate, allowing the reaction to proceed efficiently under the mild conditions present in living cells.",
    "explanation": "The enzyme works by binding to the substrate (sucrose) and stabilizing the transition state, making it easier for the reaction to occur. The lower activation energy implies that a greater proportion of molecules have sufficient energy to overcome the energy barrier, thereby speeding up the reaction rate significantly. This is a fundamental principle of enzyme catalysis.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen048"
  },
  {
    "question_text": "Evaluate the specificity of enzymes and discuss how this property is advantageous for biochemical processes in living organisms.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Enzymes exhibit high specificity due to their unique three-dimensional structures that form active sites complementary to specific substrates. This specificity ensures that enzymes catalyze only particular reactions, thereby reducing unwanted side reactions and increasing efficiency. For example, maltase specifically targets maltose to yield glucose and oxidoreductases catalyze specific redox reactions. Such specificity allows precise metabolic regulation and minimizes interference with other cellular processes.",
    "explanation": "The structure and function of enzymes are closely related; the selective binding to specific substrates facilitates controlled biochemical pathways, maintaining homeostasis in the organism. The high specificity prevents cross-reactivity, ensuring that metabolic processes occur in an orderly and efficient manner.",
    "topic": "Enzyme Specificity",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen049"
  },
  {
    "question_text": "True or False: Enzymes increase the activation energy required for biochemical reactions in living organisms.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Enzymes work by lowering the activation energy barrier, not increasing it, which enables biochemical reactions to proceed under mild conditions.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen050"
  },
  {
    "question_text": "True or False: All enzymes are named after the specific substrates they act upon.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While many enzymes are named after their substrates, some enzymes are named based on the type of reaction they catalyze, such as oxidoreductases, which reflects their catalytic function rather than the substrate name.",
    "topic": "Enzymes Naming",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen051"
  },
  {
    "question_text": "The activation energy for acid hydrolysis of sucrose is 6.22 kJ/mol. When sucrase catalyzes the hydrolysis, the activation energy drops to 2.15 kJ/mol. Calculate the percentage reduction in activation energy.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 65.5%",
    "explanation": "Percentage reduction is calculated as: ((6.22 - 2.15) / 6.22) × 100 ≈ (4.07 / 6.22) × 100 ≈ 65.5%. This demonstrates how effective enzymes are at lowering the energy barrier for reactions.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen052"
  },
  {
    "question_text": "In a reaction that normally takes 10 seconds to reach 50% completion without an enzyme, the presence of an enzyme reduces the completion time to 4 seconds. Estimate the factor by which the reaction rate has increased.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 2.5 times faster",
    "explanation": "The reaction rate increase factor is calculated by dividing the uncatalyzed time by the catalyzed time: 10 sec / 4 sec = 2.5. This means the reaction proceeds 2.5 times faster in the presence of the enzyme.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen053"
  },
  {
    "question_text": "A reaction proceeding without an enzyme has a rate of 0.002 mol/min. If a specific enzyme accelerates the reaction 1000 times, what is the new reaction rate?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "2.0 mol/min",
    "explanation": "The catalyzed reaction rate is obtained by multiplying the uncatalyzed rate by the factor of increase: 0.002 mol/min × 1000 = 2.0 mol/min.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen054"
  },
  {
    "question_text": "A particular enzyme decreases the activation energy of a reaction by 4.07 kJ/mol (from 6.22 kJ/mol to 2.15 kJ/mol). Given the Arrhenius equation k = A exp(-Ea/(RT)), with R = 8.314 J/mol·K and T = 298 K, estimate the factor by which the rate constant (k) increases due to enzymatic action.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 5.2 times increase",
    "explanation": "First, convert the energy reduction: 4.07 kJ/mol = 4070 J/mol. Using the Arrhenius relationship, the factor increase is exp(4070/(8.314×298)). Calculating the denominator: 8.314×298 ≈ 2477 J/mol, so exponent ≈ 4070/2477 ≈ 1.643. Hence, factor ≈ exp(1.643) ≈ 5.17, which is approximately a 5.2 times increase in the rate constant.",
    "topic": "Mechanism of Enzyme Action",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "07_section_10_3",
    "question_id": "cbse_xii_lech2dd_c205_gen055"
  },
  {
    "question_text": "Which of the following correctly identifies nucleic acids as long chain polymers?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Proteins",
      "B. Lipids",
      "C. Nucleotides",
      "D. Amino acids"
    ],
    "correct_answer": "C. Nucleotides",
    "explanation": "Nucleic acids are long chain polymers composed of nucleotides, and this property is why they are also called polynucleotides.",
    "topic": "Nucleic Acids",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen072"
  },
  {
    "question_text": "Which sugar is a component of DNA molecules?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. β-D-glucose",
      "B. α-D-ribose",
      "C. β-D-ribose",
      "D. β-D-2-deoxyribose"
    ],
    "correct_answer": "D. β-D-2-deoxyribose",
    "explanation": "DNA contains β-D-2-deoxyribose as its sugar moiety, whereas RNA contains β-D-ribose.",
    "topic": "Chemical Composition of Nucleic Acids",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen073"
  },
  {
    "question_text": "Which base pairing is complementary in the DNA double helix?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Adenine – Cytosine",
      "B. Adenine – Thymine and Cytosine – Guanine",
      "C. Guanine – Uracil",
      "D. Thymine – Cytosine"
    ],
    "correct_answer": "B. Adenine – Thymine and Cytosine – Guanine",
    "explanation": "In DNA, adenine always pairs with thymine through two hydrogen bonds and cytosine pairs with guanine via three hydrogen bonds, ensuring a complementary double helix structure.",
    "topic": "Structure of Nucleic Acids",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen074"
  },
  {
    "question_text": "Which of the following is not a type of RNA?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. m-RNA",
      "B. r-RNA",
      "C. t-RNA",
      "D. d-RNA"
    ],
    "correct_answer": "D. d-RNA",
    "explanation": "The three main types of RNA mentioned are messenger RNA (m-RNA), ribosomal RNA (r-RNA), and transfer RNA (t-RNA). There is no known RNA type called d-RNA.",
    "topic": "Structure of Nucleic Acids",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen075"
  },
  {
    "question_text": "What type of linkage joins nucleotides in a nucleic acid chain?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Peptide linkage",
      "B. Glycosidic linkage",
      "C. Phosphodiester linkage",
      "D. Ether linkage"
    ],
    "correct_answer": "C. Phosphodiester linkage",
    "explanation": "Nucleotides are linked by phosphodiester bonds that form between the 5' phosphate group of one nucleotide and the 3' hydroxyl group of the next.",
    "topic": "Structure of Nucleic Acids",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen076"
  },
  {
    "question_text": "Explain the difference between a nucleoside and a nucleotide.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A nucleoside consists of a nitrogenous base attached to a sugar, while a nucleotide is a nucleoside that has one or more phosphate groups attached (typically at the 5' carbon).",
    "explanation": "The key difference lies in the presence of a phosphate group. A nucleoside is simply a base attached to a pentose sugar. When a phosphate group is added to the 5' position of the sugar, the structure is called a nucleotide, which is the building block of nucleic acids.",
    "topic": "Structure of Nucleic Acids",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen077"
  },
  {
    "question_text": "What is the significance of DNA fingerprinting in modern science?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "DNA fingerprinting is used for identification in forensic science, paternity testing, identifying remains after accidents, and studying genetic relationships among racial groups.",
    "explanation": "DNA fingerprinting is based on the uniqueness of the DNA sequence for every individual. Unlike physical fingerprints, these sequences cannot be altered by external factors and are therefore reliable in criminal investigation, paternity disputes, and identification of individuals.",
    "topic": "DNA Fingerprinting",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen078"
  },
  {
    "question_text": "List the components obtained upon complete hydrolysis of DNA.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Upon complete hydrolysis, DNA yields a pentose sugar (β-D-2-deoxyribose), phosphoric acid, and nitrogenous bases.",
    "explanation": "Complete hydrolysis breaks the phosphodiester bonds, releasing the sugar, phosphate and the heterocyclic nitrogenous bases that make up the nucleotides.",
    "topic": "Chemical Composition of Nucleic Acids",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen079"
  },
  {
    "question_text": "Name the three types of RNA and describe one function for each.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The three types of RNA are: messenger RNA (m-RNA) which carries the genetic message from DNA, ribosomal RNA (r-RNA) which forms the core of ribosome's structure and catalyzes protein synthesis, and transfer RNA (t-RNA) which transports amino acids to the ribosome during protein synthesis.",
    "explanation": "Each type of RNA plays a distinct role in the cell. m-RNA acts as the messenger encoding protein structure, r-RNA is a functional component of ribosomes, and t-RNA serves as the adaptor molecule translating m-RNA code into a specific amino acid sequence.",
    "topic": "Structure and Functions of Nucleic Acids",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen080"
  },
  {
    "question_text": "Discuss the structure of the DNA double helix including the role of base pairing in maintaining its stability.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The DNA double helix is composed of two strands that wind around each other to form a helical structure. Each strand is made up of a sugar-phosphate backbone and nucleotide bases. The two strands are held together by hydrogen bonds between complementary bases: adenine pairs with thymine and cytosine pairs with guanine. This specific base pairing not only stabilizes the helical structure through hydrogen bonding but also ensures accurate replication during cell division as each strand serves as a template for the synthesis of a new complementary strand.",
    "explanation": "The double helix structure, discovered by Watson and Crick, showcases a stable structure due to the alternating sugar and phosphate groups forming the backbone while hydrogen bonds between A-T and C-G pairs maintain the integrity of the molecule. This complementary base pairing is essential to the faithful replication of DNA and the preservation of genetic information.",
    "topic": "Structure of Nucleic Acids",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen081"
  },
  {
    "question_text": "Describe in detail the roles of nucleic acids in protein synthesis and heredity.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Nucleic acids, particularly DNA, serve as the repository of genetic information, thus ensuring the continuity of hereditary traits through generations. DNA not only contains the instructions for the synthesis of all proteins but also replicates itself during cell division to provide identical copies to daughter cells. RNA plays a critical role in protein synthesis: m-RNA conveys the genetic message from DNA to the ribosomes, where r-RNA is involved in the assembly and catalysis of peptide bonds, while t-RNA transports amino acids to be added to the growing protein chain.",
    "explanation": "DNA’s ability to duplicate ensures genetic continuity, while RNA molecules are directly involved in translating the genetic code into proteins. This collaborative process underpins all biological functions, linking the inheritance of genetic traits with the cell's metabolic activities.",
    "topic": "Biological Functions of Nucleic Acids",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen082"
  },
  {
    "question_text": "True or False: In RNA, the base thymine is replaced by uracil.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "RNA does not contain thymine; instead, uracil is present as one of its four bases.",
    "topic": "Chemical Composition of Nucleic Acids",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen083"
  },
  {
    "question_text": "True or False: DNA fingerprinting can be altered by surgical interventions.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "DNA fingerprinting is based on the intrinsic sequence of nucleotides in DNA, which cannot be altered by surgery or other external modifications.",
    "topic": "DNA Fingerprinting",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen084"
  },
  {
    "question_text": "True or False: The sugar component in RNA is β-D-ribose.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "RNA contains β-D-ribose as its pentose sugar, differentiating it from DNA which contains β-D-2-deoxyribose.",
    "topic": "Chemical Composition of Nucleic Acids",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen085"
  },
  {
    "question_text": "A dinucleotide is formed by linking two nucleotides through a condensation reaction. If the average molecular mass of a nucleotide is approximately 330 g/mol, calculate the approximate molecular mass of a dinucleotide considering the loss of a water molecule (18 g/mol) during the formation of the phosphodiester bond.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "642 g/mol",
    "explanation": "Two nucleotides have a combined mass of 2 × 330 = 660 g/mol. During the formation of the phosphodiester bond, a water molecule (18 g/mol) is removed. Therefore, the mass of the dinucleotide is 660 - 18 = 642 g/mol.",
    "topic": "Structure of Nucleic Acids",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen086"
  },
  {
    "question_text": "A double-stranded DNA segment consists of 150 base pairs. Calculate the total number of nucleotides present in the segment.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "300 nucleotides",
    "explanation": "Each base pair consists of two nucleotides (one on each strand). Therefore, 150 base pairs correspond to 150 × 2 = 300 nucleotides.",
    "topic": "Structure of Nucleic Acids",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen087"
  },
  {
    "question_text": "In a hypothetical DNA molecule, assume each molecule consists of 100 nucleotides. When completely hydrolyzed, each nucleotide yields one pentose sugar. If you have 2 g of DNA with a molar mass of approximately 33,000 g/mol per molecule, calculate the number of moles of pentose sugars produced.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "0.00606 moles",
    "explanation": "First, calculate the moles of DNA: 2 g / 33,000 g/mol ≈ 6.06 × 10⁻⁵ moles. Each DNA molecule contains 100 nucleotides, so complete hydrolysis yields 100 sugar units per molecule. Therefore, the moles of sugar = 6.06 × 10⁻⁵ mol × 100 = 0.00606 moles.",
    "topic": "Chemical Composition of Nucleic Acids",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen088"
  },
  {
    "question_text": "Given that a typical phosphodiester bond forms between the 5' phosphate of one nucleotide and the 3' hydroxyl group of another, explain why this directional linkage is important for nucleic acid function.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The directional (5' to 3') linkage ensures that nucleic acids have consistent orientation, which is crucial for replication, transcription, and proper base pairing during DNA synthesis.",
    "explanation": "The consistent 5' to 3' orientation of nucleic acids allows enzymes like DNA polymerase and RNA polymerase to read and synthesize strands in a specific direction. This directionality is critical for processes like replication and transcription, ensuring that the genetic code is accurately read and duplicated.",
    "topic": "Structure of Nucleic Acids",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "09_section_10_5",
    "question_id": "cbse_xii_lech2dd_c205_gen089"
  },
  {
    "question_text": "What does the Greek word 'proteios' mean in the context of proteins?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Secondary importance",
      "B. Primary or of prime importance",
      "C. Abundant",
      "D. Basic component"
    ],
    "correct_answer": "B. Primary or of prime importance",
    "explanation": "The word protein is derived from the Greek word 'proteios', which means primary or of prime importance, emphasizing the fundamental role of proteins in living systems.",
    "topic": "Proteins – Introduction",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen020"
  },
  {
    "question_text": "Which of the following amino acids is considered essential as per the table provided in the section?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Glycine",
      "B. Alanine",
      "C. Valine",
      "D. Aspartic acid"
    ],
    "correct_answer": "C. Valine",
    "explanation": "In the provided table, essential amino acids are marked with an asterisk. Valine is marked as essential whereas Glycine and Alanine are not, and Aspartic acid is considered non-essential.",
    "topic": "Amino Acids – Classification",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen021"
  },
  {
    "question_text": "Which process results in the formation of a peptide bond between two α-amino acids?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Hydrolysis",
      "B. Condensation or dehydration reaction",
      "C. Oxidation",
      "D. Reduction"
    ],
    "correct_answer": "B. Condensation or dehydration reaction",
    "explanation": "Peptide bond formation occurs through a condensation reaction where a water molecule is eliminated when the amino group of one amino acid reacts with the carboxyl group of another.",
    "topic": "Proteins – Peptide Bond Formation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen022"
  },
  {
    "question_text": "Which of the following bonds does NOT significantly contribute to the stabilization of tertiary structure in proteins?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. Hydrogen bonds",
      "B. Disulphide linkages",
      "C. Ionic bonds",
      "D. Peptide bonds"
    ],
    "correct_answer": "D. Peptide bonds",
    "explanation": "While hydrogen bonds, disulphide linkages, van der Waals and electrostatic interactions contribute to tertiary structure, peptide bonds define the primary structure and are not involved in tertiary folding interactions.",
    "topic": "Structure of Proteins – Tertiary Structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen023"
  },
  {
    "question_text": "Which of the following factors is least likely to affect the folding of a protein into its native conformation?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. pH changes",
      "B. Temperature variations",
      "C. Formation of peptide bonds",
      "D. Ionic strength of the solution"
    ],
    "correct_answer": "C. Formation of peptide bonds",
    "explanation": "Protein folding is influenced by pH, temperature, and ionic strength which affect hydrogen bonding and other interactions. However, peptide bonds form the backbone of the protein and their formation is not involved in the folding process.",
    "topic": "Proteins – Denaturation and Folding",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen024"
  },
  {
    "question_text": "Define a zwitter ion and explain its formation in α-amino acids.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A zwitter ion is a neutral molecule that contains both positive and negative charges. In α-amino acids, it is formed when the carboxyl group (–COOH) loses a proton, becoming –COO⁻, while the amino group (–NH₂) gains a proton, becoming –NH₃⁺.",
    "explanation": "The presence of both an acidic carboxyl group and a basic amino group allows α-amino acids to form a zwitterionic structure in solution, which contributes to their amphoteric behavior.",
    "topic": "Amino Acids – Zwitter Ion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen025"
  },
  {
    "question_text": "Why are all naturally occurring α-amino acids (except glycine) optically active?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "All naturally occurring α-amino acids except glycine are optically active because the α-carbon atom in these amino acids is asymmetric, leading to the existence of enantiomers.",
    "explanation": "Glycine is the exception because its side chain is a hydrogen atom, making the α-carbon symmetric. The presence of an asymmetric carbon in other amino acids allows them to exist as optically active enantiomers, typically in the L-configuration in nature.",
    "topic": "Amino Acids – Optical Activity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen026"
  },
  {
    "question_text": "Classify amino acids as acidic, basic, or neutral based on the relative number of amino and carboxyl groups present in their molecules.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Amino acids are classified as follows: If an amino acid has an equal number of amino and carboxyl groups, it is neutral; if it has more amino groups than carboxyl groups, it is basic; and if it has more carboxyl groups than amino groups, it is acidic.",
    "explanation": "This classification is based on the nature of the groups present in the molecule, influencing its overall behavior in solution.",
    "topic": "Amino Acids – Classification",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen027"
  },
  {
    "question_text": "Briefly describe the process of protein denaturation and provide two examples mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Protein denaturation is the process where the three-dimensional structure (secondary and tertiary) of a protein is disrupted by external forces such as changes in temperature or pH, leading to loss of biological activity. Two examples mentioned are the coagulation of egg white when boiled and the curdling of milk due to lactic acid formation.",
    "explanation": "Denaturation affects the folding and non-covalent interactions within the protein, while the primary structure remains intact.",
    "topic": "Proteins – Denaturation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen028"
  },
  {
    "question_text": "Explain the four levels of protein structure, detailing the types of interactions involved at each level.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The four levels of protein structure are: Primary, Secondary, Tertiary, and Quaternary. The primary structure refers to the specific sequence of amino acids linked by peptide bonds. The secondary structure includes regular patterns like the α-helix, where the –NH group of each amino acid forms a hydrogen bond with the –C=O group of another turn, and the β-pleated sheet, where extended chains form hydrogen bonds in a sheet-like arrangement. The tertiary structure represents the overall three-dimensional folding of a single polypeptide chain, stabilized by hydrogen bonds, disulphide bonds, van der Waals forces, and electrostatic interactions. The quaternary structure is seen in proteins composed of two or more polypeptide chains (subunits) arranged in a specific spatial manner.",
    "explanation": "Each level of protein structure builds upon the previous one, with the primary sequence dictating secondary patterns, which then fold into a unique tertiary shape, and finally, in some proteins, multiple chains assemble into a quaternary structure. The interactions at each level ensure specificity and functionality of the protein.",
    "topic": "Proteins – Structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen029"
  },
  {
    "question_text": "Discuss the formation of a peptide bond between two α-amino acids using glycylalanine as an example. In your answer, describe the reaction process and the significance of water removal.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In the formation of a peptide bond, the carboxyl group (–COOH) of one amino acid reacts with the amino group (–NH₂) of another amino acid, resulting in the elimination of a water molecule (condensation reaction) and formation of an amide bond (–CO–NH–). For example, when glycine (H₂N–CH₂–COOH) reacts with alanine (H₂N–CH(CH₃)–COOH), a water molecule is removed and glycylalanine is formed. This dehydration synthesis links the amino acids into a dipeptide. The removal of water is significant because it drives the reaction forward, enabling the formation and stabilization of the peptide bond.",
    "explanation": "The step-wise formation of peptide bonds allows for the creation of proteins with complex sequences necessary for their structure and function. The condensation process is fundamental in biochemistry as it links the building blocks of proteins.",
    "topic": "Proteins – Peptide Bond Formation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen030"
  },
  {
    "question_text": "Evaluate the importance of the primary structure of proteins in determining their final three-dimensional structure and function.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The primary structure, which is the unique sequence of amino acids, determines the way the protein folds into its secondary, tertiary, and quaternary structures. Even a minor change in the primary structure can lead to significant variations in the overall 3D conformation and, consequently, the function of the protein. This is because the chemical properties of the side chains influence local interactions such as hydrogen bonding and ionic interactions, which in turn dictate larger-scale folding and stabilization. Therefore, the primary structure is crucial as it encodes all the information necessary to form the functional three-dimensional structure of the protein.",
    "explanation": "This concept underscores the central dogma of protein chemistry where the sequence of amino acids is directly linked to biological activity. Alterations in primary structure can lead to loss or change of function, which is evident in many diseases caused by protein misfolding.",
    "topic": "Proteins – Structure and Function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen031"
  },
  {
    "question_text": "Glycine is optically inactive because its α-carbon atom is not asymmetric.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Glycine has a hydrogen atom as its side chain, making its α-carbon symmetric. Hence, it does not exhibit optical activity unlike other α-amino acids which have chiral centers.",
    "topic": "Amino Acids – Optical Activity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen032"
  },
  {
    "question_text": "Denaturation of proteins destroys only the primary structure of the protein.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Denaturation typically disrupts the secondary and tertiary structures of proteins while leaving the peptide bonds that form the primary structure intact.",
    "topic": "Proteins – Denaturation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen033"
  },
  {
    "question_text": "Globular proteins are generally water soluble.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Globular proteins have a compact, spherical shape which allows them to be soluble in water. Their surface usually contains hydrophilic residues that interact favorably with water molecules.",
    "topic": "Proteins – Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen034"
  },
  {
    "question_text": "A protein is composed of 200 amino acid residues. Calculate the total number of peptide bonds present in this protein.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "199 peptide bonds",
    "explanation": "In any protein chain, the number of peptide bonds is one less than the number of amino acids. Hence, a protein with 200 amino acids will have 200 - 1 = 199 peptide bonds.",
    "topic": "Proteins – Primary Structure",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen035"
  },
  {
    "question_text": "If the average molecular mass of an amino acid residue is approximately 110 Da, estimate the molecular mass of a protein that consists of 50 amino acid residues.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 5500 Da",
    "explanation": "To calculate the molecular mass, multiply the number of amino acids by the average mass of each residue: 50 × 110 Da = 5500 Da. This provides an estimated molecular mass for the protein.",
    "topic": "Proteins – Primary Structure",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen036"
  },
  {
    "question_text": "During the formation of a dipeptide from glycine and alanine, a water molecule is eliminated. Given the molecular mass of water is 18 g/mol, calculate the mass of water eliminated if 1 mole of dipeptide is formed.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "18 g",
    "explanation": "In the formation of one mole of dipeptide, one mole of water is eliminated due to the condensation reaction. Since the molecular mass of water is 18 g/mol, the mass of water eliminated is 18 g.",
    "topic": "Proteins – Peptide Bond Formation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen037"
  },
  {
    "question_text": "If 0.5 moles of the dipeptide glycylalanine are formed through a condensation reaction, how many moles of water are liberated?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "0.5 moles of water",
    "explanation": "For each mole of dipeptide formed, 1 mole of water is eliminated. Therefore, if 0.5 moles of dipeptide are formed, 0.5 moles of water will be liberated.",
    "topic": "Proteins – Peptide Bond Formation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "05_section_10_2",
    "question_id": "cbse_xii_lech2dd_c205_gen038"
  },
  {
    "question_text": "What are hormones?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Molecules that act as intercellular messengers produced by endocrine glands and transported by the bloodstream",
      "Nutrients absorbed in the digestive system",
      "Enzymes that catalyze chemical reactions in the cell",
      "Structural proteins that support cell shape"
    ],
    "correct_answer": "Molecules that act as intercellular messengers produced by endocrine glands and transported by the bloodstream",
    "explanation": "Hormones are defined as molecules that act as intercellular messengers. They are produced by endocrine glands and released directly into the bloodstream which transports them to target sites.",
    "topic": "Hormones",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen090"
  },
  {
    "question_text": "Which pair of hormones work together to regulate blood glucose levels by lowering and raising it, respectively?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Insulin and glucagon",
      "Thyroxine and epinephrine",
      "Testosterone and estradiol",
      "Cortisol and progesterone"
    ],
    "correct_answer": "Insulin and glucagon",
    "explanation": "Insulin lowers blood glucose levels in response to a rise in blood sugar, while glucagon increases blood glucose levels. Together, they maintain glucose balance in the body.",
    "topic": "Hormones - Blood Glucose Regulation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen091"
  },
  {
    "question_text": "Which hormones mediate the body's quick response to external stimuli?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Epinephrine and norepinephrine",
      "Insulin and glucagon",
      "Testosterone and estradiol",
      "Growth hormone and thyroxine"
    ],
    "correct_answer": "Epinephrine and norepinephrine",
    "explanation": "Epinephrine and norepinephrine are released in response to external stimuli and play a key role in the body's 'fight or flight' reaction.",
    "topic": "Hormones - Response to Stimuli",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen092"
  },
  {
    "question_text": "A low level of which hormone, produced in the thyroid gland, leads to hypothyroidism characterized by lethargy and obesity?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Thyroxine",
      "Cortisol",
      "Insulin",
      "Progesterone"
    ],
    "correct_answer": "Thyroxine",
    "explanation": "Thyroxine, an iodinated derivative of the amino acid tyrosine produced in the thyroid gland, is essential for normal metabolism. A deficiency results in hypothyroidism, which includes symptoms like lethargy and obesity.",
    "topic": "Hormones - Thyroid Function",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen093"
  },
  {
    "question_text": "What is the main role of mineralocorticoids produced by the adrenal cortex?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Control the level of water and salt excretion by the kidney",
      "Mediate the body's fight or flight response",
      "Stimulate the development of secondary sexual characteristics",
      "Regulate blood glucose levels"
    ],
    "correct_answer": "Control the level of water and salt excretion by the kidney",
    "explanation": "Mineralocorticoids are responsible for regulating the balance of water and salt in the body by influencing kidney function. This is crucial for maintaining proper blood pressure and electrolyte balance.",
    "topic": "Hormones - Adrenal Cortex",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen094"
  },
  {
    "question_text": "Define a hormone in the context of its chemical nature and function.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Hormones are molecules that act as intercellular messengers; they are produced by endocrine glands and transported via the bloodstream to target organs to regulate various bodily functions.",
    "explanation": "This answer covers both the definition of hormones as chemical messengers and their role in communication between cells. It mentions their production in endocrine glands and transportation via blood.",
    "topic": "Hormones",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen095"
  },
  {
    "question_text": "List the three major chemical types of hormones mentioned in the section.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The three types include steroids (e.g., estrogens and androgens), polypeptides (e.g., insulin and endorphins), and amino acid derivatives (e.g., epinephrine and norepinephrine).",
    "explanation": "The section categorizes hormones into these three chemical natures: steroids, polypeptides, and amino acid derivatives.",
    "topic": "Hormones - Chemical Nature",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen096"
  },
  {
    "question_text": "What are the potential consequences of a low dietary iodine intake as discussed in the text?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Low iodine intake can lead to hypothyroidism and enlargement of the thyroid gland, which is often managed by using iodised salt.",
    "explanation": "Insufficient iodine leads to reduced production of thyroxine, causing hypothyroidism. The thyroid gland may enlarge in an attempt to produce more hormone.",
    "topic": "Hormones - Iodine and Thyroid",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen097"
  },
  {
    "question_text": "Briefly explain the roles of testosterone and estradiol in human development.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Testosterone, produced in males, is responsible for the development of secondary male characteristics such as deep voice and facial hair, whereas estradiol, the main female sex hormone, is crucial for the development of secondary female characteristics and the regulation of the menstrual cycle.",
    "explanation": "This explanation covers the distinct roles of these hormones in developing sexual characteristics and reproductive functions.",
    "topic": "Hormones - Sex Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen098"
  },
  {
    "question_text": "Discuss the functions of glucocorticoids and mineralocorticoids produced by the adrenal cortex, particularly in the contexts of carbohydrate metabolism, inflammatory reactions, and kidney function.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Glucocorticoids play a critical role in the regulation of carbohydrate metabolism and help modulate inflammatory responses by reducing inflammation and immune activity. They are also involved in the body's response to stress. Mineralocorticoids, on the other hand, are essential for regulating electrolyte and water balance by controlling the excretion of salt and water via the kidneys, thereby influencing blood pressure. Together, these hormones maintain not only metabolic balance but also fluid and electrolyte homeostasis.",
    "explanation": "This answer details the multifaceted roles of adrenal cortex hormones. Glucocorticoids affect metabolism and immune responses, while mineralocorticoids affect kidney functions related to salt and water excretion.",
    "topic": "Hormones - Adrenal Cortex",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen099"
  },
  {
    "question_text": "Examine how insulin and glucagon interact to maintain blood glucose levels. In your answer, include what happens when these hormones malfunction or are imbalanced.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Insulin and glucagon work antagonistically to maintain blood glucose homeostasis. Insulin is released in response to high blood glucose levels, facilitating the uptake of glucose by cells and thereby lowering blood sugar. In contrast, glucagon is released when blood glucose is low, promoting the release of glucose into the bloodstream from glycogen stores. If the balance between these hormones is disturbed, such as in diabetes where insulin production or sensitivity is impaired, blood glucose levels can become abnormally high or low. This imbalance can lead to serious complications, including hypoglycemia or hyperglycemia, and underscores the importance of their coordinated function in energy metabolism.",
    "explanation": "This answer provides a detailed discussion on the complementary functions of insulin and glucagon in regulating blood sugar. The explanation touches on the consequences of their dysfunction in metabolic diseases.",
    "topic": "Hormones - Blood Glucose Regulation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen100"
  },
  {
    "question_text": "Growth hormones and sex hormones play an important role in growth and development.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text specifically states that growth hormones and sex hormones are vital in growth and development, confirming the statement as true.",
    "topic": "Hormones - Growth and Development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen101"
  },
  {
    "question_text": "Thyroxine is produced by the adrenal cortex.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Thyroxine is produced in the thyroid gland, not the adrenal cortex. The adrenal cortex produces steroid hormones, including glucocorticoids and mineralocorticoids.",
    "topic": "Hormones - Thyroid Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen102"
  },
  {
    "question_text": "Insufficient iodine intake can lead to both hypothyroidism and the enlargement of the thyroid gland.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "Low iodine intake decreases thyroxine production, which can cause hypothyroidism and stimulate thyroid enlargement as the gland attempts to produce more hormone.",
    "topic": "Hormones - Iodine and Thyroid",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen103"
  },
  {
    "question_text": "A patient has an initial blood glucose level of 120 mg/dL. An injection of insulin is administered which is expected to reduce the blood glucose level by 20% in 30 minutes. Calculate the expected blood glucose level after 30 minutes.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "96 mg/dL",
    "explanation": "A 20% reduction of 120 mg/dL is calculated as 0.20 multiplied by 120 mg/dL, which equals 24 mg/dL. Subtracting this from the initial 120 mg/dL gives 120 - 24 = 96 mg/dL.",
    "topic": "Hormones - Insulin Function",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen104"
  },
  {
    "question_text": "A patient with Addison's disease has impaired adrenal function. If normal daily cortisol production is 10 mg and the patient produces only 30% of the normal level, calculate the daily cortisol production in this patient.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "3 mg/day",
    "explanation": "30% of 10 mg is calculated as 0.30 x 10 mg = 3 mg. This is the reduced level of cortisol production in the patient.",
    "topic": "Hormones - Adrenal Cortex",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen105"
  },
  {
    "question_text": "Iodised salt is prepared by adding sodium iodide such that 1 kg of salt contains 30 mg of iodine. If the recommended daily iodine intake is 150 μg, how many grams of this iodised salt must be consumed daily to meet the requirement?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "5 grams",
    "explanation": "First, convert the iodine content: 1 kg salt = 30 mg = 30,000 μg; thus, 1 g salt contains 30 μg iodine. To get 150 μg iodine, divide 150 μg by 30 μg/g which yields 5 g of salt.",
    "topic": "Hormones - Iodine and Thyroid",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen106"
  },
  {
    "question_text": "A subject has a baseline hormone level of 100 pg/mL. After treatment with a synthetic hormone analog, the level increases by 150% of the baseline. Calculate the new concentration in pg/mL. If the total blood volume is 5 L, determine the total amount of the hormone in the bloodstream in nanograms.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "250 pg/mL; Total amount = 1250 ng",
    "explanation": "The increase of 150% of 100 pg/mL is 150 pg/mL. Adding this to the baseline gives 100 + 150 = 250 pg/mL. With a blood volume of 5 L, convert liters to mL (5 L = 5000 mL). The total hormone amount  = 250 pg/mL × 5000 mL = 1,250,000 pg, which converts to 1250 ng (since 1 ng = 1000 pg).",
    "topic": "Hormones - Dosage and Blood Levels",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen107"
  },
  {
    "question_text": "A patient normally produces 120 μg of thyroxine daily. In hyperthyroidism, production increases by 50%. Calculate the new daily production level of thyroxine and state the percentage increase.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "180 μg/day with a 50% increase",
    "explanation": "A 50% increase on 120 μg is calculated as 0.50 x 120 μg = 60 μg. Adding this to the normal production: 120 μg + 60 μg = 180 μg/day. The percentage increase is explicitly 50%.",
    "topic": "Hormones - Thyroxine Production",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen108"
  },
  {
    "question_text": "Which vitamin deficiency is most commonly associated with night blindness and xerophthalmia?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Vitamin A",
      "Vitamin B₁",
      "Vitamin C",
      "Vitamin D"
    ],
    "correct_answer": "Vitamin A",
    "explanation": "Night blindness and xerophthalmia (hardening of the eye's cornea) are classic signs of vitamin A deficiency. Vitamin A is obtained from sources such as fish liver oil, carrots, butter, and milk.",
    "topic": "Vitamins, deficiency diseases",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen056"
  },
  {
    "question_text": "Which of the following vitamins is a fat soluble vitamin?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Vitamin C",
      "Vitamin B₁",
      "Vitamin E",
      "Vitamin B₂"
    ],
    "correct_answer": "Vitamin E",
    "explanation": "Fat soluble vitamins are soluble in fats and oils and are stored in liver and adipose tissues. Vitamin E is one of the fat soluble vitamins (the others being A, D, and K).",
    "topic": "Classification of Vitamins",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen057"
  },
  {
    "question_text": "Which of the following statements regarding vitamin supplementation is correct?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Excess vitamins are harmless.",
      "Vitamin pills are safe to take without a doctor's advice.",
      "Excess vitamins can be harmful.",
      "All vitamins are naturally synthesized in the human body."
    ],
    "correct_answer": "Excess vitamins can be harmful.",
    "explanation": "The text clearly states that an excess of vitamins is harmful and vitamin pills should not be taken without the advice of a doctor, highlighting the importance of moderation in vitamin intake.",
    "topic": "Vitamin toxicity and supplementation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen058"
  },
  {
    "question_text": "The term 'vitamin' was derived from the words 'vital' and 'amine' because early studies showed that these compounds contained which functional group?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Carboxyl group",
      "Amine group",
      "Hydroxyl group",
      "Phosphate group"
    ],
    "correct_answer": "Amine group",
    "explanation": "Initially, vitamins were called 'vitamines' since they contained amino groups (amines) and were considered essential for life. Later, it was discovered that most vitamins do not contain an amine group, leading to the current term 'vitamin'.",
    "topic": "History and nomenclature of vitamins",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen059"
  },
  {
    "question_text": "Which water soluble vitamin is an exception in that it can be stored in the body?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Vitamin C",
      "Vitamin B₆",
      "Vitamin B₁₂",
      "Vitamin B₁"
    ],
    "correct_answer": "Vitamin B₁₂",
    "explanation": "Unlike other water soluble vitamins that are readily excreted in the urine, Vitamin B₁₂ can be stored in the body, making it an exception in this group.",
    "topic": "Classification of Vitamins",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen060"
  },
  {
    "question_text": "Define vitamins and explain why they are considered essential for the maintenance of optimum growth and health.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Vitamins are organic compounds required in small amounts in the diet that perform specific biological functions necessary for normal growth, maintenance, and health. They are essential because most cannot be synthesized by the human body and their deficiency leads to specific diseases.",
    "explanation": "This answer includes the definition of vitamins as organic compounds required in small quantities and explains their importance for normal biological functions and health maintenance.",
    "topic": "Vitamins, definition and importance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen061"
  },
  {
    "question_text": "Differentiate between fat soluble and water soluble vitamins. Provide examples of each group based on the textbook.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Fat soluble vitamins (Vitamin A, D, E, and K) are soluble in fats and oils and are stored in the liver and adipose tissues, meaning they can accumulate in the body. Water soluble vitamins (B-group vitamins and Vitamin C) are soluble in water and must be consumed regularly as they are not stored (except Vitamin B₁₂, which can be stored) and are excreted in the urine.",
    "explanation": "The answer correctly distinguishes between the two classes of vitamins based on their solubility, storage behavior, and examples, which directly reflects the information provided in the text.",
    "topic": "Classification of Vitamins",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen062"
  },
  {
    "question_text": "Discuss the role of gut bacteria in vitamin synthesis and its impact on dietary vitamin requirements.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Gut bacteria in the human digestive system have the ability to synthesize certain vitamins, which can contribute to the body’s overall vitamin supply. This synthesis may reduce the dietary requirement for some vitamins, although it is not sufficient for all essential vitamins, so a balanced diet remains crucial.",
    "explanation": "The answer explains that while some vitamins are synthesized by gut bacteria, this contribution does not eliminate the need for a diet that provides all essential vitamins. It reflects an understanding of the interplay between microbial synthesis and human nutrition.",
    "topic": "Vitamin synthesis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen063"
  },
  {
    "question_text": "Discuss the importance of a balanced diet in preventing vitamin deficiency diseases. Include examples of specific vitamins, their food sources, and the diseases that result from their deficiencies as listed in the textbook.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A balanced diet is crucial to provide the necessary vitamins required for proper bodily functions. For example, vitamin A, found in fish liver oil, carrots, butter, and milk, prevents night blindness and xerophthalmia. Vitamin B₁ present in milk, yeast, green vegetables, and cereals is essential to prevent beri beri. Similarly, vitamin C from citrus fruits and green leafy vegetables prevents scurvy, while vitamin D obtained from sunlight, fish, and egg yolk is important to prevent rickets and osteomalacia. These examples show that obtaining vitamins from diverse sources ensures that the body receives adequate nutrients to prevent deficiency diseases.",
    "explanation": "The response emphasizes the connection between a balanced diet and the prevention of vitamin deficiency diseases, using specific examples from the table provided in the textbook. It also links dietary sources with the health conditions that result from deficiencies.",
    "topic": "Diet and Vitamin Deficiency Diseases",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen064"
  },
  {
    "question_text": "Critically evaluate the statement 'Most of the vitamins cannot be synthesised in our body but plants can synthesise almost all of them'. Discuss the biochemical and nutritional implications of this fact, including potential strategies for supplementation when necessary.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The statement suggests that humans depend largely on external sources for vitamins, as most cannot be synthesized endogenously. In contrast, plants have the biosynthetic capability to produce nearly all vitamins, emphasizing the importance of a plant-inclusive diet. Biochemically, this means that humans must obtain these essential compounds through diet or, in some cases, through bacterial synthesis in the gut. Nutritionally, this dependence necessitates a balanced diet to avoid deficiencies. Supplementation strategies must be carefully considered since both under-supply and over-supply can lead to health issues; for instance, fat-soluble vitamins can accumulate and cause toxicity, while water-soluble vitamins need regular intake due to their excretion. The statement underlines the need for dietary planning and medical guidance when using vitamin supplements.",
    "explanation": "This detailed answer considers the biochemical inability of the human body to synthesize most vitamins and compares it to the plant's ability. It discusses the nutritional implications and the need for a balanced diet, while also outlining the risks of excess supplementation. It reflects critical evaluation of the statement with reference to both biochemical and nutritional principles.",
    "topic": "Vitamin biosynthesis and supplementation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen065"
  },
  {
    "question_text": "True or False: Vitamin C, being water soluble, can be stored in the body for long periods.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Water soluble vitamins, including Vitamin C, are not stored in the body for long periods and are readily excreted in the urine. The exception is Vitamin B₁₂, which can be stored.",
    "topic": "Classification of Vitamins",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen066"
  },
  {
    "question_text": "True or False: Vitamin D obtained from sunlight exposure is essential for bone health, and its deficiency can lead to rickets in children.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Vitamin D plays a critical role in calcium metabolism and bone health. A deficiency in vitamin D can lead to rickets in children and osteomalacia in adults, as described in the textbook.",
    "topic": "Vitamin D and bone health",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen067"
  },
  {
    "question_text": "If the recommended daily intake of vitamin B₁ is 1.2 mg and a meal provides 0.8 mg, what percentage of the recommended amount is provided by the meal, and what is the percentage shortfall?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The meal provides approximately 66.67% of the recommended intake, resulting in a shortfall of about 33.33%.",
    "explanation": "Step 1: Calculate the percentage provided: (0.8 mg / 1.2 mg) × 100 = 66.67%. Step 2: Determine the shortfall: 100% - 66.67% = 33.33%. Thus, the meal covers about 66.67% of the daily requirement, missing 33.33%.",
    "topic": "Vitamin B₁ deficiency and dietary intake",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen068"
  },
  {
    "question_text": "The recommended daily intake of vitamin D is 600 IU. If 30 minutes of sun exposure yields only 300 IU and each additional minute of sun exposure yields an extra 10 IU of vitamin D, how many additional minutes of sun exposure are required to meet the daily requirement?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "30 additional minutes are required.",
    "explanation": "Step 1: Calculate the deficit: 600 IU - 300 IU = 300 IU. Step 2: Each minute provides 10 IU, so the additional time required is 300 IU / 10 IU per minute = 30 minutes.",
    "topic": "Vitamin D synthesis and sun exposure",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen069"
  },
  {
    "question_text": "A vitamin pill contains 500 mg of vitamin C, while the recommended daily intake is 75 mg. By what factor does the pill exceed the daily recommended amount, and what is the percentage excess relative to the recommended intake?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The pill contains approximately 6.67 times the recommended daily amount, which is an excess of about 567% relative to the recommended intake.",
    "explanation": "Step 1: Calculate the factor by dividing the pill's content by the recommended intake: 500 mg / 75 mg ≈ 6.67. Step 2: To find the percentage excess: [(500 mg - 75 mg) / 75 mg] × 100 ≈ 567%.",
    "topic": "Vitamin C dosage and supplementation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen070"
  },
  {
    "question_text": "A fat soluble vitamin pill provides 200% of the recommended daily dose of vitamin A. If the recommended dose is 900 µg, how many micrograms of vitamin A does the pill contain?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The pill contains 1800 µg of vitamin A.",
    "explanation": "Since the pill contains 200% of the recommended dose, it provides 2 × 900 µg = 1800 µg of vitamin A.",
    "topic": "Vitamin A dosage and supplementation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "08_section_10_4",
    "question_id": "cbse_xii_lech2dd_c205_gen071"
  }
]