[
  {
    "question_text": "What are hormones?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Molecules that act as intercellular messengers produced by endocrine glands and transported by the bloodstream",
      "Nutrients absorbed in the digestive system",
      "Enzymes that catalyze chemical reactions in the cell",
      "Structural proteins that support cell shape"
    ],
    "correct_answer": "Molecules that act as intercellular messengers produced by endocrine glands and transported by the bloodstream",
    "explanation": "Hormones are defined as molecules that act as intercellular messengers. They are produced by endocrine glands and released directly into the bloodstream which transports them to target sites.",
    "topic": "Hormones",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen090"
  },
  {
    "question_text": "Which pair of hormones work together to regulate blood glucose levels by lowering and raising it, respectively?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Insulin and glucagon",
      "Thyroxine and epinephrine",
      "Testosterone and estradiol",
      "Cortisol and progesterone"
    ],
    "correct_answer": "Insulin and glucagon",
    "explanation": "Insulin lowers blood glucose levels in response to a rise in blood sugar, while glucagon increases blood glucose levels. Together, they maintain glucose balance in the body.",
    "topic": "Hormones - Blood Glucose Regulation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen091"
  },
  {
    "question_text": "Which hormones mediate the body's quick response to external stimuli?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Epinephrine and norepinephrine",
      "Insulin and glucagon",
      "Testosterone and estradiol",
      "Growth hormone and thyroxine"
    ],
    "correct_answer": "Epinephrine and norepinephrine",
    "explanation": "Epinephrine and norepinephrine are released in response to external stimuli and play a key role in the body's 'fight or flight' reaction.",
    "topic": "Hormones - Response to Stimuli",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen092"
  },
  {
    "question_text": "A low level of which hormone, produced in the thyroid gland, leads to hypothyroidism characterized by lethargy and obesity?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Thyroxine",
      "Cortisol",
      "Insulin",
      "Progesterone"
    ],
    "correct_answer": "Thyroxine",
    "explanation": "Thyroxine, an iodinated derivative of the amino acid tyrosine produced in the thyroid gland, is essential for normal metabolism. A deficiency results in hypothyroidism, which includes symptoms like lethargy and obesity.",
    "topic": "Hormones - Thyroid Function",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen093"
  },
  {
    "question_text": "What is the main role of mineralocorticoids produced by the adrenal cortex?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Control the level of water and salt excretion by the kidney",
      "Mediate the body's fight or flight response",
      "Stimulate the development of secondary sexual characteristics",
      "Regulate blood glucose levels"
    ],
    "correct_answer": "Control the level of water and salt excretion by the kidney",
    "explanation": "Mineralocorticoids are responsible for regulating the balance of water and salt in the body by influencing kidney function. This is crucial for maintaining proper blood pressure and electrolyte balance.",
    "topic": "Hormones - Adrenal Cortex",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen094"
  },
  {
    "question_text": "Define a hormone in the context of its chemical nature and function.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Hormones are molecules that act as intercellular messengers; they are produced by endocrine glands and transported via the bloodstream to target organs to regulate various bodily functions.",
    "explanation": "This answer covers both the definition of hormones as chemical messengers and their role in communication between cells. It mentions their production in endocrine glands and transportation via blood.",
    "topic": "Hormones",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen095"
  },
  {
    "question_text": "List the three major chemical types of hormones mentioned in the section.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The three types include steroids (e.g., estrogens and androgens), polypeptides (e.g., insulin and endorphins), and amino acid derivatives (e.g., epinephrine and norepinephrine).",
    "explanation": "The section categorizes hormones into these three chemical natures: steroids, polypeptides, and amino acid derivatives.",
    "topic": "Hormones - Chemical Nature",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen096"
  },
  {
    "question_text": "What are the potential consequences of a low dietary iodine intake as discussed in the text?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Low iodine intake can lead to hypothyroidism and enlargement of the thyroid gland, which is often managed by using iodised salt.",
    "explanation": "Insufficient iodine leads to reduced production of thyroxine, causing hypothyroidism. The thyroid gland may enlarge in an attempt to produce more hormone.",
    "topic": "Hormones - Iodine and Thyroid",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen097"
  },
  {
    "question_text": "Briefly explain the roles of testosterone and estradiol in human development.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Testosterone, produced in males, is responsible for the development of secondary male characteristics such as deep voice and facial hair, whereas estradiol, the main female sex hormone, is crucial for the development of secondary female characteristics and the regulation of the menstrual cycle.",
    "explanation": "This explanation covers the distinct roles of these hormones in developing sexual characteristics and reproductive functions.",
    "topic": "Hormones - Sex Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen098"
  },
  {
    "question_text": "Discuss the functions of glucocorticoids and mineralocorticoids produced by the adrenal cortex, particularly in the contexts of carbohydrate metabolism, inflammatory reactions, and kidney function.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Glucocorticoids play a critical role in the regulation of carbohydrate metabolism and help modulate inflammatory responses by reducing inflammation and immune activity. They are also involved in the body's response to stress. Mineralocorticoids, on the other hand, are essential for regulating electrolyte and water balance by controlling the excretion of salt and water via the kidneys, thereby influencing blood pressure. Together, these hormones maintain not only metabolic balance but also fluid and electrolyte homeostasis.",
    "explanation": "This answer details the multifaceted roles of adrenal cortex hormones. Glucocorticoids affect metabolism and immune responses, while mineralocorticoids affect kidney functions related to salt and water excretion.",
    "topic": "Hormones - Adrenal Cortex",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen099"
  },
  {
    "question_text": "Examine how insulin and glucagon interact to maintain blood glucose levels. In your answer, include what happens when these hormones malfunction or are imbalanced.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Insulin and glucagon work antagonistically to maintain blood glucose homeostasis. Insulin is released in response to high blood glucose levels, facilitating the uptake of glucose by cells and thereby lowering blood sugar. In contrast, glucagon is released when blood glucose is low, promoting the release of glucose into the bloodstream from glycogen stores. If the balance between these hormones is disturbed, such as in diabetes where insulin production or sensitivity is impaired, blood glucose levels can become abnormally high or low. This imbalance can lead to serious complications, including hypoglycemia or hyperglycemia, and underscores the importance of their coordinated function in energy metabolism.",
    "explanation": "This answer provides a detailed discussion on the complementary functions of insulin and glucagon in regulating blood sugar. The explanation touches on the consequences of their dysfunction in metabolic diseases.",
    "topic": "Hormones - Blood Glucose Regulation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen100"
  },
  {
    "question_text": "Growth hormones and sex hormones play an important role in growth and development.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text specifically states that growth hormones and sex hormones are vital in growth and development, confirming the statement as true.",
    "topic": "Hormones - Growth and Development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen101"
  },
  {
    "question_text": "Thyroxine is produced by the adrenal cortex.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Thyroxine is produced in the thyroid gland, not the adrenal cortex. The adrenal cortex produces steroid hormones, including glucocorticoids and mineralocorticoids.",
    "topic": "Hormones - Thyroid Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen102"
  },
  {
    "question_text": "Insufficient iodine intake can lead to both hypothyroidism and the enlargement of the thyroid gland.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "Low iodine intake decreases thyroxine production, which can cause hypothyroidism and stimulate thyroid enlargement as the gland attempts to produce more hormone.",
    "topic": "Hormones - Iodine and Thyroid",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen103"
  },
  {
    "question_text": "A patient has an initial blood glucose level of 120 mg/dL. An injection of insulin is administered which is expected to reduce the blood glucose level by 20% in 30 minutes. Calculate the expected blood glucose level after 30 minutes.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "96 mg/dL",
    "explanation": "A 20% reduction of 120 mg/dL is calculated as 0.20 multiplied by 120 mg/dL, which equals 24 mg/dL. Subtracting this from the initial 120 mg/dL gives 120 - 24 = 96 mg/dL.",
    "topic": "Hormones - Insulin Function",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen104"
  },
  {
    "question_text": "A patient with Addison's disease has impaired adrenal function. If normal daily cortisol production is 10 mg and the patient produces only 30% of the normal level, calculate the daily cortisol production in this patient.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "3 mg/day",
    "explanation": "30% of 10 mg is calculated as 0.30 x 10 mg = 3 mg. This is the reduced level of cortisol production in the patient.",
    "topic": "Hormones - Adrenal Cortex",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen105"
  },
  {
    "question_text": "Iodised salt is prepared by adding sodium iodide such that 1 kg of salt contains 30 mg of iodine. If the recommended daily iodine intake is 150 μg, how many grams of this iodised salt must be consumed daily to meet the requirement?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "5 grams",
    "explanation": "First, convert the iodine content: 1 kg salt = 30 mg = 30,000 μg; thus, 1 g salt contains 30 μg iodine. To get 150 μg iodine, divide 150 μg by 30 μg/g which yields 5 g of salt.",
    "topic": "Hormones - Iodine and Thyroid",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen106"
  },
  {
    "question_text": "A subject has a baseline hormone level of 100 pg/mL. After treatment with a synthetic hormone analog, the level increases by 150% of the baseline. Calculate the new concentration in pg/mL. If the total blood volume is 5 L, determine the total amount of the hormone in the bloodstream in nanograms.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "250 pg/mL; Total amount = 1250 ng",
    "explanation": "The increase of 150% of 100 pg/mL is 150 pg/mL. Adding this to the baseline gives 100 + 150 = 250 pg/mL. With a blood volume of 5 L, convert liters to mL (5 L = 5000 mL). The total hormone amount  = 250 pg/mL × 5000 mL = 1,250,000 pg, which converts to 1250 ng (since 1 ng = 1000 pg).",
    "topic": "Hormones - Dosage and Blood Levels",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen107"
  },
  {
    "question_text": "A patient normally produces 120 μg of thyroxine daily. In hyperthyroidism, production increases by 50%. Calculate the new daily production level of thyroxine and state the percentage increase.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "180 μg/day with a 50% increase",
    "explanation": "A 50% increase on 120 μg is calculated as 0.50 x 120 μg = 60 μg. Adding this to the normal production: 120 μg + 60 μg = 180 μg/day. The percentage increase is explicitly 50%.",
    "topic": "Hormones - Thyroxine Production",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech205",
    "section_id": "10_section_10_6",
    "question_id": "cbse_xii_lech2dd_c205_gen108"
  }
]