[
  {
    "question_text": "In a mixture of ortho and para nitrophenols, which isomer is expected to be steam volatile during steam distillation?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Ortho nitrophenol",
      "Para nitrophenol",
      "Both are equally steam volatile",
      "Neither of them"
    ],
    "correct_answer": "Para nitrophenol",
    "explanation": "Para nitrophenol is more steam volatile because it does not undergo intramolecular hydrogen bonding, which is present in ortho nitrophenol. This intramolecular hydrogen bonding in the ortho isomer raises its boiling point and reduces its volatility during steam distillation.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen415"
  },
  {
    "question_text": "What is the primary reason that para nitrophenol is more volatile under steam distillation conditions compared to ortho nitrophenol?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It has a lower molecular weight",
      "It does not exhibit intramolecular hydrogen bonding",
      "It has a higher vapor pressure because of a stronger polar group",
      "It reacts with water during distillation"
    ],
    "correct_answer": "It does not exhibit intramolecular hydrogen bonding",
    "explanation": "Para nitrophenol lacks the ability to form intramolecular hydrogen bonds, which in ortho nitrophenol raise its boiling point. This absence results in a higher vapor pressure for the para isomer, making it more volatile during steam distillation.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen416"
  },
  {
    "question_text": "During steam distillation of a mixture of nitrophenol isomers, the separation is achieved due to differences in their boiling points. Which factor does NOT contribute to this difference in boiling points?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Intramolecular hydrogen bonding",
      "Molecular symmetry",
      "Intermolecular forces",
      "Type of substituents"
    ],
    "correct_answer": "Molecular symmetry",
    "explanation": "While intramolecular hydrogen bonding, intermolecular forces, and the nature of substituents affect boiling points, molecular symmetry is not a significant factor in the difference between ortho and para nitrophenols regarding their volatility in steam distillation.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen417"
  },
  {
    "question_text": "Why is steam distillation an appropriate method for separating para nitrophenol from a mixture containing ortho nitrophenol?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Because para nitrophenol is insoluble in water",
      "Due to para nitrophenol's lower boiling point from absence of intramolecular hydrogen bonding",
      "Because ortho nitrophenol reacts during distillation",
      "Due to formation of an azeotrope exclusively with ortho nitrophenol"
    ],
    "correct_answer": "Due to para nitrophenol's lower boiling point from absence of intramolecular hydrogen bonding",
    "explanation": "Steam distillation works well for para nitrophenol as its lack of intramolecular hydrogen bonding reduces its boiling point compared to ortho nitrophenol, thus allowing it to co-distill with water.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen418"
  },
  {
    "question_text": "Which of the following factors primarily affects the steam volatility of nitrophenol isomers during steam distillation?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Water solubility",
      "Molecular symmetry",
      "Hydrogen bonding characteristics",
      "Molecular weight"
    ],
    "correct_answer": "Hydrogen bonding characteristics",
    "explanation": "The ability or inability to form intramolecular hydrogen bonds significantly affects the boiling point and, hence, the steam volatility of nitrophenol isomers.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen419"
  },
  {
    "question_text": "Describe the chemical basis for the difference in steam volatility between ortho and para nitrophenol.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Para nitrophenol is more steam volatile because it does not participate in intramolecular hydrogen bonding, which increases the boiling point and decreases volatility of ortho nitrophenol.",
    "explanation": "The key difference is that ortho nitrophenol forms a stable intramolecular hydrogen bond between the hydroxyl group and the nitro group, raising its boiling point. In contrast, para nitrophenol lacks this bonding possibility, resulting in a lower boiling point and making it more amenable to removal by steam distillation.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen420"
  },
  {
    "question_text": "Explain why intramolecular hydrogen bonding in ortho nitrophenol leads to reduced steam volatility compared to para nitrophenol.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Intramolecular hydrogen bonding in ortho nitrophenol stabilizes the molecule by forming a cycle within itself, which increases its boiling point and lowers its vapor pressure, making it less volatile under steam distillation conditions.",
    "explanation": "Ortho nitrophenol can form a hydrogen bond between the hydroxyl (-OH) and nitro (-NO2) groups, which significantly stabilizes the molecular structure. This intramolecular interaction requires more energy to break, resulting in a higher boiling point compared to para nitrophenol, which cannot form such a bond.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen421"
  },
  {
    "question_text": "Identify the isomer that will be more efficiently separated using steam distillation and justify your answer based on its molecular interactions.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Para nitrophenol will be more efficiently separated because it lacks intramolecular hydrogen bonding, which results in a lower boiling point and higher vapor pressure during steam distillation.",
    "explanation": "The absence of intramolecular hydrogen bonding in para nitrophenol means that its intermolecular interactions are less complex, lowering its boiling point relative to ortho nitrophenol. This allows it to volatilize with steam, making separation easier.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen422"
  },
  {
    "question_text": "Discuss how steam distillation can be used to separate compounds with high boiling points like nitrophenols. Focus on the role of azeotropic behavior and vapor pressure in your answer.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Steam distillation leverages the fact that when two immiscible liquids are distilled together, the total vapor pressure is the sum of the individual vapor pressures. For compounds like para nitrophenol, which have high boiling points normally, their co-distillation with water (boiling at 100°C) enables separation at lower temperatures. The absence of intramolecular hydrogen bonding in para nitrophenol contributes to a relatively higher vapor pressure compared to the ortho isomer, ensuring its volatilization with steam. Additionally, the formation of an azeotrope with water in some cases lowers the effective boiling point, facilitating the separation process without thermal decomposition of the target compound.",
    "explanation": "By combining water and the target compound, the overall vapor pressure is increased, allowing the mixture to boil at a temperature lower than the boiling point of the pure high-boiling compound. This is particularly useful for temperature-sensitive substances. The difference in intermolecular interactions, as in the case of para versus ortho nitrophenol, allows selective separation based on volatility differences.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen423"
  },
  {
    "question_text": "Evaluate the limitations of using steam distillation to separate nitrophenol isomers and propose alternative methods that could be used when these limitations are present.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One limitation of steam distillation is that it relies on significant differences in volatility between components; if the nonvolatile isomer has a boiling point not sufficiently higher or if it forms a partial azeotrope, separation may be incomplete. Additionally, the presence of impurities or components that may co-distill with the target compound can complicate the process. Alternative methods such as fractional distillation, chromatography (e.g., HPLC), or recrystallization might be more effective. Chromatography, in particular, offers the advantage of separating compounds based on polarity differences and can be fine-tuned to account for minor differences in molecular properties.",
    "explanation": "While steam distillation is useful for separating compounds with marked differences in volatility, its effectiveness decreases when those differences are marginal or when the sample contains additional impurities. By using techniques like chromatography, which separates based on molecular interactions with the stationary phase, or recrystallization, which exploits differences in solubility, a cleaner separation may be achieved. Each method has its advantages and is chosen based on factors such as sample quantity, purity requirements, and available instrumentation.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen424"
  },
  {
    "question_text": "Propose an experimental procedure using steam distillation to separate a mixture of ortho and para nitrophenols, and explain the chemical principles behind each step.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The procedure would begin with preparing the mixture of ortho and para nitrophenols in a distillation flask along with a suitable amount of water. The mixture is heated gradually to initiate steam distillation. As the temperature reaches around 100°C, water vaporizes and carries the more volatile para nitrophenol with it, while the less volatile ortho nitrophenol remains in the flask. The volatile mixture is then condensed in a condenser and collected in a receiver. The separation is achieved because para nitrophenol, lacking intramolecular hydrogen bonding, has a lower boiling point and higher vapor pressure relative to ortho nitrophenol. After distillation, the organic layer can be separated from the water layer using a separatory funnel.",
    "explanation": "Each step of the procedure is designed to exploit the difference in boiling points imposed by intramolecular hydrogen bonding in ortho nitrophenol. Heating causes water to vaporize and form a co-distillation medium with para nitrophenol, reducing the effective boiling point of the latter. Cooling in a condenser allows the vapor mixture to condense, where phase separation techniques such as using a separatory funnel further purify the separated isomer.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen425"
  },
  {
    "question_text": "True or False: Ortho nitrophenol is more volatile than para nitrophenol during steam distillation because its intramolecular hydrogen bonding decreases its boiling point.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The statement is false because the intramolecular hydrogen bonding in ortho nitrophenol actually increases its boiling point by stabilizing the molecule, thereby reducing its volatility during steam distillation. Para nitrophenol, which does not participate in such bonding, is more volatile.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen426"
  },
  {
    "question_text": "True or False: Steam distillation is effective only if the mixture components exhibit significantly different boiling points under standard atmospheric pressure.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "This statement is false because steam distillation is specifically useful for separating compounds with high boiling points by taking advantage of their vapor pressures when co-distilled with water. It is not solely dependent on a large boiling point difference under atmospheric pressure.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen427"
  },
  {
    "question_text": "True or False: The formation of intramolecular hydrogen bonding in a compound typically results in a lower boiling point due to decreased energy requirements for vaporization.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The statement is false. Intramolecular hydrogen bonding stabilizes a compound by creating a strong internal bond, which generally results in a higher boiling point because more energy is required to break these bonds during vaporization.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen428"
  },
  {
    "question_text": "A laboratory mixture contains 50 g of para nitrophenol and 50 g of ortho nitrophenol. After conducting steam distillation, if 85% of para nitrophenol is recovered, calculate the mass of para nitrophenol obtained.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "42.5 g",
    "explanation": "The mass of para nitrophenol recovered is calculated by finding 85% of 50 g. Calculation: 0.85 x 50 g = 42.5 g. This shows that 42.5 g of para nitrophenol is collected.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen429"
  },
  {
    "question_text": "During steam distillation, water and para nitrophenol form a combined vapor. If the vapor pressures at 100°C are 760 mmHg for water and 150 mmHg for para nitrophenol, calculate the total vapor pressure of the mixture and the percentage contribution of para nitrophenol.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Total vapor pressure is 910 mmHg and para nitrophenol contributes approximately 16.48%",
    "explanation": "First, the total vapor pressure is the sum of the individual vapor pressures: 760 mmHg + 150 mmHg = 910 mmHg. Next, the contribution percentage of para nitrophenol is (150/910) x 100 ≈ 16.48%. This indicates that para nitrophenol makes up about 16.48% of the total vapor pressure in the vapor phase during steam distillation.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen430"
  },
  {
    "question_text": "A sample mixture of nitrophenols is subjected to steam distillation and yields a distillate containing 42.5 g of para nitrophenol. If the yield corresponds to 85% recovery based solely on para nitrophenol content, determine the initial amount of para nitrophenol in the sample.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "50 g",
    "explanation": "Let the initial amount of para nitrophenol be x. An 85% recovery gives 0.85 x = 42.5 g. Solving for x: x = 42.5 g / 0.85 = 50 g. This demonstrates that the initial amount of para nitrophenol was 50 g.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen431"
  },
  {
    "question_text": "If a scaling up of the steam distillation process results in the use of 500 g of para nitrophenol (with similar 85% recovery) mixed with 500 g of ortho nitrophenol, calculate the mass of para nitrophenol expected in the distillate.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "425 g",
    "explanation": "Scaling up the process with 500 g of para nitrophenol and assuming an 85% recovery: 0.85 x 500 g = 425 g. This answer shows that 425 g of para nitrophenol is expected in the distillate.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen432"
  },
  {
    "question_text": "For a reaction where the steam distillation is used for separation, if the vapor pressure of a component increases by 20% upon elimination of intramolecular hydrogen bonding, explain how this change affects the distillation process in terms of boiling point and separation efficiency.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An increase in vapor pressure by 20% effectively lowers the boiling point of the compound and enhances its volatility, leading to more efficient separation during steam distillation as it co-distills more readily with water.",
    "explanation": "The 20% increase in vapor pressure due to the elimination of intramolecular hydrogen bonding lowers the compound's boiling point when co-distilled with water. This decrease in boiling point results in a greater proportion of the compound in the vapor phase, thereby increasing the efficiency of its separation. This numerical relationship highlights the sensitivity of steam distillation to changes in vapor pressure.",
    "topic": "Steam Distillation of Nitro Phenols",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "30_section_7_8",
    "question_id": "cbse_xii_lech2dd_c202_gen433"
  }
]