[
  {
    "question_text": "Which of the following best explains why propanol has a higher boiling point than butane?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Propanol has hydrogen bonding while butane only exhibits dispersion forces.",
      "B. Propanol is less polar than butane.",
      "C. Butane has stronger dipole-dipole interactions.",
      "D. Butane has a higher molecular weight than propanol."
    ],
    "correct_answer": "A. Propanol has hydrogen bonding while butane only exhibits dispersion forces.",
    "explanation": "Propanol contains a hydroxyl group which enables hydrogen bonding, a strong intermolecular force that significantly raises its boiling point. Butane, being a nonpolar hydrocarbon, relies only on weak dispersion forces.",
    "topic": "Intermolecular forces in propanol and butane",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen345"
  },
  {
    "question_text": "Which intermolecular force is present in propanol but absent in butane?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Dispersion forces",
      "B. Ion-dipole interactions",
      "C. Hydrogen bonding",
      "D. London forces"
    ],
    "correct_answer": "C. Hydrogen bonding",
    "explanation": "Propanol has an -OH group that can participate in hydrogen bonding, whereas butane, being a hydrocarbon, lacks any polar functional group and cannot hydrogen bond.",
    "topic": "Intermolecular forces in propanol and butane",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen346"
  },
  {
    "question_text": "Considering the types of intermolecular forces, why does the presence of an -OH group in propanol lead to a higher boiling point relative to butane?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. The -OH group increases the molecular weight drastically.",
      "B. The -OH group introduces hydrogen bonding which significantly increases boiling point.",
      "C. The -OH group causes propanol molecules to repel each other.",
      "D. The -OH group decreases the polarity of the molecule."
    ],
    "correct_answer": "B. The -OH group introduces hydrogen bonding which significantly increases boiling point.",
    "explanation": "The hydroxyl (-OH) group in propanol allows for hydrogen bonding between molecules, which are much stronger than the dispersion forces in butane, leading to a higher boiling point.",
    "topic": "Hydrogen bonding and boiling point",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen347"
  },
  {
    "question_text": "Which property among the following is most directly affected by the type of intermolecular forces present in a substance?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Color",
      "B. Boiling point",
      "C. Molar mass",
      "D. Atomic number"
    ],
    "correct_answer": "B. Boiling point",
    "explanation": "Boiling point is largely determined by the strength of intermolecular forces. In propanol, the presence of hydrogen bonding significantly elevates its boiling point compared to butane, which only has dispersion forces.",
    "topic": "Boiling point and intermolecular forces",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen348"
  },
  {
    "question_text": "Propanol exhibits hydrogen bonding while butane does not. This difference in intermolecular interactions primarily results in which of the following?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Propanol has a lower boiling point than butane.",
      "B. Propanol has a higher boiling point than butane.",
      "C. Both have nearly identical boiling points.",
      "D. Butane forms stronger hydrogen bonds than propanol."
    ],
    "correct_answer": "B. Propanol has a higher boiling point than butane.",
    "explanation": "The ability of propanol to form hydrogen bonds significantly increases the energy required for its molecules to escape into the gas phase, thereby raising its boiling point compared to butane, which can only form relatively weak dispersion forces.",
    "topic": "Intermolecular forces and boiling point",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen349"
  },
  {
    "question_text": "Describe briefly how the presence of an -OH group in propanol contributes to its higher boiling point compared to butane.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The -OH group in propanol allows for hydrogen bonding between molecules, which is a strong intermolecular force that requires more energy to overcome during boiling, resulting in a higher boiling point.",
    "explanation": "Hydrogen bonds form when the hydrogen atom covalently bonded to an electronegative oxygen in one molecule is attracted to the oxygen of another molecule. This strong interaction increases the energy required to change the substance from liquid to gas, thereby elevating the boiling point compared to nonpolar butane.",
    "topic": "Hydrogen bonding impact on boiling point",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen350"
  },
  {
    "question_text": "Compare and contrast the type and strength of intermolecular forces in propanol and butane and explain how these forces affect their boiling points.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Propanol exhibits hydrogen bonding due to its polar -OH group, along with dipole-dipole interactions and dispersion forces, making its intermolecular attractions strong. Butane, being a nonpolar molecule, relies solely on weak dispersion (London) forces. The stronger forces in propanol require more energy to overcome, resulting in a higher boiling point than butane.",
    "explanation": "The intermolecular forces determine the energy needed to separate molecules during boiling. Hydrogen bonding in propanol demands significantly more energy compared to the weak dispersion forces in butane, which is why propanol boils at a higher temperature.",
    "topic": "Intermolecular forces comparison",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen351"
  },
  {
    "question_text": "Why is hydrogen bonding considered a stronger intermolecular force compared to dispersion forces and how does this contribute to the boiling point difference observed between propanol and butane?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hydrogen bonding is stronger due to the significant electronegativity difference between hydrogen and oxygen, creating a strong dipole-dipole attraction. This causes propanol molecules to adhere more strongly to one another, requiring more energy to break these interactions during boiling, unlike butane which only exhibits weaker dispersion forces.",
    "explanation": "The strong electrostatic nature of hydrogen bonds makes them much harder to break compared to the transient and weak interactions of dispersion forces. Consequently, substances capable of hydrogen bonding, like propanol, exhibit higher boiling points.",
    "topic": "Hydrogen bonding vs dispersion forces",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen352"
  },
  {
    "question_text": "Discuss in detail how molecular structure, including the presence of functional groups, influences the boiling points of organic compounds, using propanol and butane as examples.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Molecular structure plays a crucial role in determining boiling points. Propanol contains an -OH functional group, which allows for hydrogen bonding—a strong intermolecular force that requires significant energy to overcome. This results in a higher boiling point. In contrast, butane is a nonpolar molecule without any functional groups capable of hydrogen bonding, relying solely on weak dispersion forces. This difference explains why propanol has a considerably higher boiling point than butane.",
    "explanation": "The boiling point of a substance depends largely on intermolecular forces. In propanol, the hydroxyl group not only introduces polarity but also enables hydrogen bonding, an interaction that is much stronger than the dispersion forces that predominate in butane. As molecular weight alone does not account for the dramatic difference, the presence and type of functional group (in this case, -OH) are key. This is a clear demonstration of how molecular structure influences physical properties. Experimental measurements of boiling points reflect these theoretical predictions and are invaluable in confirming the relationship between structure and physical behavior.",
    "topic": "Structure-property relationships in organic compounds",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen353"
  },
  {
    "question_text": "Evaluate the pros and cons of designing an experiment to compare the boiling points of propanol and butane, considering the role of intermolecular forces in your analysis.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An experiment comparing the boiling points of propanol and butane should control for ambient pressure and purity of samples. Pros include the ability to directly observe the effect of hydrogen bonding in propanol versus the weak dispersion forces in butane. Cons include the volatility of butane and safety concerns due to its flammability, which may complicate measurements. Additionally, ensuring accurate thermal control is critical because slight variations can affect the observed boiling points. Overall, while the experiment can effectively demonstrate differences due to molecular interactions, practical challenges must be addressed.",
    "explanation": "When evaluating experimental design, considerations must include reproducibility, safety, and control of variables. The design must account for the flammable nature of butane and the need to precisely control temperature and pressure conditions. The experiment should also employ calibrated instruments to accurately measure boiling points. The key takeaway is that while hydrogen bonding in propanol results in a higher boiling point, designing an experiment to compare such properties requires careful handling of potential hazards and control over extraneous factors.",
    "topic": "Experimental design for boiling point determination",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen354"
  },
  {
    "question_text": "Consider the effect of increasing carbon chain length on the boiling points of alcohols and hydrocarbons. How would you expect the boiling point difference between analogous alcohols and alkanes to change with longer chains?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "As the carbon chain length increases, both alcohols and alkanes show higher boiling points due to increased dispersion forces. However, the alcohols continue to benefit from hydrogen bonding due to their -OH groups. Therefore, while both types of compounds will have increased boiling points with longer chains, the boiling point difference between the alcohol and its analogous alkane is likely to remain significant or even increase due to the continual contribution of hydrogen bonding in alcohols, whereas alkanes only gain relatively weaker dispersion interactions.",
    "explanation": "Longer carbon chains increase molecular surface area and polarizability, leading to stronger van der Waals forces. In alcohols, the additional chain length adds to the dispersion forces on top of the hydrogen bonding, while alkanes only benefit from the former. Consequently, the hydrogen bonding in alcohols provides an extra boost in boiling point that is not matched by alkanes, maintaining or widening the boiling point gap as chain length increases.",
    "topic": "Effect of chain length on boiling point",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen355"
  },
  {
    "question_text": "True or False: Propanol has a higher boiling point than butane solely because of its greater molecular mass.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The higher boiling point of propanol is not mainly due to its molecular mass but is primarily attributable to the hydrogen bonding conferred by its -OH group, which is absent in butane.",
    "topic": "Factors affecting boiling point",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen356"
  },
  {
    "question_text": "True or False: Butane exhibits dipole-dipole interactions similar to propanol.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Butane is a nonpolar molecule and does not exhibit dipole-dipole interactions. It only experiences dispersion forces, whereas propanol is polar and can exhibit dipole-dipole, as well as hydrogen bonding.",
    "topic": "Intermolecular forces",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen357"
  },
  {
    "question_text": "Given that the boiling point of butane is approximately -1 °C and that of propanol is 97 °C, calculate the boiling point difference. Explain why this numerical difference is significant in the context of intermolecular forces.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The boiling point difference is 98 °C. This large difference is significant because it highlights the effect of strong hydrogen bonding in propanol compared to the weak dispersion forces in butane.",
    "explanation": "Calculation: 97 °C - (-1 °C) = 98 °C. The large numerical difference is a direct result of the strong hydrogen bonds present in propanol, which require much more energy to overcome at the boiling point, unlike the weak dispersion forces in butane.",
    "topic": "Boiling point difference calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen358"
  },
  {
    "question_text": "If the enthalpy of vaporization for butane is 15 kJ/mol and for propanol is 35 kJ/mol, calculate the difference in energy required to vaporize one mole of each substance. What does this tell you about the intermolecular forces in both substances?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The difference in energy is 20 kJ/mol, which indicates that propanol has significantly stronger intermolecular forces (due to hydrogen bonding) compared to butane.",
    "explanation": "Calculation: 35 kJ/mol - 15 kJ/mol = 20 kJ/mol. The higher value for propanol reflects the additional energy needed to overcome hydrogen bonding in addition to dispersion forces, unlike butane which only requires energy to overcome weak dispersion forces.",
    "topic": "Enthalpy of vaporization and intermolecular forces",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen359"
  },
  {
    "question_text": "Suppose the vapor pressure of a liquid is related to its enthalpy of vaporization by the Clausius-Clapeyron equation. If propanol has a significantly higher enthalpy of vaporization than butane, describe qualitatively how their vapor pressures compare at the same temperature.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Propanol will have a lower vapor pressure compared to butane at the same temperature because its higher enthalpy of vaporization means that fewer molecules have enough energy to escape into the vapor phase.",
    "explanation": "According to the Clausius-Clapeyron equation, a higher enthalpy of vaporization results in a lower vapor pressure at a given temperature because more energy is required for molecules to transition from the liquid phase to the vapor phase. Thus, propanol, with its strong hydrogen bonding, has a lower vapor pressure than butane.",
    "topic": "Clausius-Clapeyron relationship",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen360"
  },
  {
    "question_text": "If you are given a sample of an unknown organic compound with a boiling point of 95 °C and you suspect it either contains an -OH group or is a hydrocarbon similar to butane, outline a procedure using boiling point measurement and explain your reasoning.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Measure the boiling point of the compound under controlled atmospheric conditions. If the boiling point is closer to 95 °C, similar to propanol, and significantly higher than that of typical hydrocarbons like butane, it suggests the compound may contain an -OH group that leads to hydrogen bonding. Additionally, you may further analyze the sample using spectroscopic methods to confirm the presence of the -OH functional group.",
    "explanation": "The boiling point provides primary evidence of the types of intermolecular forces at play. Since alcohols with -OH groups typically have higher boiling points due to hydrogen bonding (e.g., propanol at around 97 °C) compared to nonpolar hydrocarbons like butane (-1 °C), matching the observed boiling point with known values helps identify the nature of the compound. Supplemental spectroscopic analysis (like IR spectroscopy) can detect the O-H stretching vibration, providing further confirmation.",
    "topic": "Boiling point measurement and compound identification",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen361"
  },
  {
    "question_text": "A laboratory experiment measures the boiling point of propanol to be 97 °C. If an experimental error of ±2 °C is present, what is the range of enthalpy of vaporization you might expect for propanol compared to a standard value of 35 kJ/mol, assuming a direct proportional relationship between boiling point and enthalpy of vaporization?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "If a ±2 °C change corresponds proportionally to the standard 35 kJ/mol, the enthalpy of vaporization could vary by approximately ±(2/97)*35 kJ/mol ≈ ±0.72 kJ/mol, giving a range of about 34.3 kJ/mol to 35.7 kJ/mol.",
    "explanation": "Assuming a direct proportionality, the fractional change in boiling point due to error is 2/97. Multiplying the standard enthalpy value by this fraction gives the variation: (2/97)*35 kJ/mol ≈ 0.72 kJ/mol. Thus, the experimental enthalpy of vaporization can be estimated to lie between 35 - 0.72 and 35 + 0.72 kJ/mol.",
    "topic": "Error analysis in boiling point experiments",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech202",
    "section_id": "26_section_7_4",
    "question_id": "cbse_xii_lech2dd_c202_gen362"
  }
]