[
  {
    "question_text": "A ray of light traveling in air enters obliquely into water. Does the light ray bend towards the normal or away from the normal? Why?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The light ray bends towards the normal because water is optically denser than air, causing the light to slow down and change direction towards the normal upon entering water.",
    "explanation": "When light travels from a rarer medium (air) to a denser medium (water), it slows down due to the higher refractive index of water (n ≈ 1.33) compared to air (n ≈ 1.00). According to Snell's Law, n₁ sin θ₁ = n₂ sin θ₂, where n₁ < n₂, thus θ₂ < θ₁. This results in the light ray bending towards the normal.",
    "topic": "Refraction of Light",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Light enters from air to glass having a refractive index of 1.50. What is the speed of light in the glass? The speed of light in a vacuum is 3 × 10⁸ m/s.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The speed of light in the glass is 2.00 × 10⁸ m/s.",
    "explanation": "Using the formula for refractive index: \n\nn = c / v\n\nWhere:\n- n = 1.50\n- c = 3 × 10⁸ m/s (speed of light in vacuum)\n\nSolving for v:\n\nv = c / n = 3 × 10⁸ m/s / 1.50 = 2.00 × 10⁸ m/s",
    "topic": "Refractive Index",
    "bloom_level": "Apply"
  },
  {
    "question_text": "From Table 9.3, identify the medium having the highest optical density. Also, find the medium with the lowest optical density.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Diamond has the highest optical density with a refractive index of 2.42, and air has the lowest optical density with a refractive index of 1.0003.",
    "explanation": "Optical density is directly related to the refractive index of a medium. By examining Table 9.3, Diamond has the highest refractive index of 2.42, making it the medium with the highest optical density. Air, with a refractive index of 1.0003, has the lowest optical density among the listed materials.",
    "topic": "Refractive Index and Optical Density",
    "bloom_level": "Remember"
  },
  {
    "question_text": "You are given kerosene, turpentine, and water. In which of these does the light travel fastest? Use the information given in Table 9.3.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Light travels fastest in water.",
    "explanation": "The speed of light in a medium is inversely proportional to its refractive index (v = c/n). From Table 9.3:\n- Water has a refractive index n = 1.33 \n- Kerosene has n = 1.44 \n- Turpentine oil has n = 1.47 \n\nSince water has the lowest refractive index among the three, light travels fastest in water.",
    "topic": "Refractive Index and Speed of Light in Media",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "The refractive index of diamond is 2.42. What is the meaning of this statement?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "It means that the speed of light in diamond is (c / 2.42), where c is the speed of light in a vacuum. Specifically, the speed of light in diamond is approximately (1.24 × 10⁸) m/s.",
    "explanation": "The refractive index n is defined as the ratio of the speed of light in a vacuum (c) to its speed in the medium (v). Mathematically,\n\nn = (c / v)\n\nGiven n = 2.42 for diamond:\n\nv = (c / n) = (3 × 10⁸ m/s) / 2.42 ≈ 1.24 × 10⁸ m/s\n\nThus, light travels at approximately (1.24 × 10⁸) m/s in diamond.",
    "topic": "Refractive Index",
    "bloom_level": "Understand"
  }
]