[
  {
    "question_text": "Which refractive error is characterized by the inability to clearly see distant objects?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Myopia",
      "B) Hypermetropia",
      "C) Presbyopia",
      "D) Astigmatism"
    ],
    "correct_answer": "A) Myopia",
    "explanation": "Myopia, or near-sightedness, is when a person sees nearby objects clearly but distant objects appear blurred because the far point is nearer than infinity.",
    "topic": "Myopia",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen015"
  },
  {
    "question_text": "Which type of lens is used to correct myopia, and why?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Convex lens because it converges rays",
      "B) Concave lens because it diverges rays",
      "C) Bifocal lens because it has both types",
      "D) No lens is needed"
    ],
    "correct_answer": "B) Concave lens because it diverges rays",
    "explanation": "A concave lens helps to diverge the incoming parallel rays so that the image is shifted back onto the retina in a myopic eye.",
    "topic": "Refractive Corrections",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen016"
  },
  {
    "question_text": "What is the main corrective lens used for hypermetropia and what does it do?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Concave lens, which diverges light",
      "B) Convex lens, which converges light",
      "C) Plano lens, which doesn’t alter light",
      "D) Cylindrical lens, which corrects astigmatism"
    ],
    "correct_answer": "B) Convex lens, which converges light",
    "explanation": "Hypermetropia (far-sightedness) is corrected with a convex lens that converges the light rays, helping to form a clear image on the retina.",
    "topic": "Hypermetropia",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen017"
  },
  {
    "question_text": "Bifocal lenses combine two types of lenses. Which of the following best describes their function?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) The entire lens is convex to correct hypermetropia only.",
      "B) The upper part is concave for distant vision and the lower is convex for near vision.",
      "C) The upper part is convex and the lower part is concave.",
      "D) They alternately switch between concave and convex properties."
    ],
    "correct_answer": "B) The upper part is concave for distant vision and the lower is convex for near vision.",
    "explanation": "Bifocal lenses are designed so that the upper segment (concave) corrects myopia (distant vision) and the lower segment (convex) aids in near vision, accommodating combined visual defects.",
    "topic": "Corrective Lenses",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen018"
  },
  {
    "question_text": "Define presbyopia and explain its primary cause.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Presbyopia is a defect associated with aging, where the eye's power of accommodation decreases, making it difficult to see nearby objects. The primary cause is the weakening of the ciliary muscles and loss of flexibility in the eye lens.",
    "explanation": "As people age, the ciliary muscles become weaker and the lens loses its elasticity, causing the near point to recede and making near vision less distinct.",
    "topic": "Presbyopia",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen019"
  },
  {
    "question_text": "What are the main factors that can lead to myopia?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The main factors that can lead to myopia include an excessive curvature of the eye lens or an elongation of the eyeball.",
    "explanation": "Both an increased curvature of the lens and an elongated eyeball cause the image of distant objects to be focused in front of the retina, leading to near-sightedness.",
    "topic": "Myopia",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen020"
  },
  {
    "question_text": "Explain how a convex lens corrects hypermetropia.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A convex lens converges light rays coming from a close object so that the eye's lens can focus them properly onto the retina rather than behind it, thereby correcting hypermetropia.",
    "explanation": "In hypermetropia, the light rays from a near object are focused behind the retina. The converging action of a convex lens reduces the focal length effectively, ensuring the image is formed on the retina.",
    "topic": "Hypermetropia",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen021"
  },
  {
    "question_text": "Describe the role of eye banks in the donation process and list at least two eligibility criteria for an eye donor.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Eye banks collect, evaluate, and distribute donated eyes according to strict medical standards. Eligibility criteria for an eye donor include that the donor can be of any age or sex, can be a spectacle user or have undergone cataract surgery, and must not have communicable diseases such as AIDS, Hepatitis, or rabies.",
    "explanation": "Eye banks ensure that the donated eyes are suitable for transplant by following precise evaluation procedures. They accept donations from a wide range of individuals, provided they do not have contraindicated diseases.",
    "topic": "Eye Donation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen022"
  },
  {
    "question_text": "Compare and contrast myopia, hypermetropia, and presbyopia in terms of the position of the image formed relative to the retina and the corrective lenses used.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Myopia is characterized by the image of a distant object being formed in front of the retina and is corrected with a concave lens. Hypermetropia occurs when the image of a near object forms behind the retina, requiring a convex lens for correction. Presbyopia is an age-related reduction in the eye's accommodation power, causing difficulty with near vision due to the weakening of the ciliary muscles and diminished lens flexibility, and is also corrected using convex lenses or bifocal lenses when combined with other defects.",
    "explanation": "Each refractive defect has a unique mechanism: Myopia has a shortened focal distance leading to a closer far point; hypermetropia has a lengthened focal distance leading to a receded near point; and presbyopia is due to reduced lens flexibility with age. The corresponding corrective measures involve diverging rays in myopia using concave lenses, converging rays in hypermetropia with convex lenses, and sometimes a combination for presbyopia.",
    "topic": "Refractive Defects",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen023"
  },
  {
    "question_text": "Explain the working principle of corrective lenses for refractive errors and discuss the real-world impact of such corrections in daily life.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Corrective lenses work on the principle of refraction, which is the bending of light rays when they pass through materials of different refractive indices. In refractive errors like myopia and hypermetropia, the image of an object is formed either in front of or behind the retina due to the eye's shape or lens curvature. A concave lens in myopia diverges incoming light rays, moving the image formation onto the retina, while a convex lens in hypermetropia converges the diverging rays so they focus correctly. In daily life, these corrections allow individuals to see clearly, thereby enhancing quality of life, productivity, and school or work performance, and reducing accidents due to poor vision.",
    "explanation": "The corrective lens adjusts the path of light before it reaches the eye, thereby compensating for the abnormal focusing power of the defective eye. This principle continues to have wide applications, including modern contact lenses and surgical interventions, ultimately contributing significantly to improved vision and overall life quality.",
    "topic": "Corrective Lenses & Real-World Impact",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen024"
  },
  {
    "question_text": "True or False: In myopia, the far point is at infinity, which is why distant objects appear clear.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. In myopia, the far point is much closer than infinity.",
    "explanation": "In a myopic eye, the far point is located at a finite distance rather than at infinity, causing distant objects to be blurry.",
    "topic": "Myopia",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen025"
  },
  {
    "question_text": "True or False: A convex lens would be ineffective for correcting hypermetropia because it further moves the near point away from the eye. If false, provide the correct explanation.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. A convex lens is effective because it converges the rays from a near object, moving the image from behind the retina onto it.",
    "explanation": "A convex lens adds the necessary converging power to shorten the effective focal length, thus helping the hypermetropic eye focus properly on close objects.",
    "topic": "Hypermetropia",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen026"
  },
  {
    "question_text": "True or False: The donated eyes must be removed within 4-6 hours after death, and individuals with certain communicable diseases such as Hepatitis B or C are eligible donors. If false, provide the correct eligibility criteria.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. While the eyes must indeed be removed within 4-6 hours after death, individuals with communicable diseases such as Hepatitis B or C are NOT eligible donors.",
    "explanation": "Donated eyes must be harvested quickly (within 4-6 hours after death) to ensure viability, and donors with diseases like Hepatitis B, C, AIDS, and other specified infections are excluded to prevent transmission.",
    "topic": "Eye Donation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_x_jesc1dd_c110_gen027"
  }
]