[
  {
    "question_text": "1. What is the pattern of the magnetic field lines around a current-carrying straight conductor?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Straight lines",
      "B. Concentric circles",
      "C. Spirals",
      "D. Random curves"
    ],
    "correct_answer": "B. Concentric circles",
    "explanation": "When a current flows through a straight conductor, the resulting magnetic field forms concentric circles around the wire, as demonstrated by the experiment with iron filings.",
    "topic": "Magnetic Field Patterns",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen012"
  },
  {
    "question_text": "2. Which rule helps determine the direction of the magnetic field around a current-carrying conductor?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Left-hand rule",
      "B. Fleming’s left-hand rule",
      "C. Right-hand thumb rule",
      "D. Ampere's loop rule"
    ],
    "correct_answer": "C. Right-hand thumb rule",
    "explanation": "The right-hand thumb rule is used to determine the direction of the magnetic field around a straight conductor. Pointing the thumb in the direction of current, the curl of the fingers indicates the direction of the magnetic field.",
    "topic": "Right-Hand Thumb Rule",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen013"
  },
  {
    "question_text": "3. What happens to the magnetic field strength as you move further away from a current-carrying conductor?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. It increases",
      "B. It decreases",
      "C. It remains constant",
      "D. It first increases then decreases"
    ],
    "correct_answer": "B. It decreases",
    "explanation": "The magnetic field strength is inversely proportional to the distance from the wire. Therefore, as the distance increases, the strength of the magnetic field decreases.",
    "topic": "Magnetic Field Strength",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen014"
  },
  {
    "question_text": "4. What is the effect on the magnetic field when the current direction in a straight conductor is reversed?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. The magnetic field disappears",
      "B. The magnetic field strength doubles",
      "C. The magnetic field direction reverses",
      "D. The magnetic field becomes weaker"
    ],
    "correct_answer": "C. The magnetic field direction reverses",
    "explanation": "Reversing the current reverses the direction of the magnetic field as demonstrated by a reversal in the deflection of the compass needle in the experiment.",
    "topic": "Magnetic Field Reversal",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen015"
  },
  {
    "question_text": "5. Explain how iron filings are used to visualize the magnetic field around a current-carrying conductor.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Iron filings, when sprinkled on a sheet placed around a current-carrying conductor, align along the magnetic field lines. Tapping the sheet helps the filings assume the pattern of concentric circles, which represent the magnetic field around the wire.",
    "explanation": "The iron filings are induced by the magnetic field to align themselves along the magnetic field lines, making it possible to see the otherwise invisible field. This visual representation confirms that the magnetic field is circular around the conductor.",
    "topic": "Visualization of Magnetic Fields",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen016"
  },
  {
    "question_text": "6. What does the right-hand thumb rule indicate about the relationship between the direction of current and the magnetic field?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The right-hand thumb rule indicates that if you orient your right thumb in the direction of the current, your fingers will curl in the direction of the magnetic field lines. Thus, the orientation of the magnetic field is directly dependent on the direction in which the current flows.",
    "explanation": "This rule provides an easy method to visualize the three-dimensional nature of the magnetic field around a conductor, where the thumb points towards the current and the curled fingers represent the field direction.",
    "topic": "Right-Hand Thumb Rule",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen017"
  },
  {
    "question_text": "7. Define the relationship between the magnitude of current in a conductor and the strength of its magnetic field as observed using a compass.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The strength of the magnetic field increases with an increase in current. This is observed as a larger deflection in the compass needle when the current in the conductor increases.",
    "explanation": "Since the magnetic field is directly proportional to the current, increasing the current results in a stronger magnetic field, which in turn produces a greater force on the compass needle, causing it to deflect further.",
    "topic": "Magnetic Field Strength",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen018"
  },
  {
    "question_text": "8. Describe the experimental setup used in Activity 12.5 to investigate the magnetic field created by a current through a straight conductor. Discuss how varying the current and moving the compass affect the observed magnetic field pattern.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The setup involves a battery (12 V), variable resistance (rheostat), an ammeter, a plug key, and a long straight thick copper wire inserted through the center of a fixed rectangular cardboard sheet. Iron filings are sprinkled on the cardboard to visualize the magnetic field. When current flows through the wire, the filings align in concentric circles. Increasing the current (via the rheostat) makes the circles clearer and extends the magnetic field pattern, indicating a stronger field. Moving the compass further from the wire shows reduced deflection, demonstrating that the field strength decreases with distance.",
    "explanation": "This experiment illustrates that a straight current-carrying conductor produces a circular magnetic field. The variation in current alters the magnetic field strength, and the distance effect is evident by the changing deflection of the compass needle. This reinforces the concept of both direct proportionality with current and inverse relation with distance.",
    "topic": "Experimental Analysis of Magnetic Fields",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen019"
  },
  {
    "question_text": "9. Using the right-hand thumb rule, analyze and explain the directions of the magnetic field at points located directly above and below a horizontal conductor carrying current from east to west.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For a horizontal conductor carrying current from east to west, using the right-hand thumb rule, point your thumb towards the west (direction of current). At a point directly above the wire, the fingers will curl such that the magnetic field points towards the north. At a point directly below the wire, the curl of the fingers leads to a magnetic field pointing towards the south. This analysis is valid when considering the perspective from the ends of the conductor.",
    "explanation": "The right-hand thumb rule effectively links the orientation of current to the circular magnetic field surrounding the conductor. By aligning the thumb with the direction of current and examining the curl of the fingers, one can deduce the directions of the magnetic field at various points relative to the wire's position. This helps in analytical reasoning, especially when determining field directions in practical applications.",
    "topic": "Application of Right-Hand Thumb Rule",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen020"
  },
  {
    "question_text": "10. True/False: Increasing the battery voltage in the experimental setup will result in a more pronounced pattern of iron filings, indicating a stronger magnetic field. If false, correct the statement.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Increasing the battery voltage typically increases the current through the conductor, which in turn increases the magnetic field strength, making the pattern of iron filings more distinct.",
    "topic": "Relationship Between Voltage, Current, and Magnetic Field",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen021"
  },
  {
    "question_text": "11. True/False: Reversing the battery connections in a circuit does not affect the direction of the magnetic field produced by a current-carrying conductor. If false, state the correct outcome.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. Reversing the battery connections reverses the direction of the current, which in turn reverses the direction of the magnetic field.",
    "explanation": "The direction of the magnetic field is intrinsically linked to the direction of the current. Changing the orientation of the power supply reverses the current flow and the magnetic field's direction.",
    "topic": "Magnetic Field Direction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen022"
  },
  {
    "question_text": "12. True/False: The magnetic field lines around a current-carrying conductor are always perpendicular to the direction of the current flow.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The magnetic field produced by a current-carrying wire forms circular loops which lie in planes perpendicular to the direction of the current. Hence, at every point on these loops, the field is tangent to the circle and perpendicular to the wire.",
    "topic": "Spatial Orientation of Magnetic Fields",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen023"
  },
  {
    "question_text": "13. Which of the following statements about the magnetic field around a straight conductor carrying a constant current is NOT true?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. The field lines form concentric circles around the wire.",
      "B. The magnetic field becomes weaker as the distance from the wire increases.",
      "C. Reversing the current reverses the direction of the magnetic field.",
      "D. Increasing the current does not change the strength of the magnetic field."
    ],
    "correct_answer": "D. Increasing the current does not change the strength of the magnetic field.",
    "explanation": "This statement is incorrect because the strength of the magnetic field is directly proportional to the current. Therefore, increasing the current results in a stronger magnetic field.",
    "topic": "Magnetic Field Dependence on Current",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_x_jesc1dd_c112_gen024"
  }
]