[
  {
    "question_text": "Which of the following circuit diagram symbols represents an electric cell?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "(+) ----| |---- (-)",
      "----( )----",
      "----(X)----",
      "----[/\\/\\]----"
    ],
    "correct_answer": "(+) ----| |---- (-)",
    "explanation": "The symbol for an electric cell is conventionally drawn as '(+) ----| |---- (-)', which shows the positive and negative terminals separated by the cell symbol.",
    "topic": "Circuit Diagram Symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen027"
  },
  {
    "question_text": "In a circuit diagram, what symbol is used to represent a closed plug key (or switch)?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "----( )----",
      "----(.)----",
      "----/ ----",
      "----\\----"
    ],
    "correct_answer": "----(.)----",
    "explanation": "A closed plug key (or switch) is generally represented by the symbol with a dot, for example, '----(.)----'.",
    "topic": "Circuit Diagram Symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen028"
  },
  {
    "question_text": "Which circuit diagram symbol denotes a resistor?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "----(V)----",
      "----[/\\/\\/\\/\\]----",
      "----(A)----",
      "----(X)----"
    ],
    "correct_answer": "----[/\\/\\/\\/\\]----",
    "explanation": "The resistor is depicted as a zig-zag line '----[/\\/\\/\\/\\]----', which is the conventional symbol for a resistor in most schematic diagrams.",
    "topic": "Circuit Diagram Symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen029"
  },
  {
    "question_text": "Identify the correct symbol for a voltmeter in a circuit diagram.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "----(A)----",
      "----(V)----",
      "----(X)----",
      "----[/\\/\\/\\/\\]----"
    ],
    "correct_answer": "----(V)----",
    "explanation": "A voltmeter, which measures the electrical potential difference, is depicted as '----(V)----' in circuit diagrams.",
    "topic": "Circuit Diagram Symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen030"
  },
  {
    "question_text": "Define a circuit diagram and explain its usefulness in understanding electrical circuits.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A circuit diagram is a schematic representation of an electrical circuit where different components are represented by standardized symbols. It is useful because it provides a clear, simplified, and standardized way to understand, analyze and build electrical circuits.",
    "explanation": "Circuit diagrams use symbols to represent the battery, switch, resistors, and other components, making it easier to follow the circuit layout and understand the flow of electricity.",
    "topic": "Circuit Diagrams",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen031"
  },
  {
    "question_text": "What are the main components of an electric circuit as presented in the section, and what is the role of each component?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The main components of an electric circuit are the cell or battery (provides the electromotive force), the plug key or switch (opens or closes the circuit), the electrical component(s) such as bulbs or resistors (perform specific functions like lighting or resisting current), and the connecting wires (provide a conduction path for electric current).",
    "explanation": "Understanding the role of each element is crucial for circuit analysis. The cell supplies power, the switch controls the circuit operation, the components use the electrical energy, and wires complete the circuit by providing a conductive pathway.",
    "topic": "Circuit Components",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen032"
  },
  {
    "question_text": "Explain the difference between a plug key in its open state and its closed state, including how each is represented in circuit diagrams.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A plug key in its open state indicates that the circuit is not complete, and it is represented as '----( )----' or '----/ ----'. In contrast, a closed plug key indicates that the circuit is complete, allowing current to flow, and it is depicted as '----(.)----' or '----\\----'.",
    "explanation": "The difference is important because only when the circuit is complete (closed) does the current flow and the circuit function. The symbols are intentionally distinct to avoid confusion in circuit analysis.",
    "topic": "Circuit Diagrams",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen033"
  },
  {
    "question_text": "How is a variable resistor or rheostat represented in circuit diagrams, and why might such a component be used over a fixed resistor?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A variable resistor or rheostat is represented with a zig-zag resistor symbol combined with an arrow (e.g., '----[/\\/\\/\\/\\]---->----' or '----[/\\/\\/\\/\\]---^----'). Such components are used instead of fixed resistors when there is a need to adjust the resistance in a circuit, allowing fine control over current flow.",
    "explanation": "The arrow indicates that the resistance can be varied. This adjustability is useful in applications like dimming lights, motor speed control, and tuning circuits.",
    "topic": "Circuit Components",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen034"
  },
  {
    "question_text": "Discuss the importance of using standardized symbols in circuit diagrams, including how they contribute to effective communication and troubleshooting in electronics.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Standardized symbols provide a common language for engineers, technicians, and students to communicate circuit designs without ambiguity. They allow for quick interpretation, facilitate troubleshooting, and ease the learning process. Standard symbols also enable the creation and sharing of technical documentation that is universally understood.",
    "explanation": "Using standard symbols simplifies the process of designing, analyzing, and repairing circuits by reducing the possibility of errors and misinterpretation. This uniformity in representation improves clarity, efficiency, and collaboration in electronic work.",
    "topic": "Circuit Diagrams",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen035"
  },
  {
    "question_text": "Describe the process of constructing a simple circuit diagram that includes a cell, a switch (closed), an electric bulb, and connecting wires. Explain the function of each symbol used.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "To construct a simple circuit diagram, first draw the symbol for the cell '(+) ----| |---- (-)' to represent the power source. Next, add the symbol '----(.)----' for a closed switch to show that the circuit is complete. Then, include the electric bulb symbol ('----(X)----' or a loop symbol) to indicate the lamp in the circuit. Finally, draw lines between these components to represent the connecting wires. Each symbol directly correlates to a physical component that provides power, controls the circuit operation, lights the bulb, and connects all parts to allow current flow.",
    "explanation": "This process demonstrates an understanding of how schematic diagrams translate into real-world circuits. Each standard symbol is chosen for its clarity and to ensure that the representation is easily understandable, facilitating construction, analysis, and troubleshooting.",
    "topic": "Circuit Diagram Construction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen036"
  },
  {
    "question_text": "Analyze a given circuit diagram (assume it includes a battery, a closed switch, a resistor, and a voltmeter) and explain how the components interact to measure voltage across the resistor.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In the circuit, the battery provides the electromotive force that pushes the current through the resistor. The closed switch ensures the circuit is complete and allows current to flow. The resistor restricts the current, causing a voltage drop across it. The voltmeter, connected in parallel with the resistor, measures this voltage drop. The reading on the voltmeter reflects the potential difference caused by the resistor's opposition to current flow, as described by Ohm's law.",
    "explanation": "By carefully assessing the diagram, one can understand the role and interaction of each component. The battery supplies energy, the switch controls current flow, the resistor creates a measurable voltage drop, and the voltmeter accurately displays this drop. This analysis is foundational to circuit design and diagnostics in electrical engineering.",
    "topic": "Circuit Analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen037"
  },
  {
    "question_text": "The symbol '----┼----' in a circuit diagram represents wires crossing without joining. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The symbol '----┼----' denotes that the wires cross each other but do not make an electrical connection. This notation is crucial for avoiding misinterpretation in circuit diagrams.",
    "topic": "Circuit Diagram Symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen038"
  },
  {
    "question_text": "The symbol '----*----' represents a connection point or a wire joint in the circuit. True or False? If false, provide the correction.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "It is true that '----*----' is the symbol used to indicate a wire joint, meaning that the wires are connected at that point. This is important for understanding circuit paths and connections.",
    "topic": "Circuit Diagram Symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen039"
  },
  {
    "question_text": "The symbol for a battery is identical to that of an electric cell in a circuit diagram. True or False? If false, explain the difference.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False. While the electric cell is represented by '(+) ----| |---- (-)', a battery or combination of cells is represented by '(+) ----| |-| |---- (-)'. The difference is that a battery symbol shows more than one cell in combination to provide greater voltage or capacity.",
    "explanation": "The battery symbol explicitly indicates multiple cells connected together, often signifying higher energy output, whereas an electric cell is a single power source. This distinction is essential in understanding the design and functionality of circuits.",
    "topic": "Circuit Diagram Symbols",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc111",
    "section_id": "06_section_11_3",
    "question_id": "cbse_x_jesc1dd_c111_gen040"
  }
]