[
  {
    "question_text": "How does binary fission differ from multiple fission?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Binary fission is the process where a parent cell divides into two daughter cells, as seen in organisms like Amoeba and Leishmania. In contrast, multiple fission involves the nucleus dividing repeatedly to form several nuclei first, followed by the partitioning of the cytoplasm around each nucleus, resulting in many daughter cells being produced simultaneously—for example, in Plasmodium.",
    "explanation": "In binary fission, the division is usually symmetric, with the parent cell splitting into two nearly identical daughter cells. This process involves replication of DNA, elongation of the nucleus, and subsequent cytokinesis. Multiple fission, on the other hand, includes multiple rounds of nuclear division before cytoplasmic division, making it possible to produce many offspring at once. These differences highlight how unicellular organisms adapt their division mechanism to suit their lifestyle and environmental conditions.",
    "topic": "Modes of Reproduction; Fission",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic003"
  },
  {
    "question_text": "How will an organism be benefited if it reproduces through spores?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Reproducing through spores offers benefits such as increased survival under adverse conditions due to their thick protective walls, efficient dispersal over large areas because the spores are lightweight, and the production of large numbers of spores that increase the chances of colonizing new, suitable habitats.",
    "explanation": "Spores are an adaptation for survival and dispersal. Their thick walls protect the genetic material from environmental stresses (extreme temperatures, dryness, etc.), and their small size allows them to be carried by wind or water, facilitating widespread distribution. This increases the likelihood that some spores will find a favorable environment to germinate and grow, ensuring the continuation of the species.",
    "topic": "Spore Formation; Reproductive Strategies",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic004"
  },
  {
    "question_text": "Can you think of reasons why more complex organisms cannot give rise to new individuals through regeneration?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Complex organisms are composed of highly differentiated cells organized into specialized tissues and organs. Successful regeneration would require the correct reassembly and patterning of these multiple cell types into fully functional organs and systems, a process that is generally beyond the regenerative capacity of such organisms.",
    "explanation": "In simple multicellular organisms, regeneration is feasible because most cells are similar and retain the ability to divide and differentiate into the needed structures. However, in complex organisms, the cells are specialized and organized into specific tissues and organs. The complex spatial and temporal coordination required to re-form functional organs makes complete regeneration from a small fragment extremely unlikely. This limitation underscores the importance of sexual reproduction for these organisms to create a complete offspring with a properly organized body plan.",
    "topic": "Regeneration and Reproduction; Tissue Differentiation",
    "bloom_level": "Analyze",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic005"
  },
  {
    "question_text": "Why is vegetative propagation practised for growing some types of plants?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Vegetative propagation is practiced because it allows for the rapid and efficient production of new plants that are genetically identical to the parent. This method is particularly useful for propagating plants that have lost the ability to produce viable seeds and for ensuring consistency in desired traits, such as fruit quality and flower color. Additionally, plants produced by vegetative propagation typically mature and produce flowers or fruits faster than seed-grown plants.",
    "explanation": "In vegetative propagation, parts of a plant such as roots, stems, or leaves can develop into new individuals. This mode of reproduction does not involve the genetic reshuffling inherent in sexual reproduction, so plants maintain the same genetic makeup as the parent. This uniformity is advantageous in agriculture and horticulture where specific traits are desired. Moreover, vegetative propagation bypasses the sometimes lengthy process of seed germination and maturation, leading to a faster turnaround in plant production.",
    "topic": "Vegetative Propagation; Plant Reproduction",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic006"
  },
  {
    "question_text": "Why is DNA copying an essential part of the process of reproduction?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "DNA copying is essential to reproduction because it ensures that the genetic blueprint which determines the characteristics and functions of an organism is accurately transmitted to its offspring. Without the precise replication of DNA, the preservation of growth, development, and the maintenance of species-specific traits would be compromised.",
    "explanation": "The process of DNA replication is fundamental to both cellular reproduction and the maintenance of life processes. During reproduction, whether it is asexual or sexual, a consistent and accurate copy of the DNA is required so that the offspring inherits the necessary genetic information to develop properly. Faulty replication could lead to mutations, some of which may be lethal or could disrupt the normal functioning of the organism. This accurate copying mechanism is thus critical for ensuring stability and continuity of life.",
    "topic": "DNA Replication; Genetic Inheritance",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic007"
  },
  {
    "question_text": "Which molecule, found in the cell nucleus, contains the genetic blueprint for an organism and is responsible for inheritance of traits?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Protein",
      "B. Lipid",
      "C. Carbohydrate",
      "D. DNA"
    ],
    "correct_answer": "D. DNA. The correct answer is DNA because it houses the genetic information used for protein synthesis and determining body design.",
    "explanation": "DNA (Deoxyribonucleic Acid) contains the information for making proteins, which in turn determine an organism's structure and functions. This genetic material is passed from parent to offspring during reproduction.",
    "topic": "Genetic Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen001"
  },
  {
    "question_text": "During the process of DNA replication in a reproducing cell, why are the resulting cells not absolutely identical?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Because the cellular apparatus differs completely between cells",
      "B. Because the DNA replication process can introduce small errors or variations",
      "C. Because the mother cell intentionally creates diverse cells",
      "D. Because environmental factors directly change the DNA during division"
    ],
    "correct_answer": "B. Because the DNA replication process can introduce small errors or variations. Slight imperfections in biochemical reactions lead to subtle differences.",
    "explanation": "Though cells mostly copy their DNA accurately, the chemical reactions involved are not perfect. This leads to minor variations that result in daughter cells having slight differences compared to the parent cell.",
    "topic": "DNA Replication & Variation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen002"
  },
  {
    "question_text": "In a reproducing cell, which step is most likely responsible for introducing variations between the two daughter cells?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. The assembly of the cellular apparatus",
      "B. The process of copying the DNA",
      "C. The physical separation of the two copies",
      "D. The initial stage of cell growth"
    ],
    "correct_answer": "B. The process of copying the DNA. Errors during DNA replication can introduce variations that lead to differences between daughter cells.",
    "explanation": "DNA replication involves complex biochemical reactions that are not 100% error-free. These errors are the primary source of genetic variation between daughter cells.",
    "topic": "DNA Replication & Variation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen003"
  },
  {
    "question_text": "Why is the slight variation introduced during reproduction important in the context of evolution?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It always leads to non-functional cells.",
      "B. It is detrimental to the survival of the species.",
      "C. It provides diversity that may allow individuals to adapt to environmental changes.",
      "D. It disrupts the established body plans of organisms."
    ],
    "correct_answer": "C. It provides diversity that may allow individuals to adapt to environmental changes. Variation is key to the evolutionary process as it aids adaptation.",
    "explanation": "Genetic variations—even when they are subtle—can result in some individuals having traits that enhance their survival in a changing environment, thus contributing to evolution over generations.",
    "topic": "Evolution & Adaptation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen004"
  },
  {
    "question_text": "Define cellular reproduction in terms of DNA replication and cell division.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Cellular reproduction is the process by which a cell duplicates its DNA through chemical reactions and then divides to form two new cells, each receiving a complete set of DNA along with its own cellular apparatus.",
    "explanation": "In reproduction, DNA serves as the blueprint for building the cell, and for life to continue, each daughter cell must inherit a complete copy of these instructions along with the necessary cellular machinery.",
    "topic": "Cell Division & Reproduction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen005"
  },
  {
    "question_text": "Explain what role DNA replication errors play in evolution.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "DNA replication errors introduce slight variations in the genetic material during cell division. While many errors may have no effect or be harmful, some can provide advantageous traits that contribute to evolution by allowing organisms to better adapt to their environment.",
    "explanation": "These mutations or variations in the DNA can lead to changes in protein production, which might alter physical traits and improve an organism’s chance of survival under changing environmental conditions.",
    "topic": "DNA Replication & Mutation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen006"
  },
  {
    "question_text": "What is a niche, and how does genetic variation help organisms thrive within their niches?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A niche is the specific role or environment an organism occupies in an ecosystem. Genetic variation provides differences in traits among individuals, so when environmental conditions change, some variants may be better suited to survive and reproduce in that specific niche.",
    "explanation": "Genetic diversity ensures that some members of a population may possess traits that give them an advantage if their environment or niche undergoes significant changes, thereby aiding survival and continuity.",
    "topic": "Ecology & Evolution",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen007"
  },
  {
    "question_text": "List two reasons why a cell cannot simply push out a copy of its DNA without also forming a new cellular apparatus.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "1. The pushed-out DNA copy would lack the necessary organized cellular structures needed for life processes. 2. A complete, functioning cell requires both the DNA blueprint and the cellular machinery to support metabolic activities and maintenance.",
    "explanation": "The DNA alone cannot sustain life since it must be coupled with proteins, membranes, and other structures that form the functional unit of a living cell.",
    "topic": "Cell Structure & Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen008"
  },
  {
    "question_text": "Describe the process of DNA replication and cell division as presented in the section. In your answer, highlight the role of DNA as a blueprint for protein synthesis and the inherent possibility of errors during replication.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The process begins with chemical reactions that replicate the DNA, resulting in two copies of the genetic material within the cell. Alongside the replication of DNA, a new cellular apparatus is also created so that each daughter cell can function independently. DNA serves as the blueprint for protein synthesis, meaning that any changes in the DNA can alter the proteins produced and, consequently, the organism’s body design. Although the replication process is highly coordinated, the biochemical reactions involved are not completely error-free, allowing for slight variations between the copies. These variations, while sometimes detrimental, can be neutral or even beneficial, and are the foundation of evolutionary change.",
    "explanation": "This answer outlines that DNA replication is coupled with the creation of cellular structures and emphasizes the importance of DNA in coding for proteins. It also explains that the error-prone nature of replication introduces genetic variation, which is essential for evolution.",
    "topic": "DNA Replication & Cell Division",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen009"
  },
  {
    "question_text": "Analyze how environmental changes, such as global warming, can impact species survival through the mechanism of genetic variation. Use the example of bacteria adapting to increased water temperatures in your response.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Environmental changes like global warming can drastically alter the conditions of a niche, making it hostile to organisms that are not suited for the new conditions. In a population of bacteria adapted to temperate waters, most individuals might not survive a significant temperature rise. However, genetic variations resulting from minor errors during DNA replication could produce some bacteria with traits that confer heat resistance. These bacteria have a higher chance of surviving and reproducing in warmer conditions, leading to a shift in the population's genetic makeup—this is a clear example of natural selection driven by environmental change.",
    "explanation": "The answer explains the concept of natural selection where genetic variation within a population provides the raw material for evolution. It shows how a shift in environmental conditions, such as an increase in water temperature, can select for individuals with beneficial mutations (heat resistance), ensuring species survival.",
    "topic": "Natural Selection & Adaptation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen010"
  },
  {
    "question_text": "Explain in detail how errors during DNA replication contribute to evolution. In your answer, discuss both the beneficial and detrimental outcomes of these errors.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Errors during DNA replication create variations among daughter cells. While many errors may result in non-functional proteins leading to cell death or dysfunction, some errors can produce beneficial traits by altering protein structure in a way that improves an organism's adaptability. Beneficial mutations may offer enhanced survival traits in a changing environment, while detrimental ones are generally eliminated through natural selection. This balance between harmful and advantageous mutations is central to evolutionary processes, as it allows populations to evolve over time in response to environmental pressures.",
    "explanation": "This answer explains that the inherent inaccuracy of DNA replication is a double-edged sword—it can lead to detrimental outcomes but also produces the genetic diversity necessary for evolution. Beneficial mutations are preserved by natural selection, supporting species adaptation and evolution.",
    "topic": "Mutation & Evolution",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen011"
  },
  {
    "question_text": "Reproduction in organisms always produces cells that are exactly identical in every way to the parent cell.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. While reproduction strives to create similar cells, minor errors in DNA replication lead to subtle differences between daughter cells.",
    "explanation": "The biochemical processes involved in DNA copying are not completely error-free, which means that while the overall design is maintained, slight variations inevitably arise.",
    "topic": "DNA Replication & Cell Division",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen012"
  },
  {
    "question_text": "Variation in DNA resulting from replication errors is disadvantageous to species survival.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Although some variations can be harmful, genetic variation is crucial for adaptation and evolution, helping species survive environmental changes.",
    "explanation": "Genetic variation ensures that some individuals in a population can survive new or changing conditions. This diversity is fundamental to the process of natural selection and the long-term survival of species.",
    "topic": "Evolution & Genetic Variation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen013"
  },
  {
    "question_text": "The presence of variation in DNA copies is completely random and does not alter an organism's overall design.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False. While the occurrence of replication errors is somewhat random, these variations can affect protein synthesis and ultimately lead to changes in an organism's body design and function.",
    "explanation": "Variations, even if introduced randomly, can have significant effects on the proteins produced. These changes can alter the structure or function of cells, and over time, influence the evolution and adaptation of an organism.",
    "topic": "Genetics & Evolution",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "02_section_7_1",
    "question_id": "cbse_x_jesc1dd_c107_gen014"
  },
  {
    "question_text": "Which reproductive process is used by yeast as observed in Activity 7.1?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Fragmentation",
      "B. Budding",
      "C. Regeneration",
      "D. Spore formation"
    ],
    "correct_answer": "B. Budding – Yeast reproduces by budding, where a new cell develops as an outgrowth from the parent cell.",
    "explanation": "In Activity 7.1, yeast cells were seen with small outgrowths (buds) that eventually detach to form new individuals. This process is known as budding, a form of asexual reproduction.",
    "topic": "Asexual reproduction in yeast",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen015"
  },
  {
    "question_text": "In the bread mould observed in Activity 7.2, which structure is primarily responsible for reproduction?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Hyphae",
      "B. Mycelium",
      "C. Sporangia",
      "D. Buds"
    ],
    "correct_answer": "C. Sporangia – The sporangia contain spores that are released for reproduction.",
    "explanation": "The tiny blob-on-a-stick structures seen on the mould are sporangia, which produce spores. These spores are critical reproductive elements in moulds such as Rhizopus.",
    "topic": "Spore formation in mould",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen016"
  },
  {
    "question_text": "What type of cell division is depicted in amoeba during binary fission?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Mitosis with unequal cytoplasmic division",
      "B. Binary fission",
      "C. Multiple fission",
      "D. Fragmentation"
    ],
    "correct_answer": "B. Binary fission – The process involves splitting a single amoeba into two genetically identical daughter cells.",
    "explanation": "Binary fission in amoeba involves the elongation and division of the nucleus followed by cytoplasmic division, producing two nearly identical offspring.",
    "topic": "Fission in unicellular organisms",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen017"
  },
  {
    "question_text": "Which statement best describes vegetative propagation in plants?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It involves the production of genetically varied offspring through sexual reproduction.",
      "B. It requires a seed for the development of a new plant.",
      "C. It is a type of asexual reproduction where new plants develop from parts like roots and leaves.",
      "D. It only occurs in plants that cannot produce seeds."
    ],
    "correct_answer": "C. It is a type of asexual reproduction where new plants develop from parts like roots and leaves – This is characteristic of vegetative propagation.",
    "explanation": "Vegetative propagation is an asexual mode of reproduction that uses parts of a plant such as stem, root, or leaves to develop into a new plant, ensuring genetic uniformity with the parent.",
    "topic": "Vegetative propagation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen018"
  },
  {
    "question_text": "Define binary fission and give an example of an organism that reproduces using this method.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Binary fission is a form of asexual reproduction where a single cell divides into two equal halves. An example is Amoeba.",
    "explanation": "In binary fission, the nucleus divides and the cytoplasm splits to form two daughter cells. Amoeba is a classic example, as observed in the permanent slide in Activity 7.3.",
    "topic": "Fission",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen019"
  },
  {
    "question_text": "What is spore formation in mould, and why is it important for reproduction?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Spore formation involves producing spores in specialized structures called sporangia; these spores are vital for the reproduction and dispersal of the mould.",
    "explanation": "Sporangia produce spores, which are resistant structures that can be dispersed by wind or water, allowing mould such as Rhizopus to colonize new substrates. This is a key reproductive strategy for fungi.",
    "topic": "Spore formation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen020"
  },
  {
    "question_text": "Briefly explain how regeneration in organisms like Hydra differs from reproduction in plants through vegetative propagation.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Regeneration in Hydra involves the restoration of missing parts from damaged tissues, while vegetative propagation in plants involves growth from specific parts such as stems, roots, or leaves to create a new plant.",
    "explanation": "Hydra uses regenerative cells to reform a complete individual from a body fragment, whereas plants use predetermined structures (e.g., buds on a potato or stem cuttings) to produce new plants. The former is a repair mechanism while the latter is a reproductive strategy.",
    "topic": "Regeneration and vegetative propagation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen021"
  },
  {
    "question_text": "Define vegetative propagation and provide one example from the text.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Vegetative propagation is an asexual reproduction process where new plants grow from parts of the parent plant, such as roots, stems, or leaves. An example is the sprouting from the 'eyes' of a potato.",
    "explanation": "The example in Activity 7.5 demonstrates that potato pieces with an 'eye' produce fresh shoots and roots, exemplifying vegetative propagation where each new plant is genetically identical to its parent.",
    "topic": "Vegetative propagation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen022"
  },
  {
    "question_text": "Compare and contrast the mechanisms of asexual reproduction such as budding, fission, fragmentation, and regeneration in both unicellular and simple multicellular organisms. Provide examples from the given section.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Budding, fission, fragmentation, and regeneration are all forms of asexual reproduction. In unicellular organisms, such as yeast and amoeba, budding and binary fission occur, producing genetically identical daughter cells. In simple multicellular organisms like Spirogyra, fragmentation allows a broken piece to grow into a complete organism. Regeneration, seen in organisms like Hydra and Planaria, involves the reformation of an entire organism from a body part using specialist regenerative cells.",
    "explanation": "The answer outlines that budding (e.g., yeast), binary fission (e.g., amoeba), fragmentation (e.g., Spirogyra), and regeneration (e.g., Hydra) are all asexual methods. They differ mainly in the complexity of the organism and the specific mechanisms used to produce the offspring. The included examples provide a clear distinction between reproduction in unicellular versus multicellular organisms.",
    "topic": "Modes of asexual reproduction",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen023"
  },
  {
    "question_text": "Explain the process of tissue culture and discuss its advantages over propagation from seeds, including an outline of the steps involved.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Tissue culture involves isolating cells or tissues from a plant, placing them in an artificial medium where they form a callus, and then transferring this callus to another medium with specific hormones for differentiation into plantlets. Advantages over seed propagation include faster production, uniformity in the offspring, and the ability to produce disease-free plants even when seeds are not viable.",
    "explanation": "The process starts with the selection and sterilization of plant tissue, then placement in a nutrient medium to initiate cell division. After callus formation, the cells are exposed to hormones that promote root and shoot differentiation. Finally, developed plantlets are acclimatized and transferred to soil. This method also allows the propagation of plants that are difficult to grow from seeds, ensuring rapid and uniform production.",
    "topic": "Tissue culture",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen024"
  },
  {
    "question_text": "Describe the process of multiple fission in Plasmodium and analyze its significance in the propagation of malaria.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Multiple fission in Plasmodium involves the repeated division of the nucleus within a single cell, followed by the gathering of the cytoplasmic material around each nucleus to form multiple daughter cells (merozoites). This process is significant because it leads to the rapid multiplication of the parasite in the host, intensifying the infection and increasing the chances of transmission. ",
    "explanation": "The answer should detail that, unlike binary fission, multiple fission produces many daughter cells simultaneously in one cycle, thereby exponentially increasing the parasite population. The release of numerous merozoites upon rupture of the parent cell contributes to the severity of malaria by accelerating the infection process and challenging the host’s immune response.",
    "topic": "Multiple fission in Plasmodium",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen025"
  },
  {
    "question_text": "True or False: In asexual reproduction, genetic variation is high because there is extensive recombination during the process.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – Asexual reproduction produces offspring that are genetically identical to the parent because there is no meiotic recombination.",
    "explanation": "In contrast to sexual reproduction, asexual reproduction relies on mechanisms like budding, fission, or fragmentation that do not involve the mixing of genetic material, hence the genetic variation is very low.",
    "topic": "Genetic variation in asexual reproduction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen026"
  },
  {
    "question_text": "True or False: Vegetative propagation in plants always results in offspring that are genetically identical to the parent plant.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True – Vegetative propagation produces clones of the parent plant, maintaining the same genetic makeup.",
    "explanation": "Because vegetative propagation involves the growth of new plants from parts of the parent, without sexual recombination, the resulting offspring are genetically identical unless mutations occur.",
    "topic": "Vegetative propagation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen027"
  },
  {
    "question_text": "True or False: Fragmentation in multicellular organisms such as Spirogyra may lead to the formation of a complete organism because most cells are similar and capable of regeneration.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True – In simpler multicellular organisms like Spirogyra, each fragment contains cells that can grow into a full organism.",
    "explanation": "Due to the simple body organization in Spirogyra where most cells are similar and not highly differentiated, fragmentation can lead to successful regeneration of an entire organism.",
    "topic": "Fragmentation and regeneration",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "04_section_7_2",
    "question_id": "cbse_x_jesc1dd_c107_gen028"
  },
  {
    "question_text": "What is a major advantage of sexual reproduction over asexual reproduction?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Rapid and error-free DNA replication",
      "B. Increased genetic variation in the population",
      "C. Only one parent is needed",
      "D. Lower energy requirements"
    ],
    "correct_answer": "B. Increased genetic variation in the population. Explanation: Sexual reproduction combines genetic material from two parents, thereby enhancing variation.",
    "explanation": "Sexual reproduction creates new combinations of genetic traits by merging variations from two individuals, which plays a crucial role in adapting to changing environments.",
    "topic": "Sexual reproduction advantages",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen029"
  },
  {
    "question_text": "Which of the following correctly describes the functions of sepals and petals in flowering plants?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Sepals attract pollinators; petals protect the bud",
      "B. Petals attract pollinators; sepals protect the bud",
      "C. Both sepals and petals protect the bud",
      "D. Both are involved in photosynthesis only"
    ],
    "correct_answer": "B. Petals attract pollinators; sepals protect the bud. Explanation: Sepals serve as protection for the developing flower, while petals are often brightly colored to lure pollinators.",
    "explanation": "Sepals envelope and protect the bud, and petals provide visual cues to attract insects, birds, or other pollinators, enhancing the plant's reproductive success.",
    "topic": "Flower structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen030"
  },
  {
    "question_text": "What is the key difference between self-pollination and cross-pollination in flowering plants?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Self-pollination involves pollination between different flowers; cross-pollination occurs in the same flower",
      "B. Self-pollination always requires an external agent",
      "C. Cross-pollination leads to greater genetic variation than self-pollination",
      "D. Both processes yield identical genetic outcomes"
    ],
    "correct_answer": "C. Cross-pollination leads to greater genetic variation than self-pollination. Explanation: Cross-pollination involves the transfer of pollen from one flower to another, combining genetic material from different individuals.",
    "explanation": "Since cross-pollination mixes the genetic information from distinct individuals, it results in offspring with increased genetic diversity, which is beneficial for adapting to environmental changes.",
    "topic": "Pollination mechanisms",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen031"
  },
  {
    "question_text": "What is the primary purpose of meiosis in sexual reproduction?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. To increase the number of chromosomes in germ-cells",
      "B. To produce genetically identical cells",
      "C. To reduce the chromosome number by half, ensuring consistent genetic material in offspring",
      "D. To combine DNA from two different individuals"
    ],
    "correct_answer": "C. To reduce the chromosome number by half, ensuring consistent genetic material in offspring. Explanation: Meiosis halves the genetic content so that when gametes fuse, the original chromosome number is restored.",
    "explanation": "Meiosis is a specialized cell division that produces gametes with half the number of chromosomes. This prevents the doubling of genetic material with every generation and maintains genomic stability.",
    "topic": "Meiosis and reproduction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen032"
  },
  {
    "question_text": "Which of the following lists the correct order of structures that an egg travels through in the female reproductive system?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Ovary -> Fallopian tube -> Uterus -> Cervix",
      "B. Ovary -> Uterus -> Fallopian tube -> Cervix",
      "C. Ovary -> Cervix -> Uterus -> Fallopian tube",
      "D. Ovary -> Uterus -> Cervix -> Fallopian tube"
    ],
    "correct_answer": "A. Ovary -> Fallopian tube -> Uterus -> Cervix. Explanation: After being released from the ovary, the egg enters the Fallopian tube, then the uterus, and ultimately the cervix through which it may interact with sperm.",
    "explanation": "The egg is produced in the ovary, moves through the Fallopian tube where fertilization can occur, and then reaches the uterus. The cervix is the gateway between the uterus and the vagina.",
    "topic": "Female reproductive system",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen033"
  },
  {
    "question_text": "Define sexual reproduction and explain its key requirement.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Sexual reproduction is the process by which two specialized reproductive cells, or gametes, from two individuals (typically male and female) fuse to form a zygote.",
    "explanation": "The key requirement in sexual reproduction is the involvement of two parental gametes, which combine genetic material to generate genetic diversity in the offspring.",
    "topic": "Sexual reproduction definition",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen034"
  },
  {
    "question_text": "Explain one limitation of asexual reproduction compared to sexual reproduction.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A limitation of asexual reproduction is that it produces genetically identical offspring, which restricts genetic variation and can reduce the population's ability to adapt to environmental changes.",
    "explanation": "Without genetic diversity, a population produced asexually may be more vulnerable to diseases and environmental shifts, as all individuals react similarly to stresses.",
    "topic": "Asexual reproduction limitations",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen035"
  },
  {
    "question_text": "What are two main advantages of seed formation in flowering plants?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The two main advantages are: (1) Seeds provide protection and stored food for the embryo, and (2) they enable dispersal to new locations and allow survival through periods of unfavorable conditions due to dormancy.",
    "explanation": "Seed formation allows plants to package the embryo with essential nutrients within a hardy seed coat, protecting it during transport and during times when conditions are not conducive to growth.",
    "topic": "Seed formation and advantages",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen036"
  },
  {
    "question_text": "Describe the role of the placenta in human reproduction.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The placenta acts as an interface between the maternal and fetal blood supplies, facilitating the exchange of oxygen and nutrients to the fetus while removing waste products.",
    "explanation": "This vital organ, attached to the uterine lining, uses villi to increase the surface area for exchange. It ensures that the developing embryo receives necessary sustenance and oxygen, all while eliminating metabolic wastes through maternal circulation.",
    "topic": "Placenta function",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen037"
  },
  {
    "question_text": "Explain how errors during DNA copying and the combination of genetic material from two individuals contribute to genetic variation in sexual reproduction.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "DNA replication mechanisms, while highly accurate, do introduce occasional errors (mutations) during copying. When combined with the recombination events that occur during meiosis, these mutations—along with the diverse genetic contributions from two different individuals—create new and unique genetic combinations in the resulting zygote.",
    "explanation": "The slight inaccuracies in DNA replication can lead to mutations that become a source of genetic variation. Additionally, during meiosis, crossing-over exchanges genetic material between homologous chromosomes. When gametes from two different individuals fuse during fertilization, these unique combinations enhance the genetic diversity of the offspring, which is beneficial for the species' ability to adapt.",
    "topic": "Genetic variation in sexual reproduction",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen038"
  },
  {
    "question_text": "Describe the structure and function of the human male reproductive system, including the roles of the testes, vas deferens, and accessory glands.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The human male reproductive system comprises the testes (which produce sperm and secrete testosterone), the vas deferens (which transports sperm from the testes), and accessory glands such as the prostate and seminal vesicles that secrete fluids to nourish and facilitate the movement of sperm. Together, these structures ensure the production, maturation, and delivery of sperm during the reproductive process.",
    "explanation": "Testes are located in the scrotum, an environment with a slightly lower temperature ideal for sperm production. The vas deferens carries mature sperm to the urethra, where fluids from the prostate and seminal vesicles mix with the sperm. These secretions provide energy, aid in motility, and protect sperm during their journey toward the female reproductive tract for fertilization.",
    "topic": "Male reproductive system",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen039"
  },
  {
    "question_text": "Discuss the challenges associated with reproductive health, including the risks of sexually transmitted diseases (STDs) and unintended pregnancies, and evaluate the methods used to manage these issues.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Reproductive health challenges include the spread of STDs such as HIV-AIDS, gonorrhea, and syphilis, as well as the potential for unintended pregnancies. Preventative strategies involve using mechanical barriers (e.g., condoms), hormonal contraceptives (e.g., pills, patches), intrauterine devices (IUDs), and even surgical methods (e.g., vasectomy, tubal ligation). Each method carries its own advantages and potential side effects.",
    "explanation": "Sexual contact can facilitate the transmission of infections due to close physical contact. Condoms help minimize this risk by physically blocking the transfer of bodily fluids. Hormonal contraceptives prevent ovulation, while IUDs create an inhospitable environment for sperm. Surgical methods offer permanent solutions but come with risks such as infections. Evaluating these options involves balancing efficacy, side effects, personal health, and overall social implications.",
    "topic": "Reproductive health",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen040"
  },
  {
    "question_text": "True or False: Bulls alone can produce new calves.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. Bulls contribute sperm, but a cow (female) is necessary to provide the egg for fertilization.",
    "explanation": "Sexual reproduction in cattle requires the involvement of both a bull and a cow. While the bull supplies the sperm, the cow must provide the egg, and together they contribute genetic material to produce a calf.",
    "topic": "Sexual reproduction in animals",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen041"
  },
  {
    "question_text": "True or False: Self-pollination in flowering plants always results in increased genetic variation within the species.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Self-pollination generally results in less genetic variation because it involves the fusion of gametes from the same individual.",
    "explanation": "While self-pollination can produce viable offspring, it does not mix different genetic materials from distinct individuals. Therefore, it typically limits genetic diversity as compared to cross-pollination.",
    "topic": "Pollination and genetic variation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen042"
  },
  {
    "question_text": "True or False: All physical changes during puberty indicate that an individual is fully prepared for sexual activity and reproduction.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Although physical changes during puberty signal sexual maturation, they do not necessarily mean that an individual is mentally or physically ready for sexual activity and the responsibilities of reproduction.",
    "explanation": "Puberty marks the onset of physical changes that enable reproduction, but full readiness for sexual activity involves additional psychological and developmental factors. Thus, sexual maturity in the body does not equate to preparedness for adult sexual behavior or child-rearing.",
    "topic": "Puberty and reproductive maturity",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc107",
    "section_id": "06_section_7_3",
    "question_id": "cbse_x_jesc1dd_c107_gen043"
  },
  {
    "question_text": "How is the process of pollination different from fertilisation?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Pollination is the transfer of pollen grains, which contain the male gametes, from the anther to the stigma of a flower, whereas fertilisation is the fusion of the male gamete (from the pollen) with the female gamete (the egg cell inside the ovule) to form a zygote.",
    "explanation": "Pollination entails the movement of pollen from the male reproductive organ (anther) to the female reproductive organ (stigma), frequently with the aid of external agents such as wind, water, or animals. In contrast, fertilisation occurs when the pollen tube grows from the germinated pollen grain down through the style to deliver the male gamete to the egg in the ovule, resulting in the formation of a zygote. This clear distinction highlights the sequential steps in sexual reproduction in flowering plants, employing specialized structures and processes.",
    "topic": "Sexual Reproduction in Flowering Plants",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic008"
  },
  {
    "question_text": "What is the role of the seminal vesicles and the prostate gland?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The seminal vesicles and the prostate gland secrete fluids that mix with sperm to form semen, providing nutrition to the sperm, neutralizing the acidic environment of the female reproductive tract, and facilitating the transport of sperm.",
    "explanation": "In the male reproductive system, the fluid from the seminal vesicles is rich in sugars and other nutrients that offer energy for sperm, while the prostate gland contributes additional enzymes and alkaline secretions that help protect the sperm by neutralizing the acidic pH encountered in the female reproductive tract. This combination creates an optimal medium for sperm viability and motility.",
    "topic": "Male Reproductive System",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic009"
  },
  {
    "question_text": "What are the changes seen in girls at the time of puberty?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "At puberty, girls experience an increase in breast size, darkening of the nipple area, growth of hair in the armpits and genital region, widening of the hips, and the onset of menstruation.",
    "explanation": "During puberty, hormonal changes trigger multiple physiological transformations in girls. The ovaries begin to produce estrogen, leading to the development of secondary sexual characteristics such as breast enlargement and changes in skin pigmentation. Additionally, the redistribution of body fat and growth of pubic and axillary hair occur, signaling the maturation of the reproductive system and preparing the body for potential reproduction.",
    "topic": "Human Sexual Maturation and Puberty",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic010"
  },
  {
    "question_text": "How does the embryo get nourishment inside the mother’s body?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The embryo receives nourishment through the placenta, a specialized organ that forms when the fertilised egg attaches and implants in the uterine lining. The placenta facilitates the exchange of nutrients (such as glucose) and oxygen from the mother's blood to the embryo, as well as the removal of waste products.",
    "explanation": "After fertilisation, the zygote develops into an embryo that implants in the uterine wall. The placenta, which develops at the site of implantation, acts as the interface between the mother’s and embryo’s circulatory systems. It contains villi that increase the surface area for exchange, ensuring that essential nutrients and oxygen are delivered while metabolic wastes are removed. This process is critical for proper embryonic growth and development.",
    "topic": "Human Reproduction and Placental Function",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic011"
  },
  {
    "question_text": "If a woman is using a copper-T, will it help in protecting her from sexually transmitted diseases?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "No, a copper-T (an intrauterine contraceptive device) is designed to prevent pregnancy primarily by preventing implantation and affecting sperm viability, but it does not offer protection against sexually transmitted diseases.",
    "explanation": "The copper-T functions by releasing copper ions that create an environment toxic to sperm and interfere with the sperm's ability to fertilize an egg. However, it does not form a physical barrier to the exchange of bodily fluids during sexual intercourse. Thus, it does not prevent the transmission of pathogens that cause diseases such as gonorrhoea, syphilis, or HIV-AIDS. For protection against sexually transmitted diseases, barrier methods like condoms are recommended.",
    "topic": "Contraceptive Methods and Reproductive Health",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic012"
  },
  {
    "question_text": "What is the importance of DNA copying in reproduction?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "DNA copying is crucial because it ensures that the genetic blueprint—encoded in the DNA molecules housed in the cell nucleus—is accurately replicated and passed on during cell division. This process allows organisms to transmit their inherited traits to the next generation and establish a basis for maintaining species-specific body designs.",
    "explanation": "The process of DNA replication is fundamental to reproduction because chromosomes carry the information for assembling cellular components. When a cell divides, it must generate precise copies of its DNA to ensure that each new cell has the complete set of instructions necessary to maintain the organism’s structure and functions. Although replication is highly accurate, minor errors (mutations) can occur, leading to variations that may sometimes be neutral, harmful, or beneficial. This precise copying mechanism underpins the inheritance of traits and supports continuity in the species.",
    "topic": "DNA replication and inheritance",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic001"
  },
  {
    "question_text": "Why is variation beneficial to the species but not necessarily for the individual?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Variation is beneficial to a species because it creates a pool of different traits, increasing the chances that some members can survive environmental changes, such as temperature shifts or disease outbreaks. However, for an individual, a particular variation may not offer an advantage and could even be detrimental depending on the current environment.",
    "explanation": "Within a population, genetic variation is generated during DNA replication through minor copying errors or mutations. This diversity is critical for evolution, as it provides the raw material for natural selection. When an environmental change occurs, individuals with advantageous variations are more likely to survive and reproduce, thereby ensuring the species' overall survival. In contrast, an individual genetic variation might not improve the organism's fitness in its present environment, and in some cases, it may impair function. Thus, while variation supports long-term species adaptability and resilience, its effects on an individual organism can be variable.",
    "topic": "Genetic variation and evolutionary biology",
    "bloom_level": "Analyze",
    "source": "in-chapter",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ic002"
  },
  {
    "question_text": "Asexual reproduction takes place through budding in:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Amoeba",
      "Yeast",
      "Plasmodium",
      "Leishmania"
    ],
    "correct_answer": "Yeast",
    "explanation": "Yeast reproduces asexually by forming small outgrowths known as buds, which eventually separate and develop into new yeast cells. This process is a classic example of budding, a form of asexual reproduction where a new organism develops from an outgrowth of the parent organism.",
    "topic": "Asexual reproduction; Budding",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex001"
  },
  {
    "question_text": "Which of the following is not a part of the female reproductive system in human beings?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Ovary",
      "Uterus",
      "Vas deferens",
      "Fallopian tube"
    ],
    "correct_answer": "Vas deferens",
    "explanation": "The vas deferens is a tube that transports sperm in the male reproductive system, not in the female. The female reproductive system includes structures such as the ovary, uterus, and fallopian tubes.",
    "topic": "Human Reproductive System; Female Anatomy",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex002"
  },
  {
    "question_text": "The anther contains:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Sepals",
      "Ovules",
      "Pistil",
      "Pollen grains"
    ],
    "correct_answer": "Pollen grains",
    "explanation": "The anther is the part of the stamen in a flower that produces and contains pollen grains, which are the male gametophytes involved in plant sexual reproduction.",
    "topic": "Flower Anatomy; Reproductive Structures in Angiosperms",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex003"
  },
  {
    "question_text": "What are the advantages of sexual reproduction over asexual reproduction?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sexual reproduction introduces genetic variation by combining DNA from two parents which results in novel gene combinations. This increased variability enhances a species’ ability to adapt to changing environmental conditions and improves the long-term survival prospects of the population.",
    "explanation": "In sexual reproduction, the fusion of gametes (produced through meiosis) from two parents creates offspring with a unique genetic makeup. This combination of traits provides a wider repertoire for natural selection to act upon, facilitating adaptation to environmental changes. In contrast, asexual reproduction generally produces genetically similar offspring, which may limit adaptability.",
    "topic": "Sexual Reproduction; Genetic Variation and Evolution",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex004"
  },
  {
    "question_text": "What are the functions performed by the testis in human beings?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The testes have two main functions: (1) production of male gametes (sperm), and (2) secretion of the hormone testosterone which is crucial for sperm production and the development of secondary sexual characteristics during puberty.",
    "explanation": "The testis is a dual-function organ in the male reproductive system. Its primary role is to produce sperms required for fertilization. Additionally, it secretes testosterone – a hormone that not only regulates the process of spermatogenesis but also induces the development of secondary sexual traits such as muscle mass, body hair, and a deeper voice.",
    "topic": "Human Reproductive System; Male Anatomy and Physiology",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex005"
  },
  {
    "question_text": "Why does menstruation occur?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Menstruation occurs when the egg released by the ovary is not fertilized. The thickened uterine lining, which was prepared to nurture a potential embryo, is shed and discharged from the body.",
    "explanation": "Each menstrual cycle involves the ovary releasing an egg and the uterine lining (endometrium) thickening under the influence of hormones to create a suitable environment for a fertilized egg. If fertilization does not occur, hormonal levels drop and the thickened endometrium breaks down and is expelled from the body through the vagina, resulting in menstruation.",
    "topic": "Human Reproductive System; Menstrual Cycle",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex006"
  },
  {
    "question_text": "Draw a labelled diagram of the longitudinal section of a flower.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A correctly labelled diagram should include the sepals, petals, stamens (with components such as anther and filament), and the pistil/carpel (with components like stigma, style, ovary, and ovule). This corresponds to the diagram shown in Figure 7.7.",
    "explanation": "Students should create a diagram that clearly depicts the longitudinal section of a flower. The diagram must label the protective sepals and attractive petals, the male reproductive parts (stamen, consisting of anther and filament), and the female reproductive parts (pistil or carpel, consisting of stigma, style, ovary, and ovules). This exercise tests both knowledge of flower anatomy and the ability to visually represent complex biological structures.",
    "topic": "Plant Reproductive Structures; Flower Anatomy",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex007"
  },
  {
    "question_text": "What are the different methods of contraception?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The different methods of contraception include:\n1. Barrier methods (e.g., condoms, diaphragms, cervical caps) which physically block sperm from reaching the egg.\n2. Chemical methods (e.g., oral contraceptive pills, patches, injections) that alter hormonal balances to inhibit ovulation.\n3. Intrauterine devices (IUDs) such as Copper-T and hormonal IUDs that prevent implantation of a fertilized egg or interfere with sperm movement.\n4. Surgical methods (e.g., vasectomy in males, tubal ligation in females) which permanently interrupt the transport of gametes.\n5. Natural methods (e.g., rhythm method, withdrawal) that rely on the timing of the menstrual cycle, though these are generally less reliable.",
    "explanation": "Contraceptive methods aim to prevent unwanted pregnancies by either providing a barrier to fertilization, manipulating the hormonal cycle to prevent ovulation, or physically blocking gamete transport. Barrier methods prevent sperm-egg contact; chemical methods modify hormonal levels to inhibit ovulation; IUDs interfere with the intrauterine environment; surgical methods provide a permanent solution; and natural methods rely on behavioral modification based on an understanding of the reproductive cycle.",
    "topic": "Reproductive Health; Contraception",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex008"
  },
  {
    "question_text": "How are the modes for reproduction different in unicellular and multicellular organisms?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Unicellular organisms reproduce mainly by asexual methods such as binary fission, multiple fission, or budding (as seen in organisms like yeast). In contrast, multicellular organisms may reproduce asexually through factors like fragmentation, regeneration, budding, or vegetative propagation, but more complex multicellular organisms predominantly reproduce sexually using specialized reproductive organs and gametes. The complexity in multicellular reproduction arises due to the need for organized structures and differentiation of tissues.",
    "explanation": "Unicellular organisms have simple body plans that allow them to reproduce via division or budding, leading directly to the formation of new cells. Multicellular organisms, on the other hand, usually have specialized cells and tissues that are not all capable of independent regeneration; therefore, they often rely on specialized reproductive organs to produce gametes for sexual reproduction or use specific mechanisms (such as vegetative propagation in plants) for asexual reproduction. This difference is primarily due to organizational complexity and the need for maintaining the body plan and tissue differentiation.",
    "topic": "Reproduction; Unicellular vs. Multicellular Organisms",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex009"
  },
  {
    "question_text": "How does reproduction help in providing stability to populations of species?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Reproduction ensures the continuity of a species by replacing individuals lost to death and helps maintain the species-specific body design suited to a particular ecological niche. Additionally, through the introduction of genetic variations (especially via sexual reproduction), populations are able to adapt to environmental changes and challenges, thereby ensuring long-term stability.",
    "explanation": "Reproduction is essential for sustaining population numbers by replenishing the individuals in a species. While a high-fidelity process of DNA replication helps preserve functional traits needed for survival in a given niche, the genetic variations introduced—particularly through sexual reproduction—provide the raw material for natural selection. This balance between stability (via conservation of key traits) and variability (via genetic recombination) enables species to adapt to environmental stresses, ensuring population stability over time.",
    "topic": "Population Biology; Reproductive Strategies",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex010"
  },
  {
    "question_text": "What could be the reasons for adopting contraceptive methods?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Contraceptive methods are adopted for several reasons including, preventing unwanted pregnancies, facilitating family planning and controlling family size, spacing births to improve the health of both the mother and the child, and reducing the risk of sexually transmitted infections through barrier methods.",
    "explanation": "The use of contraceptive methods is essential in managing reproductive health. Preventing unplanned pregnancies allows individuals and couples to plan for when they are ready to have children, ensuring better health outcomes. Methods such as condoms also reduce the transmission of infectious diseases, while other strategies can help manage hormonal balances or physically block gamete interaction. Collectively, these approaches contribute not only to individual well-being but also to broader social and economic stability.",
    "topic": "Reproductive Health; Contraception and Family Planning",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "jesc107",
    "question_id": "cbse_x_jesc1dd_c107_ex011"
  }
]