[
  {
    "question_text": "Which of the following pairs will give displacement reactions?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "NaCl solution and copper metal",
      "MgCl2 solution and aluminium metal",
      "FeSO4 solution and silver metal",
      "AgNO3 solution and copper metal"
    ],
    "correct_answer": "AgNO3 solution and copper metal",
    "explanation": "In a displacement reaction the more reactive metal displaces the less reactive metal from its salt solution. Copper is more reactive than silver so when copper is placed in AgNO3 solution, it displaces silver to form copper(II) nitrate, while silver is deposited.",
    "topic": "Metal reactivity and displacement reactions",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex001"
  },
  {
    "question_text": "Which of the following methods is suitable for preventing an iron frying pan from rusting?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Applying grease",
      "Applying paint",
      "Applying a coating of zinc",
      "All of the above"
    ],
    "correct_answer": "Applying a coating of zinc",
    "explanation": "Although grease and paint can temporarily protect the surface, they might wear off during use. Coating with zinc (galvanising) is effective because zinc is more reactive than iron and acts as a sacrificial anode, thereby protecting the iron from rusting.",
    "topic": "Corrosion and protection methods",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex002"
  },
  {
    "question_text": "An element reacts with oxygen to give a compound with a high melting point that is also soluble in water. The element is likely to be:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Calcium",
      "Carbon",
      "Silicon",
      "Iron"
    ],
    "correct_answer": "Calcium",
    "explanation": "When calcium reacts with oxygen, it forms calcium oxide (CaO), an ionic compound that has a high melting point and reacts with water to form calcium hydroxide (Ca(OH)2), which is sparingly soluble. In contrast, compounds of carbon, silicon or iron with oxygen do not show these properties.",
    "topic": "Ionic compounds and metal oxide properties",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex003"
  },
  {
    "question_text": "Food cans are coated with tin and not with zinc because:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Zinc is costlier than tin",
      "Zinc has a higher melting point than tin",
      "Zinc is more reactive than tin",
      "Zinc is less reactive than tin"
    ],
    "correct_answer": "Zinc is more reactive than tin",
    "explanation": "Zinc being more reactive than tin can react with food acids and cause corrosion or contamination. Tin, on the other hand, is less reactive and does not react with the contents of the can, making it more suitable for food packaging.",
    "topic": "Metal reactivity and corrosion",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex004"
  },
  {
    "question_text": "You are given a hammer, a battery, a bulb, wires, and a switch. (a) How could you use these to distinguish between samples of metals and non-metals? (b) Assess the usefulness of these tests in distinguishing between metals and non-metals.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) You can perform a malleability test by striking each sample with a hammer; metals, being malleable, will flatten while non-metals tend to shatter (brittle). Additionally, you can perform a conductivity test by setting up a simple circuit (battery, bulb, switch, wires) and inserting each sample into the circuit; metals will conduct electricity to light the bulb, whereas non-metals will not (with the exception of graphite which conducts due to its structure). b) These tests are useful because most metals exhibit malleability and conductivity. However, there are exceptions (e.g., some non-metal allotropes and soft alkali metals) so the tests may need to be supplemented by chemical analysis for a definitive classification.",
    "explanation": "Metals are generally malleable and conduct electricity due to the delocalization of electrons, whereas most non-metals are brittle and act as insulators. The malleability test is based on mechanical properties and the conductivity test on the movement of electrons. These experimental procedures help in identifying fundamental differences, although some anomalies can occur.",
    "topic": "Physical properties of metals vs. non-metals",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex005"
  },
  {
    "question_text": "What are amphoteric oxides? Give two examples of amphoteric oxides.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Amphoteric oxides are oxides that can react both as acids and as bases. Examples include Aluminium oxide (Al2O3) and Zinc oxide (ZnO).",
    "explanation": "Amphoteric oxides display dual chemical behavior – they can react with acids to form salts and with bases to form complex salts. This property is significant in various industrial and laboratory processes.",
    "topic": "Chemical properties of metal oxides",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex006"
  },
  {
    "question_text": "Name two metals that will displace hydrogen from dilute acids, and two metals that will not.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Metals that will displace hydrogen include Zinc (Zn) and Iron (Fe), as they are placed above hydrogen in the reactivity series. Metals that will not displace hydrogen include Copper (Cu) and Silver (Ag), because they are less reactive than hydrogen.",
    "explanation": "Metals above hydrogen in the reactivity series react with dilute acids to produce hydrogen gas by displacing hydrogen from the acid. Those below hydrogen, like copper and silver, do not react in this manner because the reaction is not thermodynamically favorable.",
    "topic": "Reactivity of metals with acids",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex007"
  },
  {
    "question_text": "In the electrolytic refining of a metal M, what would you take as the anode, the cathode, and the electrolyte?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The anode is the impure metal M, the cathode is a thin strip of pure metal M, and the electrolyte is an aqueous solution of a salt of metal M (for example, MSO4 if M forms a sulfate).",
    "explanation": "Electrolytic refining works on the principle of selective dissolution where the more reactive, impure metal at the anode dissolves into the electrolyte and pure metal is deposited on the cathode. This method is widely used to obtain high purity metals.",
    "topic": "Electrolytic refining",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex008"
  },
  {
    "question_text": "Pratyush heated sulphur powder on a spatula and collected the gas evolved using an inverted test tube. (a) What will be the action of the gas on (i) dry litmus paper and (ii) moist litmus paper? (b) Write a balanced chemical equation for the reaction taking place.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) (i) The gas has no effect on dry litmus paper. (ii) On moist litmus paper, the gas dissolves in moisture to form sulphurous acid (H2SO3) causing blue litmus paper to turn red. b) The balanced chemical equation is: S(s) + O2(g) → SO2(g).",
    "explanation": "Sulphur, when heated in air, reacts with oxygen to form sulphur dioxide (SO2). SO2 is not strong enough to change the color of dry litmus paper, but when dissolved in water it forms H2SO3, an acidic solution that turns moist blue litmus paper red. This reaction demonstrates gas solubility and acid formation.",
    "topic": "Reaction of sulphur with oxygen; litmus test",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex009"
  },
  {
    "question_text": "State two ways to prevent the rusting of iron.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Two effective methods are: 1. Painting or applying oil/grease to form a protective barrier against moisture and oxygen. 2. Galvanising, which involves coating the iron with zinc so that the zinc corrodes preferentially.",
    "explanation": "Rusting of iron occurs due to the reaction with oxygen and moisture. Protective coatings such as paint or oil prevent exposure to these elements, while galvanising uses the sacrificial nature of zinc to protect the underlying iron.",
    "topic": "Corrosion prevention",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex010"
  },
  {
    "question_text": "What type of oxides are formed when non-metals combine with oxygen?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Non-metals generally form acidic oxides (for example, SO2 and CO2) or, in some cases, neutral oxides.",
    "explanation": "The oxides of non-metals typically have a covalent character and show acidic behavior. When these oxides dissolve in water, they often form acids, which is a key difference from the basic or amphoteric oxides formed by metals.",
    "topic": "Properties of non-metal oxides",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex011"
  },
  {
    "question_text": "Give reasons for the following: (a) Platinum, gold, and silver are used to make jewellery. (b) Sodium, potassium, and lithium are stored under oil. (c) Aluminium is highly reactive yet used for cooking utensils. (d) Carbonate and sulphide ores are usually converted into oxides during extraction.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) Platinum, gold, and silver are used for jewellery because they are lustrous, unreactive (resistant to corrosion/tarnishing), and possess good malleability. b) Alkali metals like sodium, potassium, and lithium are stored under oil to prevent their vigorous reaction with moisture and oxygen in the air. c) Although aluminium is reactive, it forms a thin, protective layer of aluminium oxide (Al2O3) that prevents further corrosion, making it suitable for cookware. d) Converting carbonate and sulphide ores to oxides simplifies their reduction to metals because metal oxides are easier to reduce (for example, using carbon) than the original compounds.",
    "explanation": "The answer highlights the inherent physical and chemical properties of metals that determine their applications and processing methods. Noble metals resist corrosion and maintain their luster, highly reactive alkali metals are protected from violent reactions, and the formation of oxide intermediates in ore processing makes metal extraction more efficient.",
    "topic": "Properties and extraction of metals",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex012"
  },
  {
    "question_text": "Explain why sour substances like lemon or tamarind juice are effective in cleaning tarnished copper vessels.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The acids in lemon and tamarind juice react with the basic copper carbonate or copper oxide that forms as a tarnish on copper. This reaction dissolves the tarnish by forming soluble copper salts, thereby cleaning and restoring the shine of the copper vessels.",
    "explanation": "Tarnish on copper is usually caused by the formation of basic copper carbonate (a greenish patina) or copper oxide. The acidic nature of lemon or tamarind juice neutralizes and dissolves these compounds, which is a common acid-base reaction used in cleaning applications.",
    "topic": "Acid-base reactions and cleaning processes",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex013"
  },
  {
    "question_text": "Differentiate between metals and non-metals on the basis of their chemical properties.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Metals typically form basic or amphoteric oxides, react with acids to release hydrogen gas, and tend to lose electrons to form positive ions (cations). In contrast, non-metals usually form acidic or neutral oxides, do not react with dilute acids to evolve hydrogen, and tend to gain electrons or share electrons to form negative ions or covalent bonds.",
    "explanation": "This differentiation is based on the behavior of elements during chemical reactions. The acid-base nature of the oxides and the tendency to form ions are due to the electronic configurations of the elements. Metals, with loosely held valence electrons, readily lose electrons, while non-metals, with higher electron affinities, gain or share electrons.",
    "topic": "Chemical properties of metals vs. non-metals",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex014"
  },
  {
    "question_text": "A man posing as a goldsmith dipped gold bangles in a solution, which made them sparkle but reduced their weight drastically. What is the nature of the solution used?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The solution is likely Aqua Regia, a mixture of concentrated hydrochloric acid and concentrated nitric acid, usually in a 3:1 ratio, which is capable of dissolving gold.",
    "explanation": "Aqua Regia is one of the few chemical mixtures that can dissolve noble metals like gold by oxidizing them. When the surface layer of gold is dissolved, the bangles may appear shiny but lose mass, which accounts for the reduced weight.",
    "topic": "Chemical dissolution of metals; aqua regia",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex015"
  },
  {
    "question_text": "Give reasons why copper is used to make hot water tanks and not steel.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Copper is used because it is an excellent conductor of heat, ensuring efficient heat transfer, and it is more resistant to corrosion compared to steel. Steel, which is predominantly iron, is more prone to rust under hot, moist conditions.",
    "explanation": "The selection of materials for hot water tanks is based on their thermal conductivity and corrosion resistance. Copper’s high conductivity allows it to transfer heat efficiently, while its passive oxide layer protects it against corrosion. In contrast, steel would deteriorate faster in such environments.",
    "topic": "Material properties; thermal conductivity and corrosion resistance",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc103",
    "question_id": "cbse_x_jesc1dd_c103_ex016"
  }
]