[
  {
    "question_text": "Which of the following statements best describes a plant movement that is independent of growth?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. It occurs slowly due to cell division.",
      "B. It occurs rapidly through changes in cell water content.",
      "C. It requires specialized muscle tissues.",
      "D. It depends solely on electrical impulses."
    ],
    "correct_answer": "B. It occurs rapidly through changes in cell water content.",
    "explanation": "Immediate responses, like that of the sensitive plant (Mimosa pudica), occur quickly as the cells change their water content, resulting in a change in shape. This movement does not involve growth, unlike directional movements mediated by cell division and elongation.",
    "topic": "Immediate Response in Plants",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen015"
  },
  {
    "question_text": "What role does the plant hormone auxin play in phototropism?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It inhibits cell elongation on the shady side of the shoot.",
      "B. It stimulates cell elongation on the side away from light, causing the shoot to bend toward the light.",
      "C. It causes cell division exclusively at the root tip.",
      "D. It reduces water uptake in the plant cells."
    ],
    "correct_answer": "B. It stimulates cell elongation on the side away from light, causing the shoot to bend toward the light.",
    "explanation": "In phototropism, auxin accumulates on the shaded side of the shoot, stimulates the cells to elongate more on that side, and causes the shoot to bend towards the light source. This is essential for maximizing the plant's exposure to light for photosynthesis.",
    "topic": "Hormonal Regulation in Phototropism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen016"
  },
  {
    "question_text": "Which plant hormone is known for inhibiting growth and promoting responses such as leaf wilting?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Auxin",
      "B. Gibberellins",
      "C. Cytokinins",
      "D. Abscisic acid"
    ],
    "correct_answer": "D. Abscisic acid",
    "explanation": "Abscisic acid is a plant hormone that inhibits growth and can cause processes like leaf wilting. Its role is crucial in stress responses, aiding in the regulation of stomatal closure and other growth-suppressing effects.",
    "topic": "Plant Hormones and Growth Regulation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen017"
  },
  {
    "question_text": "In the bean seed experiment described, when the flask is turned so that shoots face away from the light, which of the following best explains the behavior of newly growing shoots?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. Auxin uniformly distributes along the shoot irrespective of light direction.",
      "B. Auxin accumulates on the side away from light, causing differential growth that eventually redirects the shoot toward the light.",
      "C. The entire shoot immediately reorients by adjusting the old growth.",
      "D. Electrical impulses signal the existing cells to move towards the light."
    ],
    "correct_answer": "B. Auxin accumulates on the side away from light, causing differential growth that eventually redirects the shoot toward the light.",
    "explanation": "When the flask is turned, only the new growth responds to the light by redistributing auxin unevenly. This differential growth leads to a bend, while the old growth remains unaffected, highlighting the role of auxin in phototropism.",
    "topic": "Phototropism and Hormonal Responses",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen018"
  },
  {
    "question_text": "Define phototropism and explain its significance for plants.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Phototropism is the directional growth of plant parts in response to light, where shoots typically grow toward the light and roots grow away from it.",
    "explanation": "Phototropism enables shoots to maximize light exposure, which is crucial for photosynthesis. This process helps plants efficiently capture light energy while roots follow geotropic cues for optimal water and nutrient uptake.",
    "topic": "Phototropism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen019"
  },
  {
    "question_text": "What is geotropism and how does it benefit a plant's overall growth?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Geotropism is the directional growth of plant parts in response to gravity. Shoots typically exhibit negative geotropism by growing upward, while roots exhibit positive geotropism by growing downward.",
    "explanation": "This movement ensures that shoots are positioned to capture sunlight effectively, maximizing photosynthesis, while roots grow downward to secure moisture and nutrients from the soil, thereby supporting the plant structurally and nutritionally.",
    "topic": "Geotropism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen020"
  },
  {
    "question_text": "Differentiate between immediate response to a stimulus and growth-mediated movement in plants.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Immediate responses, such as the quick leaf movement in Mimosa pudica, involve rapid changes in cell turgor without any cell growth. In contrast, growth-mediated movements, like phototropism, occur as a result of differential cell elongation over a longer period.",
    "explanation": "Immediate responses are characterized by a fast reaction due to changes in cell water content, while growth-mediated movements depend on differential cell growth and division. Both types of responses allow plants to adapt to environmental stimuli, but through fundamentally different cellular processes.",
    "topic": "Plant Movement Mechanisms",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen021"
  },
  {
    "question_text": "Explain the role of plant hormones in coordinating growth and response to environmental stimuli.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Plant hormones such as auxins, gibberellins, cytokinins, and abscisic acid play vital roles in coordinating plant growth and responses. Auxins promote cell elongation (key in phototropism), gibberellins assist in stem elongation, cytokinins encourage cell division in areas like fruits and seeds, and abscisic acid slows or inhibits growth, particularly under stress.",
    "explanation": "These hormones are synthesized in specific parts of the plant and then transported to target cells where they regulate growth, development, and response to environmental changes. Their coordinated action ensures that plant growth is both controlled and adaptable to external conditions.",
    "topic": "Plant Hormones",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen022"
  },
  {
    "question_text": "Discuss the physiological mechanisms underlying the immediate response to stimulus in plants, and compare these with the animal nervous system responses.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Plants lack specialized nervous and muscle tissues, yet they can respond swiftly to stimuli. In plants, the immediate response involves the transmission of signals via electrical-chemical means between cells, leading to rapid changes in cell turgor by altering water content. In contrast, animals utilize a nervous system with specialized neurons and muscles that use electrical impulses and chemical neurotransmitters to effect quick movements.",
    "explanation": "While animal responses rely on fast electrical impulses along nerves and subsequent muscle contraction, plants depend on changes in water pressure within cells to generate movement. Although slower than neuronal transmission, the plant’s method effectively coordinates rapid responses (like the folding of Mimosa pudica leaves) without specialized tissues. This comparison highlights the diversity of biological mechanisms evolved to ensure survival in different life forms.",
    "topic": "Immediate Plant Responses vs. Animal Nervous Systems",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen023"
  },
  {
    "question_text": "Analyze the bean seed experiment described in the activity. How does the experiment demonstrate phototropism and the role of hormones in directional growth?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In the bean seed experiment, seedlings placed in a conical flask within a cardboard box are exposed to light from one direction. The shoots bend towards the light due to the differential growth of cells. This occurs because auxin, a growth-promoting hormone synthesized at the shoot tip, accumulates on the shaded side of the shoot, stimulating cell elongation on that side. Conversely, roots grow downward—the response includes both avoidance of light and a positive response to gravity (geotropism).",
    "explanation": "This experiment demonstrates phototropism by showing that shoots reorient themselves towards the light, optimizing photosynthetic efficiency. The redistributive action of the hormone auxin is key to this process. The experiment also illustrates that only new growth responds to the change in light direction, as older parts remain unchanged. Such responses are critical for a plant's adaptation to its environment and illustrate the importance of hormonal regulation in directional growth.",
    "topic": "Phototropism and Hormonal Regulation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen024"
  },
  {
    "question_text": "True or False: The rapid leaf movement in Mimosa pudica is a result of cell growth and division triggered by a touch stimulus.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The rapid leaf movement in Mimosa pudica is due to changes in cell turgor (water content) and not because of cell growth or division. The cells swell or shrink quickly, allowing for a rapid response.",
    "topic": "Plant Movement Mechanisms",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen025"
  },
  {
    "question_text": "True or False: In phototropism, the entire plant, including already matured parts, adjusts its direction in response to light.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Only the newly growing parts of a plant respond to changes in light direction. Mature or older parts do not significantly change their orientation, which is why the redirection of growth occurs gradually in response to the light stimulus.",
    "topic": "Phototropism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen026"
  },
  {
    "question_text": "True or False: Auxin, which plays a critical role in phototropism, is synthesized in the root tips and moves upward to influence shoot growth.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Auxin is predominantly synthesized at the shoot tip rather than in the root tips. It diffuses toward the shaded side of the shoot to promote cell elongation, which is critical for phototropism.",
    "topic": "Plant Hormones and Phototropism",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen027"
  },
  {
    "question_text": "Which of the following is a plant hormone?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Insulin",
      "Thyroxin",
      "Oestrogen",
      "Cytokinin"
    ],
    "correct_answer": "Cytokinin",
    "explanation": "Cytokinin is a class of plant hormones that promote cell division and influence growth. Unlike insulin, thyroxin, or oestrogen—which are animal hormones—cytokinin is specific to plants and plays a crucial role in regulating plant development.",
    "topic": "Plant Hormones",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex001"
  },
  {
    "question_text": "The gap between two neurons is called a",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Dendrite",
      "Synapse",
      "Axon",
      "Impulse"
    ],
    "correct_answer": "Synapse",
    "explanation": "The synapse is the junction between two neurons through which information is transmitted by chemical signals. Dendrites and axons, on the other hand, are parts of a neuron responsible for receiving and transmitting electrical impulses respectively, and an impulse is the electrical signal itself.",
    "topic": "Nervous System",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex002"
  },
  {
    "question_text": "The brain is responsible for",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Thinking",
      "Regulating the heartbeat",
      "Balancing the body",
      "All of the above"
    ],
    "correct_answer": "All of the above",
    "explanation": "The brain is the central processing unit of the nervous system, responsible not only for higher cognitive functions like thinking but also for controlling vital involuntary functions such as heartbeat regulation and maintaining balance. It integrates signals from various parts of the body to produce coordinated responses.",
    "topic": "Brain Functions",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex003"
  },
  {
    "question_text": "What is the function of receptors in our body? Think of situations where receptors do not work properly. What problems are likely to arise?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Receptors are specialized structures located in sensory organs and nerve endings that detect changes in the environment (stimuli such as light, sound, heat, touch, and chemicals) and convert these stimuli into electrical signals (nerve impulses) for the central nervous system. If receptors malfunction, the body may not accurately detect stimuli, leading to issues such as impaired vision (damaged photoreceptors), hearing loss (damaged auditory receptors), inability to sense temperature (damaged thermoreceptors), and loss of smell (damaged olfactory receptors).",
    "explanation": "Receptors are essential for environmental perception by converting external stimuli into nerve impulses. When these sensory cells are damaged by disease or injury, the corresponding senses are impaired, risking safety (e.g., failure to detect a hot object) and reducing quality of life. This problem illustrates the importance of intact and properly functioning sensory receptors, which are foundational to our ability to interact with and respond to the environment.",
    "topic": "Sensory Reception and Signal Transduction",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex004"
  },
  {
    "question_text": "Draw the structure of a neuron and explain its function.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A typical neuron structure has dendrites, a cell body (soma) containing the nucleus, an axon, and nerve endings (axon terminals). Dendrites receive incoming signals, the cell body processes these signals, the axon conducts electrical impulses (action potentials), and the nerve endings release neurotransmitters across synapses to communicate with target cells such as other neurons, muscles, or glands.",
    "explanation": "The neuron is the basic structural and functional unit of the nervous system. In the provided diagram (similar to Fig. 6.1(a)), dendrites act as receptors of signals, the cell body integrates these signals, the axon propagates the impulse, and the nerve endings establish synaptic connections. The process of converting chemical signals into electrical impulses and then back to chemical signals is fundamental in transmitting information quickly and accurately throughout the body.",
    "topic": "Neuronal Structure and Function",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex005"
  },
  {
    "question_text": "How does phototropism occur in plants?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Phototropism is the directional growth of a plant in response to light. In shoots, light exposure causes the distribution of the hormone auxin to become uneven, with auxin accumulating on the shaded side. The higher concentration of auxin promotes cell elongation on that side, making the shoot bend toward the light source.",
    "explanation": "In phototropism, the plant hormone auxin plays a crucial role by diffusing more on the side not directly exposed to the light. This differential growth results in the bending of the plant toward the light, which optimizes light absorption for photosynthesis. The process involves light perception by photoreceptors, hormone redistribution, and differential cell elongation. Diagrams often portray this mechanism, showing auxin gradient from the light to the shaded side.",
    "topic": "Plant Physiology and Tropisms",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex006"
  },
  {
    "question_text": "Which signals will get disrupted in case of a spinal cord injury?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A spinal cord injury disrupts both the transmission of motor signals from the brain to body parts below the injury and sensory signals from those body parts to the brain. It also can interfere with reflex arcs established in the spinal cord.",
    "explanation": "The spinal cord serves as the main pathway for nerve impulses traveling between the brain and the peripheral body. Damage to the spinal cord blocks these signals, affecting voluntary movements, sensation (e.g., touch, pain, temperature), and the functioning of reflexes, which are typically processed at the level of the spinal cord without direct involvement of the brain.",
    "topic": "Spinal Cord Physiology",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex007"
  },
  {
    "question_text": "How does chemical coordination occur in plants?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Chemical coordination in plants takes place via plant hormones (phytohormones) such as auxins, gibberellins, cytokinins, abscisic acid, and ethylene. These hormones are produced in one part of the plant and move—often by diffusion—to other parts, where they regulate growth, development, and responses to environmental stimuli.",
    "explanation": "Unlike animals, plants lack a nervous system but still require coordinated responses. Plant hormones are synthesized at specific sites (like shoot tips or roots) and travel through the plant to affect processes such as cell elongation, division, and differentiation. For example, auxin causes cell elongation on the shaded side of a shoot, resulting in phototropism.",
    "topic": "Plant Hormones and Signal Transduction",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex008"
  },
  {
    "question_text": "What is the need for a system of control and coordination in an organism?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A system of control and coordination is essential for integrating the functions of various body parts and ensuring a synchronized response to internal and external stimuli. It regulates growth, metabolism, movement, and homeostasis, allowing the organism to maintain balance and adapt to changing environments.",
    "explanation": "Control and coordination systems, which include the nervous and endocrine systems, ensure that all the organs and tissues of an organism work harmoniously. They facilitate rapid responses (via nerve impulses) and sustained adjustments (via hormonal signals) necessary for survival, such as reflex actions, voluntary movements, and regulation of body functions like heart rate and digestion.",
    "topic": "Homeostasis and Body Regulation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex009"
  },
  {
    "question_text": "How are involuntary actions and reflex actions different from each other?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Reflex actions are rapid, automatic responses to a specific stimulus that are mediated by a reflex arc involving the spinal cord; these responses occur without conscious thought. In contrast, involuntary actions include ongoing processes such as heartbeat, breathing, and digestion, which are regulated by brain centers (primarily in the midbrain and hindbrain) and operate continuously without conscious input.",
    "explanation": "Reflex actions are designed for immediate protection against harmful stimuli (like withdrawing a hand from a hot surface), while involuntary actions maintain essential life functions and homeostasis over a longer term. Both are involuntary, but reflex actions are quicker and involve simpler neural circuitry (often bypassing the brain), whereas many involuntary functions are managed by complex networks in the brain.",
    "topic": "Neurophysiology and Autonomic Functions",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex010"
  },
  {
    "question_text": "Compare and contrast nervous and hormonal mechanisms for control and coordination in animals.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Nervous mechanisms use electrical impulses transmitted by neurons for rapid, localized responses with short-lived effects, while hormonal mechanisms rely on chemical signals (hormones) released into the bloodstream, which act more slowly but have longer-lasting and widespread effects. Both systems work together to maintain homeostasis and coordinate body functions.",
    "explanation": "The nervous system is optimized for speed and specificity, using synapses and neural networks to transmit signals quickly across defined pathways. In contrast, the endocrine system employs hormones which diffuse through blood and affect multiple tissues simultaneously, making it ideal for regulating long-term processes such as growth, metabolism, and reproduction. Their complementary roles are evident in responses like the 'fight or flight' reaction, where nervous signals and hormonal responses (e.g., adrenaline release) are integrated.",
    "topic": "Neuroendocrinology",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex011"
  },
  {
    "question_text": "What is the difference between the manner in which movement takes place in a sensitive plant and the movement in our legs?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In a sensitive plant like Mimosa pudica, movement occurs due to rapid changes in turgor pressure within specialized cells (pulvini) that cause the leaves to fold; this is a non-growth, nastic movement mediated by electrical-chemical signals but without specialized muscle tissue. In contrast, movement in our legs is achieved through the contraction and relaxation of muscle fibers, controlled by nerve impulses from the central nervous system, which is a process involving complex interactions between the nervous and muscular systems.",
    "explanation": "Sensitive plants respond to touch by altering the water content in specific cells, resulting in a rapid physical change (movement) without actual growth. This mechanism is distinct from muscle contraction in animals, which involves the sliding filament theory (actin and myosin interactions) triggered by electrical impulses, often under voluntary control. The two mechanisms reflect adaptations to the different structural and functional needs of plants and animals.",
    "topic": "Comparative Physiology: Plant Movement vs. Animal Movement",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ex012"
  },
  {
    "question_text": "Which hormone is primarily responsible for preparing an animal's body for a fight or flight response?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Insulin",
      "B. Thyroxin",
      "C. Adrenaline",
      "D. Growth hormone"
    ],
    "correct_answer": "C. Adrenaline – It is released from the adrenal glands and circulates through the blood to prepare various tissues for rapid action.",
    "explanation": "Adrenaline accelerates the heart rate, increases blood flow to skeletal muscles, and dilates the air passages, enabling the body to respond quickly to stressful situations.",
    "topic": "Hormones and the Endocrine System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen028"
  },
  {
    "question_text": "The thyroid gland produces thyroxin. What is the primary role of thyroxin in the body?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. To regulate blood sugar levels",
      "B. To prepare the body for emergencies",
      "C. To regulate metabolism for body growth",
      "D. To stimulate the immune system"
    ],
    "correct_answer": "C. To regulate metabolism for body growth – Thyroxin helps maintain the body’s metabolic rate and is essential for growth and development.",
    "explanation": "Thyroxin influences the metabolism of carbohydrates, proteins, and fats, thereby ensuring that energy is properly utilized for growth and cellular functions.",
    "topic": "Hormones and Metabolism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen029"
  },
  {
    "question_text": "Which of the following correctly matches the hormone to its endocrine gland?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Insulin - Thyroid gland",
      "B. Adrenaline - Adrenal gland",
      "C. Growth hormone - Pancreas",
      "D. Oestrogen - Pituitary gland"
    ],
    "correct_answer": "B. Adrenaline - Adrenal gland – Adrenaline is secreted by the adrenal gland and is involved in the fight or flight response.",
    "explanation": "The adrenal gland produces adrenaline, a key hormone that enables the body to manage stressful situations. Matching other hormones correctly is critical for understanding their functions.",
    "topic": "Hormone-Gland Relationships",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen030"
  },
  {
    "question_text": "Insulin plays a crucial role in regulating blood sugar levels. Which organ produces insulin?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Pancreas",
      "B. Pituitary gland",
      "C. Adrenal gland",
      "D. Thyroid gland"
    ],
    "correct_answer": "A. Pancreas – The pancreas produces insulin, which helps in regulating the concentration of glucose in the blood.",
    "explanation": "Insulin facilitates the uptake of glucose by cells and thereby reduces blood sugar levels. It is secreted by the beta cells of the pancreas.",
    "topic": "Hormones and Blood Sugar Regulation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen031"
  },
  {
    "question_text": "Define the endocrine system and describe how hormones function as chemical messengers in animals.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The endocrine system is a network of glands that secrete hormones directly into the bloodstream. These hormones act as chemical messengers that regulate various physiological processes such as metabolism, growth, development, and stress response.",
    "explanation": "Hormones released by endocrine glands travel via blood to target tissues, where they bind to specific receptors to trigger appropriate responses. This system works in tandem with the nervous system for overall body regulation.",
    "topic": "Endocrine System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen032"
  },
  {
    "question_text": "Explain the role of iodine in the production of thyroxin and discuss what might occur in the case of an iodine deficit.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Iodine is required by the thyroid gland to synthesize the hormone thyroxin. A deficiency in iodine can lead to reduced thyroxin production, causing hypothyroidism and conditions such as goitre, which is the enlargement of the thyroid gland.",
    "explanation": "Iodine is a vital micronutrient; its deficiency impairs the gland's ability to make sufficient thyroxin, disrupting metabolism and growth. This can have serious developmental and metabolic consequences.",
    "topic": "Thyroid Function and Iodine",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen033"
  },
  {
    "question_text": "Discuss how the release of adrenaline affects various organ systems in the body during a stressful situation.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When adrenaline is released into the bloodstream, it causes several coordinated effects: the heart rate increases to deliver more oxygen to muscles; blood vessels supplying the digestive system and skin constrict, diverting blood to skeletal muscles; and the rate of breathing increases due to muscle contractions of the diaphragm and rib cage. These changes prepare the body to either fight or run in response to a stressor.",
    "explanation": "Adrenaline acts as a systemic signal that mobilizes energy stores and optimizes blood flow towards vital organs needed during emergencies, a process known as the 'fight or flight' response. This hormonal action shows how the endocrine system integrates multiple physiological responses during stress.",
    "topic": "Adrenaline and Stress Response",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen034"
  },
  {
    "question_text": "How does the feedback mechanism control hormone levels in the body? Illustrate your answer with examples involving insulin and growth hormone.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Feedback mechanisms, usually negative feedback loops, maintain hormone balance by adjusting hormone secretion based on the body’s needs. For example, when blood sugar rises, pancreatic beta cells release more insulin to lower glucose levels. As the blood sugar normalizes, insulin secretion decreases. Similarly, if the levels of growth hormone are low, the hypothalamus secretes growth hormone releasing factor, stimulating the pituitary gland to produce more growth hormone. This dynamic regulation ensures that hormone levels remain within the optimal range.",
    "explanation": "Feedback loops are essential for homeostasis, ensuring that hormones do not exceed or drop below required levels. In negative feedback, the end product of a process inhibits its further production; in positive feedback (less common in hormone regulation), the process is amplified. Examples include both insulin and growth hormone regulation.",
    "topic": "Hormone Regulation and Feedback Mechanisms",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen035"
  },
  {
    "question_text": "Discuss how hormonal imbalances can affect physical growth, citing examples such as dwarfism and gigantism.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Hormonal imbalances, particularly with growth hormone levels, can significantly alter physical growth. A deficiency of growth hormone during childhood can lead to dwarfism, characterized by short stature and underdeveloped bones, whereas an excess of growth hormone can cause gigantism, where individuals grow excessively tall and may suffer from joint problems and other health issues. These conditions illustrate how precise hormone regulation is crucial for normal development.",
    "explanation": "Growth hormone is critical during the developmental stages; its balance is maintained via feedback mechanisms. Disturbances in this balance can lead to abnormal growth patterns, underscoring the importance of hormonal regulation in ensuring proper development and overall health.",
    "topic": "Growth Hormone and Development",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen036"
  },
  {
    "question_text": "True or False: The hypothalamus directly secretes insulin to regulate blood sugar levels.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False – The pancreas secretes insulin, not the hypothalamus.",
    "explanation": "While the hypothalamus plays a crucial role in regulating hormone release by secreting releasing factors, insulin is synthesized and released by the beta cells in the pancreas.",
    "topic": "Hormone Production",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen037"
  },
  {
    "question_text": "True or False: Adrenaline is produced by the adrenal gland and helps divert blood flow from the digestive system to the skeletal muscles during stress. If false, provide the correct information.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True – Adrenaline is secreted by the adrenal gland and functions to prepare the body for crisis situations by redirecting blood flow and increasing heart and breathing rates.",
    "explanation": "The statement is correct. During stressful or emergency situations, adrenaline is released into the bloodstream to ensure that critical organs, particularly the heart and skeletal muscles, receive more blood, while non-essential systems like the digestive tract are temporarily downregulated.",
    "topic": "Adrenaline and the Stress Response",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen038"
  },
  {
    "question_text": "Describe the process by which the hypothalamus influences the secretion of hormones from the pituitary gland, and explain how this interaction is integral to the endocrine system's function.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The hypothalamus releases specific releasing hormones that travel to the pituitary gland, stimulating it to secrete its own hormones. This interaction forms a critical link in the endocrine system, ensuring that hormone levels are properly regulated and coordinated throughout the body.",
    "explanation": "This hypothalamus-pituitary connection is known as the hypothalamic–pituitary axis and is essential for regulating various physiological processes such as growth, metabolism, and stress responses. The feedback mechanisms between these two glands maintain overall homeostasis.",
    "topic": "Hypothalamus-Pituitary Interaction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen039"
  },
  {
    "question_text": "Design a simple experimental outline to investigate how a deficiency of iodine affects the thyroid gland’s function in an animal model. Include controls, variables, and the expected outcomes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The experimental design would involve two groups of an appropriate animal model: a control group fed a normal diet containing adequate iodine and an experimental group on an iodine-deficient diet. The independent variable is iodine intake, and dependent variables are indicators of thyroid function such as levels of thyroxin, size of the thyroid gland (to detect goitre), and metabolic rate. It is expected that the iodine-deficient group will show decreased thyroxin levels, an enlarged thyroid gland, and altered metabolic function compared to controls.",
    "explanation": "This experiment would test the hypothesis that iodine is essential for thyroid hormone synthesis. Measurements would include blood assays for thyroxin levels and histological examination of the thyroid gland. Consistent control of environmental variables ensures that any differences observed are due to iodine deficiency alone.",
    "topic": "Thyroid Function and Iodine Deficiency",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen040"
  },
  {
    "question_text": "What roles do animal hormones play in growth, and how does the secretion of hormones like growth hormone and sex hormones (testosterone and oestrogen) contribute to the changes observed during puberty?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Growth hormone directly stimulates cell growth and development across the body, while sex hormones such as testosterone and oestrogen regulate the development of secondary sexual characteristics and reproductive organs during puberty.",
    "explanation": "During puberty, the increased secretion of these hormones triggers changes such as increased muscle mass, bone growth, and the development of features specific to males and females. These hormonal changes ensure that growth is both coordinated and appropriate for the individual's developmental stage.",
    "topic": "Hormones in Growth and Puberty",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_x_jesc1dd_c106_gen041"
  },
  {
    "question_text": "What is the difference between a reflex action and walking?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A reflex action is an involuntary, rapid response to a stimulus that is mediated by a direct reflex arc in the spinal cord, without the need for conscious thought, whereas walking is a voluntary, coordinated action controlled by higher brain centers, such as the cerebrum and cerebellum, involving conscious decision-making and learning.",
    "explanation": "Reflex actions, such as pulling your hand away from a hot object, are mediated through a reflex arc that directly connects sensory input with motor output in the spinal cord. This minimizes reaction time and protects the body from harm. In contrast, walking requires complex processing that involves many neurons in the brain. The cerebrum is responsible for initiating the movement and planning the sequence, while the cerebellum ensures coordination, balance, and fine tuning of the movement. This distinction highlights the difference in speed and complexity between simple reflex circuits and higher-order motor control.",
    "topic": "Nervous System - Reflex Actions vs. Voluntary Movements",
    "bloom_level": "Analyze",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic001"
  },
  {
    "question_text": "What happens at the synapse between two neurons?",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "At the synapse, when an electrical impulse reaches the axon terminal of the presynaptic neuron, it triggers the release of neurotransmitters into the synaptic gap. These chemical messengers then bind to specific receptor sites on the postsynaptic neuron's dendrite or cell body, thereby initiating a new electrical impulse in that neuron.",
    "explanation": "The process involves several steps: the impulse travels along the axon to the nerve ending, where it causes vesicles to release neurotransmitters into the synaptic cleft. Once released, these chemicals diffuse across the gap and attach to receptor proteins on the postsynaptic neuron, which then open ion channels and generate a new electrical impulse. This mechanism is fundamental in neural communication and is essential for both reflex actions and more complex brain functions.",
    "topic": "Nervous System - Neural Communication and Synaptic Transmission",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic002"
  },
  {
    "question_text": "Which part of the brain maintains posture and equilibrium of the body?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cerebrum",
      "Cerebellum",
      "Medulla",
      "Hypothalamus"
    ],
    "correct_answer": "Cerebellum",
    "explanation": "The cerebellum, located in the hind-brain, plays a crucial role in maintaining balance, posture, and the precision of voluntary movements. It integrates input from various sensory systems and coordinates smooth motor activity, ensuring that activities such as walking and other movements are well-balanced and controlled.",
    "topic": "Human Brain - Cerebellum and Motor Coordination",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic003"
  },
  {
    "question_text": "How do we detect the smell of an agarbatti (incense stick)?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "We detect the smell of an agarbatti through olfactory receptors located in the nasal cavity. The volatile chemical molecules released from the burning incense dissolve in the mucus lining inside the nose and bind to the olfactory receptors. This binding converts the chemical signal into an electrical impulse that is transmitted via the olfactory nerve to the fore-brain, where it is interpreted as a specific smell.",
    "explanation": "The detection process begins when the agarbatti releases volatile compounds into the air. These compounds enter the nasal passage and interact with the mucus layer, facilitating their binding to specialized olfactory receptors. Once bound, these receptors generate an electrical impulse similar to other neural signaling processes, which is then relayed to the brain. The brain processes these signals, allowing us to perceive and distinguish the unique aroma of the incense. This process is an excellent example of sensory transduction in the olfactory system.",
    "topic": "Sensory Systems - Olfaction",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic004"
  },
  {
    "question_text": "What is the role of the brain in reflex action?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The brain is not primarily involved in the immediate execution of a reflex action, which is managed by the spinal cord via a reflex arc for rapid response. However, the brain receives the sensory information after the reflex has occurred, allowing it to become aware of the stimulus and potentially modify or inhibit subsequent reflex responses based on experience and context.",
    "explanation": "Reflex actions are designed for speed and occur without the intervention of higher brain centers, ensuring minimal delay in response to harmful stimuli. The sensory neuron directly interfaces with motor neurons in the spinal cord, facilitating a quick reaction. Nonetheless, a parallel pathway carries the sensory information up to the brain, where the event is processed and integrated. This awareness allows for future modifications in behavior and enables the brain to exert some inhibitory control over certain reflexes if necessary. Such dual processing demonstrates the efficiency of the nervous system in dealing with both immediate and considered responses.",
    "topic": "Nervous System - Reflex Arcs and Brain Function",
    "bloom_level": "Analyze",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic005"
  },
  {
    "question_text": "Which part of a neuron is responsible for acquiring information from the environment?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Nucleus",
      "Axon",
      "Dendrite",
      "Synapse"
    ],
    "correct_answer": "Dendrite – it contains receptors that detect external signals and initiate nerve impulses.",
    "explanation": "Dendrites are specialized structures that receive signals from receptors responding to stimuli from the environment, setting the process of nerve impulse transmission in motion.",
    "topic": "Neuron Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen001"
  },
  {
    "question_text": "At which part of the neuron is the electrical impulse converted into a chemical signal for onward transmission?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Dendrite",
      "Cell body",
      "Axon",
      "Nerve ending (axon terminal)"
    ],
    "correct_answer": "Nerve ending (axon terminal) – here the impulse causes the release of neurotransmitters across the synapse.",
    "explanation": "At the axon terminal, when the electrical impulse reaches the end of the neuron, it triggers the release of chemicals (neurotransmitters) that cross the synaptic gap to stimulate the next cell.",
    "topic": "Neuronal Communication",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen002"
  },
  {
    "question_text": "Which structure provides protection and shock absorption to the brain?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Vertebral column",
      "Meninges with cerebrospinal fluid inside the skull",
      "Skin",
      "Muscular tissue"
    ],
    "correct_answer": "Meninges with cerebrospinal fluid inside the skull – the brain is housed in a bony skull and cushioned by a fluid-filled membrane.",
    "explanation": "The brain is protected by being enclosed in the skull and further cushioned by cerebrospinal fluid contained within the meninges, ensuring shock absorption.",
    "topic": "Protection of Nervous Tissue",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen003"
  },
  {
    "question_text": "What is the primary function of the cerebellum?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Regulating heart rate",
      "Maintaining posture and balance, and refining voluntary movements",
      "Conscious thought",
      "Sensory signal reception"
    ],
    "correct_answer": "Maintaining posture and balance, and refining voluntary movements.",
    "explanation": "The cerebellum is responsible for coordination, precision of voluntary movements, and maintaining balance and posture, allowing smooth and accurate body movements.",
    "topic": "Brain Functions",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen004"
  },
  {
    "question_text": "Define a 'reflex arc' and explain its significance in the functioning of the nervous system.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A reflex arc is a neural pathway in which sensory neurons connect directly, via interneurons in the spinal cord, with motor neurons to produce an immediate response to a stimulus. It is significant because it enables rapid, automatic responses to potentially harmful stimuli, bypassing the slower processing centers in the brain.",
    "explanation": "Reflex arcs allow the body to react quickly by transferring the sensory input directly to the motor outputs at the level of the spinal cord. This efficiency is crucial for protecting the body against injury, such as quickly withdrawing a hand from a hot surface.",
    "topic": "Reflex Arc",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen005"
  },
  {
    "question_text": "Explain how blocking your nose affects the perception of taste.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Blocking the nose prevents volatile molecules from food from reaching the olfactory receptors, which diminishes the smell component of taste. Without the sense of smell, food lacks its complex flavor profile and tastes bland even though basic tastes like sweet, sour, salty, bitter, and umami are still detected by the tongue.",
    "explanation": "Taste is a combination of both gustatory signals (from the tongue) and olfactory signals (from the nose). When the olfactory receptors are obstructed, the overall flavor experience is greatly reduced.",
    "topic": "Taste Perception",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen006"
  },
  {
    "question_text": "List the three major parts of the human brain and describe one primary function of each.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The three major parts are: 1) Fore-brain, which is responsible for higher cognitive functions, sensory processing, and voluntary movement; 2) Mid-brain, which controls certain involuntary reflexes and processes related to eye and head movement; 3) Hind-brain, which includes the medulla (regulating vital functions such as heartbeat and breathing), the pons (relaying nerve signals), and the cerebellum (coordinating precise movements and balance).",
    "explanation": "Each part of the brain has specialized functions. The fore-brain manages conscious thought and voluntary actions, the mid-brain controls reflexive responses, and the hind-brain ensures the smooth execution of both involuntary functions and coordinated voluntary actions.",
    "topic": "Brain Structure and Functions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen007"
  },
  {
    "question_text": "How do nerve cells and muscle cells interact to produce movement?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When a nerve impulse reaches a muscle, it triggers the release of neurotransmitters at the neuromuscular junction. These neurotransmitters bind to receptors on the muscle cell, causing changes in the arrangement of muscle proteins (such as actin and myosin), which leads to muscle contraction and, consequently, movement.",
    "explanation": "The transmission of an electrical impulse from a neuron to a muscle cell involves chemical signaling at the neuromuscular junction, which ultimately results in the muscle fibers shortening (contracting) and producing movement.",
    "topic": "Neuromuscular Function",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen008"
  },
  {
    "question_text": "Describe the process by which a nerve cell receives, processes, and transmits information, starting from the detection of a stimulus to the response in an effector cell.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The process starts when a stimulus is detected by specialized receptors on the dendrites of a neuron. This detection initiates a chemical change that generates an electrical impulse. The impulse is then transmitted from the dendrites through the cell body and along the axon to the nerve ending. At the axon terminal, the electrical impulse triggers the release of neurotransmitters into the synapse, where they cross over to the dendrite of the next neuron or an effector cell such as a muscle. This process allows the body to receive and respond to environmental stimuli rapidly.",
    "explanation": "A neuron works by converting external stimuli into electrical signals which are propagated along its structure. The transmission at the synapse involves converting the electrical signal back into a chemical signal, ensuring that the communication continues effectively to the next cell or a muscle fiber, resulting in a coordinated response.",
    "topic": "Neuronal Impulse Transmission",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen009"
  },
  {
    "question_text": "Explain how the design of the body enables rapid reflex actions and compare it to voluntary responses.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Rapid reflex actions are enabled by the reflex arc, which directly connects sensory inputs with motor outputs via the spinal cord, bypassing the need for brain processing. This expedites the response, which is vital in situations like withdrawing a hand from a hot surface. In contrast, voluntary responses involve more complex processing in the brain, where sensory information is analyzed and decisions are made before sending signals back to the muscles. This extra processing time makes voluntary responses slower compared to reflex actions.",
    "explanation": "The reflex arc minimizes the distance and time between detecting a stimulus and executing a response by using a direct route through the spinal cord. Voluntary actions, meanwhile, require the brain to integrate information from multiple sources, decide on a course of action, and then send signals to the muscles, which inherently takes more time.",
    "topic": "Reflex vs. Voluntary Actions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen010"
  },
  {
    "question_text": "Discuss the role of the different parts of the brain in coordinating both voluntary and involuntary actions, and how damage to these areas might impact bodily functions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The fore-brain (including the cerebrum and hypothalamus) is involved in processing sensory information, higher cognitive functions, and initiating voluntary actions, such as planning and executing movements. The mid-brain manages certain involuntary reflexes, including eye and head movements, while the hind-brain, comprising the medulla (which regulates vital functions like heartbeat and breathing), pons (which relays signals), and cerebellum (which ensures balance, coordination, and precision), controls involuntary actions and coordinates complex motor tasks. Damage to the fore-brain might impair decision-making, memory, and voluntary movement, while damage to the hind-brain (especially the medulla) can affect essential life-sustaining functions and cerebellar damage can result in loss of coordination and balance.",
    "explanation": "Each region of the brain specializes in different functions. Voluntary actions require conscious thought and coordination primarily managed by the fore-brain, whereas involuntary actions, such as breathing and heart rate regulation, are controlled by the mid-brain and hind-brain. Damage to these areas can significantly disrupt either complex behavior or basic life functions, underscoring the importance of each brain region.",
    "topic": "Brain Functions and Damage Implications",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen011"
  },
  {
    "question_text": "True or False: The nucleus of a neuron is the primary site for receiving sensory information.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. The dendrites are responsible for receiving sensory information.",
    "explanation": "While the nucleus directs cell activities, it is the dendrites that house the receptors for detecting environmental stimuli.",
    "topic": "Neuron Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen012"
  },
  {
    "question_text": "True or False: Reflex actions require the involvement of the brain to process sensory information before initiating a motor response.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Reflex actions are mediated directly through the spinal cord via the reflex arc, allowing for faster responses without initial processing in the brain.",
    "explanation": "The reflex arc bypasses the brain to rapidly connect sensory input to motor output, which is essential for protective reflexes such as pulling away from a hot object.",
    "topic": "Reflex Arc",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen013"
  },
  {
    "question_text": "True or False: Muscle contraction in response to a nerve impulse is due to chemical changes in muscle proteins that cause the muscle cell to shorten.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True. Muscle contraction is initiated by chemical changes in proteins such as actin and myosin, leading to the shortening of muscle fibers.",
    "explanation": "When a nerve impulse reaches a muscle cell, it triggers the release of neurotransmitters that induce chemical modifications in the muscle proteins. This results in the sliding of the actin and myosin filaments, ultimately causing muscle contraction.",
    "topic": "Muscle Contraction Mechanism",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_x_jesc1dd_c106_gen014"
  },
  {
    "question_text": "How does chemical coordination take place in animals?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Chemical coordination in animals occurs through the endocrine system. Endocrine glands secrete hormones directly into the bloodstream, allowing these chemical messengers to travel to target cells or organs where they bind to specific receptors and trigger physiological responses.",
    "explanation": "In animals, besides the rapid electrical impulses of the nervous system, the endocrine system provides chemical coordination. Hormones like adrenaline, thyroxin, and insulin are secreted by glands (such as the adrenal glands, thyroid gland, and pancreas) and circulate in the blood, ensuring that all parts of the body receive the necessary signals for functions like metabolism, growth, reproduction, and stress responses. This process demonstrates the integration of chemical signaling and receptor binding to produce controlled biological reactions.",
    "topic": "Endocrine System and Hormonal Coordination",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic011"
  },
  {
    "question_text": "Why is the use of iodised salt advisable?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Iodised salt is advisable because iodine is essential for the thyroid gland to synthesize the hormone thyroxin, which regulates metabolism and supports proper growth and development. Without adequate iodine intake, there is a risk of developing goitre and other thyroid-related disorders.",
    "explanation": "Iodine is a key component in the production of thyroxin by the thyroid gland. This hormone helps regulate carbohydrate, protein, and fat metabolism, contributing to balanced growth and proper functioning of the body. Iodine deficiency can result in an enlarged thyroid (goitre) and hypothyroidism. Therefore, iodised salt is used to ensure sufficient iodine intake, making it a practical public health measure.",
    "topic": "Thyroid Function and Iodine Nutrition",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic012"
  },
  {
    "question_text": "How does our body respond when adrenaline is secreted into the blood?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When adrenaline is secreted into the blood, it initiates the 'fight or flight' response. This includes an increase in heart rate, elevated blood pressure, faster breathing rate, and redirection of blood flow from non-essential organs (like the skin and digestive system) to the skeletal muscles. These changes provide the body with increased energy and oxygen to respond to emergencies.",
    "explanation": "Adrenaline, a hormone produced by the adrenal glands, binds to adrenergic receptors on various target cells. This binding triggers several physiological changes: the heart pumps faster to meet higher oxygen demand; blood vessels in peripheral regions constrict to shunt blood to vital muscle tissues; and respiration rate increases to enhance oxygen intake. These combined effects prepare the body for rapid and intense physical activity, characteristic of the fight or flight response.",
    "topic": "Adrenaline and the Fight or Flight Response",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic013"
  },
  {
    "question_text": "Why are some patients of diabetes treated by giving injections of insulin?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Patients with diabetes are treated with insulin injections because their bodies either do not produce enough insulin (as in Type 1 diabetes) or do not respond effectively to insulin (as in advanced Type 2 diabetes). Insulin is necessary for facilitating cellular uptake of glucose, which regulates blood sugar levels.",
    "explanation": "Insulin is a hormone produced by the pancreas that enables cells to absorb glucose from the bloodstream, providing energy and maintaining normal blood sugar levels. In diabetes, insufficient insulin production or insulin resistance leads to elevated blood glucose levels, which can cause serious complications over time. Insulin injections help to restore these levels within a normal range, ensuring that the body can properly use glucose for energy.",
    "topic": "Diabetes Management and Insulin Function",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic014"
  },
  {
    "question_text": "What are plant hormones?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Plant hormones, also known as phytohormones, are chemical compounds produced in small amounts by plants. They regulate various aspects of growth, development, and responses to environmental stimuli. They are usually synthesized in one part of the plant and then transported to other regions to exert their effects. Examples include auxins, gibberellins, cytokinins, abscisic acid, and ethylene.",
    "explanation": "Plant hormones act as signaling molecules that control cell elongation, division, and differentiation. They enable plants to respond to changes in their environment, coordinate developmental processes, and regulate stress responses. Their mode of action typically involves binding to specific receptors and triggering a cascade of cellular events. This concept is central in understanding plant physiology and adaptation.",
    "topic": "Plant Hormones",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic006"
  },
  {
    "question_text": "How is the movement of the leaves of the sensitive plant different from the movement of a shoot towards light?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The movement of the leaves of the sensitive plant is rapid and does not involve growth, whereas the movement of a shoot towards light is slow and growth-dependent. In the sensitive plant, physical touch triggers a rapid change in cell turgidity (especially in the pulvinus region) causing the leaves to fold up (a nastic movement). In contrast, the shoot’s movement towards light (phototropism) involves the redistribution of the hormone auxin which causes differential cell elongation on the shaded side, resulting in a gradual bending towards the light.",
    "explanation": "Sensitive plant movement (thigmonasty) occurs quickly due to rapid changes in water content within specialized cells, allowing an almost instantaneous response to touch. Conversely, phototropic movement in shoots is a growth-mediated process where auxin accumulates on the side away from the light. This differential growth leads the shoot to bend toward the light source over time. The explanation connects physiological processes (turgor changes vs. hormone-driven cell elongation) to observable movement responses in plants.",
    "topic": "Plant Movements and Tropisms",
    "bloom_level": "Analyze",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic007"
  },
  {
    "question_text": "Give an example of a plant hormone that promotes growth.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Auxin is a prime example of a plant hormone that promotes growth by stimulating cell elongation. Additionally, gibberellins promote stem growth and cytokinins promote cell division.",
    "explanation": "Auxin, predominantly produced in young shoot tips, plays a key role in cell elongation and directional (phototropic) responses in plants. Gibberellins and cytokinins are also involved in promoting different aspects of plant growth, such as stem extension and cell division, respectively. These hormones interplay to ensure proper growth and development according to environmental cues.",
    "topic": "Plant Hormones",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic008"
  },
  {
    "question_text": "How do auxins promote the growth of a tendril around a support?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When a tendril contacts a support, auxin is redistributed so that it accumulates more on the side of the tendril that is not in contact with the support. This differential concentration of auxin causes cells on the non-contact side to elongate faster than those on the contact side, resulting in a bending of the tendril around the support, a process characteristic of thigmotropism.",
    "explanation": "The process involves the perception of touch which initiates asymmetrical auxin transport. Auxin’s effect on cell elongation is concentration-dependent; higher concentrations promote longer cell expansion. With one side growing faster than the other, the tendril curves inward around the support. This mechanism illustrates how plants convert a mechanical stimulus into a directional growth response through hormonal regulation.",
    "topic": "Plant Tropisms and Hormonal Regulation",
    "bloom_level": "Analyze",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic009"
  },
  {
    "question_text": "Design an experiment to demonstrate hydrotropism.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An experiment to demonstrate hydrotropism can be designed as follows: 1) Prepare a wire mesh trough and fill it with moist sawdust or soil. 2) Plant several germinating seeds (such as bean seeds) in the center of the trough. 3) Place a small porous clay pot filled with water at one end of the trough to create a localized high-moisture area. 4) To minimize phototropism, keep the trough in a uniformly lit environment or in darkness. 5) Observe the direction of root growth after a few days. The expected result is that the roots will bend toward the moist area, demonstrating positive hydrotropism.",
    "explanation": "This experimental setup distinguishes hydrotropism from phototropism by controlling light conditions. By providing a higher concentration of water at one end of the trough, the moisture gradient is established. Roots, which are sensitive to moisture through hydrotropic responses, will grow preferentially toward the water source. This experiment exemplifies how controlled environmental conditions can isolate specific plant responses, reinforcing the role of plant hormones and directional growth in hydrotropism.",
    "topic": "Plant Tropisms (Hydrotropism)",
    "bloom_level": "Create",
    "source": "in-chapter",
    "chapter_id": "jesc106",
    "question_id": "cbse_x_jesc1dd_c106_ic010"
  }
]