[
  {
    "question_text": "What is the primary function of the ozone layer in the Earth's stratosphere?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. To produce oxygen for life",
      "B. To shield the Earth from harmful ultraviolet (UV) radiation",
      "C. To generate weather patterns",
      "D. To store heat from the Sun"
    ],
    "correct_answer": "B. To shield the Earth from harmful ultraviolet (UV) radiation",
    "explanation": "The ozone layer absorbs and scatters the solar ultraviolet radiation, protecting living organisms from its damaging effects.",
    "topic": "Ozone Layer",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen015"
  },
  {
    "question_text": "Which of the following chemicals is most commonly associated with the depletion of the ozone layer?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Carbon Dioxide (CO2)",
      "B. Chlorofluorocarbons (CFCs)",
      "C. Methane (CH4)",
      "D. Nitrogen (N2)"
    ],
    "correct_answer": "B. Chlorofluorocarbons (CFCs)",
    "explanation": "Chlorofluorocarbons (CFCs) are synthetic chemicals that have been shown to cause significant depletion of the ozone layer when released into the atmosphere.",
    "topic": "Ozone Depletion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen016"
  },
  {
    "question_text": "Which of the following statements about biodegradable waste is correct?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It consists only of plastic materials.",
      "B. It decomposes under natural conditions through the action of microorganisms.",
      "C. It remains unchanged in the environment for hundreds of years.",
      "D. It includes materials that can only be broken down by extreme physical conditions."
    ],
    "correct_answer": "B. It decomposes under natural conditions through the action of microorganisms.",
    "explanation": "Biodegradable materials like food waste, paper, and natural fabrics are broken down naturally by the action of microorganisms.",
    "topic": "Waste Management",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen017"
  },
  {
    "question_text": "Which combination of factors is most likely to determine the rate of decomposition of organic waste?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Moisture, temperature, and the type of microorganisms present",
      "B. The color and shape of the waste material",
      "C. The altitude at which the waste is deposited",
      "D. Only the amount of moisture present"
    ],
    "correct_answer": "A. Moisture, temperature, and the type of microorganisms present",
    "explanation": "Decomposition is influenced by environmental conditions such as moisture, temperature, and the type of decomposing microorganisms, all of which determine how quickly organic matter breaks down.",
    "topic": "Decomposition Processes",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen018"
  },
  {
    "question_text": "Define ozone and explain how it differs from oxygen (O2).",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Ozone (O3) is a molecule made up of three oxygen atoms, while oxygen (O2) is a molecule with two oxygen atoms. O2 is essential for aerobic life, whereas O3, although toxic near the surface, provides crucial protection by absorbing ultraviolet (UV) radiation in the stratosphere.",
    "explanation": "Ozone is chemically different from oxygen; its triatomic structure makes it unstable at ground level but effective as a UV shield in the upper atmosphere.",
    "topic": "Ozone",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen019"
  },
  {
    "question_text": "What are Ozone Depleting Substances (ODS) and why are they harmful to the ozone layer?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ozone Depleting Substances (ODS) are chemicals such as CFCs, halons, carbon tetrachloride, and methyl chloroform. They damage the ozone layer by releasing chlorine and bromine atoms when they are broken down by UV radiation, which then catalyze the destruction of ozone molecules.",
    "explanation": "ODS are harmful because even a small number of these compounds can catalyze a reaction that destroys ozone in a repetitive cycle, reducing the protective ozone concentration in the stratosphere.",
    "topic": "Ozone Depletion",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen020"
  },
  {
    "question_text": "What does it mean for a substance to be biodegradable? Provide two examples of biodegradable and two examples of non-biodegradable materials.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A substance is biodegradable if it can be broken down by microorganisms into simpler compounds. Examples of biodegradable materials include food scraps and paper. Non-biodegradable materials include plastics and glass.",
    "explanation": "Biodegradable substances decompose naturally via microbial activity, making them less persistent in the environment compared to non-biodegradable substances which can remain for long periods.",
    "topic": "Waste Management",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen021"
  },
  {
    "question_text": "Describe the process of ozone formation in the stratosphere, including the role of ultraviolet (UV) radiation and oxygen molecules.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ultraviolet (UV) radiation from the Sun splits molecular oxygen (O2) into two free oxygen atoms. Each free oxygen atom then reacts with another O2 molecule to form ozone (O3). The process can be summarized by the reactions: O2 --(UV)--> O + O and O + O2 → O3. This process is essential as the ozone formed in the stratosphere absorbs harmful UV rays, protecting living organisms on Earth.",
    "explanation": "This process, known as the Chapman cycle, is vital to maintaining the balance of stratospheric ozone. Although this cycle creates ozone, it is offset by natural and human-induced destruction of ozone molecules, leading to concerns about ozone depletion.",
    "topic": "Ozone Formation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen022"
  },
  {
    "question_text": "Discuss the impact of non-biodegradable waste on the environment and evaluate the effectiveness of current waste management strategies, including the role of biodegradable plastics.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Non-biodegradable waste, such as plastics, glass, and metals, remains in the environment for long periods, contributing to pollution, harming wildlife, and disrupting ecosystems. Current waste management strategies include reducing consumption, recycling, and proper segregation of waste. Biodegradable plastics are being developed to decompose faster than conventional plastics; however, they generally require specific conditions like industrial composting facilities for proper breakdown and may not be effective in all environments. Overall, while these strategies are steps in the right direction, a combination of reducing waste generation, enhancing recycling processes, and developing more efficient biodegradable alternatives is necessary to mitigate environmental impacts.",
    "explanation": "The long-lasting nature of non-biodegradable waste presents significant challenges for the environment. While biodegradable plastics offer a promising solution, their success is contingent on proper disposal and processing conditions. A holistic waste management strategy is vital for sustainable environmental protection.",
    "topic": "Waste Management",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen023"
  },
  {
    "question_text": "True or False: Ozone (O3) is toxic in all parts of the Earth's atmosphere. If false, explain why.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. Ozone is toxic at ground level, but in the stratosphere, it serves a critical role in protecting life on Earth by absorbing harmful UV radiation.",
    "explanation": "At lower altitudes, high concentrations of ozone can cause respiratory problems and other health issues. However, in the upper atmosphere, ozone forms a protective layer that prevents most UV radiation from reaching the Earth's surface.",
    "topic": "Ozone",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen024"
  },
  {
    "question_text": "True or False: All biodegradable materials decompose completely when disposed of in landfills. If false, provide a correction.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. While biodegradable materials generally decompose, decomposition in landfills can be slow or incomplete due to inadequate conditions such as low moisture, limited oxygen, or unsuitable microbial activity.",
    "explanation": "Landfills are often designed to minimize decomposition to reduce odors and leachate; therefore, even biodegradable materials may not break down efficiently in a landfill environment.",
    "topic": "Waste Decomposition",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen025"
  }
]