[
  {
    "question_text": "Which of the following best describes the law of reflection of light?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The angle of incidence is larger than the angle of reflection.",
      "B. The angle of incidence is equal to the angle of reflection.",
      "C. The angle of reflection is twice the angle of incidence.",
      "D. The angles of incidence and reflection are always complementary."
    ],
    "correct_answer": "B. The angle of incidence is equal to the angle of reflection.",
    "explanation": "According to the law of reflection, the angle at which the light ray hits the surface (angle of incidence) is equal to the angle at which it leaves the surface (angle of reflection).",
    "topic": "Reflection of Light",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen001"
  },
  {
    "question_text": "What is a unique property of the image formed by a plane mirror?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The image is inverted and larger than the object.",
      "B. The image is virtual and the same size as the object.",
      "C. The image is real and diminished.",
      "D. The image is virtual and laterally displaced."
    ],
    "correct_answer": "B. The image is virtual and the same size as the object.",
    "explanation": "A plane mirror forms a virtual image that is erect, laterally inverted, and equal in size to the object.",
    "topic": "Image Formation in Plane Mirrors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen002"
  },
  {
    "question_text": "When a concave (inner spoon) surface is used for reflecting an image of a face, what change occurs as the distance between the face and the spoon increases?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. The image remains erect and magnified at all distances.",
      "B. The image becomes inverted and diminished after a certain distance.",
      "C. The image becomes real and remains same size.",
      "D. The image always remains virtual and laterally reversed."
    ],
    "correct_answer": "B. The image becomes inverted and diminished after a certain distance.",
    "explanation": "For a concave mirror, when the object (face) is close, the image can be erect and magnified, but as the object is moved away, the image typically becomes inverted and reduced in size.",
    "topic": "Concave Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen003"
  },
  {
    "question_text": "Which property correctly describes the image formed by a convex (outer spoon) surface?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Real, inverted, and magnified.",
      "B. Virtual, erect, and diminished.",
      "C. Virtual, reversed laterally, and same size.",
      "D. Real, erect, and diminished."
    ],
    "correct_answer": "B. Virtual, erect, and diminished.",
    "explanation": "A convex mirror always forms a virtual, erect image that is smaller than the object regardless of the object distance.",
    "topic": "Convex Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen004"
  },
  {
    "question_text": "Define 'reflection of light'.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Reflection of light is the process in which light rays bounce off a surface.",
    "explanation": "Reflection of light occurs when light rays strike a surface and bounce back rather than being absorbed or transmitted. The law of reflection states that the angle of incidence equals the angle of reflection.",
    "topic": "Reflection of Light",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen005"
  },
  {
    "question_text": "List three main properties of the image formed by a plane mirror.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The image is virtual, erect, and equal in size to the object.",
    "explanation": "A plane mirror yields an image that is not real (virtual), appears upright (erect), and has the same dimensions as the actual object, though it is laterally inverted.",
    "topic": "Plane Mirror Image Properties",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen006"
  },
  {
    "question_text": "What are spherical mirrors and why are they called so?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Spherical mirrors are mirrors whose reflecting surfaces are part of a sphere.",
    "explanation": "Spherical mirrors are called spherical because their surfaces are portions of a sphere. They can be either concave or convex and obey the basic laws of reflection, with image characteristics depending on their curvature.",
    "topic": "Spherical Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen007"
  },
  {
    "question_text": "Explain how the image characteristics differ when a curved spoon is used as a mirror on its inner (concave) surface versus its outer (convex) surface.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When using the inner (concave) surface, if the object (e.g., your face) is close, the image is erect and magnified; however, upon moving away, the image becomes inverted and diminished. In contrast, the convex (outer) surface always produces a virtual, erect, and reduced image regardless of the distance.",
    "explanation": "A concave mirror can form both real and virtual images depending on object distance: close objects produce virtual, enlarged images, while objects at a greater distance yield real, inverted, and smaller images. A convex mirror, on the other hand, always forms a virtual image that is erect and diminished. This illustrates how curvature affects the path of reflected rays and, in turn, the image properties.",
    "topic": "Image Formation with Curved Mirrors",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen008"
  },
  {
    "question_text": "Describe, step by step, the process of light reflection from a curved surface and how object distance influences the image formation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Light rays incident on a curved mirror obey the law of reflection where the angle of incidence equals the angle of reflection. In a concave mirror, when the object is placed close to the mirror, the reflected rays appear to diverge from a point behind the mirror, forming a virtual, enlarged image. As the object moves further away, the reflected rays cross and form a real, inverted image which becomes smaller with increasing distance. With a convex mirror, however, the reflected rays diverge, and the observer sees a virtual, erect, and diminished image regardless of the object's position.",
    "explanation": "The process begins with light rays striking the mirror surface. Due to the curved nature of the mirror, the normals at the point of incidence vary. For concave mirrors, depending on the object's distance relative to the focal length, the rays either converge to form a real image or appear to diverge to form a virtual image. Convex mirrors always cause the rays to diverge, resulting in diminished, virtual images. This phenomenon is a direct consequence of the mirror's geometry and the law of reflection.",
    "topic": "Reflection from Curved Surfaces",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen009"
  },
  {
    "question_text": "True or False: The law of reflection does not apply to curved surfaces such as spherical mirrors.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. The law of reflection applies to curved surfaces just as it does for plane mirrors.",
    "explanation": "The law of reflection, which states that the angle of incidence equals the angle of reflection, is universal and applies to all reflecting surfaces including curved or spherical mirrors.",
    "topic": "Laws of Reflection",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen010"
  },
  {
    "question_text": "True or False: A concave mirror always forms a real image regardless of the object's distance from the mirror. If false, provide the correction.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. A concave mirror can form a virtual image when the object is placed within the focal length, and a real image when the object is beyond the focal length.",
    "explanation": "A concave mirror produces a virtual, upright, and magnified image when the object is placed within its focal length. When the object moves away from the mirror (beyond the focal point), the mirror forms a real, inverted image.",
    "topic": "Concave Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen011"
  },
  {
    "question_text": "Design an experiment using a curved spoon to demonstrate the difference between convex and concave mirror image formation. Explain the setup, procedure, observations, and conclusions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One can use a large, shining spoon and observe its two surfaces separately. First, position the spoon such that its inner (concave) surface faces a target object (like a printed letter or face). Vary the distance of the object from the spoon and note changes in image size, orientation, and quality. Next, flip the spoon so the convex (outer) surface faces the object and repeat the observations while varying the distance. Record the differences: the concave side will show an image that may flip from magnified and upright to inverted and diminished, whereas the convex side will always yield a smaller, erect image. Conclude by summarizing how curvature determines the behavior of reflected rays and image characteristics.",
    "explanation": "The experimental design includes the selection of a curved reflecting surface (spoon), a target object, and systematic variation of the object distance to document how the image properties change with each surface. This hands-on experiment supports the theoretical concepts of how concave and convex mirrors operate as described in the laws of reflection and image formation.",
    "topic": "Experimental Design in Optics",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen012"
  }
]