[
  {
    "question_text": "Which of the following metals is commonly found in the free state in nature?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Aluminum",
      "Iron",
      "Gold",
      "Zinc"
    ],
    "correct_answer": "Gold is found in its free state and is not usually combined with other elements.",
    "explanation": "Metals like gold, silver, platinum, and copper (at least partly) occur in nature in their native or free state because they are less reactive. Gold, in particular, resists corrosion and oxidation.",
    "topic": "Occurrence of metals",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen029"
  },
  {
    "question_text": "Which process is used to convert sulphide ores into metal oxides before reduction?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Electrolysis",
      "Roasting",
      "Calcination",
      "Refining"
    ],
    "correct_answer": "Roasting is used to convert sulphide ores into metal oxides by heating the ore in excess air.",
    "explanation": "Roasting involves heating sulphide ores with excess oxygen, which converts them into oxides and releases sulfur dioxide gas. This conversion is necessary since metal oxides are easier to reduce than sulphides.",
    "topic": "Extraction of metals",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen030"
  },
  {
    "question_text": "Which extraction method is applied for metals at the top of the activity series, such as sodium and aluminium?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Reduction using carbon",
      "Roasting",
      "Electrolysis",
      "Heating in air"
    ],
    "correct_answer": "Electrolysis; these metals are highly reactive and cannot be reduced by carbon; hence, electrolysis of their molten chlorides or oxides is used.",
    "explanation": "Highly reactive metals like sodium, magnesium, calcium, and aluminium have a strong affinity for oxygen. As a result, their oxides cannot be reduced by carbon and instead require electrolytic reduction, which deposits the metal at the cathode.",
    "topic": "Extracting metals from highly reactive ores",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen031"
  },
  {
    "question_text": "Which process is employed to remove the gangue (impurities like soil and sand) from an ore before extracting the metal?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Concentration",
      "Refining",
      "Electrolytic refining",
      "Calcination"
    ],
    "correct_answer": "Concentration; this process separates the valuable minerals from the gangue before further extraction steps.",
    "explanation": "Concentration involves various physical or chemical processes designed to remove gangue from the ore, which increases the proportion of the metal-containing mineral and thus facilitates its profitable extraction.",
    "topic": "Enrichment of ores",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen032"
  },
  {
    "question_text": "Define 'ore' as used in the context of metal extraction.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An ore is a naturally occurring mineral from the Earth’s crust that contains a very high percentage of a particular metal and from which the metal can be profitably extracted.",
    "explanation": "Ores are mineral deposits that contain sufficient concentrations of a metal to make extraction economically feasible. They are the raw materials used in the extraction of various metals.",
    "topic": "Occurrence of metals",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen033"
  },
  {
    "question_text": "What is gangue, and why must it be removed from the ore before the metal extraction process?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Gangue refers to the impurities such as soil, sand, and other non-metallic materials present in the ore. It must be removed to increase the concentration of the target metal for economic extraction.",
    "explanation": "Removing gangue through concentration or enrichment techniques increases the proportion of the metal-bearing mineral, making the subsequent extraction process more efficient and cost-effective.",
    "topic": "Enrichment of ores",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen034"
  },
  {
    "question_text": "Explain why metals at the top of the reactivity series cannot be extracted by heating their ores with carbon.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Metals at the top of the reactivity series have a higher affinity for oxygen than carbon. Therefore, carbon cannot reduce their oxides to the free metal.",
    "explanation": "Since these metals (e.g., sodium, magnesium, aluminium) more strongly bond with oxygen, using carbon as a reducing agent is ineffective. Instead, methods like electrolytic reduction are necessary for their extraction.",
    "topic": "Extracting metals towards the top of the activity series",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen035"
  },
  {
    "question_text": "Briefly describe the role of electrolytic refining in obtaining pure metals.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Electrolytic refining uses an electrolytic cell in which the impure metal is the anode and a thin strip of pure metal is the cathode. The process dissolves the impure metal into a solution and redeposits pure metal onto the cathode while impurities remain as anode mud.",
    "explanation": "This method ensures high purity by selectively depositing the pure metal. The refined metal is collected at the cathode, while impurities either remain suspended in the electrolyte or settle as anode mud.",
    "topic": "Refining of metals",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen036"
  },
  {
    "question_text": "Discuss the complete process of extracting a metal from its ore, starting from concentration to final purification.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The extraction process begins with the concentration of the ore by removing gangue using physical or chemical processes. Next, if the ore is in the form of sulphides or carbonates, it is converted into the oxide by roasting (for sulphides) or calcination (for carbonates). The oxide is then reduced to the metal either by heating with carbon (for moderately reactive metals) or via electrolysis (for highly reactive metals). Finally, the produced metal is refined to remove any remaining impurities, often through electrolytic refining.",
    "explanation": "Each step is designed to address specific challenges: concentration increases the metal content, roasting or calcination converts the ore to a workable form, reduction isolates the metal, and refining ensures high purity. This comprehensive approach highlights the interdependency of various techniques in metallurgical extraction.",
    "topic": "Extraction of metals",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen037"
  },
  {
    "question_text": "Explain how the reactivity series influences the method of extraction of metals. Provide examples to support your explanation.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The reactivity series ranks metals by their tendency to lose electrons. Metals at the bottom (e.g., gold, silver) are less reactive and are found in their native state, requiring minimal extraction procedures. Metals in the middle (e.g., zinc, iron, lead) are moderately reactive; they are typically found as sulphides or carbonates which are converted to oxides via roasting or calcination and then reduced using carbon. Highly reactive metals at the top (e.g., sodium, magnesium, aluminium) cannot be reduced by carbon because they bind oxygen more strongly, so they are extracted by electrolytic reduction.",
    "explanation": "This categorization ensures that each metal is extracted by the most effective method according to its chemical reactivity. For instance, aluminium is obtained from aluminium oxide by the electrolytic process, whereas iron is produced from its oxide using carbon reduction. These examples underscore the importance of the reactivity series in designing extraction methods.",
    "topic": "Reactivity series and extraction techniques",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen038"
  },
  {
    "question_text": "Describe the thermit reaction, including its chemical equation, conditions required, and practical applications.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The thermit reaction involves the reduction of iron(III) oxide (Fe₂O₃) with aluminium powder to produce molten iron and aluminium oxide. The balanced equation is: Fe₂O₃(s) + 2Al(s) → 2Fe(l) + Al₂O₃(s) + Heat. This highly exothermic reaction produces enough heat to melt the iron, which is exploited in welding applications such as joining railway tracks.",
    "explanation": "The reaction is self-sustaining once initiated due to the large amount of heat generated, eliminating the need for external heating. Its practical applications include industrial welding and repair of metal structures, demonstrating an effective real-world use of exothermic reduction reactions.",
    "topic": "Thermit reaction",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen039"
  },
  {
    "question_text": "True or False: In the electrolytic refining process, pure metal is deposited at the anode.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. In electrolytic refining, the impure metal is used as the anode and pure metal is deposited at the cathode.",
    "explanation": "During electrolytic refining, oxidation occurs at the anode where the impure metal dissolves into the electrolyte, while reduction takes place at the cathode, where pure metal ions gain electrons and get deposited as a pure metal layer.",
    "topic": "Refining of metals",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen040"
  },
  {
    "question_text": "True or False: Calcination is a process that converts carbonate ores into metal oxides by heating them in a limited supply of air.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True.",
    "explanation": "Calcination involves heating carbonate ores in a limited supply of air so that carbon dioxide is released, leaving behind metal oxides that are easier to reduce in subsequent extraction steps.",
    "topic": "Extraction of metals",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen041"
  },
  {
    "question_text": "True or False: Metals high in the reactivity series can be extracted by simply heating their metal oxides with carbon.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Metals high in the reactivity series cannot be reduced by carbon because they have a stronger affinity for oxygen; they require electrolysis for extraction.",
    "explanation": "Due to their high reactivity, the oxides of metals like sodium, magnesium, and aluminium are not reduced by carbon. Instead, electrolytic reduction is used because these metals bind oxygen more strongly than carbon does.",
    "topic": "Extracting metals towards the top of the activity series",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc103",
    "section_id": "08_section_3_4",
    "question_id": "cbse_x_jesc1dd_c103_gen042"
  }
]