[
  {
    "question_text": "A ray of light travelling in air enters obliquely into water. Does the light ray bend towards the normal or away from the normal? Why?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The light ray bends towards the normal because water is an optically denser medium than air, causing the light to slow down and change direction toward the perpendicular to the surface.",
    "explanation": "According to Snell’s Law (n₁ sin i = n₂ sin r), when light passes from a rarer medium (air) to a denser medium (water), its speed decreases and it bends towards the normal. In this case, the refractive index of water (approximately 1.33) is greater than that of air (approximately 1.0003), causing the change in direction towards the normal. This phenomenon is a fundamental characteristic of the refraction of light.",
    "topic": "Refraction of Light",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic007"
  },
  {
    "question_text": "Light enters from air to glass having refractive index 1.50. What is the speed of light in the glass given that the speed of light in vacuum is 3 × 10⁸ m/s?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The speed of light in the glass is 2 × 10⁸ m/s.",
    "explanation": "Using the relation between refractive index and speed of light, n = c/v, we rearrange to get v = c/n. Substituting c = 3 × 10⁸ m/s and n = 1.50 gives v = (3 × 10⁸ m/s)/1.50 = 2 × 10⁸ m/s. This shows how light slows down when entering a denser medium like glass.",
    "topic": "Refractive Index",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic008"
  },
  {
    "question_text": "From Table 9.3, identify the medium with the highest optical density and the medium with the lowest optical density.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The medium with the highest optical density is Diamond (n = 2.42) and the one with the lowest optical density is Air (n ≈ 1.0003).",
    "explanation": "Optical density is indicated by the refractive index of a medium. According to Table 9.3, Diamond has the highest refractive index (2.42), which means it is the optically densest. Conversely, Air has a refractive index very close to 1 (approximately 1.0003), making it the optically rarest medium in the table.",
    "topic": "Refractive Index",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic009"
  },
  {
    "question_text": "You are given kerosene, turpentine, and water. In which of these does light travel fastest?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Light travels fastest in water.",
    "explanation": "The speed of light in a medium is inversely proportional to its refractive index (v = c/n). From the provided data, water has a refractive index of 1.33, kerosene has 1.44, and turpentine has 1.47. Since water has the lowest refractive index, it allows light to travel faster compared to kerosene and turpentine.",
    "topic": "Refraction and Refractive Index",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic010"
  },
  {
    "question_text": "The refractive index of diamond is 2.42. What does this statement mean?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "It means that light travels 2.42 times slower in diamond than in air (or vacuum).",
    "explanation": "The refractive index (n) is defined as the ratio of the speed of light in air (or vacuum) to the speed of light in the medium (n = c/v). For diamond, n = 2.42 indicates that the speed of light in diamond is c/2.42, i.e., light slows down by a factor of 2.42 when it enters diamond relative to its speed in air. This high refractive index also reflects the optical density of diamond.",
    "topic": "Refractive Index",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic011"
  },
  {
    "question_text": "Define 1 dioptre of power of a lens.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "1 dioptre is defined as the power of a lens with a focal length of 1 metre.",
    "explanation": "The power (P) of a lens is given by the reciprocal of its focal length (f) in metres, i.e. P = 1/f. Therefore, if f = 1 m, then the power is 1 dioptre (1 D). This simple relation is fundamental in optics and is used to determine the corrective power of lenses.",
    "topic": "Optical Power & Lens",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic012"
  },
  {
    "question_text": "A convex lens forms a real and inverted image of a needle at a distance of 50 cm from it. Where is the needle placed in front of the convex lens if the image is equal to the size of the object? Also, find the power of the lens.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The needle must be placed 50 cm in front of the lens (i.e. at 2f) and the power of the lens is +4 D.",
    "explanation": "For a convex lens, a real and inverted image with the same size as the object implies that the magnification is +1, so the object distance (u) equals the image distance (v). Given v = 50 cm, u = 50 cm. The lens formula 1/f = 1/u + 1/v then becomes 1/f = 1/50 + 1/50 = 2/50, yielding f = 25 cm (0.25 m). The power of the lens is calculated as P = 1/f (in metres), so P = 1/0.25 = +4 D. The positive sign indicates a convex (converging) lens.",
    "topic": "Lens Formula & Image Formation",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic013"
  },
  {
    "question_text": "Find the power of a concave lens of focal length 2 m.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The power of the concave lens is -0.5 D.",
    "explanation": "For a concave (diverging) lens, the focal length is taken as negative. Given f = -2 m, the power P is calculated using P = 1/f, therefore P = 1/(-2) = -0.5 D. The negative sign indicates diverging nature of the lens.",
    "topic": "Lens Power & Sign Convention",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic014"
  },
  {
    "question_text": "Which one of the following materials cannot be used to make a lens?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Water",
      "Glass",
      "Plastic",
      "Clay"
    ],
    "correct_answer": "Clay",
    "explanation": "Clay is an opaque material and does not transmit light. Lenses require a transparent medium (such as water, glass, or plastic) that allows light rays to pass through and be refracted.",
    "topic": "Optics – Lens Materials",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex001"
  },
  {
    "question_text": "The image formed by a concave mirror is observed to be virtual, erect and larger than the object. Where should the object be placed relative to the mirror?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Between the principal focus and the centre of curvature",
      "At the centre of curvature",
      "Beyond the centre of curvature",
      "Between the pole of the mirror and its principal focus"
    ],
    "correct_answer": "Between the pole of the mirror and its principal focus",
    "explanation": "For a concave mirror, when the object is placed between the pole (P) and the principal focus (F), the reflected rays diverge. The virtual rays appear to be coming from a point behind the mirror, resulting in a virtual, erect, and magnified image.",
    "topic": "Optics – Image Formation by Mirrors",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex002"
  },
  {
    "question_text": "Where should an object be placed in front of a convex lens to get a real image of the same size as the object?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "At the principal focus of the lens",
      "At twice the focal length",
      "At infinity",
      "Between the optical centre of the lens and its principal focus"
    ],
    "correct_answer": "At twice the focal length",
    "explanation": "For a thin convex (converging) lens, placing the object at a distance of 2f (twice the focal length) produces an image that is real, inverted, and of the same size as the object. This follows from the lens formula and the condition for unit magnification.",
    "topic": "Optics – Lens Formula and Image Formation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex003"
  },
  {
    "question_text": "A spherical mirror and a thin spherical lens each have a focal length of -15 cm. The mirror and the lens are likely to be:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Both concave",
      "Both convex",
      "The mirror is concave and the lens is convex",
      "The mirror is convex, but the lens is concave"
    ],
    "correct_answer": "Both concave",
    "explanation": "A negative focal length for spherical mirrors indicates a concave mirror (by the sign convention). Similarly, for lenses, a negative focal length indicates a concave (diverging) lens. Thus, both the mirror and the lens are concave.",
    "topic": "Optics – Sign Conventions and Image Formation",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex004"
  },
  {
    "question_text": "No matter how far you stand from a mirror, your image appears erect. The mirror is likely to be:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Only plane",
      "Only concave",
      "Only convex",
      "Either plane or convex"
    ],
    "correct_answer": "Either plane or convex",
    "explanation": "A plane mirror always forms a virtual, erect image of the same size as the object. A convex mirror also forms a virtual, erect, and diminished image. While a concave mirror can form an erect image, it does so only when the object is placed between the pole and the principal focus. Since the question states that the image is always erect regardless of the observer's distance, the mirror is likely to be a plane or convex mirror.",
    "topic": "Optics – Mirror Image Characteristics",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex005"
  },
  {
    "question_text": "Which of the following lenses would you prefer to use while reading small letters in a dictionary?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A convex lens of focal length 50 cm",
      "A concave lens of focal length 50 cm",
      "A convex lens of focal length 5 cm",
      "A concave lens of focal length 5 cm"
    ],
    "correct_answer": "A convex lens of focal length 5 cm",
    "explanation": "A convex (converging) lens acts as a magnifying glass that produces a magnified, virtual image when the object is placed within its focal length. A shorter focal length (such as 5 cm) provides higher magnification compared to a longer focal length (50 cm).",
    "topic": "Optics – Magnification and Lens Applications",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex006"
  },
  {
    "question_text": "We wish to obtain an erect image of an object using a concave mirror of focal length 15 cm. What should be the range of object distances from the mirror? What is the nature of the image and is the image larger or smaller than the object? Also, draw a ray diagram to show the image formation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For a concave mirror with f = 15 cm, to obtain a virtual, erect, and magnified image, the object must be placed between the pole and the focus, i.e. at distances 0 < |u| < 15 cm. In this range, the formed image is virtual, erect, and larger than the object. A ray diagram would show the object placed between the pole (P) and the principal focus (F) with incident rays reflecting such that their extensions intersect behind the mirror to form a virtual image.",
    "explanation": "When an object is placed between the pole and the focus of a concave mirror, the reflected rays diverge. An observer sees these rays as if they are coming from a point behind the mirror. The resulting image is virtual (cannot be projected), erect, and magnified. The ray diagram involves drawing two rays: one parallel to the principal axis which reflects through the focus, and another heading toward the centre of curvature reflecting back on itself. Their backward extensions meet behind the mirror to indicate the image location.",
    "topic": "Optics – Image Formation by Concave Mirrors",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex007"
  },
  {
    "question_text": "Name the type of mirror used in the following situations and support your answer with reasons: (a) Headlights of a car, (b) Side/rear-view mirrors of a vehicle, (c) Solar furnace.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For headlights of a car and solar furnaces, concave mirrors are used because they converge light rays to form a parallel beam or concentrate sunlight to a focal point. For side/rear-view mirrors, convex mirrors are used because they provide a wider field of view and always form an erect, though diminished, image.",
    "explanation": "Concave mirrors are employed in headlights and solar furnaces because their converging properties allow effective focusing of light – either to project a parallel beam (in headlights) or concentrate sunlight to generate heat (in solar furnaces). Convex mirrors are chosen for vehicle rear-view mirrors as they offer a wide field of view, essential for safety, and produce images that are always erect.",
    "topic": "Optics – Mirrors and Their Applications",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex008"
  },
  {
    "question_text": "If one-half of a convex lens is covered with black paper, will the lens produce a complete image of the object? Verify your answer experimentally and explain your observations.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Yes, the convex lens still produces a complete image of the object, though its brightness will be reduced.",
    "explanation": "Each part of a convex lens is capable of bending rays from every point on the object. Covering half of the lens reduces the total amount of light passing through, resulting in a dimmer image, but the complete image is still formed because the uncovered portion still collects light from the entire object.",
    "topic": "Optics – Image Formation by Lenses",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex009"
  },
  {
    "question_text": "An object 5 cm in length is held 25 cm away from a converging lens with a focal length of 10 cm. Draw the ray diagram and determine the position, size, and nature of the image formed.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Using the lens formula 1/v - 1/u = 1/f with u = -25 cm (object distance), f = +10 cm, we calculate: 1/v = 1/10 - 1/25 = (5 - 2)/50 = 3/50, so v ≈ +16.67 cm. The magnification m = v/u = 16.67/(-25) ≈ -0.667, meaning the image is real, inverted, and diminished with a size of approximately 3.33 cm.",
    "explanation": "For a convex lens, the lens formula is 1/v - 1/u = 1/f. Taking care with sign conventions (real object distances are negative in the standard sign convention), the computed image distance v is positive indicating that the image is real. The magnification being negative implies that the image is inverted. The ray diagram should include a ray parallel to the principal axis which, after refraction, passes through the focal point and a ray through the optical centre that remains undeviated.",
    "topic": "Optics – Lens Formula and Ray Diagrams",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex010"
  },
  {
    "question_text": "A concave lens of focal length 15 cm forms an image 10 cm from the lens. How far is the object placed from the lens? Draw the ray diagram.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For a concave lens, the focal length is negative (f = -15 cm) and the image distance is also negative (v = -10 cm). Using the lens formula 1/v - 1/u = 1/f, we get: 1/u = 1/v - 1/f = (1/(-10)) - (1/(-15)) = -1/10 + 1/15 = -1/30, so u = -30 cm. This means the object is placed 30 cm in front of the lens.",
    "explanation": "Concave lenses always form virtual images, so both the image distance and focal length are negative according to the sign convention. By applying the lens formula and solving for u, we determine that the object is 30 cm from the lens. The ray diagram should show an object at 30 cm, with rays diverging after passing through the lens that, when extended backwards, converge to form a virtual image.",
    "topic": "Optics – Lens Formula for Diverging Lenses",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex011"
  },
  {
    "question_text": "An object is placed at a distance of 10 cm from a convex mirror with a focal length of 15 cm. Determine the position and nature of the image.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Using the mirror formula 1/v + 1/u = 1/f with u = -10 cm and f = +15 cm, we get: 1/v = 1/15 - 1/(-10) = 1/15 + 1/10 = (2+3)/30 = 5/30 = 1/6. So, v = +6 cm. The image is virtual and erect, as convex mirrors always form virtual, erect, and diminished images.",
    "explanation": "For convex mirrors, the mirror formula applies and the image distance computed is positive, meaning the image is formed behind the mirror. Convex mirrors produce images that are always virtual, erect, and diminished in size. The calculation confirms that the image is located 6 cm behind the mirror.",
    "topic": "Optics – Image Formation by Convex Mirrors",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex012"
  },
  {
    "question_text": "The magnification produced by a plane mirror is +1. What does this signify?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A magnification of +1 means that the image produced by the plane mirror is virtual, erect, and exactly the same size as the object.",
    "explanation": "In a plane mirror, the law of reflection causes the image to be laterally inverted but the same size as the object, resulting in a unit magnification. The positive sign indicates that the image is upright (erect) relative to the object.",
    "topic": "Optics – Plane Mirror Properties",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex013"
  },
  {
    "question_text": "An object 5.0 cm in length is placed 20 cm in front of a convex mirror with a radius of curvature of 30 cm. Find the position, nature, and size of the image.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For a convex mirror, the focal length f is given by R/2 = 30/2 = 15 cm. Using the mirror formula: 1/v + 1/(-20) = 1/15, so 1/v = 1/15 + 1/20 = (4+3)/60 = 7/60, which gives v ≈ +8.57 cm. The magnification m = -v/u = -8.57/(-20) ≈ +0.429, so the image height is approximately 0.429 × 5.0 cm ≈ 2.14 cm. The image is virtual, erect, and diminished.",
    "explanation": "For convex mirrors the focal length is positive and the object distance is taken as negative in the mirror formula. The computed image distance is positive (indicating a virtual image behind the mirror), and the positive magnification confirms that the image is erect. The size calculation shows that the image is smaller than the object.",
    "topic": "Optics – Mirror Formula and Image Formation by Convex Mirrors",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex014"
  },
  {
    "question_text": "An object of size 7.0 cm is placed 27 cm in front of a concave mirror with a focal length of 18 cm. At what distance from the mirror should a screen be placed to obtain a sharp image? Also, determine the size and nature of the image.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Using the mirror formula for a concave mirror (with f = -18 cm and u = -27 cm), we have: 1/v = 1/f - 1/u = (1/(-18)) - (1/(-27)) = -1/18 + 1/27 = -1/54, so v = -54 cm. This means a sharp, real, and inverted image is formed 54 cm in front of the mirror. The magnification m = -v/u = -(-54)/(-27) = -54/27 = -2, leading to an image size of 7.0 cm × 2 = 14.0 cm (inverted and enlarged).",
    "explanation": "For concave mirrors, a negative image distance denotes that the image is formed in front of the mirror (real image). The negative magnification indicates an inverted image, and a magnitude greater than 1 shows that the image is magnified. The screen must therefore be placed 54 cm in front of the mirror to capture this real image.",
    "topic": "Optics – Image Formation by Concave Mirrors",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex015"
  },
  {
    "question_text": "Find the focal length of a lens with a power of –2.0 D. What type of lens is this?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The focal length f is the reciprocal of the power: f = 1/(-2.0) = -0.5 m (or -50 cm). A negative focal length indicates it is a concave (diverging) lens.",
    "explanation": "Lens power (in dioptres) is defined as P = 1/f, with f in meters. A negative dioptre value indicates a diverging (concave) lens because it forms virtual images.",
    "topic": "Optics – Lens Power and Focal Length",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex016"
  },
  {
    "question_text": "A doctor has prescribed a corrective lens with a power of +1.5 D. Find the focal length of this lens and determine whether it is converging or diverging.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The focal length f = 1/(+1.5) ≈ 0.667 m (or approximately +66.7 cm). A positive focal length indicates this is a convex (converging) lens.",
    "explanation": "Since lens power is the reciprocal of the focal length in meters, a positive power gives a positive focal length. Convex lenses, which converge light rays, are used as corrective lenses for hyperopia.",
    "topic": "Optics – Corrective Lenses",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ex017"
  },
  {
    "question_text": "Which type of mirror converges parallel rays of sunlight to form a sharp, bright spot?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Concave mirror",
      "Convex mirror",
      "Plane mirror",
      "Cylindrical mirror"
    ],
    "correct_answer": "Concave mirror – because a concave mirror converges parallel rays to its principal focus.",
    "explanation": "A concave mirror has an inwardly curved reflecting surface. When parallel rays (such as sunlight) hit it, the rays converge at the principal focus, forming a bright spot. This is unlike convex or plane mirrors.",
    "topic": "Spherical Mirrors – Concave Mirrors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen013"
  },
  {
    "question_text": "What is the relationship between the radius of curvature (R) and the focal length (f) for spherical mirrors with small apertures?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "R = f",
      "R = 2f",
      "R = 4f",
      "R = f/2"
    ],
    "correct_answer": "R = 2f – for spherical mirrors with small apertures, the radius of curvature is twice the focal length.",
    "explanation": "This relationship, R = 2f, comes from the geometry of spherical mirrors under the paraxial approximation. It implies that the principal focus (F) lies midway between the pole (P) and the center of curvature (C).",
    "topic": "Geometry of Spherical Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen014"
  },
  {
    "question_text": "Which mirror always forms an image that is virtual, erect, and diminished regardless of the object's position?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Concave mirror",
      "Convex mirror",
      "Plane mirror",
      "None of the above"
    ],
    "correct_answer": "Convex mirror – because convex mirrors always produce virtual, erect, and reduced images.",
    "explanation": "A convex mirror’s outward curvature causes incident rays to diverge. The reflected rays appear to come from a point behind the mirror, resulting in a diminished and upright (erect) image.",
    "topic": "Spherical Mirrors – Convex Mirrors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen015"
  },
  {
    "question_text": "When an object is placed between the pole (P) and the principal focus (F) of a concave mirror, what type of image is formed?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Real and inverted",
      "Virtual and erect",
      "Real and erect",
      "Virtual and inverted"
    ],
    "correct_answer": "Virtual and erect – because for objects between P and F, the reflected rays diverge and the image appears behind the mirror.",
    "explanation": "A concave mirror forms a virtual image that is erect when the object is placed between its pole and focus. This is due to the divergence of the reflected rays when the object is very close to the mirror.",
    "topic": "Image Formation by Concave Mirrors",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen016"
  },
  {
    "question_text": "Define the term \"pole\" of a spherical mirror.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The pole (P) is the center of the mirror’s reflecting surface.",
    "explanation": "In spherical mirrors, the pole is a point on the surface that serves as the reference point for measuring distances to the focus and center of curvature.",
    "topic": "Terminology of Spherical Mirrors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen017"
  },
  {
    "question_text": "Explain the term \"principal axis\" and its significance in the analysis of spherical mirrors.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The principal axis is a straight line passing through the pole (P) and the center of curvature (C) of the mirror. It is significant because it is perpendicular to the mirror at the pole and defines the symmetry of the mirror, including the location of the principal focus (F).",
    "explanation": "The principal axis serves as a reference line for drawing ray diagrams and analyzing reflection. Knowing its position helps in predicting the path of reflected rays and the formation of images.",
    "topic": "Basic Concepts in Spherical Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen018"
  },
  {
    "question_text": "What safety precaution is recommended when using a concave mirror to concentrate sunlight?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Do not look directly at the Sun or at its reflection in the mirror to avoid eye damage.",
    "explanation": "Direct observation of the Sun or its intense concentrated light can cause permanent eye damage. The caution is especially important when performing experiments involving solar concentration.",
    "topic": "Experimental Safety in Optics",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen019"
  },
  {
    "question_text": "Describe the observation that indicates a concave mirror has concentrated sunlight during an experiment involving a sheet of paper.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A small, bright, sharp spot appears on the paper and, if maintained, the paper starts to smoke and may eventually catch fire due to the concentration of sunlight.",
    "explanation": "The appearance of a bright, focused spot is evidence that the concave mirror is converging parallel rays to its principal focus. The concentrated energy at this point can heat the paper to the point of combustion.",
    "topic": "Practical Applications of Concave Mirrors",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen020"
  },
  {
    "question_text": "Discuss how the image characteristics (position, size, and orientation) change when an object is moved from being placed beyond the center of curvature (C) to between the pole (P) and the focal point (F) of a concave mirror. Support your answer with reference to ray diagrams.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "When an object is placed beyond C, the image is real, inverted, and diminished, forming between F and C. At C, the image is real, inverted, and of the same size as the object. When the object is placed between C and F, the image becomes real, inverted, and enlarged, forming beyond C. Finally, if the object is placed between P and F, the mirror produces a virtual, erect, and enlarged image, which cannot be projected on a screen as it appears behind the mirror.",
    "explanation": "This variation occurs because the location of the object relative to P, F, and C determines the convergence or divergence of the reflected rays. Ray diagrams help visualize these changes: using the ray parallel to the principal axis (which reflects through F) and the ray through the center of curvature (which retraces its path) clearly shows the shifting intersection point of reflected rays as the object moves. These principles are summarized in Table 9.1.",
    "topic": "Image Formation by Concave Mirrors",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen021"
  },
  {
    "question_text": "Explain the process of constructing ray diagrams for spherical mirrors. In your answer, describe the significance of choosing specific rays such as the ray parallel to the principal axis, the ray through the focus, and the ray through the center of curvature.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Constructing ray diagrams for spherical mirrors involves drawing at least two of the following rays: one ray parallel to the principal axis which, for concave mirrors, reflects through the principal focus (or appears to originate from the focus in convex mirrors); a second ray that passes through (or towards) the focus which reflects parallel to the principal axis; and a third ray through the center of curvature, which strikes the mirror perpendicularly and reflects back on itself. These rays intersect (or appear to intersect) at the location of the image, thus allowing one to determine its position, size, and orientation.",
    "explanation": "Choosing these specific rays simplifies the process of drawing accurate ray diagrams because their paths after reflection are predictable by the law of reflection (angle of incidence equals angle of reflection). This systematic approach is valuable in both theoretical analysis and practical experiments involving image formation.",
    "topic": "Ray Diagrams in Optics",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen022"
  },
  {
    "question_text": "True or False: For a convex mirror, the center of curvature lies behind the mirror. If false, correct the statement.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True – in a convex mirror, the center of curvature is located behind the mirror.",
    "explanation": "By definition, because a convex mirror has its reflecting surface bulging outward, the associated sphere’s center (center of curvature) lies behind the mirror.",
    "topic": "Spherical Mirrors – Convex Mirrors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen023"
  },
  {
    "question_text": "True or False: In all spherical mirrors, the principal focus is at the same distance from the pole as the center of curvature. If false, explain the correct relationship.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False – for spherical mirrors with small apertures, the principal focus is located halfway between the pole and the center of curvature (i.e., f = R/2), not at the same distance as the center of curvature.",
    "explanation": "The correct relationship is given by R = 2f. This means that the focal length (f) is half the radius of curvature (R) and hence the principal focus is midway between the pole and the center of curvature.",
    "topic": "Geometrical Optics",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen024"
  },
  {
    "question_text": "True or False: A concave mirror always forms a full-length image of a large object regardless of the mirror's size. If false, provide an explanation.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – a concave mirror does not always form a full-length image because its field of view is limited by its size; the image size depends on the mirror dimensions and the position of the object relative to the mirror.",
    "explanation": "While concave mirrors can form real images that may be magnified or reduced, the extent of the image is limited by the mirror’s aperture. A full-length image of a large object is more likely seen in convex mirrors due to their wider field of view.",
    "topic": "Image Formation and Field of View",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen025"
  },
  {
    "question_text": "List at least three real-world applications where concave mirrors are used to focus or redirect light, and briefly explain the principle behind each application.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Concave mirrors are used in torches and vehicle headlights to produce strong, parallel beams of light; in solar furnaces to concentrate sunlight for heating; and as shaving mirrors to provide magnified views of the face.",
    "explanation": "These applications rely on the concave mirror’s ability to converge parallel rays to a focal point. In torches and headlights, this creates a directed beam. In solar furnaces, the concentrated energy produces high temperatures, and in shaving mirrors the convergence can create a magnified image.",
    "topic": "Applications of Spherical Mirrors",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_x_jesc1dd_c109_gen026"
  },
  {
    "question_text": "Find the focal length of a convex mirror whose radius of curvature is 32 cm.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "f = 16 cm",
    "explanation": "For spherical mirrors, the focal length (f) is given by f = R/2. Here, the radius of curvature (R) is provided as 32 cm. Substituting the value, we get f = 32 cm / 2 = 16 cm. In convex mirrors (using the given sign convention), the focal length is taken as positive in this context.",
    "topic": "Spherical Mirrors (Image Formation, Focal Length)",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic005"
  },
  {
    "question_text": "A concave mirror produces a three times magnified (enlarged) real image of an object placed at 10 cm in front of it. Where is the image located?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The image is located 30 cm in front of the mirror.",
    "explanation": "For a concave mirror forming a real, enlarged image, the magnification (m) is given by the formula m = -v/u, where v is the image distance and u (given as -10 cm according to the sign conventions for mirrors) is the object distance. With m = -3, we have -3 = -v/(-10 cm), which simplifies to v = -30 cm. The negative sign indicates that the image is real and formed in front of the mirror. Thus, the image is located 30 cm from the mirror.",
    "topic": "Image Formation by Concave Mirrors",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic006"
  },
  {
    "question_text": "Define the principal focus of a concave mirror.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The principal focus (F) is the point on the principal axis where light rays that are initially parallel converge after reflection from a concave mirror.",
    "explanation": "In a concave mirror, according to the law of reflection, parallel rays incident on the mirror reflect and converge at a single point on the principal axis. This point, known as the principal focus, lies at a distance equal to the focal length (f) from the pole of the mirror. Understanding this concept is fundamental for studying image formation in curved mirrors.",
    "topic": "Image Formation by Concave Mirrors",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic001"
  },
  {
    "question_text": "The radius of curvature of a spherical mirror is 20 cm. What is its focal length?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The focal length is 10 cm.",
    "explanation": "For spherical mirrors with small apertures, the focal length (f) is given by f = R/2, where R is the radius of curvature. Therefore, if R = 20 cm, then f = 20 cm/2 = 10 cm. This result is based on the standard mirror formula used in geometric optics.",
    "topic": "Mirror Formula",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic002"
  },
  {
    "question_text": "Name a mirror that can give an erect and enlarged image of an object.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A concave mirror when the object is placed between the pole and the principal focus.",
    "explanation": "When an object is placed between the pole (P) and the principal focus (F) of a concave mirror, the reflected rays diverge. An observer looking into the mirror perceives a virtual, erect, and magnified image. This configuration is a classic example in the study of curved mirrors and is widely observed in applications like shaving mirrors.",
    "topic": "Image Formation by Spherical Mirrors",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic003"
  },
  {
    "question_text": "Why do we prefer a convex mirror as a rear-view mirror in vehicles?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Convex mirrors produce a virtual, erect, and diminished image with a wider field of view, allowing drivers to see a larger area behind the vehicle.",
    "explanation": "Convex mirrors diverge reflected light rays, which means that even though the images formed are diminished, they are always erect. The outward curved design provides a wider field of view compared to plane or concave mirrors. This characteristic is crucial for rear-view mirrors in vehicles, as it enables drivers to monitor a larger portion of the traffic behind them, thereby enhancing safety.",
    "topic": "Image Formation by Convex Mirrors",
    "bloom_level": "Analyze",
    "source": "in-chapter",
    "chapter_id": "jesc109",
    "question_id": "cbse_x_jesc1dd_c109_ic004"
  },
  {
    "question_text": "Which of the following best describes the law of reflection of light?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The angle of incidence is larger than the angle of reflection.",
      "B. The angle of incidence is equal to the angle of reflection.",
      "C. The angle of reflection is twice the angle of incidence.",
      "D. The angles of incidence and reflection are always complementary."
    ],
    "correct_answer": "B. The angle of incidence is equal to the angle of reflection.",
    "explanation": "According to the law of reflection, the angle at which the light ray hits the surface (angle of incidence) is equal to the angle at which it leaves the surface (angle of reflection).",
    "topic": "Reflection of Light",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen001"
  },
  {
    "question_text": "What is a unique property of the image formed by a plane mirror?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The image is inverted and larger than the object.",
      "B. The image is virtual and the same size as the object.",
      "C. The image is real and diminished.",
      "D. The image is virtual and laterally displaced."
    ],
    "correct_answer": "B. The image is virtual and the same size as the object.",
    "explanation": "A plane mirror forms a virtual image that is erect, laterally inverted, and equal in size to the object.",
    "topic": "Image Formation in Plane Mirrors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen002"
  },
  {
    "question_text": "When a concave (inner spoon) surface is used for reflecting an image of a face, what change occurs as the distance between the face and the spoon increases?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. The image remains erect and magnified at all distances.",
      "B. The image becomes inverted and diminished after a certain distance.",
      "C. The image becomes real and remains same size.",
      "D. The image always remains virtual and laterally reversed."
    ],
    "correct_answer": "B. The image becomes inverted and diminished after a certain distance.",
    "explanation": "For a concave mirror, when the object (face) is close, the image can be erect and magnified, but as the object is moved away, the image typically becomes inverted and reduced in size.",
    "topic": "Concave Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen003"
  },
  {
    "question_text": "Which property correctly describes the image formed by a convex (outer spoon) surface?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Real, inverted, and magnified.",
      "B. Virtual, erect, and diminished.",
      "C. Virtual, reversed laterally, and same size.",
      "D. Real, erect, and diminished."
    ],
    "correct_answer": "B. Virtual, erect, and diminished.",
    "explanation": "A convex mirror always forms a virtual, erect image that is smaller than the object regardless of the object distance.",
    "topic": "Convex Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen004"
  },
  {
    "question_text": "Define 'reflection of light'.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Reflection of light is the process in which light rays bounce off a surface.",
    "explanation": "Reflection of light occurs when light rays strike a surface and bounce back rather than being absorbed or transmitted. The law of reflection states that the angle of incidence equals the angle of reflection.",
    "topic": "Reflection of Light",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen005"
  },
  {
    "question_text": "List three main properties of the image formed by a plane mirror.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The image is virtual, erect, and equal in size to the object.",
    "explanation": "A plane mirror yields an image that is not real (virtual), appears upright (erect), and has the same dimensions as the actual object, though it is laterally inverted.",
    "topic": "Plane Mirror Image Properties",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen006"
  },
  {
    "question_text": "What are spherical mirrors and why are they called so?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Spherical mirrors are mirrors whose reflecting surfaces are part of a sphere.",
    "explanation": "Spherical mirrors are called spherical because their surfaces are portions of a sphere. They can be either concave or convex and obey the basic laws of reflection, with image characteristics depending on their curvature.",
    "topic": "Spherical Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen007"
  },
  {
    "question_text": "Explain how the image characteristics differ when a curved spoon is used as a mirror on its inner (concave) surface versus its outer (convex) surface.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When using the inner (concave) surface, if the object (e.g., your face) is close, the image is erect and magnified; however, upon moving away, the image becomes inverted and diminished. In contrast, the convex (outer) surface always produces a virtual, erect, and reduced image regardless of the distance.",
    "explanation": "A concave mirror can form both real and virtual images depending on object distance: close objects produce virtual, enlarged images, while objects at a greater distance yield real, inverted, and smaller images. A convex mirror, on the other hand, always forms a virtual image that is erect and diminished. This illustrates how curvature affects the path of reflected rays and, in turn, the image properties.",
    "topic": "Image Formation with Curved Mirrors",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen008"
  },
  {
    "question_text": "Describe, step by step, the process of light reflection from a curved surface and how object distance influences the image formation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Light rays incident on a curved mirror obey the law of reflection where the angle of incidence equals the angle of reflection. In a concave mirror, when the object is placed close to the mirror, the reflected rays appear to diverge from a point behind the mirror, forming a virtual, enlarged image. As the object moves further away, the reflected rays cross and form a real, inverted image which becomes smaller with increasing distance. With a convex mirror, however, the reflected rays diverge, and the observer sees a virtual, erect, and diminished image regardless of the object's position.",
    "explanation": "The process begins with light rays striking the mirror surface. Due to the curved nature of the mirror, the normals at the point of incidence vary. For concave mirrors, depending on the object's distance relative to the focal length, the rays either converge to form a real image or appear to diverge to form a virtual image. Convex mirrors always cause the rays to diverge, resulting in diminished, virtual images. This phenomenon is a direct consequence of the mirror's geometry and the law of reflection.",
    "topic": "Reflection from Curved Surfaces",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen009"
  },
  {
    "question_text": "True or False: The law of reflection does not apply to curved surfaces such as spherical mirrors.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. The law of reflection applies to curved surfaces just as it does for plane mirrors.",
    "explanation": "The law of reflection, which states that the angle of incidence equals the angle of reflection, is universal and applies to all reflecting surfaces including curved or spherical mirrors.",
    "topic": "Laws of Reflection",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen010"
  },
  {
    "question_text": "True or False: A concave mirror always forms a real image regardless of the object's distance from the mirror. If false, provide the correction.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. A concave mirror can form a virtual image when the object is placed within the focal length, and a real image when the object is beyond the focal length.",
    "explanation": "A concave mirror produces a virtual, upright, and magnified image when the object is placed within its focal length. When the object moves away from the mirror (beyond the focal point), the mirror forms a real, inverted image.",
    "topic": "Concave Mirrors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen011"
  },
  {
    "question_text": "Design an experiment using a curved spoon to demonstrate the difference between convex and concave mirror image formation. Explain the setup, procedure, observations, and conclusions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One can use a large, shining spoon and observe its two surfaces separately. First, position the spoon such that its inner (concave) surface faces a target object (like a printed letter or face). Vary the distance of the object from the spoon and note changes in image size, orientation, and quality. Next, flip the spoon so the convex (outer) surface faces the object and repeat the observations while varying the distance. Record the differences: the concave side will show an image that may flip from magnified and upright to inverted and diminished, whereas the convex side will always yield a smaller, erect image. Conclude by summarizing how curvature determines the behavior of reflected rays and image characteristics.",
    "explanation": "The experimental design includes the selection of a curved reflecting surface (spoon), a target object, and systematic variation of the object distance to document how the image properties change with each surface. This hands-on experiment supports the theoretical concepts of how concave and convex mirrors operate as described in the laws of reflection and image formation.",
    "topic": "Experimental Design in Optics",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_x_jesc1dd_c109_gen012"
  },
  {
    "question_text": "When a ray of light travels from a rarer medium (e.g., air) to a denser medium (e.g., water), how does its path change relative to the normal at the interface?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. It bends away from the normal",
      "B. It bends towards the normal",
      "C. It continues in the same line",
      "D. It gets completely reflected"
    ],
    "correct_answer": "B. It bends towards the normal. When light enters a denser medium, its speed decreases, causing it to bend towards the normal line at the point of incidence.",
    "explanation": "When light travels from a rarer medium (lower refractive index) to a denser medium (higher refractive index), its speed decreases. According to Snell’s law, this change in speed causes the light ray to bend towards the normal.",
    "topic": "Refraction of Light",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc109",
    "section_id": "06_section_9_3",
    "question_id": "cbse_x_jesc1dd_c109_gen027"
  }
]