[
  {
    "question_text": "Which process best explains the accumulation of variation in asexual reproduction?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Cell division produces identical copies with occasional DNA copying errors",
      "B. Genetic recombination through mating",
      "C. Mutation during RNA transcription",
      "D. Horizontal gene transfer between species"
    ],
    "correct_answer": "A. Cell division produces identical copies with occasional DNA copying errors",
    "explanation": "In asexual reproduction, organisms replicate by cell division. Although the copies are nearly identical, minor inaccuracies during DNA replication introduce small variations.",
    "topic": "Asexual Reproduction & Variation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen001"
  },
  {
    "question_text": "How does sexual reproduction increase genetic diversity compared to asexual reproduction?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It relies on identical cloning of the parent’s genome",
      "B. It combines genetic material from two parents, introducing new allele combinations",
      "C. It eliminates all minor differences in the offspring",
      "D. It reduces the chance of DNA copying errors"
    ],
    "correct_answer": "B. It combines genetic material from two parents, introducing new allele combinations",
    "explanation": "Sexual reproduction mixes genetic material from two individuals. This recombination creates offspring with unique combinations of traits, increasing genetic diversity more than the minor errors seen in asexual reproduction.",
    "topic": "Sexual Reproduction & Genetic Diversity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen002"
  },
  {
    "question_text": "In the accumulation of variation over generations, which factor most directly influences an organism's likelihood of survival in a changing environment?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. The common basic body design inherited from previous generations",
      "B. The newly created differences resulting from copying errors",
      "C. Both inherited variations and novel mutations",
      "D. Neither inherited nor novel variations affect survival"
    ],
    "correct_answer": "C. Both inherited variations and novel mutations",
    "explanation": "Both the variations inherited from the previous generation and new differences (such as mutations) contribute to an organism's overall fitness. Environmental factors then select for those traits, influencing survival.",
    "topic": "Variation & Natural Selection",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen003"
  },
  {
    "question_text": "Define 'accumulation of variation' in the context of reproduction.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Accumulation of variation is the gradual increase in differences among organisms over successive generations, arising from both inherited traits and new mutations.",
    "explanation": "This process explains how populations can become diverse over time as minor, inherited differences and new mutations add up, forming the basis for evolutionary change.",
    "topic": "Evolutionary Variation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen004"
  },
  {
    "question_text": "Explain one difference between the variations produced in asexual reproduction versus sexual reproduction.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In asexual reproduction, variations primarily arise from small errors during DNA replication, resulting in minor differences. In contrast, sexual reproduction introduces additional variation through the shuffling of genetic material between two parents, leading to greater genetic diversity.",
    "explanation": "Asexual reproduction copies the genome with high fidelity except for occasional mutations. Sexual reproduction, however, combines genetic contributions from two individuals, which creates new allele combinations along with any replication errors.",
    "topic": "Reproductive Strategies",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen005"
  },
  {
    "question_text": "What role does environmental selection play in the accumulation of variation in a species?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Environmental selection acts on the accumulated variations by favoring traits that enhance survival and reproduction, thereby driving evolutionary change.",
    "explanation": "Not all variations are beneficial. Natural selection filters the genetic variations by ensuring that individuals with advantageous traits are more likely to survive and reproduce, leading to an increase in frequency of those traits in the population.",
    "topic": "Natural Selection",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen006"
  },
  {
    "question_text": "List two factors that can cause variation during reproduction.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Mutations during DNA replication and genetic recombination in sexual reproduction.",
    "explanation": "Mutations, which are random changes in DNA coding due to errors during replication, and the process of recombination in sexual reproduction, both contribute to generating genetic diversity in populations.",
    "topic": "Genetic Variation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen007"
  },
  {
    "question_text": "Describe the process of accumulation of variation over generations in asexual reproduction and discuss its implications for evolutionary processes.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In asexual reproduction, a single organism divides to produce offspring that are nearly identical to the parent. However, small inaccuracies during DNA replication, such as point mutations, introduce minor variations. Over many generations, these minor changes accumulate, leading to significant diversity within a population. This accumulated variation is crucial for evolution because it provides the raw materials on which natural selection can act, even though the rate of variation is slower compared to sexual reproduction.",
    "explanation": "The mechanism of asexual reproduction is efficient but limits genetic diversity to random mutations. These mutations, though rare, accumulate over time and can lead to observable phenotypic differences. When environmental pressures act on these variations, some individuals may have a survival advantage, ultimately leading to evolutionary change.",
    "topic": "Asexual Reproduction & Evolution",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen008"
  },
  {
    "question_text": "Discuss the role of sexual reproduction in generating diversity compared to asexual reproduction, and analyze how this increased diversity might affect a population's ability to adapt to environmental changes.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sexual reproduction generates diversity by combining genetic material from two different parents, creating offspring with unique allele combinations. This process introduces greater genetic variability than asexual reproduction, which relies solely on replication errors. Increased genetic diversity in a population improves its ability to adapt to environmental changes, as there is a higher likelihood that some individuals possess traits that confer survival advantages under new or changing conditions. These adaptive traits, when favored by natural selection, can lead to evolutionary shifts in the population.",
    "explanation": "The recombination of genes during sexual reproduction results in a broader range of genotypes. This diversity is critical for natural selection because it increases the pool of traits from which adaptive variations can arise, thereby enhancing the overall resilience and adaptability of the population in dynamic environments.",
    "topic": "Sexual Reproduction, Genetic Diversity, & Adaptation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen009"
  },
  {
    "question_text": "Evaluate how minor copying errors in DNA replication during asexual reproduction can lead to significant evolutionary changes over many generations. Provide examples and discuss the underlying genetic principles such as mutation and natural selection.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Minor copying errors in DNA replication, although infrequent, introduce mutations that can accumulate over generations in asexually reproducing organisms. Over time, even these subtle changes can lead to significant evolutionary outcomes. For example, in a population of bacteria, a mutation might confer resistance to an antibiotic. Environmental pressure—such as the presence of the antibiotic—then favors the survival of bacteria with this mutation. This is an example of natural selection, where genetic variation (introduced by replication errors) combined with selective pressure results in evolutionary adaptation. These principles underscore the importance of both randomness (mutation) and the nonrandom process of selection in driving evolution.",
    "explanation": "Even in the absence of sexual recombination, the accumulation of small mutations can alter phenotypes over extended periods. Natural selection then acts on these variations, favoring beneficial traits. Examples include antibiotic resistance in bacteria and changes in enzyme efficiency in metabolic pathways, illustrating how micro-level errors can have macro-level evolutionary impacts.",
    "topic": "DNA Replication Errors, Mutation, and Natural Selection",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen010"
  },
  {
    "question_text": "True or False: During asexual reproduction, the level of genetic diversity is equivalent to that produced by sexual reproduction. If false, explain why.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. Asexual reproduction produces offspring that are almost identical to the parent, with variations arising only from rare DNA copying errors, whereas sexual reproduction creates greater genetic diversity by combining genetic materials from two parents.",
    "explanation": "The genetic variation seen in sexual reproduction is largely due to the recombination of parental genes and the segregation of alleles, which generates new combinations of traits. This process inherently produces more diversity than the limited variation introduced by mutations in asexual reproduction.",
    "topic": "Genetic Diversity in Reproduction",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen011"
  },
  {
    "question_text": "True or False: Small inaccuracies in DNA replication during asexual reproduction can result in significant variations that may be beneficial under environmental selection. If false, explain why.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True. Although the variations are small, over many generations these differences can accumulate and, under environmental pressure, can lead to adaptations that benefit the organism.",
    "explanation": "Even in asexual populations, minor mutations can introduce changes that become significant over time. Beneficial mutations can enhance survival and reproduction when environmental conditions favor those changes, demonstrating key principles of natural selection.",
    "topic": "Mutation & Natural Selection",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_x_jesc1dd_c108_gen012"
  }
]