[
  {
    "question_text": "Why are some substances biodegradable and some non-biodegradable?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Substances are biodegradable if microorganisms such as bacteria and fungi produce the enzymes required to break down their complex chemical structures into simpler compounds. Natural organic materials like food waste, paper, and wood are biodegradable because of their molecular composition. In contrast, non-biodegradable substances (e.g., many plastics, glass, metals) have synthetic or highly stable molecular structures that resist enzymatic breakdown.",
    "explanation": "Biodegradation is an enzymatic process where microorganisms convert organic substances into simpler molecules that are re-assimilated into the ecosystem. Natural compounds generally have chemical bonds that are accessible to these enzymes, whereas synthetic materials often possess strong bonds and complex polymers that remain unchanged under natural conditions. This distinction underscores the importance of material choice in waste management and environmental impact.",
    "topic": "Biodegradation and waste management",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic003"
  },
  {
    "question_text": "Give any two ways in which biodegradable substances would affect the environment.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1) When managed properly (for example, through composting), biodegradable substances decompose to release nutrients back into the soil, enriching it and supporting plant growth. 2) If disposed of improperly, like being dumped in water bodies, their decomposition can deplete dissolved oxygen, produce foul odors, and release greenhouse gases such as methane, which adversely affect environmental quality.",
    "explanation": "Biodegradable materials, by virtue of being naturally decomposed by microorganisms, play a key role in nutrient cycling. Proper composting turns organic waste into valuable soil amendments, enhancing fertility. However, when organic waste accumulates in uncontrolled environments (like stagnant water), the rapid microbial activity can consume oxygen and generate methane, contributing to issues like eutrophication and climate change.",
    "topic": "Environmental effects of biodegradable waste",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic004"
  },
  {
    "question_text": "Give any two ways in which non-biodegradable substances would affect the environment.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1) Non-biodegradable substances accumulate in the environment, causing persistent pollution, which can result in physical hazards to wildlife (ingestion or entanglement) and aesthetic degradation. 2) Their production often consumes significant non-renewable resources and energy, and disposal methods such as incineration can release toxic pollutants into the air, further impacting environmental and human health.",
    "explanation": "Because materials like plastics, glass, and metals do not readily break down, they persist in ecosystems for extended periods. This accumulation in landfills, water bodies, and natural habitats leads to long-term environmental contamination. Additionally, the resource-intensive manufacturing processes contribute to resource depletion and environmental degradation. Understanding these impacts motivates efforts toward reduction, reuse, and recycling.",
    "topic": "Environmental impact of non-biodegradable waste",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic005"
  },
  {
    "question_text": "Activity 13.7: Find out what happens to the waste generated at home. Is there a system in place to collect this waste? Find out how the local body deals with the waste. Are there mechanisms in place to treat the biodegradable and non-biodegradable wastes separately? Calculate how much waste is generated at home and in the classroom, estimate the biodegradable portion, and suggest ways of dealing with this waste.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Answers will vary based on local observations and estimations. Generally, households collect waste in designated bins, and municipal services collect and segregate waste into biodegradable (e.g., kitchen waste, paper) and non-biodegradable (e.g., plastics, metals) fractions. Best practices include promoting waste segregation at source, composting biodegradable waste, and recycling or proper disposal of non-biodegradable waste. The quantitative estimates will depend on family or classroom size and consumption habits.",
    "explanation": "This activity requires students to actively investigate local waste management practices and analyze quantitative data. Students are expected to survey how waste is collected, processed, and managed by local authorities. They should evaluate the outcomes based on environmental impact, considering how improper segregation contributes to pollution, and propose sustainable waste management solutions.",
    "topic": "Waste management and environmental impact",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic006"
  },
  {
    "question_text": "Activity 13.8: Find out how the sewage in your locality is treated. Are there mechanisms to ensure that local water bodies are not polluted by untreated sewage? In addition, find out how local industries treat their waste and if there are measures in place to prevent soil and water pollution.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Responses should include descriptions of sewage treatment processes such as primary (screening and sedimentation), secondary (biological treatment using microbes), and, where applicable, tertiary treatment processes. For industrial waste, students should describe the role of Effluent Treatment Plants (ETPs) and any regulatory measures enforced by local pollution boards. The effectiveness of these treatment systems can vary, but they all aim to minimize environmental pollution of water bodies and soil.",
    "explanation": "This task challenges students to perform field research or gather secondary data regarding local waste treatment methods. It involves understanding the sequential stages in sewage treatment and comparing them with industrial waste management practices. Students should analyze the reliability of local systems and suggest improvements based on scientific principles and real-world applications.",
    "topic": "Wastewater treatment and industrial effluent management",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic007"
  },
  {
    "question_text": "What are the advantages of disposable paper cups over disposable plastic cups?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Disposable paper cups are generally more advantageous because they are made from renewable resources and are biodegradable (even though they may be lined with a thin layer of plastic or wax). In contrast, disposable plastic cups are derived from fossil fuels, are non-biodegradable, and persist in the environment for hundreds of years. However, paper cups also require significant resources for production and may not be completely environmentally benign if not sourced sustainably.",
    "explanation": "The comparison involves evaluating the life-cycle of both products. Paper cups break down more effectively in natural environments, reducing long-term waste, whereas plastic cups contribute to persistent pollution. The assessment should include considerations of resource inputs, production methods, and end-of-life disposal impacts, illustrating the broader concept of environmental sustainability in product design.",
    "topic": "Environmental impact of disposable products",
    "bloom_level": "Evaluate",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic008"
  },
  {
    "question_text": "Activity 13.9: Search the internet or library to find out what hazardous materials have to be dealt with when disposing of electronic items. How would these materials affect the environment? Also, find out how plastics are recycled and whether the recycling process has any environmental impact.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Electronic waste (e-waste) contains hazardous substances such as lead (Pb), mercury (Hg), cadmium (Cd), and brominated flame retardants (BFRs); these materials can leach into the soil and water, posing severe health risks and environmental contamination if not properly managed. Plastic recycling involves collection, sorting (by resin codes), cleaning, shredding, melting, and reforming the plastic into new products. Although recycling reduces the demand for virgin plastics and minimizes landfill waste, the process consumes energy, water, and may produce secondary pollutants if not controlled.",
    "explanation": "The investigation should help students understand the complexities of e-waste management and the environmental trade-offs in plastic recycling. The hazardous chemicals in electronics emphasize the need for specialized recycling processes to prevent contamination. Meanwhile, the steps involved in plastic recycling, from sorting to remanufacturing, require careful assessment of energy and resource use, making it a multifaceted environmental issue that draws on principles of chemistry, materials science, and environmental engineering.",
    "topic": "E-waste management and plastic recycling",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic009"
  },
  {
    "question_text": "Which of the following is an example of an abiotic component in an ecosystem?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Grass",
      "B. Fish",
      "C. Soil",
      "D. Bird"
    ],
    "correct_answer": "C. Soil – Because soil is a non-living (physical) component of an ecosystem.",
    "explanation": "Abiotic components refer to non-living factors in the ecosystem such as soil, temperature, rainfall, and minerals, while biotic components are the living organisms.",
    "topic": "Ecosystem Components",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen001"
  },
  {
    "question_text": "What is the primary role of producers in an ecosystem?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. To break down dead organic matter",
      "B. To convert solar energy into chemical energy",
      "C. To eat other organisms",
      "D. To provide shelter for animals"
    ],
    "correct_answer": "B. To convert solar energy into chemical energy – Producers such as green plants perform photosynthesis, capturing sunlight and converting it into energy-rich compounds.",
    "explanation": "Producers (autotrophs) are essential because they capture solar energy through photosynthesis and produce organic compounds that serve as food for consumers.",
    "topic": "Producers and Energy Flow",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen002"
  },
  {
    "question_text": "Which of the following best illustrates the phenomenon of biological magnification?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Nutrients being cycled in the ecosystem",
      "B. Chemical pesticides accumulating in higher concentrations at each trophic level",
      "C. Oxygen production by aquatic plants",
      "D. Carbon dioxide usage by plants"
    ],
    "correct_answer": "B. Chemical pesticides accumulating in higher concentrations at each trophic level – This describes how non-degradable chemicals concentrate as they move up the food chain.",
    "explanation": "Biological magnification occurs when persistent chemicals increase in concentration as they are passed from lower to higher trophic levels, posing risks to top predators, including humans.",
    "topic": "Biological Magnification",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen003"
  },
  {
    "question_text": "Approximately what percentage of the energy consumed at one trophic level is transferred to the next trophic level in most ecosystems?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. 1%",
      "B. 10%",
      "C. 25%",
      "D. 50%"
    ],
    "correct_answer": "B. 10% – On average, only about 10% of energy is transferred from one trophic level to the next.",
    "explanation": "Due to energy loss (as heat, in metabolic processes, etc.) at each tap of the food chain, only around 10% of the energy from one trophic level is available to the next, limiting the number of trophic levels.",
    "topic": "Energy Flow in Ecosystems",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen004"
  },
  {
    "question_text": "Define an ecosystem and list its two primary components.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An ecosystem is a community of interacting living organisms (biotic components) and their non-living environments (abiotic components).",
    "explanation": "Ecosystems are composed of biotic factors like plants, animals, and microorganisms and abiotic factors such as temperature, water, soil, and minerals, which interact to maintain environmental balance.",
    "topic": "Ecosystem Components",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen005"
  },
  {
    "question_text": "What are producers and consumers? Provide one example for each.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Producers are organisms that produce their own food using sunlight (e.g., plants), while consumers are organisms that depend on others for food (e.g., herbivores like deer or carnivores like lions).",
    "explanation": "Producers convert solar energy into chemical energy via photosynthesis. Consumers, including herbivores, carnivores, and omnivores, rely directly or indirectly on producers for food.",
    "topic": "Trophic Levels",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen006"
  },
  {
    "question_text": "Explain why a small, contained ecosystem like an aquarium requires periodic cleaning compared to a natural pond.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Aquariums have limited water volume and biodiversity, which leads to rapid accumulation of waste, excess nutrients, and toxins; thus, regular cleaning is needed to prevent harmful build-up. In contrast, natural ponds have larger volumes, more species, and complex nutrient cycles that aid in self-purification.",
    "explanation": "The confined space in an aquarium means that waste products (like ammonia from fish excreta) accumulate quickly, upsetting the balanced cycling of nutrients. Natural systems benefit from higher dilution and biodiversity, ensuring more efficient decomposition and recycling.",
    "topic": "Artificial vs. Natural Ecosystems",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen007"
  },
  {
    "question_text": "Describe the concept of a food web and explain how it differs from a simple food chain.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A food web is a complex network of interconnected food chains that shows multiple feeding relationships among organisms, while a food chain is a single linear sequence of organisms where each is eaten by the next.",
    "explanation": "In a food chain, energy flows in a single line from producers to various levels of consumers. A food web, however, represents the multiple pathways through which energy and nutrients circulate within an ecosystem, illustrating that most organisms consume and are consumed by more than one species.",
    "topic": "Food Chains and Webs",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen008"
  },
  {
    "question_text": "Explain the process of energy flow through an ecosystem starting from the capture of sunlight by producers, through various trophic levels, and discuss why energy diminishes at each level.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Energy flow in an ecosystem begins when producers, such as green plants, capture sunlight and convert it into chemical energy through photosynthesis. This energy is then transferred to primary consumers (herbivores) when they feed on the plants. Secondary consumers, which are carnivores that eat the herbivores, obtain energy next, followed by tertiary consumers. At each trophic level, energy is lost as heat during metabolism, for bodily maintenance, or due to incomplete digestion, which is why typically only about 10% of the energy passes to the next trophic level.",
    "explanation": "Photosynthesis initiates energy capture from sunlight. Each subsequent trophic interaction results in significant energy losses due to the second law of thermodynamics, as energy is dissipated predominantly in the form of heat. This progressive loss sets limitations on the number of trophic levels in an ecosystem.",
    "topic": "Energy Flow in Ecosystems",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen009"
  },
  {
    "question_text": "Describe the phenomenon of biological magnification. Discuss its implications for human health and the environment with examples.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Biological magnification refers to the process where the concentration of persistent, non-degradable chemicals (such as pesticides) increases as they move up the trophic levels. This occurs because organisms at lower levels absorb these chemicals from contaminated water, soil, or food and then, when consumed by predators, these chemicals accumulate at higher concentrations in their bodies. For example, small aquatic animals may accumulate pesticides that are further concentrated in large fish, which in turn can lead to high pesticide levels in human consumers, potentially causing health risks like cancer or neurological disorders.",
    "explanation": "Persistent chemicals are not efficiently metabolized or excreted, leading to their accumulation in body tissues. As they move up the food chain, each trophic level receives the total chemical load from many prey organisms, which increases the risk of toxic effects in top predators, including humans.",
    "topic": "Biological Magnification and Health",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen010"
  },
  {
    "question_text": "Design an experiment using an aquarium as an artificial ecosystem. List the essential components, explain potential interactions between the organisms, address periodic maintenance needs, and evaluate the risks of introducing a harmful species.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "To design an aquarium experiment, one should include essential components such as water, oxygen (using an aerator), substrate (soil/sand), aquatic plants (producers), fish and small invertebrates (primary consumers), and decomposers like beneficial bacteria. The experiment should examine how producers generate oxygen through photosynthesis, which supports the respiration of fish, and how waste products become nutrients for plants via microbial decomposition. Regular maintenance (cleaning, feeding, and monitoring water quality) is crucial to prevent toxic buildup. Introducing a harmful species (like a predatory fish in a community with small fish) could disrupt the balance by consuming too many individuals, demonstrating the importance of species selection to maintain a balanced ecosystem.",
    "explanation": "This experiment highlights the principles of ecosystem maintenance, energy flow, and inter-species interactions, emphasizing that the balance in artificial ecosystems is delicate and requires careful design and management to closely mimic natural processes.",
    "topic": "Artificial Ecosystem Design",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen011"
  },
  {
    "question_text": "True or False: In an ecosystem, the term 'biotic components' includes only animals and plants.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False – Biotic components include not only animals and plants but also microorganisms such as bacteria, fungi, and other living forms.",
    "explanation": "Biotic factors refer to all living organisms in an ecosystem including animals, plants, fungi, bacteria, and protists.",
    "topic": "Ecosystem Components",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen012"
  },
  {
    "question_text": "True or False: The flow of energy in an ecosystem is bidirectional, meaning energy can be recycled back to producers from consumers.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – Energy flow in an ecosystem is unidirectional. Once energy is used by an organism, it is lost as heat and cannot be recycled back to the producers.",
    "explanation": "Energy is lost at each trophic level primarily due to metabolic processes and the laws of thermodynamics, preventing its recycling back up the food chain.",
    "topic": "Energy Flow in Ecosystems",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen013"
  },
  {
    "question_text": "True or False: A food chain is a linear and exclusive sequence where each organism is eaten by only one other species, without any overlapping feeding relationships.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – While a food chain represents one linear pathway of energy flow, in reality, ecosystems have overlapping feeding relationships which are better represented by a food web.",
    "explanation": "Most organisms have varied diets and are involved in multiple feeding relationships, making food webs a more accurate representation of energy and nutrient flows within ecosystems.",
    "topic": "Food Chains and Webs",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_x_jesc1dd_c113_gen014"
  },
  {
    "question_text": "Which of the following groups contain only biodegradable items?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Grass, flowers and leather",
      "Grass, wood and plastic",
      "Fruit-peels, cake and lime-juice",
      "Cake, wood and grass"
    ],
    "correct_answer": "Fruit-peels, cake and lime-juice (Option C)",
    "explanation": "Fruit-peels, cake, and lime-juice are composed of organic materials that decompose relatively quickly compared to items such as leather (which biodegrades very slowly) and plastic (which is non-biodegradable). Although option D also contains only biodegradable items, option C is the best answer because the organic waste in option C decomposes faster. This illustrates the concept of biodegradability and the environmental implications of waste composition.",
    "topic": "Biodegradability and Waste Management",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex001"
  },
  {
    "question_text": "Which of the following constitute a food-chain?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Grass, wheat and mango",
      "Grass, goat and human",
      "Goat, cow and elephant",
      "Grass, fish and goat"
    ],
    "correct_answer": "Grass, goat and human (Option B)",
    "explanation": "A food chain is a sequence of organisms through which energy and nutrients pass. In option B, grass is a producer, the goat is a primary consumer that feeds on the grass, and the human is a secondary consumer who may consume the goat. This correctly illustrates the trophic levels in a food chain.",
    "topic": "Food Chains and Trophic Levels",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex002"
  },
  {
    "question_text": "Which of the following are environment-friendly practices?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Carrying cloth-bags while shopping",
      "Switching off unnecessary lights and fans",
      "Walking to school instead of getting a ride",
      "All of the above"
    ],
    "correct_answer": "All of the above (Option D)",
    "explanation": "Each option represents an environment-friendly practice: using cloth bags reduces plastic waste, switching off unused electrical devices saves energy, and walking reduces fossil fuel consumption. Together, they illustrate sustainable practices in everyday life.",
    "topic": "Environmental Conservation and Sustainable Practices",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex003"
  },
  {
    "question_text": "What will happen if we kill all the organisms in one trophic level?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Eliminating all organisms in one trophic level will disrupt the entire ecosystem. The consumers that rely on the affected trophic level for food may starve, while the prey organisms may experience population explosions. This imbalance can lead to a cascade effect, eventually destabilizing the nutrient cycles and energy flow in the ecosystem.",
    "explanation": "Removing an entire trophic level interferes with the intricate balance of the food web. For example, if primary consumers (herbivores) are eliminated, the producers may overgrow or die off without the regulatory pressure of grazing. Conversely, if producers are removed, every organism dependent on primary production loses its energy source, resulting in ecosystem collapse. This concept demonstrates the interdependence of trophic levels and the importance of energy flow and nutrient cycling.",
    "topic": "Ecosystem Dynamics and Trophic Interactions",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex004"
  },
  {
    "question_text": "Will the impact of removing all the organisms in a trophic level be different for different trophic levels? Can the organisms of any trophic level be removed without causing damage to the ecosystem?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Yes, the impact will vary depending on the trophic level removed. Removing producers, which form the base of the food chain, would lead to the collapse of the entire ecosystem. Removing top carnivores could cause an overpopulation of herbivores, and eliminating decomposers would halt nutrient recycling. No trophic level can be completely removed without causing significant ecological imbalance.",
    "explanation": "Each trophic level plays a distinct role in maintaining the ecosystem’s stability. Producers convert solar energy into chemical energy, and consumers along with decomposers ensure energy flow and nutrient recycling. The removal of any one level disrupts these processes: a lack of producers removes the energy source for all higher levels, while the removal of decomposers prevents the breakdown and reuse of organic matter. Thus, every level is critical to the overall ecological balance.",
    "topic": "Food Web Interdependence and Ecosystem Stability",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex005"
  },
  {
    "question_text": "What is biological magnification? Will the levels of this magnification be different at different levels of the ecosystem?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Biological magnification is the process whereby the concentration of non-degradable substances, such as pesticides or heavy metals, increases at each successive trophic level in a food chain. The highest concentrations are found in organisms at the top trophic levels.",
    "explanation": "Biomagnification occurs because these substances are not easily broken down and tend to accumulate in the tissues of organisms. As a predator consumes several prey that each contain small amounts of these toxins, the concentration increases in the predator. This phenomenon is particularly dangerous for top predators, including humans, and underscores the need for monitoring and regulating pollutants in the environment.",
    "topic": "Pollutants and Food Chain Dynamics",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex006"
  },
  {
    "question_text": "What are the problems caused by the non-biodegradable wastes that we generate?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Non-biodegradable waste causes numerous environmental problems including land pollution (accumulation in landfills and soil contamination), water pollution (leaching into water bodies affecting aquatic life), air pollution (when burned, releasing toxins), harm to wildlife (ingestion or entanglement), and overall degradation of natural landscapes.",
    "explanation": "Non-biodegradable materials persist in the environment for long periods, interfering with natural processes. For example, plastics can take hundreds to thousands of years to decompose, disrupting ecosystems and harming organisms. The physical presence of such waste also creates unsightly and unsafe conditions, which can lead to secondary issues such as reduced water quality and biodiversity loss.",
    "topic": "Waste Management and Environmental Pollution",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex007"
  },
  {
    "question_text": "If all the waste we generate is biodegradable, will this have no impact on the environment?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "No, even if all waste were biodegradable, it could still negatively impact the environment. The decomposition of large amounts of biodegradable material, especially in anaerobic conditions, can produce methane (a potent greenhouse gas) and leachate that pollutes water sources.",
    "explanation": "Biodegradable waste, when not managed properly, can still cause environmental harm. In landfills, for example, insufficient oxygen can lead to anaerobic decomposition, releasing methane and creating leachate that contaminates groundwater. Therefore, proper waste management practices such as composting are essential to minimize these impacts, despite the waste being biodegradable.",
    "topic": "Waste Decomposition and Environmental Impact",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex008"
  },
  {
    "question_text": "Why is damage to the ozone layer a cause for concern? What steps are being taken to limit this damage?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Damage to the ozone layer is concerning because it acts as a shield against harmful ultraviolet (UV) radiation from the sun. Increased UV exposure can lead to skin cancer, cataracts, immune system suppression, and damage to terrestrial and aquatic ecosystems. Internationally, measures such as the Montreal Protocol have been implemented to phase out ozone-depleting substances (ODS) like chlorofluorocarbons (CFCs), thereby reducing further damage and aiding in the gradual recovery of the ozone layer.",
    "explanation": "The ozone layer’s function is critical for life as it absorbs most of the sun’s harmful UV radiation. The thinning or depletion of this layer increases the risk of UV-related health issues and environmental disturbances. The Montreal Protocol and its subsequent amendments represent successful international cooperation using scientific evidence to regulate and reduce pollutants, demonstrating a real-world application of environmental governance principles and chemical safety.",
    "topic": "Ozone Layer Depletion and Environmental Policies",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ex009"
  },
  {
    "question_text": "What is ozone and how does it affect any ecosystem?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ozone (O₃) is a molecule composed of three oxygen atoms. In the stratosphere, it forms a protective layer that absorbs harmful ultraviolet (UV) radiation, thereby protecting living organisms from damage (e.g., skin cancer, cataracts, and damage to plant life). In the troposphere, however, ozone acts as a pollutant, contributing to smog and respiratory problems, and it can also damage vegetation.",
    "explanation": "Ozone has distinct roles depending on its location in the atmosphere. In the upper atmosphere (stratosphere), the formation of ozone occurs via the reaction O₂ --(UV)--> 2O followed by O + O₂ → O₃. This ozone layer absorbs most of the Sun's harmful UV radiation, safeguarding ecosystems and human health. Conversely, near the Earth's surface (in the troposphere), ozone is produced by photochemical reactions involving industrial pollutants and sunlight. This ground-level ozone can cause respiratory issues, damage crops and other plant life, and contribute to urban smog. Understanding these dual roles is crucial for both environmental protection and public health.",
    "topic": "Atmospheric Chemistry / Ecosystem Effects",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic010"
  },
  {
    "question_text": "How can you help in reducing the problem of waste disposal? Give any two methods.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Two effective methods to reduce waste disposal issues are: (1) Reduce Consumption: Limiting purchases to what is necessary, avoiding single-use products, and selecting items with minimal packaging can greatly decrease the amount of waste produced; (2) Segregation and Recycling/Composting: By separating waste into biodegradable materials (which can be composted) and non-biodegradable materials (which can be recycled), we can ensure that waste is processed in an environmentally friendly way and minimize landfill accumulation.",
    "explanation": "Reducing waste begins with minimizing consumption, which lowers the initial generation of waste. Effective waste management strategies involve segregating waste at the source — separating kitchen waste (biodegradable) from plastics, paper, and metals (non-biodegradable). Biodegradable materials can be composted to return valuable nutrients to the soil, while recyclables are processed to conserve raw materials and energy. This dual approach not only reduces environmental impact but also supports resource recovery and sustainable waste management practices.",
    "topic": "Waste Management / Environmental Sustainability",
    "bloom_level": "Apply",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic011"
  },
  {
    "question_text": "What are trophic levels? Give an example of a food chain and state the different trophic levels in it.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Trophic levels are the steps or positions that organisms occupy in a food chain, representing the flow of energy from one level to another. For example, in the food chain: Grass → Grasshopper → Frog → Snake, the trophic levels are: Grass (Producer, First Trophic Level), Grasshopper (Primary Consumer, Second Trophic Level), Frog (Secondary Consumer, Third Trophic Level), and Snake (Tertiary Consumer, Fourth Trophic Level).",
    "explanation": "Trophic levels reflect the hierarchical positions in a food chain. Producers (autotrophs like grass) convert solar energy into chemical energy through photosynthesis. Primary consumers (herbivores such as grasshoppers) feed on producers, secondary consumers (carnivores like frogs) feed on primary consumers, and tertiary consumers (carnivores such as snakes) feed on secondary consumers. This sequence illustrates the flow of energy and the loss of energy at each step due to metabolic processes, supporting the concept of energy pyramids and ecological efficiency. Diagrams such as food chain illustrations help visualize these relationships.",
    "topic": "Food Chains and Trophic Levels",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic001"
  },
  {
    "question_text": "What is the role of decomposers in the ecosystem?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Decomposers, such as bacteria and fungi, break down dead organic matter (dead plants, animals, waste products) into simpler inorganic substances. This process releases essential nutrients back into the soil, water, and air, making them available again for producers like plants. They are critical for nutrient cycling and maintaining the balance of ecosystems.",
    "explanation": "Decomposers perform the essential function of recycling materials in the ecosystem by decomposing dead organic matter and waste products. This biochemical process, often mediated by extracellular enzymes, converts complex organic compounds into simple inorganic nutrients (e.g., nitrogen, phosphorus) that can be taken up by plants. This nutrient cycling is vital for soil fertility and ecosystem sustainability. Without decomposers, dead matter and waste would accumulate, and the nutrient cycle would be significantly disrupted. In laboratory settings, experiments often involve measuring the rate of decomposition under controlled conditions to study these processes.",
    "topic": "Nutrient Cycling and Decomposition",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "jesc113",
    "question_id": "cbse_x_jesc1dd_c113_ic002"
  },
  {
    "question_text": "What is the primary function of the ozone layer in the Earth's stratosphere?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. To produce oxygen for life",
      "B. To shield the Earth from harmful ultraviolet (UV) radiation",
      "C. To generate weather patterns",
      "D. To store heat from the Sun"
    ],
    "correct_answer": "B. To shield the Earth from harmful ultraviolet (UV) radiation",
    "explanation": "The ozone layer absorbs and scatters the solar ultraviolet radiation, protecting living organisms from its damaging effects.",
    "topic": "Ozone Layer",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen015"
  },
  {
    "question_text": "Which of the following chemicals is most commonly associated with the depletion of the ozone layer?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Carbon Dioxide (CO2)",
      "B. Chlorofluorocarbons (CFCs)",
      "C. Methane (CH4)",
      "D. Nitrogen (N2)"
    ],
    "correct_answer": "B. Chlorofluorocarbons (CFCs)",
    "explanation": "Chlorofluorocarbons (CFCs) are synthetic chemicals that have been shown to cause significant depletion of the ozone layer when released into the atmosphere.",
    "topic": "Ozone Depletion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen016"
  },
  {
    "question_text": "Which of the following statements about biodegradable waste is correct?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It consists only of plastic materials.",
      "B. It decomposes under natural conditions through the action of microorganisms.",
      "C. It remains unchanged in the environment for hundreds of years.",
      "D. It includes materials that can only be broken down by extreme physical conditions."
    ],
    "correct_answer": "B. It decomposes under natural conditions through the action of microorganisms.",
    "explanation": "Biodegradable materials like food waste, paper, and natural fabrics are broken down naturally by the action of microorganisms.",
    "topic": "Waste Management",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen017"
  },
  {
    "question_text": "Which combination of factors is most likely to determine the rate of decomposition of organic waste?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Moisture, temperature, and the type of microorganisms present",
      "B. The color and shape of the waste material",
      "C. The altitude at which the waste is deposited",
      "D. Only the amount of moisture present"
    ],
    "correct_answer": "A. Moisture, temperature, and the type of microorganisms present",
    "explanation": "Decomposition is influenced by environmental conditions such as moisture, temperature, and the type of decomposing microorganisms, all of which determine how quickly organic matter breaks down.",
    "topic": "Decomposition Processes",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen018"
  },
  {
    "question_text": "Define ozone and explain how it differs from oxygen (O2).",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Ozone (O3) is a molecule made up of three oxygen atoms, while oxygen (O2) is a molecule with two oxygen atoms. O2 is essential for aerobic life, whereas O3, although toxic near the surface, provides crucial protection by absorbing ultraviolet (UV) radiation in the stratosphere.",
    "explanation": "Ozone is chemically different from oxygen; its triatomic structure makes it unstable at ground level but effective as a UV shield in the upper atmosphere.",
    "topic": "Ozone",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen019"
  },
  {
    "question_text": "What are Ozone Depleting Substances (ODS) and why are they harmful to the ozone layer?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ozone Depleting Substances (ODS) are chemicals such as CFCs, halons, carbon tetrachloride, and methyl chloroform. They damage the ozone layer by releasing chlorine and bromine atoms when they are broken down by UV radiation, which then catalyze the destruction of ozone molecules.",
    "explanation": "ODS are harmful because even a small number of these compounds can catalyze a reaction that destroys ozone in a repetitive cycle, reducing the protective ozone concentration in the stratosphere.",
    "topic": "Ozone Depletion",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen020"
  },
  {
    "question_text": "What does it mean for a substance to be biodegradable? Provide two examples of biodegradable and two examples of non-biodegradable materials.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A substance is biodegradable if it can be broken down by microorganisms into simpler compounds. Examples of biodegradable materials include food scraps and paper. Non-biodegradable materials include plastics and glass.",
    "explanation": "Biodegradable substances decompose naturally via microbial activity, making them less persistent in the environment compared to non-biodegradable substances which can remain for long periods.",
    "topic": "Waste Management",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen021"
  },
  {
    "question_text": "Describe the process of ozone formation in the stratosphere, including the role of ultraviolet (UV) radiation and oxygen molecules.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ultraviolet (UV) radiation from the Sun splits molecular oxygen (O2) into two free oxygen atoms. Each free oxygen atom then reacts with another O2 molecule to form ozone (O3). The process can be summarized by the reactions: O2 --(UV)--> O + O and O + O2 → O3. This process is essential as the ozone formed in the stratosphere absorbs harmful UV rays, protecting living organisms on Earth.",
    "explanation": "This process, known as the Chapman cycle, is vital to maintaining the balance of stratospheric ozone. Although this cycle creates ozone, it is offset by natural and human-induced destruction of ozone molecules, leading to concerns about ozone depletion.",
    "topic": "Ozone Formation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen022"
  },
  {
    "question_text": "Discuss the impact of non-biodegradable waste on the environment and evaluate the effectiveness of current waste management strategies, including the role of biodegradable plastics.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Non-biodegradable waste, such as plastics, glass, and metals, remains in the environment for long periods, contributing to pollution, harming wildlife, and disrupting ecosystems. Current waste management strategies include reducing consumption, recycling, and proper segregation of waste. Biodegradable plastics are being developed to decompose faster than conventional plastics; however, they generally require specific conditions like industrial composting facilities for proper breakdown and may not be effective in all environments. Overall, while these strategies are steps in the right direction, a combination of reducing waste generation, enhancing recycling processes, and developing more efficient biodegradable alternatives is necessary to mitigate environmental impacts.",
    "explanation": "The long-lasting nature of non-biodegradable waste presents significant challenges for the environment. While biodegradable plastics offer a promising solution, their success is contingent on proper disposal and processing conditions. A holistic waste management strategy is vital for sustainable environmental protection.",
    "topic": "Waste Management",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen023"
  },
  {
    "question_text": "True or False: Ozone (O3) is toxic in all parts of the Earth's atmosphere. If false, explain why.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. Ozone is toxic at ground level, but in the stratosphere, it serves a critical role in protecting life on Earth by absorbing harmful UV radiation.",
    "explanation": "At lower altitudes, high concentrations of ozone can cause respiratory problems and other health issues. However, in the upper atmosphere, ozone forms a protective layer that prevents most UV radiation from reaching the Earth's surface.",
    "topic": "Ozone",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen024"
  },
  {
    "question_text": "True or False: All biodegradable materials decompose completely when disposed of in landfills. If false, provide a correction.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. While biodegradable materials generally decompose, decomposition in landfills can be slow or incomplete due to inadequate conditions such as low moisture, limited oxygen, or unsuitable microbial activity.",
    "explanation": "Landfills are often designed to minimize decomposition to reduce odors and leachate; therefore, even biodegradable materials may not break down efficiently in a landfill environment.",
    "topic": "Waste Decomposition",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc113",
    "section_id": "04_section_13_2",
    "question_id": "cbse_x_jesc1dd_c113_gen025"
  }
]