[
  {
    "question_text": "Ethane, with the molecular formula C₂H₆, has how many covalent bonds?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "6 covalent bonds",
      "7 covalent bonds",
      "8 covalent bonds",
      "9 covalent bonds"
    ],
    "correct_answer": "7 covalent bonds",
    "explanation": "Ethane (C₂H₆) has one C–C bond and six C–H bonds, making a total of 7 covalent bonds. The single bond between the two carbon atoms plus the three bonds from each carbon to hydrogen gives the answer.",
    "topic": "Covalent bonding and molecular structure",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex001"
  },
  {
    "question_text": "Butanone is a four‐carbon compound. What is its functional group?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Carboxylic acid",
      "Aldehyde",
      "Ketone",
      "Alcohol"
    ],
    "correct_answer": "Ketone",
    "explanation": "Butanone contains the carbonyl functional group placed within the carbon chain (not at the end) and is identified by the suffix ‘-one’.",
    "topic": "Functional groups in organic compounds",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex002"
  },
  {
    "question_text": "While cooking, if the bottom of the vessel is getting blackened on the outside, what does it indicate about the fuel?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The food is not cooked completely",
      "The fuel is not burning completely",
      "The fuel is wet",
      "The fuel is burning completely"
    ],
    "correct_answer": "The fuel is not burning completely",
    "explanation": "Incomplete combustion of the fuel results in the production of soot (unburnt carbon), which deposits on the vessel. This is evident from the blackening observed.",
    "topic": "Combustion and fuel chemistry",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex003"
  },
  {
    "question_text": "Explain the nature of the covalent bond using the bond formation in CH₃Cl.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In CH₃Cl, carbon has 4 valence electrons and tends to form four bonds to achieve an octet. It shares one electron with each of the three hydrogen atoms, forming three C–H covalent bonds, and shares one electron with chlorine, forming a C–Cl bond. While the C–H bonds are essentially non-polar due to similar electronegativities, the C–Cl bond is polar because chlorine is more electronegative. Overall, each shared electron pair constitutes a covalent bond that enables both atoms to achieve their stable, noble gas-like configuration.",
    "explanation": "Covalent bonds form when atoms share electrons so that each atom can complete its valence shell. In CH₃Cl, carbon’s tetravalency allows it to form four bonds simultaneously. The formation of these bonds, depicted using Lewis dot structures, demonstrates fundamental covalent bonding principles, including differences in bond polarity due to electronegativity differences.",
    "topic": "Covalent bonding and Lewis structures",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex004"
  },
  {
    "question_text": "Draw the electron dot structures for (a) ethanoic acid, (b) H₂S, (c) propanone, and (d) F₂.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ethanoic acid: CH₃COOH (Lewis: show CH₃ bonded to a carbonyl carbon with a –OH group attached), H₂S: H–S–H with lone pairs on S, Propanone: CH₃COCH₃ (central carbon double bonded to O and single bonded to two CH₃ groups), F₂: :F–F: (each F with three lone pairs).",
    "explanation": "Students should depict the valence electrons using Lewis dot structures. For ethanoic acid, ensure that the carboxyl group is shown properly with a double bond to oxygen and a hydroxyl group. H₂S must show two single bonds with hydrogen atoms and lone pairs on sulfur. Propanone requires the central carbon to be shown bonded to an oxygen (with a double bond) and two methyl groups, and for F₂, each fluorine atom should display three lone pairs.",
    "topic": "Lewis structures and molecular geometry",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex005"
  },
  {
    "question_text": "What is a homologous series? Explain with an example.",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A homologous series is a group of organic compounds that have a similar general formula, the same functional group, and similar chemical properties. Successive members of the series differ by a –CH₂– unit. An example is the alkane series: methane (CH₄), ethane (C₂H₆), propane (C₃H₈), etc.",
    "explanation": "In a homologous series, the addition of one –CH₂– unit results in a gradual change in physical properties while maintaining similar chemical reactions. This regular change is observed in properties such as boiling points and melting points among successive members of the series.",
    "topic": "Organic chemistry – Homologous series",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex006"
  },
  {
    "question_text": "How can ethanol and ethanoic acid be differentiated on the basis of their physical and chemical properties?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ethanol and ethanoic acid can be differentiated as follows: Physically, ethanol has a characteristic alcoholic odor and a lower boiling point, whereas ethanoic acid (acetic acid) has a pungent, vinegar-like smell and a higher boiling/melting point (it can freeze in cold climates as glacial acetic acid). Chemically, ethanoic acid, being an acid, reacts with bases (e.g., Na₂CO₃ or NaHCO₃) to produce effervescence (CO₂ gas evolution), while ethanol does not. Additionally, ethanol decolorizes oxidizing agents like alkaline KMnO₄ due to its ability to be oxidized, whereas ethanoic acid, the oxidation product, shows little or no such change.",
    "explanation": "The differences arise because ethanol is an alcohol (neutral solvent) while ethanoic acid is a weak carboxylic acid. Their distinct functional groups lead to differences in intermolecular forces (hydrogen bonding, dipole-dipole interactions), reactivity towards bases, and their behavior in oxidation reactions.",
    "topic": "Organic compound properties and functional group behavior",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex007"
  },
  {
    "question_text": "Why does micelle formation take place when soap is added to water? Will a micelle be formed in other solvents such as ethanol?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Micelle formation occurs because soap molecules are amphiphilic, meaning they have a hydrophobic long-chain tail and a hydrophilic ionic head. In water, the hydrophobic parts aggregate to minimize contact with water, while the hydrophilic heads remain in contact with the aqueous phase, forming spherical structures known as micelles. In a solvent like ethanol, which is less polar than water, the driving force for micelle formation is greatly reduced or absent because both hydrophilic and hydrophobic parts may be soluble, meaning that soap molecules tend to remain individually dissolved.",
    "explanation": "In water, the polarity of the solvent forces the non-polar hydrocarbon chains of soap molecules to cluster together (hydrophobic effect). This minimizes the free energy of the system. In contrast, ethanol has a lower polarity, allowing the hydrocarbon tail greater solubility, hence it does not promote micelle formation.",
    "topic": "Emulsification and micelle formation",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex008"
  },
  {
    "question_text": "Why are carbon and its compounds used as fuels for most applications?",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Carbon and its compounds are widely used as fuels because they have high calorific values, meaning they release a significant amount of heat upon combustion. Their combustion is highly exothermic, producing carbon dioxide and water when sufficient oxygen is available. Additionally, carbon-based fuels such as hydrocarbons are abundant, can be stored and transported easily, and their combustion reactions can be controlled for practical energy release.",
    "explanation": "The energy released from the breaking and forming of bonds during combustion of carbon compounds makes them effective fuels. This energy density, combined with abundance in nature, underscores their importance in applications such as heating, transportation, and power generation.",
    "topic": "Combustion and energy",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex009"
  },
  {
    "question_text": "Explain the formation of scum when hard water is treated with soap.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Scum formation occurs because hard water contains high concentrations of calcium (Ca²⁺) and magnesium (Mg²⁺) ions. Soap, which consists of sodium (or potassium) salts of fatty acids, reacts with these ions to form insoluble calcium or magnesium salts of the fatty acids. These insoluble compounds precipitate out as a white, curdy substance called scum.",
    "explanation": "The reaction can be represented as: 2 C₁₇H₃₅COO⁻ Na⁺ + Ca²⁺ → (C₁₇H₃₅COO)₂Ca(s) + 2 Na⁺. This reaction limits the effectiveness of soap in hard water by reducing its ability to form micelles, an important mechanism in cleaning.",
    "topic": "Water hardness and soap chemistry",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex010"
  },
  {
    "question_text": "What change will you observe if you test a soap solution with both red and blue litmus paper?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A soap solution is typically slightly alkaline due to hydrolysis of fatty acid salts. It will turn red litmus paper blue, while blue litmus paper will remain unchanged.",
    "explanation": "The alkaline nature arises from the reaction of the soap with water, which produces hydroxide ions. This weak basicity is sufficient to change the color of red litmus paper to blue, confirming the basic pH of the solution.",
    "topic": "Acid-base properties of compounds",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex011"
  },
  {
    "question_text": "What is hydrogenation and what is one of its major industrial applications?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hydrogenation is a chemical reaction in which hydrogen (H₂) is added across unsaturated bonds (double or triple bonds) in organic compounds, typically in the presence of a catalyst such as nickel, palladium, or platinum. One major industrial application of hydrogenation is the conversion of unsaturated vegetable oils into saturated or semi-saturated fats, such as margarine, which improves their stability and texture.",
    "explanation": "During hydrogenation, the catalyst facilitates the addition of hydrogen atoms to the carbon–carbon multiple bonds, effectively 'saturating' the molecule. This process is critical in food processing for modifying the physical properties of fats and oils and in other chemical industries where saturation is desired.",
    "topic": "Hydrogenation and catalytic reactions",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex012"
  },
  {
    "question_text": "Which of the following hydrocarbons undergo addition reactions: C₂H₆, C₃H₈, C₃H₆, C₂H₂, and CH₄?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "C₂H₆ and C₃H₈",
      "C₂H₆ and CH₄",
      "C₃H₆ and C₂H₂",
      "All of them"
    ],
    "correct_answer": "C₃H₆ and C₂H₂",
    "explanation": "Addition reactions occur in unsaturated hydrocarbons that contain double or triple bonds. C₃H₆ (propene) is an alkene (contains a double bond) and C₂H₂ (ethyne) is an alkyne (contains a triple bond), whereas C₂H₆, C₃H₈, and CH₄ are saturated hydrocarbons (alkanes) and do not undergo addition reactions under normal conditions.",
    "topic": "Reaction mechanisms in organic chemistry",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex013"
  },
  {
    "question_text": "Give a test that can be used to differentiate between saturated and unsaturated hydrocarbons.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The Bromine Water Test is used to differentiate between saturated and unsaturated hydrocarbons. When bromine water (reddish-brown) is added to an unsaturated hydrocarbon, the color fades due to the addition reaction across the double or triple bond, whereas a saturated hydrocarbon does not decolorize the bromine water.",
    "explanation": "Unsaturated hydrocarbons react readily with bromine water because of the presence of carbon–carbon multiple bonds. This test, also known as Baeyer's Test when using dilute alkaline potassium permanganate, helps in identifying the unsaturation in organic compounds.",
    "topic": "Qualitative organic analysis",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex014"
  },
  {
    "question_text": "Explain the mechanism of the cleaning action of soaps.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Soaps are amphiphilic molecules with a hydrophobic (non-polar) tail and a hydrophilic (polar) head. When added to water during cleaning, the hydrophobic tails attach to oil or grease particles while the hydrophilic heads remain in contact with water. This leads to the formation of spherical structures called micelles, where the oil is encapsulated within the center. The micelles remain suspended in water and can be washed away, thus removing the dirt.",
    "explanation": "The cleaning process involves emulsification – the hydrophobic parts of soap molecules surround and solubilize oily dirt, while the hydrophilic parts interact with water. This dual interaction enables the dispersion of dirt and grease, making them easier to rinse off. Diagrams of micelles often show the hydrophobic tails pointing inward and the hydrophilic heads outward, reinforcing the concept of emulsification.",
    "topic": "Colloid chemistry and emulsification",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "jesc104",
    "question_id": "cbse_x_jesc1dd_c104_ex015"
  }
]