[
  {
    "question_text": "Which of the following best describes 'life processes'?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Activities related only to movement",
      "B. Maintenance functions that keep organisms alive even at rest",
      "C. Processes only occurring during feeding",
      "D. Reproductive functions only"
    ],
    "correct_answer": "B. Maintenance functions that keep organisms alive even at rest",
    "explanation": "Life processes include all the maintenance functions that occur continuously in living organisms, even when they are at rest, to prevent damage and ensure survival.",
    "topic": "Life Processes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen001"
  },
  {
    "question_text": "The process in which food is converted into energy and molecular building blocks, using oxygen to break down carbon-based molecules, is known as:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Digestion",
      "B. Respiration",
      "C. Photosynthesis",
      "D. Excretion"
    ],
    "correct_answer": "B. Respiration",
    "explanation": "Respiration is the biological process where oxygen is used to oxidize food molecules (usually carbon-based) in order to release energy, with by-products that are removed by excretion.",
    "topic": "Respiration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen002"
  },
  {
    "question_text": "Why do multicellular organisms require a transportation system for nutrients and oxygen?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Because all cells are directly exposed to the environment",
      "B. To facilitate intercellular communication only",
      "C. Because not all cells are in direct contact with the environment",
      "D. To enhance reproduction"
    ],
    "correct_answer": "C. Because not all cells are in direct contact with the environment",
    "explanation": "In multicellular organisms, many cells are located internally and are not in direct contact with the environment. Therefore, a specialized transportation system is necessary to carry food, oxygen, and waste materials between cells and tissues.",
    "topic": "Multicellularity and Transport",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen003"
  },
  {
    "question_text": "Define 'life processes' as described in the section.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Life processes are the continuous maintenance functions carried out by living organisms to keep their structures intact and functioning even when the organism is not actively engaged in any specific activity.",
    "explanation": "The term 'life processes' encompasses all the essential mechanisms needed to prevent decay and to support the maintenance and growth of the organism, regardless of activity level.",
    "topic": "Life Processes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen004"
  },
  {
    "question_text": "Explain the role of nutrition in the life processes of an organism.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Nutrition is the process whereby organisms take in food from their external environment, break it down through chemical reactions, and convert it into energy and raw materials necessary for cell maintenance and growth.",
    "explanation": "Nutrition ensures that the cells receive essential carbon-based molecules and energy for sustaining life processes, as well as for building up the organism's structure during growth.",
    "topic": "Nutrition",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen005"
  },
  {
    "question_text": "Discuss how excretion is vital for maintaining cellular functions.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Excretion is crucial because it involves the removal of harmful waste by-products generated during chemical reactions, preventing their accumulation and potential damage to cells.",
    "explanation": "During processes like respiration, waste products are produced that could be harmful if not removed. A dedicated excretory system ensures these wastes are transported away and expelled, maintaining cellular homeostasis.",
    "topic": "Excretion",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen006"
  },
  {
    "question_text": "Why is a transportation system necessary in multicellular organisms, and how does it overcome the limitations of diffusion?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A transportation system is necessary because as the body size increases, not all cells are in direct contact with the environment. This system helps distribute food, oxygen, and remove waste efficiently, overcoming the slow and limited process of simple diffusion.",
    "explanation": "In multicellular organisms, internal cells cannot rely solely on diffusion due to distance limitations. A specialized transportation mechanism ensures all cells receive vital substances, thereby supporting efficient function and survival.",
    "topic": "Multicellular Organisms and Transport",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen007"
  },
  {
    "question_text": "Explain how respiration integrates chemical reactions to support life processes, including the use of oxygen and the generation of energy.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Respiration is a cellular process where oxygen is used to oxidize food molecules, such as glucose (C6H12O6). The chemical reaction, C6H12O6 + 6O2 → 6CO2 + 6H2O + energy, demonstrates how oxygen enables the breakdown of carbon-based molecules to produce energy. The energy released is used for cellular activities and maintenance, while carbon dioxide and water are expelled as waste.",
    "explanation": "In respiration, oxidizing-reducing reactions break down food molecules, releasing energy stored in chemical bonds. Oxygen acts as the final electron acceptor, making the process efficient. This energy fuels molecular movements necessary for maintaining life structures and functions, while by-products are managed through excretion.",
    "topic": "Respiration and Energy Conversion",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen008"
  },
  {
    "question_text": "Compare and contrast the mechanisms of nutrient uptake and waste removal in single-celled organisms versus multicellular organisms.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Single-celled organisms typically rely on direct diffusion across the cell membrane for nutrient uptake and waste removal because the entire surface is in direct contact with the environment. In contrast, multicellular organisms develop specialized tissues and organs that facilitate the uptake and transport of nutrients and oxygen to internal cells, as well as the efficient removal of wastes through dedicated excretory systems.",
    "explanation": "The simple diffusion method works for single-celled organisms due to their small size and high surface area-to-volume ratio. However, in larger, complex organisms, diffusion alone is insufficient; thus, specialized systems such as the circulatory and excretory systems evolved to overcome these limitations, ensuring that cells deep within the body receive adequate sustenance and that toxic by-products are effectively removed.",
    "topic": "Cellular Processes in Different Organism Types",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen009"
  },
  {
    "question_text": "Discuss the interdependence of the processes of nutrition, respiration, and excretion in maintaining homeostasis in organisms.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Nutrition, respiration, and excretion are interconnected processes that together ensure homeostasis. Nutrition brings in food and raw materials from the external environment, respiration converts these materials into usable energy while producing waste by-products, and excretion removes these wastes to maintain a stable internal environment. The failure of any one process can disrupt cellular functions and overall organismal homeostasis.",
    "explanation": "The processes work in tandem: nutrition supplies the necessary inputs, respiration extracts energy and creates waste, and excretion prevents the accumulation of harmful substances. This interconnected network is essential for the maintenance of life processes, enabling the organism to sustain growth, repair, and overall function.",
    "topic": "Homeostasis and Interdependent Life Processes",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen010"
  },
  {
    "question_text": "Life processes only occur when an organism is active and awake.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. Life processes occur continuously, even when the organism is at rest or asleep.",
    "explanation": "Even in states of inactivity, essential life processes such as nutrition, respiration, and excretion continue to function to maintain organismal homeostasis.",
    "topic": "Life Processes Continuity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen011"
  },
  {
    "question_text": "The process of nutrition involves only the absorption of food without any chemical reactions inside the body.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Nutrition involves both the absorption of food and a series of chemical reactions that break down food molecules into energy and raw materials.",
    "explanation": "Nutrition is not a passive process; it requires the conversion of complex carbon-based molecules into simpler forms through chemical reactions, which then provide energy and materials needed for growth and maintenance.",
    "topic": "Nutrition and Chemical Reactions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_x_jesc1dd_c105_gen012"
  }
]