[
  {
    "question_text": "Which of the following statements best describes a plant movement that is independent of growth?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. It occurs slowly due to cell division.",
      "B. It occurs rapidly through changes in cell water content.",
      "C. It requires specialized muscle tissues.",
      "D. It depends solely on electrical impulses."
    ],
    "correct_answer": "B. It occurs rapidly through changes in cell water content.",
    "explanation": "Immediate responses, like that of the sensitive plant (Mimosa pudica), occur quickly as the cells change their water content, resulting in a change in shape. This movement does not involve growth, unlike directional movements mediated by cell division and elongation.",
    "topic": "Immediate Response in Plants",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen015"
  },
  {
    "question_text": "What role does the plant hormone auxin play in phototropism?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It inhibits cell elongation on the shady side of the shoot.",
      "B. It stimulates cell elongation on the side away from light, causing the shoot to bend toward the light.",
      "C. It causes cell division exclusively at the root tip.",
      "D. It reduces water uptake in the plant cells."
    ],
    "correct_answer": "B. It stimulates cell elongation on the side away from light, causing the shoot to bend toward the light.",
    "explanation": "In phototropism, auxin accumulates on the shaded side of the shoot, stimulates the cells to elongate more on that side, and causes the shoot to bend towards the light source. This is essential for maximizing the plant's exposure to light for photosynthesis.",
    "topic": "Hormonal Regulation in Phototropism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen016"
  },
  {
    "question_text": "Which plant hormone is known for inhibiting growth and promoting responses such as leaf wilting?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Auxin",
      "B. Gibberellins",
      "C. Cytokinins",
      "D. Abscisic acid"
    ],
    "correct_answer": "D. Abscisic acid",
    "explanation": "Abscisic acid is a plant hormone that inhibits growth and can cause processes like leaf wilting. Its role is crucial in stress responses, aiding in the regulation of stomatal closure and other growth-suppressing effects.",
    "topic": "Plant Hormones and Growth Regulation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen017"
  },
  {
    "question_text": "In the bean seed experiment described, when the flask is turned so that shoots face away from the light, which of the following best explains the behavior of newly growing shoots?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. Auxin uniformly distributes along the shoot irrespective of light direction.",
      "B. Auxin accumulates on the side away from light, causing differential growth that eventually redirects the shoot toward the light.",
      "C. The entire shoot immediately reorients by adjusting the old growth.",
      "D. Electrical impulses signal the existing cells to move towards the light."
    ],
    "correct_answer": "B. Auxin accumulates on the side away from light, causing differential growth that eventually redirects the shoot toward the light.",
    "explanation": "When the flask is turned, only the new growth responds to the light by redistributing auxin unevenly. This differential growth leads to a bend, while the old growth remains unaffected, highlighting the role of auxin in phototropism.",
    "topic": "Phototropism and Hormonal Responses",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen018"
  },
  {
    "question_text": "Define phototropism and explain its significance for plants.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Phototropism is the directional growth of plant parts in response to light, where shoots typically grow toward the light and roots grow away from it.",
    "explanation": "Phototropism enables shoots to maximize light exposure, which is crucial for photosynthesis. This process helps plants efficiently capture light energy while roots follow geotropic cues for optimal water and nutrient uptake.",
    "topic": "Phototropism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen019"
  },
  {
    "question_text": "What is geotropism and how does it benefit a plant's overall growth?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Geotropism is the directional growth of plant parts in response to gravity. Shoots typically exhibit negative geotropism by growing upward, while roots exhibit positive geotropism by growing downward.",
    "explanation": "This movement ensures that shoots are positioned to capture sunlight effectively, maximizing photosynthesis, while roots grow downward to secure moisture and nutrients from the soil, thereby supporting the plant structurally and nutritionally.",
    "topic": "Geotropism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen020"
  },
  {
    "question_text": "Differentiate between immediate response to a stimulus and growth-mediated movement in plants.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Immediate responses, such as the quick leaf movement in Mimosa pudica, involve rapid changes in cell turgor without any cell growth. In contrast, growth-mediated movements, like phototropism, occur as a result of differential cell elongation over a longer period.",
    "explanation": "Immediate responses are characterized by a fast reaction due to changes in cell water content, while growth-mediated movements depend on differential cell growth and division. Both types of responses allow plants to adapt to environmental stimuli, but through fundamentally different cellular processes.",
    "topic": "Plant Movement Mechanisms",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen021"
  },
  {
    "question_text": "Explain the role of plant hormones in coordinating growth and response to environmental stimuli.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Plant hormones such as auxins, gibberellins, cytokinins, and abscisic acid play vital roles in coordinating plant growth and responses. Auxins promote cell elongation (key in phototropism), gibberellins assist in stem elongation, cytokinins encourage cell division in areas like fruits and seeds, and abscisic acid slows or inhibits growth, particularly under stress.",
    "explanation": "These hormones are synthesized in specific parts of the plant and then transported to target cells where they regulate growth, development, and response to environmental changes. Their coordinated action ensures that plant growth is both controlled and adaptable to external conditions.",
    "topic": "Plant Hormones",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen022"
  },
  {
    "question_text": "Discuss the physiological mechanisms underlying the immediate response to stimulus in plants, and compare these with the animal nervous system responses.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Plants lack specialized nervous and muscle tissues, yet they can respond swiftly to stimuli. In plants, the immediate response involves the transmission of signals via electrical-chemical means between cells, leading to rapid changes in cell turgor by altering water content. In contrast, animals utilize a nervous system with specialized neurons and muscles that use electrical impulses and chemical neurotransmitters to effect quick movements.",
    "explanation": "While animal responses rely on fast electrical impulses along nerves and subsequent muscle contraction, plants depend on changes in water pressure within cells to generate movement. Although slower than neuronal transmission, the plant’s method effectively coordinates rapid responses (like the folding of Mimosa pudica leaves) without specialized tissues. This comparison highlights the diversity of biological mechanisms evolved to ensure survival in different life forms.",
    "topic": "Immediate Plant Responses vs. Animal Nervous Systems",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen023"
  },
  {
    "question_text": "Analyze the bean seed experiment described in the activity. How does the experiment demonstrate phototropism and the role of hormones in directional growth?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In the bean seed experiment, seedlings placed in a conical flask within a cardboard box are exposed to light from one direction. The shoots bend towards the light due to the differential growth of cells. This occurs because auxin, a growth-promoting hormone synthesized at the shoot tip, accumulates on the shaded side of the shoot, stimulating cell elongation on that side. Conversely, roots grow downward—the response includes both avoidance of light and a positive response to gravity (geotropism).",
    "explanation": "This experiment demonstrates phototropism by showing that shoots reorient themselves towards the light, optimizing photosynthetic efficiency. The redistributive action of the hormone auxin is key to this process. The experiment also illustrates that only new growth responds to the change in light direction, as older parts remain unchanged. Such responses are critical for a plant's adaptation to its environment and illustrate the importance of hormonal regulation in directional growth.",
    "topic": "Phototropism and Hormonal Regulation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen024"
  },
  {
    "question_text": "True or False: The rapid leaf movement in Mimosa pudica is a result of cell growth and division triggered by a touch stimulus.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The rapid leaf movement in Mimosa pudica is due to changes in cell turgor (water content) and not because of cell growth or division. The cells swell or shrink quickly, allowing for a rapid response.",
    "topic": "Plant Movement Mechanisms",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen025"
  },
  {
    "question_text": "True or False: In phototropism, the entire plant, including already matured parts, adjusts its direction in response to light.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Only the newly growing parts of a plant respond to changes in light direction. Mature or older parts do not significantly change their orientation, which is why the redirection of growth occurs gradually in response to the light stimulus.",
    "topic": "Phototropism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen026"
  },
  {
    "question_text": "True or False: Auxin, which plays a critical role in phototropism, is synthesized in the root tips and moves upward to influence shoot growth.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Auxin is predominantly synthesized at the shoot tip rather than in the root tips. It diffuses toward the shaded side of the shoot to promote cell elongation, which is critical for phototropism.",
    "topic": "Plant Hormones and Phototropism",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "jesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_x_jesc1dd_c106_gen027"
  }
]