[
  {
    "question_text": "Explain on the basis of valence bond theory that [Ni(CN)4]2– ion with square planar structure is diamagnetic and the [NiCl4]2– ion with tetrahedral geometry is paramagnetic.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In [Ni(CN)4]2–, the strong field cyanide ligands force electron pairing and promote dsp2 hybridization, resulting in a square planar, low-spin, diamagnetic complex (no unpaired electrons). In contrast, [NiCl4]2– has weak field chloride ligands, uses sp3 hybridization to form a tetrahedral structure, and remains high-spin with two unpaired electrons, making it paramagnetic.",
    "explanation": "According to the valence bond theory section, square planar complexes like [Ni(CN)4]2– involve dsp2 hybridization; here, cyanide (a strong field ligand) produces a large ligand field splitting that forces the electrons in Ni2+ (d8 configuration) to pair, yielding a diamagnetic complex. Conversely, [NiCl4]2–, with weak field chloride ligands, undergoes sp3 hybridization without sufficient splitting to cause electron pairing, resulting in a high-spin tetrahedral complex having two unpaired electrons and displaying paramagnetism.",
    "topic": "Bonding in Coordination Compounds / Valence Bond Theory",
    "bloom_level": "Understand",
    "source": "intext",
    "chapter_id": "lech105",
    "intext_id": "09_intext_questions_ch105",
    "question_id": "cbse_xii_lech1dd_c105_in018"
  },
  {
    "question_text": "[NiCl4]2– is paramagnetic while [Ni(CO)4] is diamagnetic though both are tetrahedral. Why?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The difference arises because the oxidation state and ligand field strength differ. In [NiCl4]2–, nickel is in the +2 oxidation state (d8 configuration) and chloride is a weak field ligand that leads to a high-spin, tetrahedral complex with unpaired electrons. In [Ni(CO)4], nickel is in the zero oxidation state (d10 configuration) and carbonyl (CO) is a strong π-acceptor ligand that produces a fully paired d-shell, resulting in a diamagnetic complex.",
    "explanation": "The provided section explains that weak field ligands such as Cl– do not produce enough crystal field splitting to pair electrons, so [NiCl4]2– remains high-spin and paramagnetic. On the other hand, CO is a strong field ligand that stabilizes a low oxidation state (Ni0, d10) where all ten electrons are paired, even in a tetrahedral arrangement. This explains the distinct magnetic properties despite both complexes having tetrahedral geometry.",
    "topic": "Magnetic Properties / Crystal Field Theory",
    "bloom_level": "Understand",
    "source": "intext",
    "chapter_id": "lech105",
    "intext_id": "09_intext_questions_ch105",
    "question_id": "cbse_xii_lech1dd_c105_in019"
  },
  {
    "question_text": "[Fe(H2O)6]3+ is strongly paramagnetic whereas [Fe(CN)6]3– is weakly paramagnetic. Explain.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In [Fe(H2O)6]3+, water is a weak field ligand that produces a small crystal field splitting (Δo), resulting in a high-spin configuration (Fe3+, d5) with all five electrons unpaired, which makes it strongly paramagnetic. In contrast, in [Fe(CN)6]3–, cyanide is a strong field ligand that causes a larger splitting; this leads to a low-spin configuration with extensive pairing of electrons, yielding only one unpaired electron, thus rendering it weakly paramagnetic.",
    "explanation": "According to Crystal Field Theory, the magnitude of Δo depends on the ligand's field strength. Water, being a weak field ligand, does not force the pairing of electrons in the d orbitals of Fe3+ (d5 configuration), so all five electrons remain unpaired, resulting in strong paramagnetism. Conversely, cyanide is a strong field ligand and induces significant splitting, favoring electron pairing in the lower energy t2g orbitals, hence only a single electron remains unpaired and the complex is weakly paramagnetic.",
    "topic": "Magnetic Properties / Crystal Field Theory",
    "bloom_level": "Understand",
    "source": "intext",
    "chapter_id": "lech105",
    "intext_id": "09_intext_questions_ch105",
    "question_id": "cbse_xii_lech1dd_c105_in020"
  },
  {
    "question_text": "Explain [Co(NH3)6]3+ is an inner orbital complex whereas [Ni(NH3)6]2+ is an outer orbital complex.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "[Co(NH3)6]3+ is an inner orbital complex because Co3+ (d6) in a strong ligand field provided by NH3 leads to maximum pairing of electrons, allowing the complex to utilize the vacant inner 3d orbitals for dsp3 hybridization (low-spin configuration). In contrast, [Ni(NH3)6]2+ involves Ni2+ (d8) in a relatively weaker ligand field, which does not cause extensive pairing; hence, it uses the outer orbitals (4d) along with 4s and 4p orbitals for sp3d2 hybridization, forming a high-spin or outer orbital complex.",
    "explanation": "The key difference lies in the availability of low-energy 3d orbitals for hybridization. In [Co(NH3)6]3+, the strong field produced by NH3 ligands enables the pairing of electrons in the Co3+ ion so that two vacant 3d orbitals can participate in hybridization (d2sp3), characterizing it as an inner orbital complex. On the other hand, [Ni(NH3)6]2+ does not achieve significant pairing due to a less favorable ligand field, so hybridization involves the higher energy orbitals (sp3d2), making it an outer orbital complex.",
    "topic": "Hybridization in Coordination Compounds / Valence Bond Theory",
    "bloom_level": "Understand",
    "source": "intext",
    "chapter_id": "lech105",
    "intext_id": "09_intext_questions_ch105",
    "question_id": "cbse_xii_lech1dd_c105_in021"
  },
  {
    "question_text": "Predict the number of unpaired electrons in the square planar [Pt(CN)4]2– ion.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The square planar [Pt(CN)4]2– ion is expected to have 0 unpaired electrons.",
    "explanation": "In [Pt(CN)4]2–, platinum is in the +2 oxidation state (d8 configuration). Square planar complexes for d8 metal ions generally adopt a low-spin configuration utilizing dsp2 hybridization which causes all the d electrons to be paired. Consequently, the complex is diamagnetic with no unpaired electrons.",
    "topic": "Magnetic Properties / Coordination Compound Geometry",
    "bloom_level": "Apply",
    "source": "intext",
    "chapter_id": "lech105",
    "intext_id": "09_intext_questions_ch105",
    "question_id": "cbse_xii_lech1dd_c105_in022"
  },
  {
    "question_text": "The hexaquo manganese(II) ion contains five unpaired electrons, while the hexacyanoion contains only one unpaired electron. Explain using Crystal Field Theory.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For the hexaquo manganese(II) ion ([Mn(H2O)6]2+), water acts as a weak field ligand, resulting in a small splitting of the d orbitals. This leads to a high-spin configuration for Mn2+ (d5) with all five electrons remaining unpaired. In the hexacyano manganese(II) ion, cyanide is a strong field ligand that causes a large crystal field splitting; thus, for the same d5 configuration, electrons pair up in the lower energy t2g orbitals, resulting in a low-spin configuration with only one unpaired electron.",
    "explanation": "Crystal Field Theory explains magnetic behavior based on the splitting of d orbitals by the ligand's field strength. Water, as a weak field ligand, produces a small splitting (Δo), so electrons in Mn2+ (d5) occupy all five separate orbitals singly (high spin), leading to five unpaired electrons. Cyanide, being a strong field ligand, increases Δo enough to overcome the pairing energy, forcing electrons to pair in the lower energy t2g orbitals (low spin), leaving only one unpaired electron. This accounts for the observed differences in magnetic properties between the hexaaquo and hexacyano manganese complexes.",
    "topic": "Magnetic Properties / Crystal Field Theory",
    "bloom_level": "Understand",
    "source": "intext",
    "chapter_id": "lech105",
    "intext_id": "09_intext_questions_ch105",
    "question_id": "cbse_xii_lech1dd_c105_in023"
  }
]