[
  {
    "question_text": "Which of the following expressions best represents the general electronic configuration of the outer orbitals in d-block elements?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "(n-1)d^(1–10) ns^(1–2)",
      "nd^(1–10) (n+1)s^(1–2)",
      "(n-1)d^(0–9) ns^(1–2)",
      "nd^(1–10) ns^(0–1)"
    ],
    "correct_answer": "(n-1)d^(1–10) ns^(1–2)",
    "explanation": "The general formula given in the section is (n–1)d^(1–10) ns^(1–2), which indicates that the inner d orbitals may contain between 1 and 10 electrons and the outer s orbital may have 1 or 2 electrons.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen022"
  },
  {
    "question_text": "Palladium (Pd) is an exception to the general electronic configuration pattern of transition elements. What is its ground state configuration?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "4d^9 5s^1",
      "4d^10 5s^0",
      "4d^8 5s^2",
      "4d^10 5s^1"
    ],
    "correct_answer": "4d^10 5s^0",
    "explanation": "The textbook states that Pd has an electronic configuration of 4d^10 5s^0, which is an exception to the general (n–1)d ns configuration pattern.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen023"
  },
  {
    "question_text": "Chromium exhibits an abnormal electron configuration among transition elements. Which configuration correctly represents chromium?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "3d^4 4s^2",
      "3d^5 4s^1",
      "3d^3 4s^3",
      "3d^6 4s^0"
    ],
    "correct_answer": "3d^5 4s^1",
    "explanation": "Chromium adopts the configuration 3d^5 4s^1 instead of the expected 3d^4 4s^2 because a half-filled d subshell is more stable.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen024"
  },
  {
    "question_text": "Copper's electron configuration deviates from the expected pattern found in the 3d series. What is the electron configuration of copper?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "3d^9 4s^2",
      "3d^10 4s^1",
      "3d^8 4s^2",
      "3d^10 4s^2"
    ],
    "correct_answer": "3d^10 4s^1",
    "explanation": "Copper shows the configuration 3d^10 4s^1 instead of 3d^9 4s^2, which is due to the extra stability associated with a completely filled d orbital.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen025"
  },
  {
    "question_text": "What is the primary reason that half-filled or completely filled orbitals are more stable in transition elements?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Because of the large energy gap between s and d orbitals",
      "Because electron repulsion is minimized in these configurations",
      "Because the small energy difference between (n–1)d and ns orbitals favors symmetric electron distribution",
      "Because these configurations prevent any interaction with external fields"
    ],
    "correct_answer": "Because the small energy difference between (n–1)d and ns orbitals favors symmetric electron distribution",
    "explanation": "The section explains that due to the very little energy difference between the (n–1)d and ns orbitals, half-filled (or completely filled) sets benefit from extra stability, leading to the abnormal configurations observed in some transition elements.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen026"
  },
  {
    "question_text": "Explain briefly why zinc (Zn), despite being a d-block element, is not classified as a transition element.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Zinc is not classified as a transition element because its 3d orbitals are completely filled (3d^10) in both its ground state and common oxidation states.",
    "explanation": "A transition element is defined by having incompletely filled d orbitals in at least one oxidation state. Zinc, with a filled 3d orbital configuration, does not meet this criterion.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen027"
  },
  {
    "question_text": "How does the small energy difference between the (n–1)d and ns orbitals lead to exceptions in the expected electron configurations of some transition elements?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The small energy difference allows electrons to shift from the ns orbital to the (n–1)d orbital, leading to configurations that favor half-filled or fully filled d orbitals, which are more stable.",
    "explanation": "Because the energy gap is minimal, transferring an electron from ns to (n–1)d can result in a more stable electronic arrangement, explaining the exceptions observed in elements like Cr and Cu.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen028"
  },
  {
    "question_text": "What is the significance of the d orbitals protruding to the periphery of the atom in transition elements?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The protrusion of d orbitals increases their exposure to the surroundings, which affects the element's magnetic properties, catalytic behavior, and its ability to form complexes with various ligands.",
    "explanation": "Since the d orbitals extend further from the nucleus, they interact more strongly with external fields and other atoms or ligands, influencing properties such as color, magnetism, and catalytic activity.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen029"
  },
  {
    "question_text": "Discuss briefly why transition elements can exhibit a variety of oxidation states.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Transition elements can exhibit multiple oxidation states because their (n–1)d and ns orbitals are close in energy, which allows electrons to be lost or shared in varying numbers depending on the chemical environment.",
    "explanation": "The small energy difference between the ns and (n–1)d orbitals makes it energetically feasible for different numbers of electrons to be removed or involved in bonding, resulting in a range of possible oxidation states.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen030"
  },
  {
    "question_text": "Discuss the relationship between an element’s electron configuration, particularly its incompletely filled d orbitals, and its paramagnetic and catalytic properties.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Incompletely filled d orbitals in transition elements provide unpaired electrons, which are responsible for paramagnetism. Additionally, these vacant or partially occupied orbitals can overlap with orbitals of other atoms or molecules, facilitating electron transfer and lowering activation energies, which contributes to the catalytic properties of these elements.",
    "explanation": "Paramagnetism arises from unpaired electrons in the d orbitals. The ability of these elements to easily change oxidation states and form temporary bonds with reactants makes them effective catalysts. This relationship between electron configuration and chemical behavior is fundamental in understanding the properties of transition metals.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen031"
  },
  {
    "question_text": "Compare and contrast the electron configurations of chromium and copper. Explain how these configurations influence their chemical behavior.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Chromium has the configuration 3d^5 4s^1 and copper has 3d^10 4s^1. The half-filled d subshell in chromium provides extra stability and affects its reactivity, while copper's fully filled d subshell (despite an unusual distribution) contributes to its distinct chemical properties, such as its tendency to form certain complexes and its unique redox behavior.",
    "explanation": "In chromium, the half-filled d orbital configuration provides additional stability and plays a role in its chemical reactivity. Copper, on the other hand, while also having one electron in the s orbital, has a completely filled d orbital which influences its typical catalytic and conductive properties. This difference in electron configuration is key to understanding their differing behavior in chemical reactions.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen032"
  },
  {
    "question_text": "Propose how the increased stability of half-filled and completely filled orbitals can be exploited in the design of new catalysts based on transition metals.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "By selecting transition metals that can achieve half-filled or fully filled d orbital configurations in their active states, catalyst designers can harness the inherent stability and unique electronic properties of these states. This could lead to catalysts with enhanced selectivity and lower activation energies for specific reactions.",
    "explanation": "The inherent stability of half-filled or completely filled d orbitals often results in lower energy intermediates and improved reactivity. By tuning reactions to operate at conditions where the metal catalyst adopts these stable configurations, chemists can design catalysts that are both robust and highly effective in their role.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen033"
  },
  {
    "question_text": "True or False: The electronic configuration of palladium (Pd) in its ground state is an exception to the general configuration rule for transition elements.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The textbook clearly states that Pd has an electronic configuration of 4d^10 5s^0, making it an exception to the typical (n–1)d^(1–10) ns^(1–2) configuration for transition elements.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen034"
  },
  {
    "question_text": "True or False: Zinc (Zn) is classified as a transition element because it forms coloured complexes in solution.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Zinc is not considered a transition element despite sometimes forming coloured compounds because its 3d orbitals are completely filled in all oxidation states, which is a key criterion for transition elements.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen035"
  },
  {
    "question_text": "True or False: The protrusion of the d orbitals to the periphery of the atom significantly influences the chemical properties and reactivity of transition metals.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "Because the d orbitals extend further from the nucleus, they are more affected by the surrounding environment. This influences the element’s magnetic properties, its ability to form complexes, and its catalytic behavior.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen036"
  },
  {
    "question_text": "Using Table 4.1, determine the total number of electrons in the outer orbitals (d and s electrons combined) for vanadium (V, Z = 23).",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "5 electrons",
    "explanation": "According to Table 4.1, vanadium has the configuration 3d^3 and 4s^2. Adding these gives 3 + 2 = 5 electrons in the outer orbitals.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen037"
  },
  {
    "question_text": "For rhodium (Rh, Z = 45) as listed in Table 4.1, calculate the total number of electrons in its outer orbitals.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "9 electrons",
    "explanation": "Table 4.1 shows that rhodium has 5s^1 and 4d^8 electrons. Therefore, the total number in the outer orbitals is 1 + 8 = 9 electrons.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen038"
  },
  {
    "question_text": "Using the information from Table 4.1, determine the total number of electrons in the outer orbitals (s and d) for gold (Au, Z = 79).",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "11 electrons",
    "explanation": "From Table 4.1, gold has 6s^1 and 5d^10 electrons. Therefore, the total is 1 + 10 = 11 electrons in the outer orbitals.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen039"
  },
  {
    "question_text": "Using the data provided, calculate the total number of electrons in the outer orbitals for niobium (Nb, Z = 41). Provide your answer with the appropriate units.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "5 electrons",
    "explanation": "According to Table 4.1, niobium has 5s^1 and 4d^4, which sums up to 1 + 4 = 5 electrons. The answer is 5 electrons.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen040"
  },
  {
    "question_text": "Consider silver (Ag, Z = 47), which has 5s^1 and 4d^10 electrons according to Table 4.1. Calculate the total number of electrons in the outer orbitals and explain how this configuration supports its classification as a transition element even though the d orbital is completely filled in the ground state.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "11 electrons; silver is considered a transition element because despite its filled 4d orbital, it still exhibits characteristic transition properties such as complex formation and catalytic behavior due to the involvement of d electrons in bonding.",
    "explanation": "From Table 4.1, silver has 5s^1 plus 4d^10 giving a total of 11 electrons in the outer orbitals. Although the d orbital is filled in its ground state, Ag is classified as a transition element because many of its chemical properties, like forming coloured complexes and catalytic behavior, arise from the involvement of d electrons during chemical reactions.",
    "topic": "Electronic Configurations of d-Block Elements",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lech104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lech1dd_c104_gen041"
  }
]