[
  {
    "question_text": "What is the major source of metals on Earth?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Seawater",
      "Earth’s crust",
      "Atmosphere",
      "Biological organisms"
    ],
    "correct_answer": "Earth’s crust",
    "explanation": "The earth’s crust is the major source of metals. While seawater does contain some soluble salts like sodium chloride and magnesium chloride, the majority of metals are extracted from minerals found in the earth's crust.",
    "topic": "Occurrence of Metals",
    "bloom_level": "Remember"
  },
  {
    "question_text": "Define an ore in the context of metal extraction.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An ore is a mineral that contains a high percentage of a particular metal, allowing the metal to be profitably extracted from it.",
    "explanation": "Ores are minerals that are rich in a specific metal, making it economically feasible to extract the metal from the ore. They contain sufficient metal content to justify the extraction process.",
    "topic": "Occurrence of Metals",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Which of the following metals is typically found in the free state in nature?\n\nA) Sodium\n\nB) Magnesium\n\nC) Gold\n\nD) Aluminum",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Sodium",
      "B) Magnesium",
      "C) Gold",
      "D) Aluminum"
    ],
    "correct_answer": "C) Gold",
    "explanation": "Gold is one of the metals that is found in the free state in nature because it is very unreactive. Sodium, magnesium, and aluminum are highly reactive and are not found in the free state naturally.",
    "topic": "Extraction of Metals",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Explain the process of roasting with an example reaction involving zinc sulfide.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Roasting is the process of heating sulfide ores in the presence of excess air to convert them into metal oxides. For example, roasting zinc sulfide (ZnS) can be represented by the following reaction:\n\n2ZnS(s) + 3O₂(g) → 2ZnO(s) + 2SO₂(g)",
    "explanation": "Roasting involves heating the sulfide ore with excess oxygen. In the case of zinc sulfide, the reaction with oxygen produces zinc oxide and sulfur dioxide gas. This conversion to the oxide form is necessary before the reduction step to obtain pure zinc metal.",
    "topic": "Extracting Metals in the Middle of the Activity Series",
    "bloom_level": "Apply"
  },
  {
    "question_text": "During the extraction of mercury from cinnabar (HgS), identify the oxidizing and reducing agents in the first reaction:\n\n2HgS(s) + 3O₂(g) → 2HgO(s) + 2SO₂(g)",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Oxidizing agent: O₂(g);\nReducing agent: HgS(s)",
    "explanation": "In the reaction, oxygen (O₂) is the oxidizing agent as it gains electrons and gets reduced to SO₂. Mercury sulfide (HgS) acts as the reducing agent because it loses sulfur, getting oxidized to HgO.",
    "topic": "Extracting Metals Low in the Activity Series",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "Match the following metals with their appropriate extraction methods based on their reactivity series position.\n\n1. Sodium\n\n2. Iron\n\n3. Copper\n\n4. Aluminum\n\nMethods:\n\nA) Electrolytic reduction\n\nB) Reduction with carbon\n\nC) Heating in air\n\nD) Heating alone",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "1-A, 2-B, 3-C, 4-A",
      "1-B, 2-A, 3-D, 4-C",
      "1-A, 2-B, 3-D, 4-A",
      "1-C, 2-D, 3-B, 4-A"
    ],
    "correct_answer": "1-A, 2-B, 3-D, 4-A",
    "explanation": "Sodium, being high in the activity series, is obtained by electrolytic reduction (A). Iron, moderately reactive, is reduced using carbon (B). Copper, low in the activity series, can be obtained by heating alone (D). Aluminum, also high in the activity series, is obtained by electrolytic reduction (A).",
    "topic": "Extraction of Metals",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Calculate the amount of oxygen (in moles) required to completely roast 4 moles of zinc sulfide (ZnS). Use the roasting reaction:\n\n2ZnS(s) + 3O₂(g) → 2ZnO(s) + 2SO₂(g)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "3 moles of O₂ are required to roast 2 moles of ZnS. Therefore, for 4 moles of ZnS:\n\n(3 moles O₂ / 2 moles ZnS) × 4 moles ZnS = 6 moles O₂",
    "explanation": "From the balanced equation, 2 moles of ZnS require 3 moles of O₂. Using the molar ratio, 4 moles of ZnS would require (3/2) × 4 = 6 moles of O₂.",
    "topic": "Extracting Metals in the Middle of the Activity Series",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Differentiate between roasting and calcination with suitable examples.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Roasting is the process of heating sulfide ores in the presence of excess air to convert them into oxides. For example, roasting zinc sulfide (ZnS) converts it to zinc oxide (ZnO) and sulfur dioxide (SO₂).\n\nCalcination is the process of heating carbonate ores in limited air to decompose them into oxides and carbon dioxide. For example, calcination of zinc carbonate (ZnCO₃) yields zinc oxide (ZnO) and carbon dioxide (CO₂).",
    "explanation": "Roasting is used for sulfide ores and involves excess oxygen, while calcination is used for carbonate ores with limited oxygen. Both processes convert the ore to its oxide form, which is easier to reduce to the pure metal.",
    "topic": "Extracting Metals in the Middle of the Activity Series",
    "bloom_level": "Understand"
  },
  {
    "question_text": "In the thermit reaction:\n\nFe₂O₃(s) + 2Al(s) → 2Fe(l) + Al₂O₃(s) + Heat,\n\nwhich substance is oxidized and which is reduced?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Aluminum (Al) is oxidized, and iron(III) oxide (Fe₂O₃) is reduced.",
    "explanation": "Aluminum loses electrons (is oxidized) to form Al₂O₃, while iron in Fe₂O₃ gains electrons (is reduced) to form Fe(l).",
    "topic": "Extracting Metals in the Middle of the Activity Series",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "Describe the electrolytic refining process of copper and explain how impurities are removed.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Electrolytic refining of copper involves using an impure copper anode and a pure copper cathode in an electrolyte solution of copper sulfate (CuSO₄). When electric current is passed through the cell, pure copper from the anode dissolves into the electrolyte and is deposited onto the cathode. Impurities that are less reactive than copper remain in the electrolyte solution or settle as anode mud. This process results in the deposition of pure copper on the cathode.",
    "explanation": "In electrolytic refining, the impure metal serves as the anode and a pure metal strip as the cathode. The electrolyte facilitates the transfer of copper ions from the anode to the cathode, ensuring that only pure copper is deposited. Impurities either remain dissolved in the electrolyte or form insoluble residues, thus purifying the copper.",
    "topic": "Refining of Metals",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Which of the following reactions represents the reduction of zinc oxide using carbon?\n\nA) ZnO(s) + C(s) → Zn(s) + CO(g)\n\nB) ZnO(s) + C(s) → ZnC(s) + O₂(g)\n\nC) ZnO(s) + C(s) → ZnCO₃(s)\n\nD) ZnO(s) + 2C(s) → Zn(s) + 2CO(g)",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) ZnO(s) + C(s) → Zn(s) + CO(g)",
      "B) ZnO(s) + C(s) → ZnC(s) + O₂(g)",
      "C) ZnO(s) + C(s) → ZnCO₃(s)",
      "D) ZnO(s) + 2C(s) → Zn(s) + 2CO(g)"
    ],
    "correct_answer": "D) ZnO(s) + 2C(s) → Zn(s) + 2CO(g)",
    "explanation": "The correct reduction of zinc oxide with carbon requires two moles of carbon to fully reduce one mole of ZnO to zinc metal and produce two moles of carbon monoxide. Option A is incorrect because it only uses one mole of carbon.",
    "topic": "Extracting Metals in the Middle of the Activity Series",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Why are metals like sodium, magnesium, and aluminum obtained by electrolytic reduction rather than by reduction with carbon?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Because these metals are highly reactive and have a greater affinity for oxygen than carbon, making it impossible for carbon to reduce their oxides.",
    "explanation": "Metals such as sodium, magnesium, and aluminum are high in the activity series and are more reactive than carbon. Their oxides cannot be reduced by carbon, so electrolytic reduction is used instead.",
    "topic": "Extracting Metals towards the Top of the Activity Series",
    "bloom_level": "Understand"
  }
]