[
  {
    "question_text": "Why is sodium kept immersed in kerosene oil?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sodium is kept immersed in kerosene oil to prevent it from reacting violently with oxygen and moisture in the air. Kerosene acts as a protective barrier, inhibiting sodium's exposure to oxygen and water vapor, thereby preventing oxidation and potential fires or explosions.",
    "explanation": "Sodium is highly reactive, especially with oxygen and water. When exposed to air, it can react to form sodium oxide or hydroxide, releasing heat and sometimes igniting. Immersing sodium in kerosene oil reduces its exposure to these elements by creating a protective layer around the metal. Kerosene is a non-polar solvent that does not react with sodium, providing a stable environment and ensuring safe storage. This practice is essential to manage the reactivity of sodium and prevent hazardous incidents.",
    "topic": "Reactivity of metals with oxygen and moisture",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Write equations for the reactions of:\n\n1. Iron with steam\n2. Calcium and potassium with water",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1. Reaction of Iron with Steam:\n3Fe(s) + 4H₂O(g) → Fe₃O₄(s) + 4H₂(g)\n\n2. Reaction of Calcium with Water:\nCa(s) + 2H₂O(l) → Ca(OH)₂(aq) + H₂(g)\n\nReaction of Potassium with Water:\n2K(s) + 2H₂O(l) → 2KOH(aq) + H₂(g)",
    "explanation": "1. **Iron with Steam:** Iron reacts with steam (water in the gaseous state) at high temperatures to form iron(II,III) oxide (Fe₃O₄) and hydrogen gas (H₂).\n\n3Fe(s) + 4H₂O(g) → Fe₃O₄(s) + 4H₂(g)\n\n2. **Calcium with Water:** Calcium reacts with water at room temperature to form calcium hydroxide (Ca(OH)₂) and hydrogen gas.\n\nCa(s) + 2H₂O(l) → Ca(OH)₂(aq) + H₂(g)\n\n3. **Potassium with Water:** Potassium reacts very vigorously with water, forming potassium hydroxide (KOH) and hydrogen gas. Due to its high reactivity, the hydrogen produced may ignite.\n\n2K(s) + 2H₂O(l) → 2KOH(aq) + H₂(g)",
    "topic": "Reactivity of metals with water and steam",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Samples of four metals A, B, C, and D were taken and added to the following solutions one by one. The results obtained have been tabulated as follows:\n\n| Metal | Iron(II) sulphate | Copper(II) sulphate | Zinc sulphate | Silver nitrate |\n|-------|-------------------|---------------------|---------------|----------------|\n| A     | No reaction       | Displacement        |               |                |\n| B     | Displacement      | No reaction         |               |                |\n| C     | No reaction       | No reaction         | No reaction   | Displacement   |\n| D     | No reaction       | No reaction         | No reaction   | No reaction    |\n\nUse the table above to answer the following questions about metals A, B, C, and D.\n\n1. Which is the most reactive metal?\n2. What would you observe if B is added to a solution of Copper(II) sulphate?\n3. Arrange the metals A, B, C, and D in the order of decreasing reactivity.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "1. **Most Reactive Metal:**\nThe most reactive metal can be determined by observing which metal causes the most displacement reactions. Metal C displaces silver from silver nitrate, indicating a higher reactivity than metals A and B, which only displace some metals. Therefore, Metal C is the most reactive among the four.\n\n2. **Observation when B is added to Copper(II) sulphate:**\nAccording to the table, Metal B shows no reaction with Copper(II) sulphate. This implies that Metal B is less reactive than Copper in the reactivity series, and hence, it cannot displace Copper from its sulphate solution. Therefore, no visible reaction (such as precipitation or formation of a different metal) would be observed.\n\n3. **Order of Decreasing Reactivity:**\nBased on the displacement reactions:\n\n- **Metal C:** Displaces Silver nitrate (highest reactivity among the reactions).\n- **Metal A:** Displaces Copper(II) sulphate.\n- **Metal B:** Displaces Iron(II) sulphate.\n- **Metal D:** No reactions observed, indicating lowest reactivity.\n\nThus, the order is:\n\n**Metal C > Metal A > Metal B > Metal D**",
    "explanation": "1. **Determining the Most Reactive Metal:**\n   - Metal C can displace Silver from Silver nitrate, which indicates that it has a higher reactivity than the others because Silver is lower in the reactivity series.\n   - Metal A can displace Copper from Copper(II) sulphate, showing it is more reactive than Copper and less reactive than Metal C.\n   - Metal B can displace Iron from Iron(II) sulphate, indicating it is less reactive than Copper.\n   - Metal D shows no displacement reactions, suggesting it is the least reactive.\n\n2. **Reaction of Metal B with Copper(II) sulphate:**\n   - Since Metal B does not react with Copper(II) sulphate, it means Metal B cannot displace Copper from its sulphate solution. This is because Metal B is less reactive than Copper.\n\n3. **Arranging Metals in Order of Reactivity:**\n   - The ability to displace another metal from its solution indicates higher reactivity.\n   - Metal C displaces the most valuable metal (Silver), followed by Metal A (Copper), then Metal B (Iron), and finally Metal D, which does not displace any of the metals tested.",
    "topic": "Reactivity series and displacement reactions",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "Which gas is produced when dilute hydrochloric acid is added to a reactive metal? Write the chemical reaction when iron reacts with dilute H₂SO₄.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When dilute hydrochloric acid is added to a reactive metal, hydrogen gas (H₂) is produced.\n\n**Chemical reaction of Iron with dilute H₂SO₄:**\nFe(s) + H₂SO₄(aq) → FeSO₄(aq) + H₂(g)",
    "explanation": "1. **Gas Produced:**\nReactive metals react with dilute hydrochloric acid (HCl) to produce hydrogen gas (H₂) and a metal chloride. The general reaction is:\n\nMetal + HCl → Metal chloride + H₂(g)\n\nHere, the gas evolved is hydrogen (H₂).\n\n2. **Reaction of Iron with Dilute H₂SO₄:**\nIron reacts with dilute sulfuric acid (H₂SO₄) to produce iron(II) sulphate (FeSO₄) and hydrogen gas (H₂).\n\nFe(s) + H₂SO₄(aq) → FeSO₄(aq) + H₂(g)\n\nThis reaction is similar to that with hydrochloric acid, where the metal reacts with the acid to produce a salt and hydrogen gas.",
    "topic": "Reactivity of metals with acids",
    "bloom_level": "Apply"
  },
  {
    "question_text": "What would you observe when zinc is added to a solution of iron(II) sulphate? Write the chemical reaction that takes place.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "**Observation:**\nWhen zinc metal is added to a solution of iron(II) sulphate, zinc displaces iron from the solution. This results in the formation of zinc sulphate, and elemental iron may precipitate if formed in metallic form. Additionally, there is an evolution of hydrogen gas bubbles if the reaction proceeds with acidity present.\n\n**Chemical Reaction:**\nZn(s) + FeSO₄(aq) → ZnSO₄(aq) + Fe(s)",
    "explanation": "1. **Observation:**\nZinc is more reactive than iron according to the reactivity series. When zinc is placed in an iron(II) sulphate (FeSO₄) solution, zinc displaces iron from the solution because it is more reactive. As a result, zinc sulphate (ZnSO₄) is formed in solution, and elemental iron precipitates out. If the solution is acidic, hydrogen gas may also be evolved, observable as bubbles.\n\n2. **Chemical Reaction:**\nThe displacement reaction can be represented by the following balanced chemical equation:\n\nZn(s) + FeSO₄(aq) → ZnSO₄(aq) + Fe(s)\n\nIn this reaction, zinc (Zn) replaces iron (Fe) in iron(II) sulphate, forming zinc sulphate and elemental iron.",
    "topic": "Displacement reactions and reactivity series",
    "bloom_level": "Apply"
  }
]