[
  {
    "question_text": "A survey conducted by an organisation for the cause of illness and death among the women between the ages 15 - 44 (in years) worldwide found the following figures (in %):\n\n S.No.   Causes        Female fatality rate (%)\n 1.   Reproductive health conditions – 31.8\n 2.   Neuropsychiatric conditions – 25.4\n 3.   Injuries – 12.4\n 4.   Cardiovascular conditions – 4.3\n 5.   Respiratory conditions – 4.1\n 6.   Other causes – 22.0\n\n(i) Represent the information given above graphically. (Bar graph recommended)\n(ii) Which condition is the major cause of women’s ill health and death worldwide?\n(iii) Try to find out, with the help of your teacher, any two factors which play a major role in the cause in (ii) above being the major cause.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) A bar graph with the causes on the x-axis and the female fatality rate on the y-axis. Each bar’s height is proportional to the percentage given (e.g., the bar for Reproductive health conditions reaches a height of 31.8 units).\n(ii) Reproductive health conditions (31.8%) is the major cause.\n(iii) Two possible factors could be inadequate access to reproductive health services and socio-economic conditions affecting women’s health.",
    "explanation": "Step 1: Plot the causes on the x-axis and the corresponding fatality rates on the y-axis. Use uniform spacing for the bars. \nStep 2: The bar that reaches the highest value will show the major cause; here it is Reproductive health conditions at 31.8%.\nStep 3: Discuss with your teacher potential external factors such as poor health infrastructure, cultural practices, or lack of education which can contribute to higher fatality rates in reproductive health conditions.",
    "topic": "Graphical Representation of Data – Bar Graphs",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex001"
  },
  {
    "question_text": "The following data on the number of girls (to the nearest ten) per thousand boys in different sections of Indian society is given below:\n\n Section      Number of girls per thousand boys\n Scheduled Caste (SC)   940\n Scheduled Tribe (ST)   970\n Non SC/ST      920\n Backward districts   950\n Non-backward districts  920\n Rural        930\n Urban        910\n\n(i) Represent the information above by a bar graph.\n(ii) In the classroom discuss what conclusions can be arrived at from the graph.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) A bar graph should be drawn with the different sections on the horizontal axis and the number of girls per thousand boys on the vertical axis. Each section is represented by a bar with height corresponding to the given value.\n(ii) Observations might include that Scheduled Tribes (ST) show the highest ratio (970), while Urban areas show the lowest (910), with some sections having similar ratios indicating disparities in gender distribution across different social and geographical groups.",
    "explanation": "Step 1: Label the x-axis with the names of the sections and the y-axis with the values (number of girls per thousand boys). Plot each bar using the numerical values provided.\nStep 2: Once the graph is plotted, analyze and compare the heights of the bars to discuss differences. For example, the highest bar (ST at 970) suggests a relatively better girl-to-boy ratio compared to others, while Urban areas have the lowest ratio (910).\nStep 3: Discuss potential social, economic, or cultural reasons for these differences in a classroom setting.",
    "topic": "Graphical Representation of Data – Bar Graphs",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex002"
  },
  {
    "question_text": "Given below are the seats won by different political parties in the polling outcome of a state assembly election:\n\n Political Party   A   B   C   D   E   F\n Seats Won     75  55  37  29  10  37\n\n(i) Draw a bar graph to represent the polling results.\n(ii) Which political party won the maximum number of seats?",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) A bar graph should be drawn with the political parties on the x-axis (A, B, C, D, E, F) and the corresponding seats won on the y-axis. Each bar’s height corresponds to the number of seats (e.g., Party A reaches 75).\n(ii) Party A won the maximum number of seats (75).",
    "explanation": "Step 1: Draw the x-axis and mark the parties A through F. The y-axis should be scaled to at least 75 since that is the highest value.\nStep 2: For each party, draw a bar with height equal to the number of seats won. \nStep 3: Identify the bar with the maximum height. In this case, Party A's bar is the tallest with 75 seats.",
    "topic": "Graphical Representation of Data – Bar Graphs",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex003"
  },
  {
    "question_text": "The length of 40 leaves of a plant are measured correct to one millimetre, and the obtained data is represented in the following table:\n\n Length (in mm)   Number of leaves\n 118 - 126      3\n 127 - 135      5\n 136 - 144      9\n 145 - 153      12\n 154 - 162      5\n 163 - 171      4\n 172 - 180      2\n\n(i) Draw a histogram to represent the given data. [Hint: First make the class intervals continuous (e.g., 117.5–126.5, 126.5–135.5, etc.)]\n(ii) Is there any other suitable graphical representation for the same data? (Frequency Polygon)\n(iii) Is it correct to conclude that the maximum number of leaves are 153 mm long? Why?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Construct a histogram by first adjusting the class intervals to be continuous: 117.5–126.5, 126.5–135.5, 135.5–144.5, 144.5–153.5, 153.5–162.5, 162.5–171.5, 171.5–180.5. Plot these on the horizontal axis (length in mm) and the frequency (number of leaves) on the vertical axis. Draw adjacent bars with heights corresponding to the frequencies (3, 5, 9, 12, 5, 4, 2).\n(ii) A frequency polygon can also be drawn by plotting the midpoints of each class (calculated from the continuous intervals) against the respective frequencies and joining the points by straight lines.\n(iii) No, it is not correct. The value 153 mm is the upper limit of the class interval (144.5–153.5) that has the highest frequency. It does not mean that the maximum number of individual leaves measured exactly 153 mm; rather, most leaves fall into that interval.",
    "explanation": "Step 1: Adjust class intervals to make them continuous (subtract 0.5 from the lower limit and add 0.5 to the upper limit). \nStep 2: Draw the histogram with these new intervals on the x-axis and frequencies on the y-axis. \nStep 3: For a frequency polygon, compute the class midpoints and plot them with frequencies, then join the dots with straight lines.\nStep 4: Understand that the class interval’s upper boundary does not represent an individual measurement but a range that contains the maximum frequency.",
    "topic": "Graphical Representation of Data – Histogram and Frequency Polygon",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex004"
  },
  {
    "question_text": "The following table gives the life times of 400 neon lamps:\n\n Life time (in hours)   Number of lamps\n 300 - 400        14\n 400 - 500        56\n 500 - 600        60\n 600 - 700        86\n 700 - 800        74\n 800 - 900        62\n 900 - 1000       48\n\n(i) Represent the given information with the help of a histogram.\n(ii) How many lamps have a life time of more than 700 hours?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Draw a histogram with life time intervals on the x-axis and frequency (number of lamps) on the y-axis. Each bar represents the number of lamps in that 100-hour interval.\n(ii) Add the frequencies for the intervals 700 - 800, 800 - 900, and 900 - 1000: 74 + 62 + 48 = 184 lamps.",
    "explanation": "Step 1: Plot the continuous intervals for the life times along the x-axis. Ensure the bars are adjacent since these intervals are continuous.\nStep 2: The height of each bar reflects the number of lamps in that interval. \nStep 3: To answer (ii), sum the frequencies for all intervals above 700 hours: 74 (700–800) + 62 (800–900) + 48 (900–1000) = 184.\nStep 4: Label the axes appropriately for a clear histogram.",
    "topic": "Graphical Representation of Data – Histogram",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex005"
  },
  {
    "question_text": "The following table gives the distribution of students of two sections according to the marks obtained by them:\n\n Section A              Section B\n Marks  Frequency     Marks  Frequency\n 0 - 10   3         0 - 10   5\n 10 - 20   9        10 - 20   19\n 20 - 30  17        20 - 30   15\n 30 - 40  12        30 - 40   10\n 40 - 50   9        40 - 50   1\n\nRepresent the marks of the students of both sections on the same graph by two frequency polygons. From the two polygons compare the performance of the two sections.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Plot a common graph with the marks (use class midpoints if necessary) on the x-axis and the frequency on the y-axis. For Section A, plot the points corresponding to each class interval and join them to form a frequency polygon. Similarly, plot and join the points for Section B using a distinct color or line style. A comparison of the shapes and peak frequencies of the two polygons will indicate the performance differences between the sections. For instance, a higher frequency in lower mark intervals for one section might suggest weaker performance compared to the other.",
    "explanation": "Step 1: Convert the class intervals into class midpoints (e.g., for 0–10, midpoint = 5; for 10–20, midpoint = 15; etc.).\nStep 2: Plot the midpoints vs. frequencies for Section A and Section B on the same set of axes.\nStep 3: Connect the plotted points for each section with lines to form frequency polygons. Use different colors or line types to distinguish between the two sections.\nStep 4: Compare the two polygons by examining their peaks, spreads, and overall shape to deduce which section performed better overall.",
    "topic": "Graphical Representation of Data – Frequency Polygon",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex006"
  },
  {
    "question_text": "The runs scored by two teams A and B on the first 60 balls in a cricket match are given below:\n\n Number of balls   Team A   Team B\n 1 - 6        2     5\n 7 - 12       1     6\n 13 - 18       8     2\n 19 - 24       9     10\n 25 - 30       4     5\n 31 - 36       5     6\n 37 - 42       6     3\n 43 - 48       10     4\n 49 - 54       6     8\n 55 - 60       2     10\n\nRepresent the data of both teams on the same graph by frequency polygons. [Hint: First make the class intervals continuous, e.g., 0.5–6.5, 6.5–12.5, etc.]",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "First, adjust the class intervals to be continuous (e.g., 0.5–6.5 for 1–6, 6.5–12.5 for 7–12, etc.). Then, for each interval, determine the midpoint (for instance, (0.5+6.5)/2 = 3.5, etc.). Plot the midpoints on the x-axis and the corresponding runs (frequency values) on the y-axis for each team. Draw a frequency polygon for Team A and another for Team B on the same graph, using distinct markers or colors. This combined graph facilitates a visual comparison of the scoring patterns of the two teams.",
    "explanation": "Step 1: Adjust each class interval so that they are continuous. For example, for the interval 1–6, use 0.5–6.5 and calculate the midpoint as 3.5.\nStep 2: Repeat for all intervals.\nStep 3: On the same axes, plot the midpoints versus the runs for both Team A and Team B using different symbols or colors.\nStep 4: Connect the points of each team with lines to form their respective frequency polygons.\nStep 5: Analyze differences in the shapes of these polygons to compare performance across the intervals.",
    "topic": "Graphical Representation of Data – Frequency Polygon",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex007"
  },
  {
    "question_text": "A random survey of the number of children of various age groups playing in a park was found as follows:\n\n Age (in years)   Number of children\n 1 - 2       5\n 2 - 3       3\n 3 - 5       6\n 5 - 7       12\n 7 - 10       9\n 10 - 15      10\n 15 - 17      4\n\nDraw a histogram to represent the data above. (Note: Varying class widths require adjusted frequencies).",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Create a histogram where the horizontal axis represents the age groups and the vertical axis represents the number of children. Since the age intervals have varying widths, compute the adjusted frequency (density) for each interval using the formula: Adjusted Frequency = (Frequency / Class Width). For example, for the age group 1–2 (width = 1 year), adjusted frequency = 5/1 = 5. Do this for every age group, then plot bars with the width corresponding to the age range and height equal to the adjusted frequency. This ensures the area of each bar is proportional to the frequency.",
    "explanation": "Step 1: Note the class widths: For instance, 1–2 is 1 year wide, 2–3 is 1 year wide, 3–5 is 2 years, 5–7 is 2 years, 7–10 is 3 years, 10–15 is 5 years, and 15–17 is 2 years.\nStep 2: Calculate adjusted frequency for each class by dividing the frequency by the class width.\nStep 3: Draw the histogram using the original class intervals along the x-axis and adjusted frequencies on the y-axis; bars will have different widths but the area (width × height) represents the true frequency.\nStep 4: Label axes, ensuring that the graph accurately represents the distribution despite the unequal class widths.",
    "topic": "Graphical Representation of Data – Histogram with Varying Class Widths",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex008"
  },
  {
    "question_text": "100 surnames were randomly picked up from a local telephone directory and a frequency distribution of the number of letters in the surnames was found as follows:\n\n Number of letters   Number of surnames\n 1 - 4        6\n 4 - 6        30\n 6 - 8        44\n 8 - 12       16\n 12 - 20       4\n\n(i) Draw a histogram to depict the given information. (Note: Varying class widths require adjusted frequencies).\n(ii) Write the class interval in which the maximum number of surnames lie.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Draw a histogram where the x-axis represents the number of letters in the surnames and the y-axis represents the number of surnames. Since the class widths are not equal, compute the adjusted frequency for each interval using: Adjusted Frequency = (Frequency / Class Width). For instance, for 1–4 (width = 3), the adjusted frequency is 6/3 = 2. Repeat this for all intervals and plot the bars accordingly.\n(ii) The maximum frequency is 44, which falls in the class interval 6 - 8.",
    "explanation": "Step 1: Determine the class widths: for 1–4, width is 3; for 4–6, width is 2; for 6–8, width is 2; for 8–12, width is 4; and for 12–20, width is 8.\nStep 2: Calculate adjusted frequency for each interval by dividing the given frequency by the class width.\nStep 3: Plot the histogram with the actual class intervals on the x-axis and adjusted frequencies on the y-axis so that each bar’s area represents the actual frequency accurately.\nStep 4: Identify the interval with the highest frequency value; here, the interval 6–8 contains 44 surnames, the maximum among all intervals.",
    "topic": "Graphical Representation of Data – Histogram with Varying Class Widths",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex009"
  }
]