[
  {
    "question_text": "If the diagonals of a parallelogram are equal, then show that it is a rectangle.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Proof: Let ABCD be a parallelogram with diagonals AC and BD such that AC = BD. Since the diagonals of a parallelogram bisect each other, the triangles formed around the intersection point are congruent. By applying triangle congruence (SSS or SAS) to the triangles formed by the diagonals, it can be shown that the base angles are equal. With extra reasoning using the property that consecutive angles in a parallelogram are supplementary, one concludes that all angles must be right angles. Hence, ABCD is a rectangle.",
    "explanation": "Step 1: In parallelogram ABCD, let the intersection of the diagonals be O. Thus, AO = OC and BO = OD. \nStep 2: Given AC = BD, by considering triangles AOB and COD, we have AO = OC, BO = OD, and AB = CD (opposite sides of a parallelogram), implying the triangles are congruent. \nStep 3: Because of the congruence, the angles at vertices A and C get equally divided, and using the fact that consecutive angles in a parallelogram are supplementary, one deduces that angle A (and similarly all other angles) must be 90°. \nStep 4: Hence, the parallelogram is a rectangle.",
    "topic": "Properties of Parallelograms and Rectangles",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh108",
    "question_id": "cbse_ix_iemh1dd_c108_ex001"
  },
  {
    "question_text": "Show that the diagonals of a square are equal and bisect each other at right angles.",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Proof: In a square, all four sides are equal and the shape is a specific type of parallelogram. It is known that in any parallelogram the diagonals bisect each other. For a square, by drawing both diagonals, one can use triangle congruence (SSS) to show that the triangles formed are congruent. This congruence further shows that each diagonal splits the opposite angles equally and the intersection forms four congruent right triangles, proving that the diagonals are equal in length and intersect at 90°.",
    "explanation": "Step 1: Let ABCD be a square and draw diagonals AC and BD, meeting at O. \nStep 2: Since a square is a parallelogram, we have AO = OC and BO = OD. \nStep 3: Using the fact that all sides of the square are equal, triangles AOB, BOC, COD, and DOA are congruent by the SSS postulate. \nStep 4: Congruence of these triangles implies that the angles formed at O are equal. As the sum around point O is 360°, each angle is 90°. \nStep 5: Thus, the diagonals are equal, bisect each other, and intersect at right angles.",
    "topic": "Properties of Squares and Diagonals",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iemh108",
    "question_id": "cbse_ix_iemh1dd_c108_ex002"
  },
  {
    "question_text": "Diagonal AC of a parallelogram ABCD bisects ∠A. Show that (i) it bisects ∠C also, (ii) ABCD is a rhombus.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Proof: (i) In parallelogram ABCD, since opposite angles are equal, bisecting ∠A implies that the corresponding parts in ∠C are also equal due to the properties of parallel lines and alternate interior angles. (ii) Further, by proving that the triangles on either side of diagonal AC are congruent (using ASA or AAS), it follows that the corresponding sides of the parallelogram are equal, which is the defining property of a rhombus. Hence, ABCD is a rhombus.",
    "explanation": "Step 1: Let ABCD be a parallelogram with diagonal AC, and suppose AC bisects ∠A. Denote ∠DAC = ∠BAC. \nStep 2: Because ABCD is a parallelogram, ∠A = ∠C. Therefore, the bisector of ∠A forces a corresponding equal split in ∠C when considering the alternate interior angles generated by the parallel sides. \nStep 3: Consider triangles △ABC and △CDA. They share the side AC; moreover, by properties of parallelograms, AB = DC and AD = BC. With the angle bisector assumption, sufficient angle congruence exists to apply the ASA criterion, proving the triangles are congruent. \nStep 4: Congruence of these triangles implies that the adjacent sides of the parallelogram are equal, so all sides are equal. Hence, ABCD is a rhombus.",
    "topic": "Properties of Parallelograms and Rhombuses",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh108",
    "question_id": "cbse_ix_iemh1dd_c108_ex003"
  },
  {
    "question_text": "ABCD is a rectangle in which diagonal AC bisects ∠A as well as ∠C. Show that: (i) ABCD is a square (ii) diagonal BD bisects ∠B as well as ∠D.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Proof: (i) In the given rectangle, if diagonal AC bisects ∠A and ∠C, then by using congruence of triangles (formed by the diagonals) one can show that the adjacent sides of the rectangle are equal, which is the necessary and sufficient condition for a rectangle to be a square. (ii) Moreover, by symmetry and using the properties of diagonals in a square (which bisect each other and the angles), it follows that the other diagonal BD also bisects ∠B and ∠D.",
    "explanation": "Step 1: Start with rectangle ABCD where ∠A = 90°. Given that diagonal AC bisects ∠A, we have ∠DAC = ∠BAC = 45°. Similarly, since AC bisects ∠C, the corresponding angles at C are also 45°. \nStep 2: In a rectangle, opposite sides are parallel. With the angle bisector information, the triangles formed (△ABC and △ADC) are congruent by ASA. This congruence forces AB = BC, thereby making all sides equal, which is the definition of a square. \nStep 3: In a square, the diagonals are known to bisect the vertex angles. Therefore, diagonal BD must bisect ∠B and ∠D. \nStep 4: This establishes both claims: ABCD is a square and diagonal BD bisects the angles at B and D.",
    "topic": "Properties of Rectangles and Squares",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh108",
    "question_id": "cbse_ix_iemh1dd_c108_ex004"
  },
  {
    "question_text": "In parallelogram ABCD, two points P and Q are taken on diagonal BD such that DP = BQ. Show that: (i) ∆APD ≅ ∆CQB, (ii) AP = CQ, (iii) ∆AQB ≅ ∆CPD, (iv) AQ = CP, (v) APCQ is a parallelogram.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Proof: By considering the given condition DP = BQ on diagonal BD, and using the properties of a parallelogram (diagonals bisect each other, and opposite sides are equal and parallel), one can form pairs of triangles within the figure. (i) By showing that triangles △APD and △CQB have two pairs of equal sides (due to midpoints and parallelogram properties) and the included angle equal, by the SAS congruence criterion, they are congruent. (ii) This congruence gives AP = CQ. (iii) Similarly, triangles △AQB and △CPD can be shown congruent, implying AQ = CP. (v) With these equalities, the quadrilateral APCQ has both pairs of opposite sides equal and parallel, hence it is a parallelogram.",
    "explanation": "Step 1: Sketch parallelogram ABCD and mark diagonal BD. Place points P and Q on BD such that DP = BQ. \nStep 2: Note that in a parallelogram, the diagonals bisect each other. Use this property to examine triangles △APD and △CQB. \nStep 3: Show that in △APD and △CQB, we have AP = CQ (to be proven later), DP = BQ (given), and angle APD equals angle CQB (vertical angles or by properties of parallel lines). This verifies congruence by SAS. \nStep 4: As a result, corresponding parts of congruent triangles are equal (CPCT), so AP = CQ. \nStep 5: A similar argument establishes that △AQB ≅ △CPD, giving AQ = CP. \nStep 6: With these equalities, quadrilateral APCQ has both pairs of opposite sides equal. By the definition of a parallelogram, APCQ is a parallelogram.",
    "topic": "Congruence in Parallelograms and Properties of Diagonals",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh108",
    "question_id": "cbse_ix_iemh1dd_c108_ex005"
  },
  {
    "question_text": "ABCD is a parallelogram and AP and CQ are perpendiculars from vertices A and C on diagonal BD. Show that: (i) ∆APB ≅ ∆CQD, (ii) AP = CQ.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Proof: In parallelogram ABCD, drop perpendiculars from A and C onto diagonal BD, meeting it at P and Q respectively. Since the diagonals of a parallelogram bisect each other and the perpendiculars create right triangles, we analyze triangles △APB and △CQD. By showing that BP = QD (from symmetry) and using the right angle and common angle, the triangles are congruent by the Hypotenuse-Angle (HA) or RHS criterion. Therefore, AP = CQ.",
    "explanation": "Step 1: Draw parallelogram ABCD with diagonal BD, and let AP and CQ be drawn perpendicular to BD. \nStep 2: In triangles △APB and △CQD, note that ∠APB and ∠CQD are right angles. \nStep 3: The diagonals of a parallelogram bisect each other, which gives relationships between the segments on BD. \nStep 4: Along with corresponding angles (vertical angles) and the shared property from the parallelogram, triangles △APB and △CQD are congruent by RHS or by right-angle triangle congruence criteria. \nStep 5: Hence, by CPCT, AP = CQ.",
    "topic": "Properties of Parallelograms, Right Triangles, and Perpendiculars",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh108",
    "question_id": "cbse_ix_iemh1dd_c108_ex006"
  },
  {
    "question_text": "ABCD is a trapezium in which AB ∥ CD and AD = BC. Show that (i) ∠A = ∠B, (ii) ∠C = ∠D, (iii) △ABC ≅ △BAD, (iv) diagonal AC = diagonal BD.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Proof: In the given trapezium ABCD with AB ∥ CD and non-parallel sides AD = BC, extend AB and draw a line through C parallel to AD meeting the extension at E. Using alternate interior angles and the properties of parallel lines, one can show that ∠A = ∠B and ∠C = ∠D. Furthermore, by drawing diagonals and establishing that triangles △ABC and △BAD are congruent by the SAS criterion (using AD = BC, the given parallelism, and equal alternate interior angles), it follows that diagonal AC equals diagonal BD.",
    "explanation": "Step 1: Draw trapezium ABCD with AB ∥ CD and AD = BC. Extend AB beyond B and draw line CE such that CE ∥ AD. \nStep 2: Using the properties of parallel lines, observe that alternate interior angles are equal giving ∠A = ∠B and similarly ∠C = ∠D. \nStep 3: Consider triangles △ABC and △BAD. In these triangles, side AD = BC (given), and because of the angle equalities from the parallel line properties, the triangles are congruent by the SAS criterion. \nStep 4: From the congruence, all corresponding sides are equal which implies diagonal AC = diagonal BD. \nStep 5: This completes the proof for all four parts.",
    "topic": "Properties of Trapeziums and Congruence of Triangles",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh108",
    "question_id": "cbse_ix_iemh1dd_c108_ex007"
  }
]