[
  {
    "question_text": "In quadrilateral ACBD, AC = AD and AB bisects ∠CAD (see Fig. 7.16). Show that ΔABC ≅ ΔABD. What can you say about BC and BD?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "By noting that in triangles ABC and ABD, we have AC = AD (given), AB is common, and the bisector condition gives ∠CAB = ∠DAB. Therefore, by the SAS criterion, ΔABC is congruent to ΔABD, and consequently, the corresponding sides are equal, i.e. BC = BD.",
    "explanation": "Step 1: Identify triangles ΔABC and ΔABD which share the side AB.\nStep 2: Given that AC = AD and that AB bisects ∠CAD, it follows that the angles ∠CAB and ∠DAB are equal.\nStep 3: With side AB common, the three pieces of information – AC = AD, AB = AB, and ∠CAB = ∠DAB – allow us to apply the SAS (Side-Angle-Side) congruence rule to conclude that ΔABC ≅ ΔABD.\nStep 4: By the property of congruent triangles, all corresponding sides and angles are equal; thus, BC = BD.\nThe key concept used is triangle congruence (SAS criterion) and the property that corresponding parts of congruent triangles are equal (CPCT).",
    "topic": "Congruence of Triangles",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh107",
    "question_id": "cbse_ix_iemh1dd_c107_ex001"
  },
  {
    "question_text": "ABCD is a quadrilateral in which AD = BC and ∠DAB = ∠CBA (see Fig. 7.17). Prove that (i) ΔABD ≅ ΔBAC, (ii) BD = AC, (iii) ∠ABD = ∠BAC.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Consider triangles DAB and CBA: AB is common, AD = BC (given), and the included angles ∠DAB and ∠CBA are equal (given). By the SAS congruence rule, ΔDAB ≅ ΔCBA. It then follows that corresponding parts are equal; hence, (i) the triangles ΔABD and ΔBAC (which are the same as ΔDAB and ΔCBA with appropriate vertex order) are congruent, (ii) BD = AC, and (iii) ∠ABD = ∠BAC.",
    "explanation": "Step 1: Focus on triangles DAB and CBA. Note that side AB is common to both triangles.\nStep 2: The given AD = BC and the equality of the angles ∠DAB = ∠CBA serve as the second and third pieces of necessary information.\nStep 3: Applying the SAS criterion (Side-Angle-Side) shows that ΔDAB ≅ ΔCBA.\nStep 4: By the CPCT principle, all corresponding parts of congruent triangles are equal. Consequently:\n   - The side BD (corresponding to AC) are equal, so BD = AC.\n   - The angles ∠ABD and ∠BAC are equal.\nThis completes the required proof.",
    "topic": "Congruence of Triangles",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh107",
    "question_id": "cbse_ix_iemh1dd_c107_ex002"
  },
  {
    "question_text": "AD and BC are equal perpendiculars to a line segment AB (see Fig. 7.18). Show that CD bisects AB.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Consider right triangles ADC and BDC formed by dropping perpendiculars from A and B. Since AD = BC (given), ∠DAB = ∠CBA = 90°, and the line CD is common to both triangles, by the Hypotenuse-Leg (right triangle) congruence criterion, ΔADC ≅ ΔBDC. Therefore, the segment AB is divided equally by CD, i.e. CD bisects AB.",
    "explanation": "Step 1: From the figure, AD and BC are drawn perpendicular to AB, meaning that ∠DAB and ∠CBA are right angles.\nStep 2: In triangles ADC and BDC, the leg AD equals leg BC (given) and the hypotenuse CD is common.\nStep 3: The Right Angle-Hypotenuse-Leg (RHL) congruence of right triangles applies, yielding ΔADC ≅ ΔBDC.\nStep 4: By CPCT, the segments on the base AB corresponding to A and B are equal, which means that CD bisects AB.\nThis employs properties of right triangles and triangle congruence.",
    "topic": "Congruence of Triangles",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh107",
    "question_id": "cbse_ix_iemh1dd_c107_ex003"
  },
  {
    "question_text": "l and m are two parallel lines intersected by another pair of parallel lines p and q (see Fig. 7.19). Show that ΔABC ≅ ΔCDA.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In the configuration, the intersection of the two families of parallel lines forms a parallelogram ABCD. In any parallelogram, the diagonals split the shape into two congruent triangles. Thus, triangles ΔABC and ΔCDA are congruent by the ASA criterion (since they share the diagonal AC, and corresponding angles determined by the parallel lines are equal), leading to ΔABC ≅ ΔCDA.",
    "explanation": "Step 1: Recognize that the two pairs of parallel lines, l ∥ m and p ∥ q, form a parallelogram (or a similar quadrilateral with parallel opposite sides) with vertices A, B, C, D.\nStep 2: In a parallelogram, the diagonals divide the figure into two congruent triangles because (a) one diagonal is common to both triangles and (b) the alternate interior angles created by the parallel lines are equal.\nStep 3: Specifically, triangles ΔABC and ΔCDA share diagonal AC, and the angles at vertices A and C are equal by the properties of parallel lines (alternate interior angles).\nStep 4: Applying the ASA or AAS congruence rule, we conclude that ΔABC ≅ ΔCDA.\nHence, the proof is complete.",
    "topic": "Properties of Parallelograms and Triangle Congruence",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh107",
    "question_id": "cbse_ix_iemh1dd_c107_ex004"
  },
  {
    "question_text": "Line l is the bisector of an angle ∠A and B is any point on l. BP and BQ are perpendiculars from B to the arms of ∠A (see Fig. 7.20). Show that: (i) ΔAPB ≅ ΔAQB, (ii) BP = BQ, i.e. B is equidistant from the arms of ∠A.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Since l is the angle bisector, the distances from any point on it to the arms of the angle are equal. In triangles ΔAPB and ΔAQB, AB is common, ∠ABP = ∠ABQ = 90° (since BP and BQ are perpendicular to the arms), and the angles at A are equal because l bisects ∠A. Hence, by the AAS criterion, ΔAPB ≅ ΔAQB, which implies that BP = BQ.",
    "explanation": "Step 1: Note that B lies on the angle bisector of ∠A, so the angles between line AB and the perpendiculars BP and BQ are congruent.\nStep 2: In triangles ΔAPB and ΔAQB, the right angles at P and Q (due to the perpendiculars) serve as one angle each.\nStep 3: AB is common to both triangles and the angle at A is divided equally by l. Thus, by the AAS (Angle-Angle-Side) congruence theorem, the triangles are congruent.\nStep 4: From the congruence, corresponding sides BP and BQ are equal, establishing that B is equidistant from the two arms of ∠A.\nThis demonstrates a property of angle bisectors in relation to distances from a point on the bisector to the rays of the angle.",
    "topic": "Angle Bisector and Perpendicular Distance",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iemh107",
    "question_id": "cbse_ix_iemh1dd_c107_ex005"
  },
  {
    "question_text": "In Fig. 7.21, AC = AE, AB = AD and ∠BAD = ∠EAC. Show that BC = DE.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Observe that BC = AC − AB and DE = AE − AD. Given that AC = AE and AB = AD, it follows directly that BC = DE.",
    "explanation": "Step 1: Write the expressions for BC and DE in terms of the given segments: BC = AC − AB and DE = AE − AD.\nStep 2: Substitute the equalities provided: AC = AE and AB = AD.\nStep 3: After substitution, we obtain BC = AE − AD and DE = AE − AD, hence BC = DE.\nStep 4: Thus, by simple subtraction and corresponding equality of segments, the result is established.\nThis problem uses basic algebraic manipulation along with the properties of equal segments in a geometric figure.",
    "topic": "Algebraic Manipulation in Geometry",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh107",
    "question_id": "cbse_ix_iemh1dd_c107_ex006"
  },
  {
    "question_text": "AB is a line segment and P is its midpoint. D and E are points on the same side of AB such that ∠BAD = ∠ABE and ∠EPA = ∠DPB (see Fig. 7.22). Show that (i) ΔDAP ≅ ΔEBP, (ii) AD = BE.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Since P is the midpoint of AB, we have AP = BP. Also, the equality ∠BAD = ∠ABE shows a symmetry in the placement of points D and E with respect to AB. Moreover, the condition ∠EPA = ∠DPB provides an additional pair of equal angles in triangles ΔDAP and ΔEBP. With AP = BP, the equal angles at A and at P, by the ASA congruence criterion, we conclude that ΔDAP ≅ ΔEBP. Consequently, the corresponding sides AD and BE are equal.",
    "explanation": "Step 1: Recognize that P, being the midpoint of AB, ensures that AP = BP.\nStep 2: The given angle equality ∠BAD = ∠ABE indicates that the rays AD and BE are symmetrically disposed with respect to line AB.\nStep 3: The additional condition ∠EPA = ∠DPB yields equality of another pair of corresponding angles in triangles ΔDAP and ΔEBP.\nStep 4: With one pair of sides (AP = BP) and two pairs of angles equal, the ASA (Angle-Side-Angle) criterion applies to conclude that ΔDAP ≅ ΔEBP.\nStep 5: By CPCT, the corresponding sides AD and BE are equal.\nThis problem tests the application of congruence criteria based on midpoint information and angle equalities.",
    "topic": "Congruence of Triangles and Angle Conditions",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh107",
    "question_id": "cbse_ix_iemh1dd_c107_ex007"
  },
  {
    "question_text": "In right triangle ABC, right angled at C, M is the midpoint of hypotenuse AB. C is joined to M and produced to a point D such that DM = CM. Point D is joined to point B (see Fig. 7.23). Show that: (i) ΔAMC ≅ ΔBMD, (ii) ∠DBC is a right angle, (iii) ΔDBC ≅ ΔACB, (iv) CM = ½ AB.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Firstly, since M is the midpoint of the hypotenuse of the right triangle ABC, we know that AM = MB and, by the circle theorem, CM is equal to these segments. With DM = CM (given), consider triangles ΔAMC and ΔBMD: they have CM common, AM = MB, and the angles at M are vertically equal; hence by the SAS criterion, ΔAMC ≅ ΔBMD. This congruence implies that ∠DBC is a right angle (as corresponding angles in congruent configurations), and further, by comparing parts, ΔDBC ≅ ΔACB. Finally, using the property of a right triangle that the length of the median to the hypotenuse is half the hypotenuse, we deduce that CM = ½ AB.",
    "explanation": "Step 1: In right triangle ABC (with right angle at C), the midpoint M of the hypotenuse AB has the property that AM = MB, and it is known that the median from the right angle to the hypotenuse is equal to half the hypotenuse.\nStep 2: With point D chosen such that DM = CM, consider triangles ΔAMC and ΔBMD. They share side CM, have AM = MB (since M is midpoint), and the included angles at M are equal (vertical angles). Therefore, by SAS, the triangles are congruent, yielding ΔAMC ≅ ΔBMD.\nStep 3: This congruence implies corresponding angles are equal; in particular, it can be shown that ∠DBC is a right angle.\nStep 4: Furthermore, by considering other corresponding parts, one can prove that ΔDBC ≅ ΔACB (often by a combination of congruence and the properties pertaining to the altitude in a right triangle).\nStep 5: Finally, by the well-known property of the median to the hypotenuse in a right triangle, we conclude that CM = ½ AB.\nThis solution uses properties of right triangles, midpoints, and triangle congruence (SAS), as well as known theorems about medians in right triangles.",
    "topic": "Right Triangle Geometry and Triangle Congruence",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh107",
    "question_id": "cbse_ix_iemh1dd_c107_ex008"
  }
]