[
  {
    "question_text": "Which of the following graphs is best described as a representation of data using bars of uniform width where the height of each bar is proportional to the data values?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Histogram",
      "B. Bar Graph",
      "C. Frequency Polygon",
      "D. Pie Chart"
    ],
    "correct_answer": "B. Bar Graph",
    "explanation": "A bar graph represents data using bars of uniform width, where the height of each bar is directly proportional to the data value it represents. Histograms, however, are used for grouped frequency distributions and may involve varying widths, while frequency polygons are line graphs joining midpoints of histogram bars.",
    "topic": "Bar Graphs",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen015"
  },
  {
    "question_text": "In constructing a histogram for a grouped frequency distribution with uniform class widths, which element of the rectangles is made proportional to the frequency?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The base of the rectangle",
      "B. The height of the rectangle",
      "C. The perimeter of the rectangle",
      "D. The diagonal of the rectangle"
    ],
    "correct_answer": "B. The height of the rectangle",
    "explanation": "In a histogram with uniform class widths, the height of each rectangle is set proportional to the frequency of the corresponding class, ensuring that the area of the rectangle (base × height) is also proportional to the frequency.",
    "topic": "Histograms",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen016"
  },
  {
    "question_text": "When classes of a histogram have varying widths, what adjustment is required to correctly represent the frequency of each class?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Widen all classes to match",
      "B. Change the base length of rectangles",
      "C. Adjust the height so that the area is proportional to frequency",
      "D. Normalize the frequency values"
    ],
    "correct_answer": "C. Adjust the height so that the area is proportional to frequency",
    "explanation": "For histograms with classes of varying widths, the heights of the rectangles need to be adjusted so that the area (base × height) of each rectangle remains proportional to the frequency of the class, compensating for the different widths.",
    "topic": "Histograms with Non-uniform Classes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen017"
  },
  {
    "question_text": "Identify and define the graphical representation obtained by joining the mid-points of the tops of adjacent rectangles in a histogram.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "This graphical representation is called a frequency polygon. It is constructed by joining the mid-points of the tops of the histogram's rectangles, and it often includes endpoints joined to the mid-points of the fictitious classes before the first and after the last, typically having a frequency of zero.",
    "explanation": "A frequency polygon is used to display the overall distribution of data. By connecting the mid-points of the histogram rectangles, it provides a clear visualization of trends and patterns in the data frequency.",
    "topic": "Frequency Polygons",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen018"
  },
  {
    "question_text": "Define a bar graph and explain its primary use in data representation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A bar graph is a chart that presents categorical data with rectangular bars where the lengths of the bars are proportional to the values they represent. It is primarily used for comparing different groups or categories of data.",
    "explanation": "Bar graphs effectively show comparisons among discrete categories. Each bar's height (or length) visually represents the magnitude of the category, making it easy to compare different values at a glance.",
    "topic": "Bar Graphs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen019"
  },
  {
    "question_text": "Explain the difference between a histogram and a bar graph, giving one key point for each difference.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A histogram represents a grouped frequency distribution where the data is continuous and the bars touch each other to indicate continuous data, whereas a bar graph represents categorical data with gaps between the bars. Additionally, in histograms, the area of the rectangles (especially when classes have varying widths) is used to represent frequency, while in bar graphs, the height of the bars represents the data values.",
    "explanation": "The key differences are:\n1. Data type: Histograms deal with continuous data, while bar graphs are used for categorical data.\n2. Bar separation: Histograms typically have contiguous bars whereas bar graphs have spaces between the bars.\n3. Representation: In histograms, the area is significant when class widths vary; in bar graphs, it is the height that represents the value.",
    "topic": "Histograms vs Bar Graphs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen020"
  },
  {
    "question_text": "Discuss in detail the rationale behind adjusting the heights of rectangles in histograms that have classes with varying widths. Include in your answer how this adjustment ensures accurate data representation.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When the classes in a frequency distribution have varying widths, simply using the height directly proportional to frequency would misrepresent the data because wider classes would naturally have larger areas even if they did not have a greater frequency. To correct for this, the height of each rectangle is adjusted so that the area (which is base × height) accurately reflects the frequency. This is achieved by dividing the frequency by the class width to obtain the frequency density. Multiplying the class width by this adjusted height returns the frequency, ensuring consistency and accurate representation across classes.",
    "explanation": "The adjustment is based on the concept of frequency density. For a class with width w and frequency f, the frequency density is f/w. The height of the rectangle is set equal to this density. This ensures:\n1. For uniform widths, the height remains simply proportional to the frequency.\n2. For varying widths, the area (width × height = width × (f/w) = f) consistently represents the frequency, providing an accurate visual depiction of data distribution.",
    "topic": "Histograms with Non-uniform Classes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen021"
  },
  {
    "question_text": "Describe the steps involved in constructing a frequency polygon from a given histogram. Provide a logical justification for each step.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "To construct a frequency polygon from a histogram, follow these steps:\n1. Identify the mid-points (class marks) of each histogram bar. These mid-points represent the central value of each class.\n2. Plot the frequency corresponding to each mid-point on a graph, where the x-axis represents the class marks and the y-axis represents the frequency.\n3. Connect the plotted points with straight lines to form the polygon.\n4. Extend the graph by marking and connecting points for a class preceding the first class and succeeding the last class, assigning a frequency of zero for these points. This ensures the polygon returns to the baseline, providing a complete picture of the data distribution.\nJustification: The mid-points ensure accurate location in the continuous scale, the connection of points (line segments) illustrates trends, and extending to zero frequency provides context to the distribution’s boundaries.",
    "explanation": "Each step is crucial:\n- Determining mid-points standardizes the representation of each class interval.\n- Plotting frequencies at these mid-points visualizes the relative weight of each interval.\n- Connecting the points creates a continuous line that highlights trends in the data.\n- Including zero-frequency endpoints ensures the area under the curve reflects the complete distribution, avoiding misinterpretation of data boundaries.",
    "topic": "Frequency Polygons",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen022"
  },
  {
    "question_text": "The following frequency distribution represents the number of books read by students in a month:\n\nNumber of Books Read (Class Interval): 0-2, 3-5, 6-8, 9-11\nFrequency: 4, 7, 5, 2\n\n(a) Construct a histogram using this data assuming class widths are uniform.\n(b) Compute the mid-points for each class and explain how you would construct a frequency polygon from this histogram.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) For a histogram with uniform class widths, draw rectangles for the classes 0-2, 3-5, 6-8, and 9-11, with heights 4, 7, 5, and 2 respectively. \n(b) The mid-points for the classes are calculated as follows:\n• For 0-2: (0+2)/2 = 1\n• For 3-5: (3+5)/2 = 4\n• For 6-8: (6+8)/2 = 7\n• For 9-11: (9+11)/2 = 10\nTo construct the frequency polygon, plot the points (1, 4), (4, 7), (7, 5), (10, 2) on a graph. Then, join each point with a straight line segment and extend the polygon to the x-axis by adding points at mid-points of the classes preceding the first (e.g., -2 with frequency 0) and succeeding the last (e.g., 13 with frequency 0).",
    "explanation": "Step-by-step solution:\n1. Histogram: Draw rectangles where the base of each rectangle corresponds to the class interval and the height corresponds to the frequency.\n2. Compute mid-points using the formula (lower limit + upper limit)/2.\n3. Plot the mid-points against the corresponding frequency.\n4. Join the plotted points with lines.\n5. Extend the line to the x-axis by plotting points with frequency zero before the first class and after the last class, ensuring a complete frequency polygon.",
    "topic": "Histogram and Frequency Polygon Construction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen023"
  },
  {
    "question_text": "Consider the following grouped frequency distribution with non-uniform class widths:\n\nClass Interval: 0-4, 4-7, 7-10, 10-15\nFrequency: 8, 12, 5, 10\n\n(a) Calculate the frequency density for each class.\n(b) Describe how you would use these densities to construct a histogram.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) Frequency density is calculated as Frequency ÷ Class Width.\n• For 0-4: Class width = 4 → Density = 8/4 = 2\n• For 4-7: Class width = 3 → Density = 12/3 = 4\n• For 7-10: Class width = 3 → Density = 5/3 ≈ 1.67\n• For 10-15: Class width = 5 → Density = 10/5 = 2\n(b) To construct the histogram, draw each class interval along the horizontal axis with the appropriate width. Then, for each interval, draw a rectangle whose height equals the frequency density. The area of each rectangle (width × height) will represent the actual frequency for that class.",
    "explanation": "For each class, we first compute the frequency density by dividing the frequency by the width. This ensures that the area of the rectangle accurately depicts the frequency. When plotting the histogram, use the class intervals as the width of the rectangles and set their heights to the calculated densities. This method accounts for the varying widths, so that the area (which equals density × width) equals the frequency in that class.",
    "topic": "Histograms with Varying Class Widths",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen024"
  },
  {
    "question_text": "A teacher collected data on the number of hours students studied per week. The data was grouped into the intervals: 0-5, 5-10, 10-15, and 15-20 with frequencies 3, 9, 12, and 6 respectively. \n\n(a) Draw the corresponding histogram assuming uniform class widths.\n(b) From the histogram, determine the mid-points of each class and plot the frequency polygon.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) The histogram is constructed with class intervals 0-5, 5-10, 10-15, and 15-20. Each rectangle is drawn with a width of 5 and heights 3, 9, 12, and 6 respectively. \n(b) Mid-points are calculated as:\n• 0-5: (0+5)/2 = 2.5\n• 5-10: (5+10)/2 = 7.5\n• 10-15: (10+15)/2 = 12.5\n• 15-20: (15+20)/2 = 17.5\nPlot the points (2.5, 3), (7.5, 9), (12.5, 12), (17.5, 6) on the graph, then connect these with straight lines. Extend the polygon by adding points with zero frequency before the first mid-point and after the last mid-point, such as (−2.5, 0) and (22.5, 0).",
    "explanation": "This problem requires constructing both a histogram and a frequency polygon:\n1. For the histogram: Draw rectangles using the given intervals and frequencies. Since the class widths (5) are uniform, each height directly corresponds to its frequency.\n2. For the frequency polygon: Calculate the mid-point for each class, plot each mid-point with the corresponding frequency, and connect them with straight lines. Extend the polygon to reach the x-axis by placing auxiliary points at the beginning and end with a frequency of zero.",
    "topic": "Histogram and Frequency Polygon Construction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen025"
  },
  {
    "question_text": "Critically evaluate the advantages and limitations of using frequency polygons over histograms in representing continuous data distributions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Advantages of frequency polygons include:\n• They provide a clear visual representation of trends and overall data shape, making it easier to compare multiple distributions on the same graph.\n• They allow for easy identification of peaks and troughs in the data.\n• When overlaid with other frequency polygons, comparisons are more straightforward due to the use of line graphs.\n\nLimitations include:\n• Frequency polygons may lose some of the granular detail present in histograms, particularly in cases with a small number of classes.\n• They might be less intuitive for audiences unfamiliar with statistical graphics, compared to the commonly understood bar representation in histograms.\n• In cases of discrete data or when the number of observations is small, histograms may present a more exact picture of frequency distribution.",
    "explanation": "A thorough evaluation includes listing both pros and cons. Frequency polygons simplify the graphical comparison of data sets and clearly show trends, but they may sacrifice detailed information when the data set is small or when class boundaries are not well defined. Histograms maintain a more concrete representation by showing the actual distribution of frequencies in each class.",
    "topic": "Comparative Graphical Analysis",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "03_section_12_2",
    "question_id": "cbse_ix_iemh1dd_c112_gen026"
  },
  {
    "question_text": "A survey conducted by an organisation for the cause of illness and death among the women between the ages 15 - 44 (in years) worldwide found the following figures (in %):\n\n S.No.   Causes        Female fatality rate (%)\n 1.   Reproductive health conditions – 31.8\n 2.   Neuropsychiatric conditions – 25.4\n 3.   Injuries – 12.4\n 4.   Cardiovascular conditions – 4.3\n 5.   Respiratory conditions – 4.1\n 6.   Other causes – 22.0\n\n(i) Represent the information given above graphically. (Bar graph recommended)\n(ii) Which condition is the major cause of women’s ill health and death worldwide?\n(iii) Try to find out, with the help of your teacher, any two factors which play a major role in the cause in (ii) above being the major cause.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) A bar graph with the causes on the x-axis and the female fatality rate on the y-axis. Each bar’s height is proportional to the percentage given (e.g., the bar for Reproductive health conditions reaches a height of 31.8 units).\n(ii) Reproductive health conditions (31.8%) is the major cause.\n(iii) Two possible factors could be inadequate access to reproductive health services and socio-economic conditions affecting women’s health.",
    "explanation": "Step 1: Plot the causes on the x-axis and the corresponding fatality rates on the y-axis. Use uniform spacing for the bars. \nStep 2: The bar that reaches the highest value will show the major cause; here it is Reproductive health conditions at 31.8%.\nStep 3: Discuss with your teacher potential external factors such as poor health infrastructure, cultural practices, or lack of education which can contribute to higher fatality rates in reproductive health conditions.",
    "topic": "Graphical Representation of Data – Bar Graphs",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex001"
  },
  {
    "question_text": "The following data on the number of girls (to the nearest ten) per thousand boys in different sections of Indian society is given below:\n\n Section      Number of girls per thousand boys\n Scheduled Caste (SC)   940\n Scheduled Tribe (ST)   970\n Non SC/ST      920\n Backward districts   950\n Non-backward districts  920\n Rural        930\n Urban        910\n\n(i) Represent the information above by a bar graph.\n(ii) In the classroom discuss what conclusions can be arrived at from the graph.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) A bar graph should be drawn with the different sections on the horizontal axis and the number of girls per thousand boys on the vertical axis. Each section is represented by a bar with height corresponding to the given value.\n(ii) Observations might include that Scheduled Tribes (ST) show the highest ratio (970), while Urban areas show the lowest (910), with some sections having similar ratios indicating disparities in gender distribution across different social and geographical groups.",
    "explanation": "Step 1: Label the x-axis with the names of the sections and the y-axis with the values (number of girls per thousand boys). Plot each bar using the numerical values provided.\nStep 2: Once the graph is plotted, analyze and compare the heights of the bars to discuss differences. For example, the highest bar (ST at 970) suggests a relatively better girl-to-boy ratio compared to others, while Urban areas have the lowest ratio (910).\nStep 3: Discuss potential social, economic, or cultural reasons for these differences in a classroom setting.",
    "topic": "Graphical Representation of Data – Bar Graphs",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex002"
  },
  {
    "question_text": "Given below are the seats won by different political parties in the polling outcome of a state assembly election:\n\n Political Party   A   B   C   D   E   F\n Seats Won     75  55  37  29  10  37\n\n(i) Draw a bar graph to represent the polling results.\n(ii) Which political party won the maximum number of seats?",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) A bar graph should be drawn with the political parties on the x-axis (A, B, C, D, E, F) and the corresponding seats won on the y-axis. Each bar’s height corresponds to the number of seats (e.g., Party A reaches 75).\n(ii) Party A won the maximum number of seats (75).",
    "explanation": "Step 1: Draw the x-axis and mark the parties A through F. The y-axis should be scaled to at least 75 since that is the highest value.\nStep 2: For each party, draw a bar with height equal to the number of seats won. \nStep 3: Identify the bar with the maximum height. In this case, Party A's bar is the tallest with 75 seats.",
    "topic": "Graphical Representation of Data – Bar Graphs",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex003"
  },
  {
    "question_text": "The length of 40 leaves of a plant are measured correct to one millimetre, and the obtained data is represented in the following table:\n\n Length (in mm)   Number of leaves\n 118 - 126      3\n 127 - 135      5\n 136 - 144      9\n 145 - 153      12\n 154 - 162      5\n 163 - 171      4\n 172 - 180      2\n\n(i) Draw a histogram to represent the given data. [Hint: First make the class intervals continuous (e.g., 117.5–126.5, 126.5–135.5, etc.)]\n(ii) Is there any other suitable graphical representation for the same data? (Frequency Polygon)\n(iii) Is it correct to conclude that the maximum number of leaves are 153 mm long? Why?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Construct a histogram by first adjusting the class intervals to be continuous: 117.5–126.5, 126.5–135.5, 135.5–144.5, 144.5–153.5, 153.5–162.5, 162.5–171.5, 171.5–180.5. Plot these on the horizontal axis (length in mm) and the frequency (number of leaves) on the vertical axis. Draw adjacent bars with heights corresponding to the frequencies (3, 5, 9, 12, 5, 4, 2).\n(ii) A frequency polygon can also be drawn by plotting the midpoints of each class (calculated from the continuous intervals) against the respective frequencies and joining the points by straight lines.\n(iii) No, it is not correct. The value 153 mm is the upper limit of the class interval (144.5–153.5) that has the highest frequency. It does not mean that the maximum number of individual leaves measured exactly 153 mm; rather, most leaves fall into that interval.",
    "explanation": "Step 1: Adjust class intervals to make them continuous (subtract 0.5 from the lower limit and add 0.5 to the upper limit). \nStep 2: Draw the histogram with these new intervals on the x-axis and frequencies on the y-axis. \nStep 3: For a frequency polygon, compute the class midpoints and plot them with frequencies, then join the dots with straight lines.\nStep 4: Understand that the class interval’s upper boundary does not represent an individual measurement but a range that contains the maximum frequency.",
    "topic": "Graphical Representation of Data – Histogram and Frequency Polygon",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex004"
  },
  {
    "question_text": "The following table gives the life times of 400 neon lamps:\n\n Life time (in hours)   Number of lamps\n 300 - 400        14\n 400 - 500        56\n 500 - 600        60\n 600 - 700        86\n 700 - 800        74\n 800 - 900        62\n 900 - 1000       48\n\n(i) Represent the given information with the help of a histogram.\n(ii) How many lamps have a life time of more than 700 hours?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Draw a histogram with life time intervals on the x-axis and frequency (number of lamps) on the y-axis. Each bar represents the number of lamps in that 100-hour interval.\n(ii) Add the frequencies for the intervals 700 - 800, 800 - 900, and 900 - 1000: 74 + 62 + 48 = 184 lamps.",
    "explanation": "Step 1: Plot the continuous intervals for the life times along the x-axis. Ensure the bars are adjacent since these intervals are continuous.\nStep 2: The height of each bar reflects the number of lamps in that interval. \nStep 3: To answer (ii), sum the frequencies for all intervals above 700 hours: 74 (700–800) + 62 (800–900) + 48 (900–1000) = 184.\nStep 4: Label the axes appropriately for a clear histogram.",
    "topic": "Graphical Representation of Data – Histogram",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex005"
  },
  {
    "question_text": "The following table gives the distribution of students of two sections according to the marks obtained by them:\n\n Section A              Section B\n Marks  Frequency     Marks  Frequency\n 0 - 10   3         0 - 10   5\n 10 - 20   9        10 - 20   19\n 20 - 30  17        20 - 30   15\n 30 - 40  12        30 - 40   10\n 40 - 50   9        40 - 50   1\n\nRepresent the marks of the students of both sections on the same graph by two frequency polygons. From the two polygons compare the performance of the two sections.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Plot a common graph with the marks (use class midpoints if necessary) on the x-axis and the frequency on the y-axis. For Section A, plot the points corresponding to each class interval and join them to form a frequency polygon. Similarly, plot and join the points for Section B using a distinct color or line style. A comparison of the shapes and peak frequencies of the two polygons will indicate the performance differences between the sections. For instance, a higher frequency in lower mark intervals for one section might suggest weaker performance compared to the other.",
    "explanation": "Step 1: Convert the class intervals into class midpoints (e.g., for 0–10, midpoint = 5; for 10–20, midpoint = 15; etc.).\nStep 2: Plot the midpoints vs. frequencies for Section A and Section B on the same set of axes.\nStep 3: Connect the plotted points for each section with lines to form frequency polygons. Use different colors or line types to distinguish between the two sections.\nStep 4: Compare the two polygons by examining their peaks, spreads, and overall shape to deduce which section performed better overall.",
    "topic": "Graphical Representation of Data – Frequency Polygon",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex006"
  },
  {
    "question_text": "The runs scored by two teams A and B on the first 60 balls in a cricket match are given below:\n\n Number of balls   Team A   Team B\n 1 - 6        2     5\n 7 - 12       1     6\n 13 - 18       8     2\n 19 - 24       9     10\n 25 - 30       4     5\n 31 - 36       5     6\n 37 - 42       6     3\n 43 - 48       10     4\n 49 - 54       6     8\n 55 - 60       2     10\n\nRepresent the data of both teams on the same graph by frequency polygons. [Hint: First make the class intervals continuous, e.g., 0.5–6.5, 6.5–12.5, etc.]",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "First, adjust the class intervals to be continuous (e.g., 0.5–6.5 for 1–6, 6.5–12.5 for 7–12, etc.). Then, for each interval, determine the midpoint (for instance, (0.5+6.5)/2 = 3.5, etc.). Plot the midpoints on the x-axis and the corresponding runs (frequency values) on the y-axis for each team. Draw a frequency polygon for Team A and another for Team B on the same graph, using distinct markers or colors. This combined graph facilitates a visual comparison of the scoring patterns of the two teams.",
    "explanation": "Step 1: Adjust each class interval so that they are continuous. For example, for the interval 1–6, use 0.5–6.5 and calculate the midpoint as 3.5.\nStep 2: Repeat for all intervals.\nStep 3: On the same axes, plot the midpoints versus the runs for both Team A and Team B using different symbols or colors.\nStep 4: Connect the points of each team with lines to form their respective frequency polygons.\nStep 5: Analyze differences in the shapes of these polygons to compare performance across the intervals.",
    "topic": "Graphical Representation of Data – Frequency Polygon",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex007"
  },
  {
    "question_text": "A random survey of the number of children of various age groups playing in a park was found as follows:\n\n Age (in years)   Number of children\n 1 - 2       5\n 2 - 3       3\n 3 - 5       6\n 5 - 7       12\n 7 - 10       9\n 10 - 15      10\n 15 - 17      4\n\nDraw a histogram to represent the data above. (Note: Varying class widths require adjusted frequencies).",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Create a histogram where the horizontal axis represents the age groups and the vertical axis represents the number of children. Since the age intervals have varying widths, compute the adjusted frequency (density) for each interval using the formula: Adjusted Frequency = (Frequency / Class Width). For example, for the age group 1–2 (width = 1 year), adjusted frequency = 5/1 = 5. Do this for every age group, then plot bars with the width corresponding to the age range and height equal to the adjusted frequency. This ensures the area of each bar is proportional to the frequency.",
    "explanation": "Step 1: Note the class widths: For instance, 1–2 is 1 year wide, 2–3 is 1 year wide, 3–5 is 2 years, 5–7 is 2 years, 7–10 is 3 years, 10–15 is 5 years, and 15–17 is 2 years.\nStep 2: Calculate adjusted frequency for each class by dividing the frequency by the class width.\nStep 3: Draw the histogram using the original class intervals along the x-axis and adjusted frequencies on the y-axis; bars will have different widths but the area (width × height) represents the true frequency.\nStep 4: Label axes, ensuring that the graph accurately represents the distribution despite the unequal class widths.",
    "topic": "Graphical Representation of Data – Histogram with Varying Class Widths",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex008"
  },
  {
    "question_text": "100 surnames were randomly picked up from a local telephone directory and a frequency distribution of the number of letters in the surnames was found as follows:\n\n Number of letters   Number of surnames\n 1 - 4        6\n 4 - 6        30\n 6 - 8        44\n 8 - 12       16\n 12 - 20       4\n\n(i) Draw a histogram to depict the given information. (Note: Varying class widths require adjusted frequencies).\n(ii) Write the class interval in which the maximum number of surnames lie.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Draw a histogram where the x-axis represents the number of letters in the surnames and the y-axis represents the number of surnames. Since the class widths are not equal, compute the adjusted frequency for each interval using: Adjusted Frequency = (Frequency / Class Width). For instance, for 1–4 (width = 3), the adjusted frequency is 6/3 = 2. Repeat this for all intervals and plot the bars accordingly.\n(ii) The maximum frequency is 44, which falls in the class interval 6 - 8.",
    "explanation": "Step 1: Determine the class widths: for 1–4, width is 3; for 4–6, width is 2; for 6–8, width is 2; for 8–12, width is 4; and for 12–20, width is 8.\nStep 2: Calculate adjusted frequency for each interval by dividing the given frequency by the class width.\nStep 3: Plot the histogram with the actual class intervals on the x-axis and adjusted frequencies on the y-axis so that each bar’s area represents the actual frequency accurately.\nStep 4: Identify the interval with the highest frequency value; here, the interval 6–8 contains 44 surnames, the maximum among all intervals.",
    "topic": "Graphical Representation of Data – Histogram with Varying Class Widths",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iemh112",
    "question_id": "cbse_ix_iemh1dd_c112_ex009"
  },
  {
    "question_text": "Which of the following is the best graphical representation for comparing data across distinct categories?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Bar graph",
      "Histogram",
      "Frequency polygon",
      "Pie chart"
    ],
    "correct_answer": "Bar graph",
    "explanation": "A bar graph is ideal for comparing distinct categories as each bar represents a category with uniform spacing. Histograms and frequency polygons are more suited for continuous data while pie charts show parts of a whole.",
    "topic": "Bar Graphs",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen001"
  },
  {
    "question_text": "In a histogram drawn for a continuous frequency distribution with equally wide class intervals, what does the height of each rectangle directly represent?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The class boundaries",
      "The frequency of the class",
      "The midpoint of the class",
      "The cumulative frequency"
    ],
    "correct_answer": "The frequency of the class",
    "explanation": "When class intervals are of equal width, the area of each rectangle is proportional to the frequency, and since the width is constant, the height is directly proportional to the frequency.",
    "topic": "Histogram",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen002"
  },
  {
    "question_text": "When constructing a histogram with varying class widths, what must be adjusted to ensure that the area of each rectangle remains proportional to its frequency?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The width of the rectangles",
      "The spacing between bars",
      "The lengths (heights) of the rectangles",
      "The color of the rectangles"
    ],
    "correct_answer": "The lengths (heights) of the rectangles",
    "explanation": "For histograms with varying class widths, the height (or length) of each rectangle is adjusted (using the adjusted frequency formula) so that the area (height × width) accurately represents the frequency.",
    "topic": "Histogram with Varying Widths",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen003"
  },
  {
    "question_text": "What is the class-mark of a class interval 70–80?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "70",
      "80",
      "75",
      "77.5"
    ],
    "correct_answer": "75",
    "explanation": "The class-mark is calculated by taking the average of the upper and lower limits. So, (70 + 80) / 2 = 75.",
    "topic": "Frequency Polygon",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen004"
  },
  {
    "question_text": "Define a bar graph and discuss one major advantage of using a bar graph over a tabular representation of data.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A bar graph is a pictorial representation of data where bars of uniform width and equal spacing represent different categories. One major advantage is that it provides a clear visual comparison between categories, making patterns and differences evident at a glance.",
    "explanation": "A bar graph displays categories along one axis (commonly the x-axis) and the corresponding values on the other axis (y-axis). It is preferred over tables because it offers visual cues that help quickly compare the magnitude of the data, which might be less obvious in a numerical table.",
    "topic": "Bar Graphs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen005"
  },
  {
    "question_text": "Describe the purpose of a 'kink' or break in the horizontal axis when drawing a histogram where the first class interval does not start at zero.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The kink or break is used to indicate that the scale does not start at zero; it draws attention to the fact that the first class interval starts at a number greater than zero, ensuring accurate representation of the data.",
    "explanation": "A break in the horizontal axis is included so that the viewer understands that the axis scale has been altered (the starting point is not zero), ensuring that the relative widths and positions of class intervals are accurately perceived.",
    "topic": "Histogram",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen006"
  },
  {
    "question_text": "What is a frequency polygon? Briefly explain how it is constructed from a histogram.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A frequency polygon is a line graph that shows the frequency of each class interval in a distribution. It is constructed by connecting the midpoints of the tops of the bars (rectangles) in a histogram, and including extra points at the ends corresponding to zero frequency to complete the polygon.",
    "explanation": "To construct a frequency polygon, first determine the midpoints (class-marks) of each class interval in the histogram. Plot these points corresponding to the frequency on the vertical axis. Then, connect the successive points with straight lines. It is common to add points for intervals preceding and succeeding the data with zero frequency to complete the shape.",
    "topic": "Frequency Polygon",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen007"
  },
  {
    "question_text": "Explain why adding class intervals with zero frequency at the beginning and end is important when drawing a frequency polygon.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Adding class intervals with zero frequency at the beginning and end of a frequency polygon ensures that the polygon accurately reflects the start and stop of the data distribution. It helps in equating the area under the polygon to the area of the corresponding histogram by forming congruent triangles with the edges.",
    "explanation": "The extra points (with zero frequency) help the frequency polygon to start and end at the horizontal axis. This guarantees that the total area under the polygon will match that of the histogram, ensuring consistency in the representation of the data's distribution.",
    "topic": "Frequency Polygon",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen008"
  },
  {
    "question_text": "A family’s monthly expenditure (in thousand rupees) is given in the table below:\n\nHeads: Electricity, Water, Grocery, Rent, Transportation\nExpenditure: 3, 2, 6, 8, 1\n\nDraw a bar graph representing the data. Explain each step clearly.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Step 1: Label the horizontal axis with the expenditure heads and ensure equal spacing. Step 2: Label the vertical axis with the expenditure amounts; choose a scale such as 1 unit = 1 thousand rupees. Step 3: Draw bars for each head with heights corresponding to the given data (Electricity: 3, Water: 2, Grocery: 6, Rent: 8, Transportation: 1). Step 4: Maintain the same width for each bar and equal gaps in between.\n\nThis results in a bar graph where each bar visually represents the expenditure on a particular head.",
    "explanation": "A bar graph is constructed by first assigning a category (expenditure head) to the horizontal axis. The vertical axis represents the numerical values (expenditure in thousand rupees). Each bar is drawn with a height proportional to its value. Uniform bar widths and equal spacing improve clarity and make comparison easier.",
    "topic": "Bar Graphs",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen009"
  },
  {
    "question_text": "Given the following frequency distribution for weights (in kg) of 50 students:\n\nWeight Intervals (kg): 40-45, 45-50, 50-55, 55-60\nFrequencies: 12, 18, 10, 10\n\nConstruct a histogram. Then, explain how you would construct the corresponding frequency polygon, including adding endpoints for zero frequency.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "To construct the histogram:\n1. Label the horizontal axis with weight intervals (40-45, 45-50, etc.) and the vertical axis with frequencies.\n2. Draw a rectangle for each interval with a width corresponding to 5 kg. The heights of the rectangles are: 12, 18, 10, and 10 respectively.\n\nTo construct the frequency polygon:\n1. Find the midpoints of each weight interval: (42.5, 47.5, 52.5, 57.5).\n2. Plot these midpoints with their corresponding frequencies (12, 18, 10, 10).\n3. Add an extra point to the left of 42.5. For the interval preceding 40-45, assume a midpoint of 37.5 with 0 frequency; similarly, add a point to the right of 57.5 at 62.5 with 0 frequency.\n4. Connect all the points with straight lines in sequence.\nThis frequency polygon now represents the continuous distribution of weights.",
    "explanation": "A histogram is built by drawing rectangles for each class interval with heights equal to their frequencies and widths representing the class width. For a frequency polygon, midpoints (class-marks) are identified and corresponding frequencies are plotted. Endpoints with zero frequency are added to ensure the polygon touches the horizontal axis, providing a complete picture of the data distribution.",
    "topic": "Histogram and Frequency Polygon",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen010"
  },
  {
    "question_text": "A school's survey recorded the birth months of 100 students. The following table represents the data (number of students born in each month):\n\nJan: 8, Feb: 7, Mar: 9, Apr: 8, May: 6, Jun: 7, Jul: 10, Aug: 12, Sep: 9, Oct: 8, Nov: 7, Dec: 9.\n\n(i) Construct a bar graph representing this data. \n(ii) Identify the month with the highest number of births and provide its frequency.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) To construct the bar graph, plot months on the x-axis with equal spacing and the number of students on the y-axis with an appropriate scale (for example, 1 unit = 1 student). Draw each bar with a height corresponding to the student count for that month. \n(ii) The month with the highest number of births is August with 12 students.",
    "explanation": "Step 1: Label the horizontal axis with the months (January to December) and label the vertical axis with numbers from 0 to at least 12. \nStep 2: Draw bars for each month with heights corresponding to: Jan (8), Feb (7), Mar (9), Apr (8), May (6), Jun (7), Jul (10), Aug (12), Sep (9), Oct (8), Nov (7), and Dec (9).\nStep 3: From the bars, August has the highest frequency (12 students).",
    "topic": "Bar Graphs",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen011"
  },
  {
    "question_text": "A teacher grouped the marks of 80 students into the following intervals with frequencies:\n\nMarks: 0–20, 20–40, 40–60, 60–80, 80–100\nFrequencies: 5, 15, 30, 20, 10\n\nCalculate the adjusted frequency for the class 0–20 if the minimum class size is considered to be 20. Then, explain how this adjustment helps in constructing an accurate histogram for data with varying class widths.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For the class 0–20, class size = 20. The adjusted frequency is calculated as (Minimum Class Size / Class Size) × Frequency. Assuming the minimum class size is 20 (which is the same as this class size), Adjusted frequency = (20/20) × 5 = 5. \nThis adjustment ensures that when class widths vary, the heights of the rectangles correctly represent frequency per unit width, so that the area (height × width) accurately reflects the actual frequency.",
    "explanation": "Step 1: Identify the minimum class size, here it is 20. \nStep 2: For the class 0–20, use the formula: Adjusted Frequency = (Minimum Class Size / Current Class Size) × Frequency = (20/20) × 5 = 5. \nStep 3: Adjustment accounts for varying class widths so that the area of the histogram (which represents frequency) is proportional across all intervals.",
    "topic": "Histogram with Varying Widths",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen012"
  },
  {
    "question_text": "In a study, the weekly cost of living index is divided into the following classes with corresponding frequencies:\n\nIndex ranges: 120–130, 130–140, 140–150, 150–160, 160–170\nFrequencies: 3, 7, 15, 10, 5\n\n(i) Calculate the class-marks for these intervals.\n(ii) Draw a frequency polygon using these class-marks and frequencies. Include the additional points for zero frequency at both ends.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Class-marks are calculated as follows:\nFor 120–130: (120+130)/2 = 125\nFor 130–140: (130+140)/2 = 135\nFor 140–150: (140+150)/2 = 145\nFor 150–160: (150+160)/2 = 155\nFor 160–170: (160+170)/2 = 165\n\n(ii) To draw the frequency polygon:\n- Plot the points (125, 3), (135, 7), (145, 15), (155, 10), (165, 5).\n- Add an extra point before 125, for the class 110–120, with midpoint 115 and frequency 0, and after 165, for the class 170–180, with midpoint 175 and frequency 0.\n- Join the points in order: (115, 0) → (125, 3) → (135, 7) → (145, 15) → (155, 10) → (165, 5) → (175, 0).",
    "explanation": "Step 1: Calculate the class-mark of each interval by averaging its endpoints. \nStep 2: Plot each (class-mark, frequency) pair on the graph. \nStep 3: Add additional points for classes preceding the first class and succeeding the last class with zero frequency; these ensure the polygon closes to the horizontal axis.\nStep 4: Connect all points with straight lines to form the frequency polygon.",
    "topic": "Frequency Polygon",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen013"
  },
  {
    "question_text": "A table shows the distribution of a city's daily temperature ranges (in °C) over a month:\n\nTemperature ranges: 10–15, 15–20, 20–25, 25–30\nFrequencies: 4, 12, 10, 4\n\nConstruct a bar graph and a histogram from this data. Discuss the main differences in constructing these two graphs and the type of data they best represent.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "To construct the bar graph:\n• Use the temperature ranges as distinct categories on the x-axis, with equal spacing regardless of interval width.\n• The y-axis represents frequencies. Draw bars for each range with heights 4, 12, 10, and 4 respectively.\n\nTo construct the histogram:\n• Treat temperature ranges as continuous intervals. The x-axis represents temperature and is marked continuously; no gaps are left between the intervals.\n• Draw rectangles with base widths equal to the interval widths (here each is 5°C) and heights corresponding to the frequencies (after confirming that the area, not just the height, represents the frequency).\n\nMain differences:\n• Bar graphs are ideal for categorical data and have gaps between bars, while histograms are used for continuous data with adjacent intervals.\n• In bar graphs, the width of the bar is not significant whereas in histograms it is essential for representing frequency density.",
    "explanation": "In constructing a bar graph, each category is separated and simply depicted with a bar whose height represents frequency. In contrast, a histogram is suited for continuous data: the intervals should be adjacent with no gaps, and the area (height × width) is proportional to the frequency. This question tests understanding of both representations, highlighting their construction and appropriate usage.",
    "topic": "Bar Graph vs. Histogram",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iemh112",
    "section_id": "01_section_12_1",
    "question_id": "cbse_ix_iemh1dd_c112_gen014"
  }
]