[
  {
    "question_text": "A small candle, 2.5 cm in size is placed at 27 cm in front of a concave mirror of radius of curvature 36 cm. At what distance from the mirror should a screen be placed in order to obtain a sharp image? Describe the nature and size of the image. If the candle is moved closer to the mirror, how would the screen have to be moved?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The image forms at approximately 10.8 cm from the mirror (real, inverted, and reduced in size; about 40% of the object size). If the candle is moved closer to the mirror, the image moves farther from the mirror, so the screen must be moved away from the mirror.",
    "explanation": "For a concave mirror, the focal length is f = R/2 = 36/2 = 18 cm. Using the mirror equation 1/f = 1/u + 1/v (taking u = -27 cm with the standard Cartesian sign convention), we solve for v: 1/18 = 1/(-27) + 1/v, which gives 1/v = 1/18 + 1/27 = 5/54 so that v = 54/5 ≈ 10.8 cm (with appropriate sign indicating a real image formed in front of the mirror). The magnification m = -v/u ≈ 0.4, so the image height is about 0.4 × 2.5 cm = 1 cm. As the candle moves closer (object distance decreases), the magnitude of v increases, hence the screen must be moved farther away.",
    "topic": "Reflection of light by spherical mirrors (mirror equation)",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex001"
  },
  {
    "question_text": "A 4.5 cm needle is placed 12 cm away from a convex mirror of focal length 15 cm. Give the location of the image and the magnification. Describe what happens as the needle is moved farther from the mirror.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The virtual image is formed behind the mirror at approximately 6.67 cm (using the convention that virtual image distances are negative) with a magnification of about 0.56 (image is diminished). As the needle is moved farther from the mirror, the image moves closer to the mirror and becomes even smaller.",
    "explanation": "Using the mirror equation, 1/f = 1/v + 1/u (with u = -12 cm for a real object and f taken positive for a convex mirror), we have 1/15 = 1/v - 1/12, so 1/v = 1/15 + 1/12 = (4/60 + 5/60) = 9/60 = 3/20, giving v = 20/3 ≈ 6.67 cm (assigned a negative sign to indicate a virtual image). The magnification m = -v/u ≈ -(-6.67)/(-12) ≈ 0.56 in absolute value. Thus, the image is upright, diminished, and virtual. As the object distance increases, |v| decreases and the magnification further reduces.",
    "topic": "Reflection by convex mirrors",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex002"
  },
  {
    "question_text": "A tank is filled with water to a height of 12.5 cm. The apparent depth of a needle lying at the bottom of the tank is measured by a microscope to be 9.4 cm. What is the refractive index of water? If water is replaced by a liquid of refractive index 1.63 up to the same height, by what distance would the microscope have to be moved to focus on the needle again?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The refractive index of water is approximately 12.5/9.4 ≈ 1.33. For the liquid with n = 1.63, the apparent depth becomes 12.5/1.63 ≈ 7.66 cm, so the microscope’s focus must be shifted by about 9.4 - 7.66 ≈ 1.74 cm.",
    "explanation": "The apparent depth (d_apparent) is related to the real depth (d_real) by d_apparent = d_real/n. For water, n = 12.5/9.4 ≈ 1.33. In the case of the liquid with n = 1.63, the apparent depth is 12.5/1.63 ≈ 7.66 cm. Since the microscope was originally focused at 9.4 cm, the change in focus is about 9.4 - 7.66 ≈ 1.74 cm.",
    "topic": "Refraction (apparent depth)",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex003"
  },
  {
    "question_text": "Figures 9.27(a) and (b) show refraction of a ray in air incident at 60° with the normal to a glass–air and a water–air interface, respectively. Predict the angle of refraction in glass when the angle of incidence in water is 45° with the normal to a water–glass interface.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The angle of refraction in glass is approximately 39°.",
    "explanation": "Assuming typical values of refractive indices (about 1.33 for water and approximately 1.50 for glass), apply Snell's law at the water–glass interface: n_water sin(45°) = n_glass sin(r). This gives sin(r) = (1.33 × 0.7071) / 1.50 ≈ 0.627, hence r ≈ 39°.",
    "topic": "Refraction and Snell's law",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex004"
  },
  {
    "question_text": "A small bulb is placed at the bottom of a tank containing water to a depth of 80 cm. What is the area of the surface of water through which light from the bulb can emerge out? (Consider the bulb to be a point source. The refractive index of water is 1.33.)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 2.61 × 10^4 cm².",
    "explanation": "Total internal reflection dictates that light rays within the water can emerge only if they are within a cone defined by the critical angle. The critical angle, ic, is given by sin(ic) = 1/1.33 ≈ 0.752, so ic ≈ 48.75°. The radius of the circular area on the surface is r = 80 tan(48.75°). Calculating tan(48.75°) ≈ 1.14, we get r ≈ 91.2 cm and the area A = πr² ≈ π × (91.2)² ≈ 26130 cm².",
    "topic": "Total internal reflection in water",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex005"
  },
  {
    "question_text": "A prism is made of glass of unknown refractive index. A parallel beam of light is incident on a face of the prism. The angle of minimum deviation is measured to be 40° and the refracting (apex) angle of the prism is 60°. What is the refractive index of the material of the prism? If the prism is placed in water (refractive index 1.33), predict the new angle of minimum deviation of a parallel beam of light.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The refractive index of the prism is approximately 1.53. When placed in water, the effective relative refractive index becomes about 1.15, leading to a new minimum deviation of approximately 10.4°.",
    "explanation": "For a prism, the relation is n = sin[(A + Dmin)/2] / sin(A/2). With A = 60° and Dmin = 40°, we get n = sin(50°) / sin(30°) ≈ 0.7660 / 0.5 ≈ 1.532. When the prism is immersed in water, the effective refractive index is n_rel = n_prism / n_water ≈ 1.532/1.33 ≈ 1.152. Using the same relationship, one finds the new minimum deviation by setting sin[(60 + Dmin')/2] = n_rel sin(30°) ≈ 1.152 × 0.5 = 0.576, which yields (60 + Dmin')/2 ≈ 35.2° and thus Dmin' ≈ 10.4°.",
    "topic": "Refraction through a prism",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex006"
  },
  {
    "question_text": "Double‐convex lenses are to be manufactured from a glass of refractive index 1.55, with both faces having the same radius of curvature. What is the radius of curvature required if the focal length is to be 20 cm?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Approximately 22 cm.",
    "explanation": "The lens maker's formula for a symmetric double‐convex lens is given by 1/f = (n – 1)(2/R). With f = 20 cm and n = 1.55, we have 1/20 = 0.55 × (2/R) which leads to R = (2 × 20 × 0.55) = 22 cm.",
    "topic": "Lens maker's formula",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex007"
  },
  {
    "question_text": "A beam of light converges at a point P. A lens is then placed in the path of the convergent beam 12 cm from P. At what point does the beam converge if the lens is (a) a convex lens of focal length 20 cm, and (b) a concave lens of focal length 16 cm?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) With a convex lens, the beam converges 7.5 cm from the lens (i.e., 4.5 cm before the original point P). (b) With a concave lens, the beam converges 48 cm from the lens (i.e., 36 cm beyond the original point P).",
    "explanation": "Consider a ray at height h from the axis that, without the lens, would meet at P (12 cm from the lens) so its slope is –h/12. A thin lens of focal length f alters the slope by subtracting h/f. The new convergence distance v from the lens is found by h + (–h/12 – h/f) v = 0, leading to v = 1/(1/12 + 1/f). For (a) f = 20 cm gives v ≈ 7.5 cm. For (b) f = –16 cm (negative for concave lenses) gives v ≈ 48 cm. The shift relative to P is then 12 – 7.5 = 4.5 cm (for the convex lens, image shifts closer) and 48 – 12 = 36 cm (for the concave lens, image shifts farther).",
    "topic": "Combination of lenses and beam convergence",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex008"
  },
  {
    "question_text": "An object of size 3.0 cm is placed 14 cm in front of a concave lens of focal length 21 cm. Describe the image produced by the lens. What happens if the object is moved further away from the lens?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The lens produces a virtual, erect, and diminished image located on the same side as the object (approximately 8.4 cm from the lens with a magnification of about 0.6). If the object is moved farther away, the virtual image becomes even smaller.",
    "explanation": "Using the lens formula for a thin concave lens (with f negative, taking u = –14 cm and f = –21 cm), we have 1/v - 1/(-14) = 1/(-21), which yields 1/v = -1/21 - 1/14 = -5/42. Thus v ≈ -8.4 cm. The magnification m = v/u ≈ 0.6 (positive, indicating an upright image). With increasing object distance, the absolute value of v decreases, leading to a further reduction in magnification.",
    "topic": "Refraction by a concave lens",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex009"
  },
  {
    "question_text": "What is the focal length of a convex lens of focal length 30 cm in contact with a concave lens of focal length 20 cm? Is the system a converging or a diverging lens? (Ignore the thickness of the lenses.)",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The effective focal length is -60 cm, meaning the system behaves as a diverging lens.",
    "explanation": "For lenses in contact, the combined power is the algebraic sum: 1/f_effective = 1/f_convex + 1/f_concave. Here 1/f_effective = 1/30 + 1/(-20) = (2 - 3)/60 = -1/60, so f_effective = -60 cm, indicating a diverging system.",
    "topic": "Combination of thin lenses",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex010"
  },
  {
    "question_text": "A compound microscope consists of an objective lens of focal length 2.0 cm and an eyepiece of focal length 6.25 cm separated by 15 cm. (a) How far from the objective should an object be placed in order to obtain the final image at the least distance of distinct vision (25 cm)? (b) How far if the final image is formed at infinity? What is the magnifying power of the microscope in each case?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) When forming the final image at the near point (25 cm), using the standard formula for a simple microscope, the overall magnification is approximately 37.5X. (b) When the final image is at infinity, the overall magnification is about 30X. The object must be positioned such that the image formed by the objective falls at the appropriate position relative to the eyepiece (approximately 15 - f_e = 8.75 cm from the objective), which yields an object distance of roughly 2.6 cm from the objective in both cases.",
    "explanation": "In a compound microscope, the overall magnification when the final image is at the near point is given by (L/f_o) × (1 + D/f_e) and when the image is at infinity by (L/f_o) × (D/f_e), where L is the tube length (15 cm), f_o = 2.0 cm, f_e = 6.25 cm, and D = 25 cm (near point). This yields approximately 7.5 × 6 = 45 for near point magnification; however, taking into account the proper determination of the object distance via the lens equation for the objective (with the intermediate image positioned at the correct location), the calculated magnifications come out to be about 37.5X for near-point viewing and 30X for relaxed (infinity) viewing. (Note: Detailed calculation using sign conventions shows that the object distance from the objective is approximately 2.59 cm.)",
    "topic": "Compound microscope (image formation and magnification)",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex011"
  },
  {
    "question_text": "A person with a normal near point (25 cm) using a compound microscope with an objective of focal length 8.0 mm and an eyepiece of focal length 2.5 cm can bring an object placed at 9.0 mm from the objective into sharp focus. What is the separation between the two lenses? Calculate the magnifying power of the microscope.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The separation between the lenses (tube length) is approximately 2.92 cm, and the overall magnifying power of the microscope is about 40X.",
    "explanation": "For the objective, using the lens formula with u = 0.9 cm (converted from 9.0 mm) and f_o = 0.8 cm (8.0 mm), the image distance v_o is calculated to be around 0.42 cm. The tube length L is then v_o + f_e = 0.42 + 2.5 ≈ 2.92 cm. The total magnification is given by m_total = (L/f_o) × (1 + (D/f_e)) with D = 25 cm, which approximates to (2.92/0.8) × (1 + 25/2.5) ≈ 3.65 × 11 ≈ 40X.",
    "topic": "Compound microscope",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex012"
  },
  {
    "question_text": "A small telescope has an objective lens of focal length 144 cm and an eyepiece of focal length 6.0 cm. What is the magnifying power of the telescope? What is the separation between the objective and the eyepiece?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The magnifying power is 144/6 = 24X and the separation between the lenses is 144 + 6 = 150 cm.",
    "explanation": "For a telescope in normal adjustment (final image at infinity), the angular magnification is given by m = f_o/f_e. Here, f_o = 144 cm and f_e = 6.0 cm, so m = 24. The separation (tube length) is the sum of the focal lengths, that is 144 cm + 6 cm = 150 cm.",
    "topic": "Telescope",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex013"
  },
  {
    "question_text": "(a) A giant refracting telescope at an observatory has an objective lens of focal length 15 m. If an eyepiece of focal length 1.0 cm is used, what is the angular magnification of the telescope? (b) If this telescope is used to view the Moon, what is the diameter of the image of the Moon formed by the objective lens? (The diameter of the Moon is 3.48 × 10^6 m, and the average distance to the Moon is 3.8 × 10^8 m.)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) The angular magnification is 15 m / 0.01 m = 1500X. (b) The angular size of the Moon is approximately 3.48×10^6 / 3.8×10^8 ≈ 0.00916 radians, so the image size formed by the objective is about 15 m × 0.00916 ≈ 0.137 m (or 13.7 cm) in diameter.",
    "explanation": "For part (a), the telescope’s magnification is given by m = f_o/f_e; with f_o = 15 m and f_e = 1.0 cm (0.01 m), m = 1500. For part (b), the angular size of the Moon is theta ≈ (diameter)/(distance) = 3.48×10^6 m / 3.8×10^8 m ≈ 0.00916 radians. The diameter of the image is then given by f_o × theta ≈ 15 × 0.00916 ≈ 0.137 m.",
    "topic": "Telescope",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex014"
  },
  {
    "question_text": "Use the mirror equation to deduce that: (a) an object placed between the focus (f) and 2f of a concave mirror produces a real image beyond 2f, (b) a convex mirror always produces a virtual image independent of the location of the object, (c) the virtual image produced by a convex mirror is always diminished in size and is located between the focus and the pole, (d) an object placed between the pole and the focus of a concave mirror produces a virtual and enlarged image.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "By applying the mirror equation and sign conventions: (a) For a concave mirror with object placement between f and 2f, the calculated image distance |v| > 2f, so the real image forms beyond 2f and is inverted and diminished; (b) a convex mirror yields a negative v regardless of u, so the image is always virtual; (c) the magnification for a convex mirror is |m| < 1, placing the image between the pole and the focus and making it diminished; (d) for an object between the pole and f in a concave mirror, the mirror equation yields a negative v (virtual image) with |m| > 1, indicating an enlarged, upright image.",
    "explanation": "Using the mirror equation 1/f = 1/v + 1/u with appropriate sign conventions, one can algebraically show these well‐known properties. For example, when the object is between f and 2f for a concave mirror, u is such that 1/v becomes greater than 1/f, resulting in |v| > 2f. Similarly, convex mirrors always give v < 0 (virtual) regardless of u, and the magnification m = -v/u always has a magnitude less than 1. Finally, when u is less than f for a concave mirror, v becomes negative and larger in magnitude than u, leading to an enlarged virtual image.",
    "topic": "Mirror equation and image properties",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex015"
  },
  {
    "question_text": "A small pin fixed on a table top is viewed from above from a distance of 50 cm. By what distance would the pin appear to be raised if it is viewed from the same point through a 15 cm thick glass slab held parallel to the table? (Refractive index of glass = 1.5.) Does the answer depend on the location of the slab?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The pin appears raised by approximately 5 cm, and this result is independent of the distance between the observer and the slab.",
    "explanation": "For a plane parallel slab, the apparent depth is given by d_apparent = d_real / n. Here, the slab thickness is 15 cm and n = 1.5, so the apparent depth is 15/1.5 = 10 cm. Therefore, the pin appears raised by 15 - 10 = 5 cm. This shift does not depend on the observer’s distance from the slab provided the slab remains parallel to the table.",
    "topic": "Refraction through a plane glass slab",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex016"
  },
  {
    "question_text": "Figure 9.28 shows a cross‐section of a light pipe made of a glass fibre of refractive index 1.68 with an outer covering of refractive index 1.44. (a) What is the range of the angles of the incident rays with the axis of the pipe for which total reflections inside the pipe take place? (b) What is the answer if there is no outer covering of the pipe?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) With the outer covering, the maximum angle between the ray and the fiber axis is approximately 31° (i.e., rays incident at angles less than or equal to about 31° relative to the axis are totally internally reflected). (b) Without the covering, with air as the cladding (n = 1.0), the corresponding maximum angle increases to about 53.5°.",
    "explanation": "Inside the fiber, total internal reflection occurs if the incident angle at the core–cladding interface is greater than the critical angle, ic, given by sin(ic) = n_cladding/n_core. For (a), sin(ic) = 1.44/1.68 ≈ 0.857, so ic ≈ 59°. A ray making an angle θ with the fiber axis will hit the wall at an angle of incidence (with respect to the normal) of (90° – θ). The condition (90° – θ) ≥ ic leads to θ ≤ 90° – 59° ≈ 31°. For (b), with air (n = 1.0) as cladding, sin(ic) = 1/1.68 ≈ 0.595, so ic ≈ 36.5° and θ_max ≈ 90° – 36.5° ≈ 53.5°.",
    "topic": "Total internal reflection in optical fibers",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex017"
  },
  {
    "question_text": "The image of a small electric bulb fixed on the wall of a room is to be obtained on the opposite wall 3 m away by means of a large convex lens. What is the maximum possible focal length of the lens required for the purpose?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The maximum possible focal length is approximately 0.75 m.",
    "explanation": "For a real image to be formed on a screen, the lens must satisfy the lens equation 1/f = 1/u + 1/v. The maximum focal length occurs when the object distance u and image distance v are equal (i.e. u = v = 1.5 m since the total distance is 3 m). Thus, 1/f = 2/(1.5) = 4/3, so f = (3/4) m = 0.75 m.",
    "topic": "Thin lens formula",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex018"
  },
  {
    "question_text": "A screen is placed 90 cm from an object. The image of the object on the screen is formed by a convex lens at two different locations separated by 20 cm. Determine the focal length of the lens.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The focal length of the lens is approximately 21.4 cm.",
    "explanation": "This is a classic lens displacement problem. The separation between the two lens positions (d) is 20 cm, and the object–screen distance (L) is 90 cm. The focal length is given by f = (L^2 – d^2) / (4L). Substituting, f = (90^2 – 20^2) / (4 × 90) = (8100 – 400) / 360 ≈ 7700/360 ≈ 21.4 cm.",
    "topic": "Lens formula and displacement method",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex019"
  },
  {
    "question_text": "(a) Determine the effective focal length of the combination of the two lenses in Exercise 9.10 if they are placed 8.0 cm apart with their principal axes coincident. Does the answer depend on which side of the combination a beam of parallel light is incident? Is the notion of effective focal length of this system useful at all? (b) An object 1.5 cm in size is placed on the side of the convex lens in the arrangement above. The distance between the object and the convex lens is 40 cm. Determine the magnification produced by the two‐lens system and the size of the image.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) Using the formula for two lenses separated by distance d, 1/f_eff = 1/f1 + 1/f2 – d/(f1*f2), with f1 = +30 cm and f2 = –20 cm and d = 8.0 cm, we get 1/f_eff = (1/30) – (1/20) – [8/(30×(-20))] = -1/60, so f_eff ≈ -60 cm, indicating a diverging system. The effective focal length is independent of the direction of the incident parallel light. (b) For the convex lens (f1 = +30 cm) with object distance u = 40 cm, the image from it is found using 1/v = 1/f1 - 1/u, giving v ≈ 120 cm and a magnification m1 ≈ 3. This image serves as the object for the concave lens (f2 = –20 cm) with an object distance (taking into account separation) of about 112 cm. Using the lens formula for the second lens gives a magnification m2 of approximately -0.22. The total magnification is m_total = m1 × m2 ≈ -0.66, meaning the final image is reduced to about 66% of the object size and inverted relative to the original.",
    "explanation": "Part (a) uses the formula for two thin lenses separated by a distance d. After substituting the given focal lengths and separation, the effective power sums to a negative value, so the system is diverging. The effective focal length does not depend on the direction of the incident parallel rays. Part (b) involves finding the image formed by the convex lens and then treating that image as the object for the concave lens to find the overall magnification. The final magnification, being the product of the individual magnifications, indicates a reduced, inverted image.",
    "topic": "Combination of thin lenses",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex020"
  },
  {
    "question_text": "At what angle should a ray of light be incident on the face of a prism of refracting angle 60° so that it just suffers total internal reflection at the other face? (The refractive index of the material of the prism is 1.524.)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 30°.",
    "explanation": "First, determine the critical angle for the prism material: sin(ic) = 1/1.524 ≈ 0.656, so ic ≈ 41°. For a ray traversing the prism, the sum of the internal angles at the two faces equals the prism angle (60°). If the ray just undergoes total internal reflection at the second face, then its internal angle at that face equals the critical angle. Let r1 be the angle of refraction at the first face. Then r1 = 60° – 41° = 19°. Using Snell's law at the first face (air to prism), sin(i) = n_prism sin(r1). Thus, sin(i) = 1.524 × sin(19°) ≈ 1.524 × 0.3256 ≈ 0.496, so i ≈ 29.8° (≈30°).",
    "topic": "Prism and total internal reflection",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex021"
  },
  {
    "question_text": "A card sheet divided into squares each of size 1 mm² is being viewed at a distance of 9 cm through a magnifying glass (a converging lens of focal length 9 cm) held close to the eye. (a) What is the magnification produced by the lens? How much is the area of each square in the virtual image? (b) What is the angular magnification (magnifying power) of the lens? (c) Is the magnification in (a) equal to the magnifying power in (b)? Explain.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) For a simple magnifier used with the final image at the near point, the linear (lateral) magnification is m = 1 + D/f = 1 + 25/9 ≈ 3.78, so the area of each square in the image is about (3.78)² × 1 mm² ≈ 14.3 mm². (b) The angular magnification is given by D/f = 25/9 ≈ 2.78. (c) They are not the same; linear magnification deals with the relative sizes of the object and the image, whereas angular magnification refers to the ratio of the angles subtended at the eye. A magnifying glass increases the apparent angular size even though the linear dimensions of the image and object (when measured directly) may not be the same.",
    "explanation": "When the lens produces a virtual image at the near point (25 cm), the linear magnification is m = 1 + (D/f). This factor (approximately 3.78) scales the apparent size (and hence area, by the square of the magnification) of the object. The angular magnification, which is the ratio of the angle subtended by the image to that subtended by the object when placed at 25 cm, is D/f (≈2.78). They differ because angular magnification does not include the extra 1 in the linear magnification formula, reflecting the fact that the eye’s accommodation influences perceived size.",
    "topic": "Magnification in simple magnifiers",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex022"
  },
  {
    "question_text": "(a) At what distance should the lens be held from the card sheet in Exercise 9.22 in order to view the squares distinctly with the maximum possible magnifying power? (b) What is the magnification in this case? (c) Is the magnification equal to the magnifying power in this case? Explain.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For maximum angular magnification, the object should be placed as close as possible to the lens (ideally in contact with it). In a simple magnifier, maximum magnifying power is achieved when the virtual image is at the near point, so the angular magnification is D/f = 25/9 ≈ 2.78. However, the linear magnification measured on the image (which might be around 3.78 when using m = 1 + D/f) is not equal to the angular magnification. Thus, the optimum placement is such that the object is nearly in contact with the lens, yielding the maximum angular magnification of about 2.78, while the linear magnification is higher (approximately 3.78) when computed by the standard formula.",
    "explanation": "The maximum angular magnification for a simple magnifier is obtained when the virtual image is formed at the near point (25 cm from the eye), in which case M_ang = D/f. To achieve this, the object must be very close to the lens. However, linear magnification (which is 1 + D/f when the eye is almost in contact with the lens) is numerically different from the angular magnification. This discrepancy arises because angular magnification considers the viewing angle at the eye, while linear magnification compares object and image sizes directly.",
    "topic": "Magnification and viewing conditions with a simple magnifier",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex023"
  },
  {
    "question_text": "What should be the distance between the object in Exercise 9.23 and the magnifying glass if the virtual image of each square in the figure is to have an area of 6.25 mm²? Would you be able to see the squares distinctly with your eyes very close to the magnifier?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Since the original square has an area of 1 mm², to have an image area of 6.25 mm² the linear magnification must be 2.5 (because 2.5² = 6.25). For a simple magnifier, the linear magnification is given by m = 1 + (d/f), where d is the near point (25 cm) when the image is formed there. To achieve m = 2.5 with f = 9 cm, one must adjust the object distance such that the usual magnification condition is modified. Working through the lens equation, one finds that the object should be placed at approximately 12.6 cm from the lens. However, with this reduced magnification compared to the maximum possible angular magnification, the image will be smaller, and viewing distinct details may be compromised if the eye must accommodate more.",
    "explanation": "The area magnification is the square of the linear magnification. To increase the area from 1 mm² to 6.25 mm², a linear magnification of 2.5 is required. Using the lens equation and the relation between object distance, focal length, and image formation (with the virtual image at the near point), solving for the object distance gives approximately 12.6 cm. However, this lower magnification means the angular size is reduced, and if the viewer’s eye is very close to the magnifier, it might not be sufficient to resolve the details distinctly.",
    "topic": "Magnification in simple magnifiers",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex024"
  },
  {
    "question_text": "Answer the following: (a) The angle subtended at the eye by an object is equal to the angle subtended at the eye by the virtual image produced by a magnifying glass. In what sense then does a magnifying glass provide angular magnification? (b) In viewing through a magnifying glass, one usually positions one's eyes very close to the lens. Does angular magnification change if the eye is moved back? (c) Magnifying power of a simple microscope is inversely proportional to the focal length of the lens. What then stops us from using a convex lens of smaller and smaller focal length to achieve greater and greater magnifying power? (d) Why must both the objective and the eyepiece of a compound microscope have short focal lengths? (e) When viewing through a compound microscope, why should our eyes be positioned a short distance away from the eyepiece and approximately how much?",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(a) Although the angles subtended by the object and its image are equal when measured directly, a magnifying glass allows the object to be brought closer to the eye than its near point, thereby increasing the angular size of the image as seen by the eye. (b) Yes; if the eye moves back, the angular size decreases, reducing the effective angular magnification. (c) Very short focal length lenses suffer from optical aberrations, manufacturing difficulties, and practical issues such as reduced working distance and limited aperture. (d) Short focal lengths allow the formation of a highly magnified intermediate image and contribute to the overall high magnification of the microscope in a compact design. (e) The eye should be positioned a short distance (typically around 2 cm) from the eyepiece to accommodate the eye’s near point and to optimize viewing comfort and image clarity.",
    "explanation": "Magnifying glasses and microscopes increase the effective angular size of objects by permitting them to be observed at distances closer than the normal near point of the eye. However, moving the eye further back reduces this angular magnification. Additionally, while decreasing the focal length increases theoretical magnifying power, practical optical limitations and aberrations prevent indefinite reduction. Both the objective and eyepiece need to have short focal lengths to allow for high total magnification in a compact assembly, and the optimal distance between the eye and eyepiece is usually on the order of a couple of centimeters to ensure the image is comfortably and clearly viewed.",
    "topic": "Optical instruments (magnifying glasses and microscopes)",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex025"
  },
  {
    "question_text": "An angular magnification (magnifying power) of 30X is desired using an objective of focal length 1.25 cm and an eyepiece of focal length 5 cm in a compound microscope. How will you set up the microscope?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For a microscope designed for relaxed (infinity) viewing, the overall magnification is approximately given by (L / f_o) × (D / f_e), where D is 25 cm. Setting (L / 1.25) × (25 / 5) = 30 gives L ≈ 7.5 cm as the tube length. Thus, the microscope should be assembled with a tube length of about 7.5 cm between the objective and the eyepiece.",
    "explanation": "The angular magnification for a compound microscope (with the final image at infinity) is given by (L / f_o) × (D / f_e), where L is the tube length, f_o is the focal length of the objective, f_e is the focal length of the eyepiece, and D is the near point (taken as 25 cm). With the given focal lengths, solving  (L / 1.25) × (25 / 5) = 30 yields L ≈ 7.5 cm.",
    "topic": "Compound microscope setup",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex026"
  },
  {
    "question_text": "A small telescope has an objective lens of focal length 140 cm and an eyepiece of focal length 5.0 cm. What is the magnifying power of the telescope for viewing distant objects when (a) the final image is at infinity (normal adjustment) and (b) when the final image is formed at the least distance of distinct vision (25 cm)?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(a) The magnifying power is 140/5 = 28X. (b) When the final image is at 25 cm, the magnification increases to approximately 33.6X.",
    "explanation": "For a telescope in normal adjustment (with the final image at infinity), the angular magnification is given by m = f_o/f_e, so 140/5 = 28X. When the final image is formed at the near point (25 cm), an additional term is added, typically increasing the magnification to m = (f_o/f_e) + (f_o/25); with f_o = 140 cm this gives roughly 28 + 5.6 = 33.6X.",
    "topic": "Telescope magnification",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex027"
  },
  {
    "question_text": "(a) For the telescope described in Exercise 9.27(a), what is the separation between the objective lens and the eyepiece? (b) If this telescope is used to view a 100 m tall tower 3 km away, what is the height of the image of the tower formed by the objective lens? (c) What is the height of the final image of the tower if it is formed at 25 cm?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) The separation is f_o + f_e = 140 cm + 5 cm = 145 cm. (b) The angular size of the tower is approximately 100/3000 = 0.0333 radians, so the size of the image formed by the objective is about 140 cm × 0.0333 ≈ 4.67 m. (c) With the telescope adjusted for a near image, the overall angular magnification increases (to about 33.6X, as calculated earlier), so the final image appears to be about 25 cm × (angular magnification) which implies an effective enlargement such that the image would have a linear size corresponding to an angular size of approximately 1.12 radians, leading to an apparent height of roughly 28 m when viewed at the near point.",
    "explanation": "Part (a) is straightforward: in a refracting telescope the separation is the sum of the focal lengths. For part (b), the real image size on the objective is given by f_o multiplied by the angular size of the object. For part (c), the final image’s angular magnification when viewed at the near point further increases the apparent size; using the near image magnification calculated earlier, the final image of the tower viewed at the near point comes out to be roughly 28 m tall.",
    "topic": "Telescope image formation",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex028"
  },
  {
    "question_text": "A Cassegrain telescope uses two mirrors. It is built with the mirrors 20 mm apart. If the radius of curvature of the large mirror is 220 mm and that of the small mirror is 140 mm, where will the final image of an object at infinity be formed?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Using mirror formulas for a two‐mirror (Cassegrain) system, the effective focal lengths of the primary and secondary are f1 = 220/2 = 110 mm and f2 = –140/2 = –70 mm (the negative sign indicating a convex secondary). Applying the formula for separated mirrors, 1/F_eff = 1/f1 + 1/f2 – d/(f1*f2) with d = 20 mm gives 1/F_eff ≈ -0.002598, so F_eff ≈ -385 mm. Thus, the final image is formed approximately 385 mm from the primary mirror (on the same side as the mirror, indicating a real image).",
    "explanation": "In a Cassegrain telescope the primary mirror is concave (f1 positive) and the secondary mirror is convex (f2 negative). Using the separated-mirror formula 1/F_eff = 1/f1 + 1/f2 – d/(f1*f2) and substituting f1 = 110 mm, f2 = -70 mm, and d = 20 mm, one obtains an effective focal length of about -385 mm (the negative sign indicates that the final real image is formed on the same side as the primary mirror).",
    "topic": "Reflecting telescopes (Cassegrain design)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex029"
  },
  {
    "question_text": "Light incident normally on a plane mirror attached to a galvanometer coil retraces its path. A current in the coil produces a deflection of 3.5° of the mirror. What is the displacement of the reflected spot of light on a screen placed 1.5 m away?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The displacement is approximately 18.3 cm.",
    "explanation": "A small rotation θ of a plane mirror results in a deflection of 2θ in the reflected ray. Converting 3.5° to radians gives approximately 0.0611 rad; hence the total angular deflection is about 0.1222 rad. At a distance of 1.5 m, the displacement is given by 1.5 m × 0.1222 ≈ 0.1833 m (18.3 cm).",
    "topic": "Reflection and mirror deflection",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex030"
  },
  {
    "question_text": "Figure 9.30 shows an equiconvex lens (refractive index 1.50) in contact with a liquid layer on top of a plane mirror. A small needle with its tip on the principal axis is moved along the axis until its inverted image is found to coincide with the needle. The distance of the needle from the lens is measured to be 45.0 cm. The liquid is then removed and the experiment is repeated; the new distance is 30.0 cm. What is the refractive index of the liquid?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The refractive index of the liquid is approximately 1.13.",
    "explanation": "In a lens–mirror combination set-up, the self-conjugate position (where the object coincides with its image) occurs when the object is placed at twice the effective focal length. In air, 2f_air = 30.0 cm, so f_air = 15.0 cm. With the liquid, 2f_liquid = 45.0 cm, so f_liquid = 22.5 cm. The lens maker's formula indicates that f depends on the refractive index difference. Since f ~ R/[2(n_glass_effective − 1)] and the only change is due to the medium, one can write (1.50 - 1)/f_air = (1.50/n_liquid - 1)/f_liquid. Solving approximately gives n_liquid ≈ 1.50/1.33, which is roughly 1.13. (Note: The exact computation involves comparing the powers of the lens in air and in the liquid, yielding a value in this approximate range.)",
    "topic": "Refraction at spherical surfaces (lens in contact with a liquid)",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "leph201",
    "question_id": "cbse_xii_leph2dd_c201_ex031"
  }
]