[
  {
    "question_text": "Which device, used before the discovery of the transistor in 1948, controls the electron flow using a heated cathode in a vacuum?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Vacuum Tube",
      "Semiconductor Diode",
      "Bipolar Junction Transistor",
      "Resistor"
    ],
    "correct_answer": "Vacuum Tube",
    "explanation": "Vacuum tubes are devices in which an electron flow is controlled by a heated cathode and the electrons flow through a vacuum. This was common before the invention of the transistor.",
    "topic": "Vacuum Tubes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen001"
  },
  {
    "question_text": "In a vacuum tube, which electrode emits electrons when heated?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Plate",
      "Cathode",
      "Grid",
      "Anode"
    ],
    "correct_answer": "Cathode",
    "explanation": "The cathode in a vacuum tube is heated to supply electrons, making it the source from which electron flow originates.",
    "topic": "Vacuum Tubes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen002"
  },
  {
    "question_text": "Why is a vacuum necessary within a vacuum tube?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It increases the electrical resistance between electrodes",
      "It prevents electrons from losing energy due to collisions with air molecules",
      "It reduces the overall power consumption",
      "It ensures that the electrons flow from anode to cathode"
    ],
    "correct_answer": "It prevents electrons from losing energy due to collisions with air molecules",
    "explanation": "A vacuum is needed in a vacuum tube to eliminate air molecules that can interfere with the electron flow, causing energy loss due to collisions.",
    "topic": "Electron Flow in Vacuum Tubes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen003"
  },
  {
    "question_text": "Which naturally occurring crystal, when used with a metal point contact, was employed as a detector for radio waves?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Silicon",
      "Germanium",
      "Galena (Lead sulphide)",
      "Diamond"
    ],
    "correct_answer": "Galena (Lead sulphide)",
    "explanation": "Galena (PbS) was used as a detector of radio waves in early semiconductor applications by using a metal point contact.",
    "topic": "Semiconductor Detectors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen004"
  },
  {
    "question_text": "Compared to vacuum tubes, solid-state semiconductor devices are known for which of the following advantages?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Bulky construction and high power consumption",
      "Compact size, low power consumption, and high reliability",
      "Requirement of high operating voltages",
      "Short operational life"
    ],
    "correct_answer": "Compact size, low power consumption, and high reliability",
    "explanation": "Solid-state semiconductor devices operate within the solid itself, which eliminates the need for a heated cathode and an evacuated space. They are therefore small, efficient, and long-lasting compared to vacuum tubes.",
    "topic": "Semiconductor Devices vs. Vacuum Tubes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen005"
  },
  {
    "question_text": "Explain why a vacuum is necessary inside a vacuum tube.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A vacuum is necessary to prevent electrons from colliding with air molecules, which would cause energy loss and inefficient operation.",
    "explanation": "In the absence of a vacuum, air molecules would collide with the moving electrons, causing them to lose energy. This would diminish the device's performance. The vacuum ensures that electrons travel unimpeded from the cathode to the anode.",
    "topic": "Vacuum Requirement in Tubes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen006"
  },
  {
    "question_text": "Describe the main advantages semiconductor devices have over vacuum tubes.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Semiconductor devices are small in size, consume low power, operate at low voltages, have long operational life, and are highly reliable as they do not require heating or evacuation.",
    "explanation": "Semiconductor devices function within the solid state itself without the need for a heated cathode or a vacuum. This leads to several benefits including lower power consumption, reduced size, and increased reliability and lifespan compared to vacuum tubes.",
    "topic": "Semiconductor Devices",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen007"
  },
  {
    "question_text": "What early discovery in the 1930s paved the way for semiconductor electronics?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It was discovered that some solid-state semiconductors and their junctions could control both the number and the direction of charge carriers.",
    "explanation": "The observation that minor excitations like heat, light, or a small voltage could alter the mobile charge carrier concentration in semiconductors led to the development of semiconductor electronics, marking a significant innovation beyond vacuum tube technology.",
    "topic": "Semiconductor Discovery",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen008"
  },
  {
    "question_text": "Identify two significant limitations of vacuum tubes as mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Vacuum tubes are bulky and consume high power; they also typically operate at high voltages and have limited operational life along with low reliability.",
    "explanation": "The text highlights that vacuum tubes have several drawbacks including their large size, high power consumption, high voltage operation, short lifespan, and limited reliability, which ultimately led to the development of semiconductor devices.",
    "topic": "Limitations of Vacuum Tubes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen009"
  },
  {
    "question_text": "Compare and contrast the structure and operation of vacuum tubes and semiconductor devices. In your answer, discuss why there was a significant shift from vacuum tubes to semiconductor technology.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Vacuum tubes rely on a heated cathode and operate in a vacuum to control electron flow between electrodes, making them bulky and power-intensive. In contrast, semiconductor devices control the flow of charge carriers within a solid material without the need for heating or a vacuum. This fundamental difference results in semiconductor devices being much smaller, more energy-efficient, and more reliable, prompting the shift away from vacuum tubes.",
    "explanation": "Vacuum tubes require an evacuated space and a heated cathode which increases size and power consumption, and reduces lifespan. Semiconductors, by operating within the solid state, eliminate these requirements, enabling miniaturization, low-voltage operation, lower power consumption, and improved reliability. These advantages were key drivers for transitioning to semiconductor technology.",
    "topic": "Vacuum Tubes vs. Semiconductor Devices",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen010"
  },
  {
    "question_text": "Discuss the role of the galena crystal in the early development of semiconductor technology. How did its use as a radio wave detector influence later advancements?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The galena crystal, naturally occurring as lead sulphide (PbS), was used as a radio wave detector by employing a metal point contact. This early application demonstrated that solid materials could control the flow of charge carriers, laying the groundwork for the development of semiconductor devices. Its success encouraged further exploration into solid-state physics, eventually leading to the discovery of devices like junction diodes and transistors.",
    "explanation": "The use of the galena crystal illustrated the potential of solid-state materials in electronic applications. By detecting radio waves, it showed that minor excitations could modulate charge carrier concentration—a principle that is fundamental to modern semiconductor devices. This early success spurred additional research and innovation in the field, paving the way for more complex semiconductor devices.",
    "topic": "Evolution of Semiconductor Devices",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen011"
  },
  {
    "question_text": "True or False: In a vacuum diode, electrons flow from the anode to the cathode.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In a vacuum diode, electrons are emitted from the heated cathode and flow towards the anode, not the other way around.",
    "topic": "Electron Flow in Vacuum Tubes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen012"
  },
  {
    "question_text": "True or False: Solid-state semiconductor devices operate by controlling the supply and flow of charge carriers within the solid itself, without the need for an evacuated space or external heating.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Unlike vacuum tubes, semiconductor devices control the flow of charge carriers within the solid state and do not require a vacuum or heated cathodes for operation.",
    "topic": "Semiconductor Devices",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen013"
  },
  {
    "question_text": "A vacuum tube operates at 100 V. If the operating voltage is decreased by 50%, what is the new operating voltage?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "50 V",
    "explanation": "A 50% decrease from 100 V results in 100 V x 0.5 = 50 V.",
    "topic": "Vacuum Tube Operation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen014"
  },
  {
    "question_text": "Calculate the energy supplied by a vacuum tube operating at 100 V when a single electron (charge = 1.6 x 10^-19 C) is emitted. Express your answer in joules.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1.6 x 10^-17 joules",
    "explanation": "The energy given to one electron is calculated using the formula E = V x e. Substituting V = 100 V and e = 1.6 x 10^-19 C, we get 100 x 1.6 x 10^-19 = 1.6 x 10^-17 joules.",
    "topic": "Energy in Vacuum Tubes",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen015"
  },
  {
    "question_text": "A semiconductor device operates at 5 V, while a vacuum tube operates at 100 V. If a process involves 1000 electrons passing through each device every second, calculate and compare the energy consumed per second by each device. Use the electron charge of 1.6 x 10^-19 C.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Vacuum tube consumes 1.6 x 10^-14 J/s; Semiconductor device consumes 8 x 10^-16 J/s",
    "explanation": "For the vacuum tube: Energy per second = 100 V x (1000 electrons x 1.6 x 10^-19 C/electron) = 100 x 1.6 x 10^-16 = 1.6 x 10^-14 joules per second. For the semiconductor device: Energy per second = 5 V x (1000 x 1.6 x 10^-19) = 5 x 1.6 x 10^-16 = 8 x 10^-16 joules per second. Thus, the vacuum tube uses 20 times more energy per second than the semiconductor device.",
    "topic": "Energy Consumption Comparison",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen016"
  },
  {
    "question_text": "In a vacuum tube device, the gap between the cathode and the anode is 2 cm and a voltage of 100 V is applied across them. Assuming an electron is released from rest, estimate the time it takes for the electron to reach the anode. Use the electron charge 1.6 x 10^-19 C, electron mass 9.1 x 10^-31 kg, and the equation d = 0.5 x a x t^2 where a = (e x V/d)/m.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 6.75 x 10^-9 seconds",
    "explanation": "First, calculate the electric field: E = V/d = 100 V / 0.02 m = 5000 V/m. Then compute the acceleration: a = (e x E) / m = (1.6 x 10^-19 C x 5000 V/m) / (9.1 x 10^-31 kg) ≈ 8.79 x 10^14 m/s^2. Using d = 0.5 x a x t^2 with d = 0.02 m, solve for t: t = sqrt((2 x d)/a) = sqrt((0.04)/8.79 x 10^14) ≈ sqrt(4.55 x 10^-17) ≈ 6.75 x 10^-9 s.",
    "topic": "Electron Motion in Vacuum Tubes",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph206",
    "section_id": "02_section_14_1",
    "question_id": "cbse_xii_leph2dd_c206_gen017"
  }
]