[
  {
    "question_text": "According to Bohr's model, what carries away the energy difference when an electron transitions from a higher to a lower energy level?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Photon",
      "B: Electron",
      "C: Neutron",
      "D: Proton"
    ],
    "correct_answer": "A: Photon",
    "explanation": "In Bohr's model, when an electron jumps from a higher to a lower energy level, the energy difference is carried away by a photon. This is expressed by the equation hv = E_ni - E_nf.",
    "topic": "Electron transitions and photon emission",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen075"
  },
  {
    "question_text": "Which of the following equations correctly represents the energy difference involved in an electron transition in a hydrogen atom?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: hv = E_nf - E_ni",
      "B: hv = E_ni - E_nf",
      "C: hv = E_ni + E_nf",
      "D: hv = E_ni × E_nf"
    ],
    "correct_answer": "B: hv = E_ni - E_nf",
    "explanation": "The correct expression is hv = E_ni - E_nf, where E_ni is the energy of the initial higher level and E_nf is the energy of the final lower level.",
    "topic": "Energy transition equation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen076"
  },
  {
    "question_text": "What happens when an atom absorbs a photon whose energy exactly matches the energy required for an electron to transition to a higher energy state?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: The electron emits a photon and jumps to a lower energy state",
      "B: The atom produces dark absorption lines in the spectrum",
      "C: The electron is ejected from the atom",
      "D: The atom becomes fully ionized"
    ],
    "correct_answer": "B: The atom produces dark absorption lines in the spectrum",
    "explanation": "When an atom absorbs a photon of the exact energy required for the transition, the photon is absorbed and the electron moves to a higher energy state, leaving dark absorption lines in the continuous spectrum.",
    "topic": "Absorption and spectral lines",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen077"
  },
  {
    "question_text": "Which postulate of Bohr's model directly explains the discrete line spectra observed in the hydrogen atom?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A: The first postulate",
      "B: The second postulate",
      "C: The third postulate",
      "D: The zeroth postulate"
    ],
    "correct_answer": "C: The third postulate",
    "explanation": "The third postulate of Bohr's model states that the energy difference between quantized levels is emitted or absorbed as a photon, which directly explains the discrete line spectra.",
    "topic": "Bohr's postulates and discrete spectra",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen078"
  },
  {
    "question_text": "What type of spectral lines are produced when electrons in a hydrogen atom transition from higher to lower energy levels?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Continuous spectral lines",
      "B: Emission lines",
      "C: Absorption lines",
      "D: Scattering lines"
    ],
    "correct_answer": "B: Emission lines",
    "explanation": "Electrons moving from a higher energy state to a lower energy state emit photons, resulting in emission lines in the spectrum.",
    "topic": "Emission lines in hydrogen atom",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen079"
  },
  {
    "question_text": "Define the term 'line spectrum' in the context of the hydrogen atom.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A line spectrum is a set of discrete frequencies of light that are emitted or absorbed when electrons in an atom transition between quantized energy levels.",
    "explanation": "A line spectrum occurs because electrons can only exist in specific energy levels. When electrons transition between these levels, they emit or absorb photons at discrete energies, resulting in distinct spectral lines.",
    "topic": "Line spectra",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen080"
  },
  {
    "question_text": "Explain in your own words why the energy levels in the hydrogen atom are discrete according to Bohr's model.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The energy levels are discrete because electrons in a hydrogen atom are restricted to specific, quantized orbits. Transitions between these well-defined orbits can only occur with fixed energy differences, resulting in discrete energy levels.",
    "explanation": "Bohr's model introduced quantization, meaning that electrons can only occupy certain allowed orbits with specific energies. This quantization results in fixed energy differences between levels, which leads to the emission or absorption of photons with specific frequencies.",
    "topic": "Discrete energy levels",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen081"
  },
  {
    "question_text": "Discuss the significance of the equation hv = E_ni - E_nf in understanding the interaction between light and the hydrogen atom.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The equation hv = E_ni - E_nf is significant because it quantifies the energy difference between quantized electron energy levels. This relationship shows how the emission or absorption of a photon corresponds exactly to the difference in energy between two states, thereby confirming the quantization of energy in the hydrogen atom.",
    "explanation": "This equation is central to Bohr's theory. It connects the energy of the photon (determined by its frequency) to the difference in energy between initial and final electron states. The fact that only certain photon energies are observed is direct evidence of the quantized nature of the electron energy levels, supporting the quantum theory.",
    "topic": "Photon energy and atomic transitions",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen082"
  },
  {
    "question_text": "What experimental observation supports Bohr's model of discrete energy levels in the hydrogen atom?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The observation of discrete spectral lines in the emission and absorption spectra of hydrogen supports Bohr's model.",
    "explanation": "Discrete spectral lines indicate that only certain photon energies are emitted or absorbed, which is consistent with the idea of quantized energy levels as described by Bohr's model.",
    "topic": "Spectral lines and quantization",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen083"
  },
  {
    "question_text": "Describe the process of electron transition in the hydrogen atom and explain how it leads to the formation of emission lines. Include the relevant energy equation in your answer.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When an electron in the hydrogen atom transitions from a higher energy state (with quantum number n_i) to a lower energy state (with quantum number n_f), the difference in energy is released as a photon. This process is described by the equation hv = E_ni - E_nf. Since both n_i and n_f are integers, this produces photons with discrete energies, which are observed as distinct emission lines in the spectrum.",
    "explanation": "The process involves an electron losing energy by dropping to a lower energy level. The energy lost (E_ni - E_nf) is carried away by a photon, whose frequency is given by v = (E_ni - E_nf) / h. Because the energy levels are quantized, only specific photon energies can be emitted, resulting in the emission line spectrum characteristic of the hydrogen atom.",
    "topic": "Electron transitions and emission spectra",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen084"
  },
  {
    "question_text": "Analyze how Bohr's concept of quantized electron orbits revolutionized our understanding of atomic structure and the generation of spectral lines.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Bohr's introduction of quantized electron orbits meant that electrons could only occupy certain discrete energy levels. This explained the observed discrete spectral lines, as the energy difference between any two allowed levels corresponds to the energy of a photon with a specific frequency. This breakthrough provided a critical stepping stone in the development of quantum theory by showing that atomic properties are not continuous but quantized.",
    "explanation": "Prior to Bohr's model, the continuous nature of classical physics could not account for the discrete spectral lines observed in hydrogen. Bohr's hypothesis that electrons have quantized orbits, with energy differences emitted or absorbed as photons (described by hv = E_ni - E_nf), not only explained these observations but also paved the way for the modern quantum mechanical description of atoms. This represented a fundamental shift in our understanding of atomic and subatomic phenomena.",
    "topic": "Bohr's model and quantum theory",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen085"
  },
  {
    "question_text": "Evaluate the impact of the discovery of the hydrogen atom's line spectrum on the progression of modern quantum theory, including any recognition received by Niels Bohr for his work.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The discovery of the hydrogen atom's line spectrum had a profound impact on the advancement of quantum theory. It provided compelling evidence for the quantization of energy in atoms, as only certain photon energies were emitted or absorbed. This breakthrough, explained by Bohr's model of quantized electron orbits, not only validated the concept of discrete energy levels but also stimulated further research into quantum mechanics. Niels Bohr was awarded the Nobel Prize in Physics in 1922 for his pioneering work in this area, underscoring the significance of his contributions.",
    "explanation": "The discrete spectral lines observed in hydrogen could not be explained by classical physics. Bohr's model, which introduced the idea of quantized electron energy levels and the emission or absorption of photons with energies corresponding to these level differences, provided a satisfactory explanation. This marked a pivotal moment in physics as it laid the groundwork for modern quantum theory, leading to widespread recognition of Bohr's work, including the Nobel Prize in 1922.",
    "topic": "Impact of hydrogen line spectrum on quantum theory",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen086"
  },
  {
    "question_text": "True or False: In Bohr's model, the energy difference between electron states is always radiated away as a photon.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "In Bohr's model, an electron transitioning from a higher to a lower energy state emits a photon whose energy exactly equals the difference between the energy levels.",
    "topic": "Electron transitions",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen087"
  },
  {
    "question_text": "True or False: According to Bohr's model, the emission spectrum of a hydrogen atom displays a continuous range of photon frequencies.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Bohr's model predicts that the hydrogen atom emits photons at discrete frequencies corresponding to the difference between quantized energy levels, not a continuous range.",
    "topic": "Spectral lines",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen088"
  },
  {
    "question_text": "An electron transition in a hydrogen atom results in an energy difference of 10.2 eV. Using Planck's constant h = 4.14 x 10^-15 eV·s, calculate the frequency of the emitted photon.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Approximately 2.47 x 10^15 s^-1",
    "explanation": "Using the formula hv = ΔE, the frequency v = ΔE / h. Substituting the given values: v = 10.2 eV / (4.14 x 10^-15 eV·s) ≈ 2.47 x 10^15 s^-1.",
    "topic": "Photon emission",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen089"
  },
  {
    "question_text": "An electron in a hydrogen atom transitions from n = 3 to n = 2. Given the energy levels E_n = -13.6 eV / n^2, calculate the energy of the emitted photon.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 1.89 eV",
    "explanation": "First, calculate the energy of the levels: For n = 3, E_3 = -13.6/9 ≈ -1.51 eV; for n = 2, E_2 = -13.6/4 = -3.40 eV. The energy difference is ΔE = E_2 - E_3 = (-3.40) - (-1.51) = -1.89 eV. The absolute value gives 1.89 eV, which is the energy of the emitted photon.",
    "topic": "Quantum transitions, energy calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen090"
  },
  {
    "question_text": "Calculate the wavelength of the photon emitted when an electron transitions from n = 4 to n = 2 in a hydrogen atom. Use E_n = -13.6 eV/n^2, h = 4.14 x 10^-15 eV·s, and the speed of light c = 3.00 x 10^8 m/s.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 487 nm",
    "explanation": "First, compute the energy levels: E_4 = -13.6/16 ≈ -0.85 eV and E_2 = -13.6/4 = -3.40 eV. The energy difference is ΔE = |E_2 - E_4| = 2.55 eV. Next, find the frequency: v = ΔE / h = 2.55 eV / (4.14 x 10^-15 eV·s) ≈ 6.16 x 10^14 s^-1. Finally, determine the wavelength: λ = c / v = (3.00 x 10^8 m/s) / (6.16 x 10^14 s^-1) ≈ 4.87 x 10^-7 m, which is approximately 487 nm.",
    "topic": "Photon wavelength calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen091"
  },
  {
    "question_text": "A photon with an energy of 12.09 eV is absorbed by a hydrogen atom to promote an electron to a higher energy state. Calculate the frequency of this photon using h = 4.14 x 10^-15 eV·s.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 2.92 x 10^15 s^-1",
    "explanation": "Using the relation v = ΔE / h, substitute the given values: v = 12.09 eV / (4.14 x 10^-15 eV·s) ≈ 2.92 x 10^15 s^-1.",
    "topic": "Photon absorption",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen092"
  },
  {
    "question_text": "An experiment shows that one spectral line corresponds to an energy difference of 1.89 eV, and another measurement indicates that the lower level has an energy 3.40 eV below the zero-energy level. Using Bohr's energy level formula E_n = -13.6 eV/n^2, verify the energy levels for n = 2 and n = 3, and show that the difference between these levels is consistent with the measured 1.89 eV.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Verification shows that for n = 2, E_2 = -13.6/4 = -3.40 eV, and for n = 3, E_3 = -13.6/9 ≈ -1.51 eV; the difference |E_2 - E_3| ≈ 1.89 eV.",
    "explanation": "According to the Bohr model, for n = 2, E_2 = -13.6/4 = -3.40 eV, which matches the experimental value of 3.40 eV below zero. For n = 3, E_3 = -13.6/9 ≈ -1.51 eV. The energy difference is |E_2 - E_3| = |-3.40 - (-1.51)| ≈ 1.89 eV, confirming the measured energy difference between the two levels.",
    "topic": "Bohr's energy levels and experimental verification",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph204",
    "section_id": "05_section_12_5",
    "question_id": "cbse_xii_leph2dd_c204_gen093"
  }
]