[
  {
    "question_text": "Which optical instrument uses a pair of lenses to magnify small objects in two successive stages?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Telescope",
      "B) Simple microscope",
      "C) Compound microscope",
      "D) Kaleidoscope"
    ],
    "correct_answer": "Compound microscope",
    "explanation": "A compound microscope uses two lenses: the objective which creates a real, inverted magnified image and the eyepiece which further magnifies this image. This two-step magnification distinguishes it from a simple microscope.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen099"
  },
  {
    "question_text": "The angular magnification of a simple microscope when the image is formed at infinity is represented by which formula?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) 1 + (D/f)",
      "B) D/f",
      "C) f/D",
      "D) 1 + (f/D)"
    ],
    "correct_answer": "D/f",
    "explanation": "When the final image is formed at infinity in a simple microscope, the angular magnification is given by the ratio of the near point distance D to the focal length f of the lens, hence D/f.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen100"
  },
  {
    "question_text": "In a telescope, the magnification is obtained by using the focal lengths of the objective and eyepiece. Which of the following expressions correctly represents the telescope's magnifying power?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) f_e / f_o",
      "B) f_o + f_e",
      "C) f_o / f_e",
      "D) f_o - f_e"
    ],
    "correct_answer": "f_o / f_e",
    "explanation": "A telescope's magnification is the ratio of the objective's focal length to that of the eyepiece; thus the correct expression is f_o / f_e.",
    "topic": "Optical Instruments - Telescope",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen101"
  },
  {
    "question_text": "Which modern optical instrument typically uses a concave mirror for the objective to avoid chromatic aberration?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Simple microscope",
      "B) Compound microscope",
      "C) Reflecting telescope",
      "D) Refracting telescope"
    ],
    "correct_answer": "Reflecting telescope",
    "explanation": "Reflecting telescopes use concave mirrors for the objective, which eliminates chromatic aberration and allows the mirror to be supported over its entire surface.",
    "topic": "Optical Instruments - Telescope",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen102"
  },
  {
    "question_text": "For a compound microscope, if the objective has a very small focal length and the tube length is large, what effect does this have on the magnification provided by the objective?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A) It decreases magnification",
      "B) It increases magnification",
      "C) It does not affect magnification",
      "D) It causes image inversion"
    ],
    "correct_answer": "It increases magnification",
    "explanation": "Since the magnification due to the objective is given by L/f_o, a small focal length and a large tube length L result in a larger value of L/f_o, thus increasing the magnification.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen103"
  },
  {
    "question_text": "Define a compound microscope and list its main components.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A compound microscope is an optical instrument that uses two sets of lenses to magnify small objects. Its main components are the objective lens, which forms a real, inverted, and magnified image of the object, and the eyepiece, which further magnifies this image to produce a final virtual image.",
    "explanation": "The compound microscope uses the objective lens first to create an enlarged image, and then the eyepiece acts as a magnifier, allowing detailed viewing of small objects.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen104"
  },
  {
    "question_text": "Explain why forming the image at infinity is considered more comfortable for viewing in a microscope.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Forming the image at infinity is more comfortable because it allows the observer's eye to remain relaxed, as the eye is naturally set to focus on objects at infinity, minimizing eye strain associated with near point focusing.",
    "explanation": "When the final image is at infinity, the eye does not need to accommodate (change its focus), which reduces strain and enables longer, more comfortable periods of observation.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen105"
  },
  {
    "question_text": "State the formula for the magnification of a simple microscope when the image is formed at the near point. Explain the meaning of the symbols in the formula.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The formula is m = 1 + D/f, where m is the magnification, D is the near point distance (approximately 25 cm), and f is the focal length of the lens.",
    "explanation": "This formula shows that by placing an object closer than the near point using a lens with small focal length, the apparent size of the object increases by a factor of 1 + D/f. D represents comfortable viewing distance while f is the focal property of the lens.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen106"
  },
  {
    "question_text": "Describe how the objective and the eyepiece work together in a compound microscope to produce a magnified image.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In a compound microscope, the objective lens first produces a real, inverted, and magnified image of the object. This image is located near the focal plane of the eyepiece. The eyepiece then acts as a simple magnifier, producing a final virtual image that is still inverted relative to the original object. The overall magnification is the product of the magnifications provided by the objective and the eyepiece.",
    "explanation": "The process involves two stages of magnification. The objective, with a short focal length, enlarges the sample, and the eyepiece further magnifies this intermediate image, making fine details visible to the viewer.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen107"
  },
  {
    "question_text": "Discuss the principle of operation and advantages of using a reflecting telescope over a refracting telescope. In your answer, include the roles of the primary and secondary mirrors as described in the text.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A reflecting telescope uses a large concave primary mirror to gather and focus light, and a secondary mirror to redirect the light to the eyepiece. This design eliminates chromatic aberration because mirrors do not disperse light by wavelength, unlike lenses. Furthermore, the mirror can be supported over its entire back surface, making it easier to construct large, lightweight objectives. The reflecting telescope’s design is particularly advantageous for observing faint objects due to its large light gathering power and is easier to manufacture at large sizes.",
    "explanation": "Reflecting telescopes overcome the problems of chromatic aberration that affect refracting telescopes, and their design allows more efficient support of the primary mirror, reducing structural challenges. The primary mirror concentrates light and the secondary mirror adjusts the light path so that the final image is conveniently located for observation.",
    "topic": "Optical Instruments - Telescope",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen108"
  },
  {
    "question_text": "Using the lens formula for a simple microscope, derive the expression m = 1 + D/f. In your answer, discuss the assumptions made regarding object and image distances.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "To derive m = 1 + D/f, consider that for a simple microscope, the angular magnification is enhanced by allowing the object to be placed within the focal length of the lens. By placing the object at a distance at or less than f, the lens forms an image at the near point (D) for clear viewing. Under the assumption that the image distance equals the near point (and using the lens formula 1/f = 1/u + 1/v with proper sign conventions), one arrives at the magnification expression m = 1 + D/f. The assumption here is that the viewer's near point is D (about 25 cm) and that the object is placed close to the lens for maximum magnification while still allowing a comfortable view.",
    "explanation": "The derivation uses the lens formula with the condition that the final image is at the near point, which gives a specific relationship between u, v, and f. Key assumptions include the object distance being nearly f and the image distance being approximately equal to the near point D.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen109"
  },
  {
    "question_text": "Compare and contrast the working principles of a telescope and a microscope, focusing particularly on the roles of the objective and the eyepiece and the types of magnification achieved (linear vs. angular).",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A microscope and a telescope both use an objective and an eyepiece lens, but serve different purposes. In a microscope, the objective lens creates a real, magnified image of a very small object at a close distance, which is then further magnified by the eyepiece to produce a final virtual image. This process primarily enhances linear magnification, quantified by h' over h. In contrast, a telescope is designed for viewing distant objects where the objective lens captures parallel rays and forms an image at its focal plane; the eyepiece then magnifies this image by increasing the angular size, with the magnification given by f_o/f_e. Thus, while microscopes deal with small objects and use a combination of linear and angular magnification, telescopes primarily rely on angular magnification to make distant objects appear larger.",
    "explanation": "The objective in a microscope is designed for high linear magnification of small objects, whereas in a telescope, it is designed to collect light from distant objects. The eyepiece in both systems serves to further magnify the image, but in a microscope it works to bring the object within a comfortable viewing distance, while in a telescope it increases the angular size of the image for detailed observation.",
    "topic": "Optical Instruments - General",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen110"
  },
  {
    "question_text": "The human eye is considered one of the most important optical devices given by nature.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text emphasizes that the human eye is one of the most important optical devices, highlighting its natural ability to form images.",
    "topic": "Optical Instruments - General",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen111"
  },
  {
    "question_text": "In a simple microscope, the maximum angular magnification is achieved when the image is formed at the near point for comfortable viewing.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While the near point image yields a magnification of 1 + D/f, forming the image at infinity (with magnification D/f) is generally preferred because it allows the eye to remain relaxed even though the numerical magnification value is slightly lower.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen112"
  },
  {
    "question_text": "A compound microscope produces an image that is erect relative to the original object.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The compound microscope produces a final image that is inverted relative to the original object because the objective forms a real inverted image and the eyepiece further magnifies this inverted image.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen113"
  },
  {
    "question_text": "A simple microscope is designed to achieve a magnification of 6 when the final image is formed at the near point. Given that the near point distance D is 25 cm, calculate the focal length f of the convex lens used.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "5 cm",
    "explanation": "The magnification for a simple microscope with the image at the near point is given by m = 1 + D/f. Substituting m = 6 and D = 25 cm, we have 6 = 1 + 25/f, which leads to 25/f = 5. Solving for f gives f = 25/5 = 5 cm.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen114"
  },
  {
    "question_text": "For a simple microscope with a focal length of 4 cm, compute the angular magnification when the final image is formed at infinity. Use the near point distance D = 25 cm.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "6.25",
    "explanation": "When the final image is at infinity, the angular magnification is given by m = D/f. With D = 25 cm and f = 4 cm, m = 25/4 = 6.25.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen115"
  },
  {
    "question_text": "A telescope has an objective with a focal length of 100 cm and an eyepiece with a focal length of 2 cm. Calculate the magnifying power of this telescope.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "50",
    "explanation": "The magnification of a telescope is given by m = f_o / f_e. With f_o = 100 cm and f_e = 2 cm, m = 100/2 = 50.",
    "topic": "Optical Instruments - Telescope",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen116"
  },
  {
    "question_text": "A compound microscope uses an objective with a focal length of 1.2 cm, an eyepiece with a focal length of 2.5 cm, and a tube length of 18 cm. Compute the total magnification when the final image is formed at infinity. Assume the near point distance D is 25 cm.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "150",
    "explanation": "For a compound microscope with the final image at infinity, the total magnification is given by m = (L/f_o) x (D/f_e). Here, L = 18 cm, f_o = 1.2 cm, D = 25 cm, and f_e = 2.5 cm. Thus, m = (18/1.2) x (25/2.5) = 15 x 10 = 150.",
    "topic": "Optical Instruments - Microscope",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen117"
  },
  {
    "question_text": "In an astronomical telescope, two stars separated by 1 minute of arc are observed. If the telescope has an objective focal length of 120 cm and an eyepiece focal length of 1.5 cm, what is the apparent separation between the stars in minutes of arc and in degrees?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "80 minutes of arc, which is approximately 1.33 degrees",
    "explanation": "First, calculate the magnification m = f_o / f_e = 120/1.5 = 80. The apparent angular separation is then m multiplied by the actual separation: 80 x 1 minute = 80 minutes of arc. Converting minutes to degrees, 80 minutes ÷ 60 = 1.33 degrees (approximately).",
    "topic": "Optical Instruments - Telescope",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph201",
    "section_id": "07_section_9_7",
    "question_id": "cbse_xii_leph2dd_c201_gen118"
  }
]