[
  {
    "question_text": "Which of the following statements correctly describes the effect of increasing the intensity of incident light on the photoelectric current (when the frequency is above the threshold)?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The photoelectric current increases linearly with intensity.",
      "The photoelectric current decreases with intensity.",
      "The photoelectric current remains constant irrespective of intensity.",
      "The photoelectric current increases exponentially with intensity."
    ],
    "correct_answer": "The photoelectric current increases linearly with intensity.",
    "explanation": "According to the experimental observations, for a constant frequency and potential, the number of photoelectrons emitted per second is directly proportional to the intensity of the incident radiation. This results in a linear increase in the photocurrent with increasing light intensity.",
    "topic": "Effect of intensity on photoelectric current",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen058"
  },
  {
    "question_text": "In the experiment on the photoelectric effect, when the collector plate is made more positive, the photocurrent initially increases and then saturates. Which term best describes this maximum current level?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cutoff current",
      "Threshold current",
      "Saturation current",
      "Retarding current"
    ],
    "correct_answer": "Saturation current",
    "explanation": "The saturation current is defined as the maximum photocurrent achieved when all the emitted electrons from the photosensitive plate are being collected by the collector plate. Increasing the potential beyond this point does not increase the current.",
    "topic": "Effect of potential on photocurrent",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen059"
  },
  {
    "question_text": "Which of the following best explains the significance of the cutoff (or stopping) potential in the photoelectric effect experiments?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It is the potential at which the saturation current is reached.",
      "It is the minimum retarding potential needed to stop even the most energetic photoelectrons.",
      "It is the potential required to increase the number of photoelectrons emitted per second.",
      "It is the potential at which light intensity has the maximum effect on the photocurrent."
    ],
    "correct_answer": "It is the minimum retarding potential needed to stop even the most energetic photoelectrons.",
    "explanation": "The cutoff or stopping potential is defined as the minimum negative (retarding) potential required to repel all the photoelectrons, including the ones with the maximum kinetic energy. At this point, the photocurrent drops to zero.",
    "topic": "Effect of potential on photocurrent",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen060"
  },
  {
    "question_text": "How does the stopping potential change with increasing frequency of the incident radiation (keeping intensity constant)?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It decreases as frequency increases.",
      "It remains constant regardless of frequency.",
      "It increases linearly with frequency.",
      "It increases exponentially with frequency."
    ],
    "correct_answer": "It increases linearly with frequency.",
    "explanation": "Experimental results show that the stopping potential (which is related to the maximum kinetic energy of photoelectrons) increases linearly with the frequency of the incident radiation. This is because a higher frequency means higher photon energy, which translates to a greater kinetic energy of the emitted electrons.",
    "topic": "Effect of frequency on stopping potential",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen061"
  },
  {
    "question_text": "When a negative potential is applied to the collector plate in a photoelectric setup, what happens to the photoelectrons?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "They are accelerated towards the collector.",
      "They are repelled and only the more energetic ones reach the collector.",
      "They are completely absorbed by the emitter.",
      "They increase in number."
    ],
    "correct_answer": "They are repelled and only the more energetic ones reach the collector.",
    "explanation": "When a retarding (negative) potential is applied to the collector plate, the photoelectrons are opposed by the electric field. Only those electrons with sufficient kinetic energy can overcome this potential barrier, leading to a decrease in photocurrent until a cutoff potential is reached.",
    "topic": "Effect of potential on photocurrent",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen062"
  },
  {
    "question_text": "Explain the concept of saturation current in the context of the photoelectric effect and describe the experimental conditions under which it is achieved.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The saturation current is the maximum photocurrent obtained when all photoelectrons emitted from the photosensitive surface are collected by the collector plate. It is achieved by applying a sufficiently high positive potential to the collector, ensuring that every emitted photoelectron is attracted and measured.",
    "explanation": "In the experiment, as the positive potential on the collector increases, more photoelectrons are collected, thereby increasing the photocurrent. However, once all the emitted electrons are being collected, further increases in potential do not lead to additional current. This maximum level of current is called the saturation current.",
    "topic": "Effect of potential on photocurrent",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen063"
  },
  {
    "question_text": "Define the cutoff or stopping potential in a photoelectric experiment and explain its significance.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The cutoff or stopping potential is the minimum negative potential required to reduce the photocurrent to zero by stopping even the most energetic photoelectrons. It signifies the maximum kinetic energy of the emitted photoelectrons since eV0 equals the maximum kinetic energy.",
    "explanation": "The stopping potential allows one to determine the maximum kinetic energy of the photoelectrons. By gradually making the collector potential more negative, the point at which the current drops to zero gives a measure of this energy, as per the relation Kmax = eV0.",
    "topic": "Effect of potential on photocurrent",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen064"
  },
  {
    "question_text": "How does the velocity (or kinetic energy) of the photoelectrons change with the frequency of the incident light, and why is a threshold frequency necessary?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The maximum kinetic energy of the photoelectrons increases linearly with the frequency of the incident light because higher frequency photons have more energy. The threshold frequency is the minimum frequency required to overcome the work function of the material; below this frequency, no electrons are emitted regardless of light intensity.",
    "explanation": "According to Einstein's photoelectric equation, the energy of the incident photon (hv) must exceed the work function (φ) of the metal for electrons to be emitted. Thus, only frequencies above the threshold frequency (v0) result in electron emission, and the excess energy appears as the kinetic energy of the electrons.",
    "topic": "Effect of frequency on photoelectric emission",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen065"
  },
  {
    "question_text": "Describe how the photoelectric current varies with the accelerating (positive) potential and the retarding (negative) potential applied to the collector plate.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When a positive (accelerating) potential is applied, the photocurrent increases until it saturates, as all electrons are being collected. When a negative (retarding) potential is applied, the photocurrent decreases, eventually reaching zero at the stopping potential.",
    "explanation": "With an increasing positive potential, more electrons, even those with lower kinetic energy, are attracted to the collector, leading to an increase in current until every emitted electron is collected (saturation). Conversely, a negative potential repels the electrons, allowing only the ones with higher kinetic energy to reach the collector until eventually, none can overcome the retarding force.",
    "topic": "Effect of potential on photocurrent",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen066"
  },
  {
    "question_text": "Discuss the experimental arrangement used for studying the photoelectric effect. Include the role of the evacuated tube, photosensitive and collector plates, voltage measurement devices, and the light source.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The experimental setup consists of an evacuated glass or quartz tube to avoid collisions of photoelectrons with air molecules. A thin photosensitive plate (cathode) emits electrons when irradiated with monochromatic light, and an opposing metal plate (anode) collects these electrons. Monochromatic light of a sufficiently short wavelength is directed through a quartz window, which allows ultraviolet light to pass. The potential difference across the plates, controlled and varied using a battery and a commutator (allowing reversal of polarity), is measured using a voltmeter. A microammeter records the photocurrent, which depends on the light’s intensity and frequency. This setup allows detailed study of how photoelectrons are emitted and the relationship between stopping potential and frequency.",
    "explanation": "The arrangement is critical to isolating the effects of light on electron emission. The evacuated tube ensures that the electron trajectories are not disturbed by interactions with air, and the use of precise measuring instruments like voltmeters and microammeters provides data on how the applied potential affects the emission and collection of electrons.",
    "topic": "Experimental study of photoelectric effect",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen067"
  },
  {
    "question_text": "Analyze the significance of the linear relationship between the stopping potential and the frequency of the incident radiation. How does this observation support Einstein's photoelectric equation?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The linear relationship indicates that the maximum kinetic energy of the photoelectrons (given by eV0) is directly proportional to the frequency of the incident light minus the work function, as expressed in Einstein's photoelectric equation (Kmax = hv - φ). This relationship supports the quantization of light energy, demonstrating that light consists of photons whose energy is proportional to their frequency. The straight-line graph with a slope of h/e provides experimental evidence for the photon theory of light and confirms that the electron emission process is not dependent on the intensity of the light but on its frequency.",
    "explanation": "Einstein’s equation (hv - φ = eV0) predicts a linear dependence of the stopping potential on the frequency of the incident light. The intercept of the line on the frequency axis gives the threshold frequency, and the slope allows determination of Planck's constant (when multiplied by the electron charge). This linear behavior was one of the key experimental findings that led to the acceptance of the particle nature of light.",
    "topic": "Effect of frequency on stopping potential",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen068"
  },
  {
    "question_text": "Evaluate why the stopping potential remains independent of the intensity of the incident light in photoelectric experiments.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The stopping potential measures the maximum kinetic energy of the photoelectrons, which depends solely on the energy of the individual photons (determined by the frequency) and the material's work function. Increasing the intensity of light increases the number of photons (and hence the number of emitted electrons) but does not change the energy carried by each photon. Therefore, while the saturation current increases with intensity, the maximum kinetic energy—and thus the stopping potential—remains unchanged.",
    "explanation": "This behavior is a direct consequence of the quantization of light. Since the energy of a photon is given by hv, where h is Planck's constant and v is the frequency, varying the intensity only affects the number of photons and not their individual energies. The stopping potential eV0 reflects the energy required to halt even the most energetic electrons and, as such, is independent of the number of electrons emitted per unit time.",
    "topic": "Independence of stopping potential on intensity",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen069"
  },
  {
    "question_text": "The statement 'The photoelectric current is independent of the light intensity' is presented. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The photoelectric current is directly proportional to the intensity of the incident light because higher intensity increases the number of photons striking the surface, thereby increasing the number of photoelectrons emitted per second.",
    "topic": "Effect of intensity on photocurrent",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen070"
  },
  {
    "question_text": "True or False: The maximum kinetic energy of the photoelectrons increases linearly with the frequency of incident light, and this relationship is independent of the light's intensity.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Experimental observations and Einstein's photoelectric equation support that the maximum kinetic energy (eV0) is proportional to the frequency of the incident light minus the work function and does not depend on the intensity. The intensity only affects the number of photoelectrons emitted, not their individual energies.",
    "topic": "Effect of frequency on photoelectric effect",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen071"
  },
  {
    "question_text": "True or False: Increasing the intensity of incident light will result in a higher stopping potential in a photoelectric experiment.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The stopping potential is determined by the energy of the individual photons (which depends on frequency) and is independent of the intensity. While increasing intensity raises the number of photoelectrons (and thus the photocurrent), it does not change the maximum kinetic energy of those electrons.",
    "topic": "Effect of intensity vs. stopping potential",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen072"
  },
  {
    "question_text": "A photoelectric experiment measures a stopping potential of 2.0 V for a particular frequency of incident light. Calculate the maximum kinetic energy of the emitted photoelectrons in joules. (Take the charge of an electron as 1.6 x 10^-19 C.)",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The maximum kinetic energy is 3.2 x 10^-19 joules.",
    "explanation": "The maximum kinetic energy of the photoelectrons is given by Kmax = eV0, where e = 1.6 x 10^-19 C and V0 = 2.0 V. Therefore, Kmax = (1.6 x 10^-19 C)(2.0 V) = 3.2 x 10^-19 joules.",
    "topic": "Relation between stopping potential and kinetic energy",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen073"
  },
  {
    "question_text": "In an experiment using monochromatic light of frequency 8.0 x 10^14 Hz, the measured stopping potential is 1.5 V. Calculate the work function of the photosensitive metal in joules. (Planck's constant, h, is 6.63 x 10^-34 J·s, and electron charge, e, is 1.6 x 10^-19 C.)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The work function is 2.90 x 10^-19 joules (approximately).",
    "explanation": "Using Einstein's photoelectric equation: Kmax = hv - φ and also Kmax = eV0. Rearranging gives φ = hv - eV0. Substituting the values, φ = (6.63 x 10^-34 J·s)(8.0 x 10^14 Hz) - (1.6 x 10^-19 C)(1.5 V). This is φ = 5.304 x 10^-19 J - 2.4 x 10^-19 J = 2.904 x 10^-19 J (approximately 2.90 x 10^-19 J).",
    "topic": "Determination of work function",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen074"
  },
  {
    "question_text": "A particular metal shows a stopping potential of 0 V at a frequency of 5.0 x 10^14 Hz and 2.0 V at a frequency of 7.0 x 10^14 Hz. Determine the slope of the stopping potential versus frequency graph (in V·s) and the threshold frequency for this metal.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The slope is 1.0 x 10^-14 V·s and the threshold frequency is 5.0 x 10^14 Hz.",
    "explanation": "The slope is calculated by delta V / delta frequency = (2.0 V - 0 V) / [(7.0 x 10^14 Hz) - (5.0 x 10^14 Hz)] = 2.0 V / 2.0 x 10^14 Hz = 1.0 x 10^-14 V·s. The threshold frequency is the frequency at which the stopping potential becomes 0 V, which is given as 5.0 x 10^14 Hz.",
    "topic": "Stopping potential versus frequency graph",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen075"
  },
  {
    "question_text": "In a photoelectric experiment, if the intensity of incident light is tripled and the corresponding saturation current becomes 6 µA, what would be the saturation current at the original intensity?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The saturation current at the original intensity is 2 µA.",
    "explanation": "Since the photocurrent is directly proportional to the intensity of the incident light, tripling the intensity triples the current. Therefore, if 6 µA corresponds to triple the intensity, then the original intensity would produce 6 µA / 3 = 2 µA.",
    "topic": "Effect of intensity on photocurrent",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen076"
  },
  {
    "question_text": "Two metals, A and B, have threshold frequencies of 7.0 x 10^14 Hz and 6.0 x 10^14 Hz respectively. If both are illuminated with light of frequency 8.0 x 10^14 Hz, which metal will exhibit a higher stopping potential and why?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Metal B will exhibit a higher stopping potential because it has a lower work function.",
    "explanation": "For both metals, the maximum kinetic energy of the photoelectrons is given by Kmax = hv - φ, with φ = hv0 (threshold frequency). Metal A: Kmax = h(8.0 x 10^14 - 7.0 x 10^14) = h(1.0 x 10^14). Metal B: Kmax = h(8.0 x 10^14 - 6.0 x 10^14) = h(2.0 x 10^14). Since Kmax is higher for Metal B, the stopping potential, which is proportional to the maximum kinetic energy, will be higher for Metal B.",
    "topic": "Comparison of stopping potentials for different metals",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "05_section_11_4",
    "question_id": "cbse_xii_leph2dd_c203_gen077"
  }
]