[
  {
    "question_text": "According to the wave picture of light, what is the expected effect on the maximum kinetic energy of photoelectrons when the intensity of incident light is increased?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) It increases linearly with intensity",
      "B) It increases exponentially with intensity",
      "C) It remains unchanged",
      "D) It decreases with intensity"
    ],
    "correct_answer": "A) It increases linearly with intensity",
    "explanation": "In the wave theory of light, the energy from the electromagnetic wave is continuously absorbed by electrons. Therefore, a higher intensity—which corresponds to larger amplitude fields—is expected to supply more energy to each electron, leading to an increase in the maximum kinetic energy of the ejected electrons.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen078"
  },
  {
    "question_text": "Which one of the following statements best represents the prediction of the wave theory regarding the frequency of incident light and photoelectric emission?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) There is a threshold frequency below which no electrons will be emitted",
      "B) Electrons will be emitted only if the frequency is above ultraviolet",
      "C) Given a sufficiently intense beam, electrons should be emitted regardless of frequency",
      "D) The frequency has no effect on the energy absorption process"
    ],
    "correct_answer": "C) Given a sufficiently intense beam, electrons should be emitted regardless of frequency",
    "explanation": "The wave theory predicts that because energy is absorbed continuously, even a low-frequency beam – if intense and allowed sufficient time – should eventually provide enough energy to eject electrons. This view contradicts the experimental finding of a threshold frequency.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen079"
  },
  {
    "question_text": "According to the wave theory, what is the predicted behavior regarding the time delay between light exposure and photoelectron emission?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Emission occurs instantaneously",
      "B) A measurable delay is expected due to the slow absorption of energy",
      "C) The delay decreases with increasing light frequency",
      "D) The delay is independent of light intensity"
    ],
    "correct_answer": "B) A measurable delay is expected due to the slow absorption of energy",
    "explanation": "In the wave theory, energy is absorbed gradually by electrons from the continuous wavefront. It would take a finite amount of time for an electron to accumulate enough energy to overcome the work function, leading to an observable delay in the photoelectric emission.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen080"
  },
  {
    "question_text": "Why does the wave picture of light fail to explain the lack of time delay in photoelectric emission?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Because it assumes electrons can interact with light instantaneously",
      "B) Because it incorrectly assumes that energy absorption is discrete",
      "C) Because it predicts a slow, continuous energy accumulation process",
      "D) Because it denies the existence of the electromagnetic field"
    ],
    "correct_answer": "C) Because it predicts a slow, continuous energy accumulation process",
    "explanation": "The wave picture assumes that the electron continuously absorbs energy over the wavefront, which would take a measurable amount of time (often hours) to accumulate enough energy to overcome the work function. This contradicts the instantaneous nature of the observed photoelectric emission.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen081"
  },
  {
    "question_text": "According to the wave picture of light, what would happen if the intensity of radiation is increased to a very high value even below the threshold frequency?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) No photoelectrons would be emitted because frequency is below threshold",
      "B) Photoelectrons would eventually be emitted after a long time",
      "C) Photoelectrons would be emitted instantaneously",
      "D) The kinetic energy of emitted electrons would decrease"
    ],
    "correct_answer": "B) Photoelectrons would eventually be emitted after a long time",
    "explanation": "The wave model implies that with enough intensity and time, even light below the typical threshold frequency can impart sufficient energy to electrons. This prediction is in direct contradiction with experimental observations that show no emission below a specific threshold frequency.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen082"
  },
  {
    "question_text": "In your own words, explain why the continuous energy absorption model of the wave theory does not account for the instantaneous emission of photoelectrons.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The continuous absorption model implies that electrons gradually accumulate energy over time, which would lead to a measurable delay before emission. However, experiments show that photoelectric emission occurs almost instantly, indicating that energy is absorbed in discrete packets rather than gradually.",
    "explanation": "The wave theory suggests that electrons take time to build up sufficient energy due to continuous absorption from the entire wavefront. The observed immediate emission of electrons contradicts this prediction, implying that the absorption process must occur in a manner other than continuous accumulation.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen083"
  },
  {
    "question_text": "Describe the main reason why the wave picture of light fails to predict the existence of a threshold frequency in the photoelectric effect.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The wave picture assumes that energy is absorbed gradually and continuously, so with enough time and intensity, even low-frequency light should eventually emit electrons. This contradicts the observed strict threshold frequency, below which no electrons are emitted.",
    "explanation": "According to the wave theory, the amount of energy absorbed by each electron is determined by the overall intensity of the light rather than its frequency. However, the experimental results consistently show that no photoelectrons are emitted below a certain frequency, meaning the energy of individual photons (related to frequency) is critical.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen084"
  },
  {
    "question_text": "How does the predicted energy absorption rate from the wave theory compare with the observed energy accumulation required for photoelectric emission?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The wave theory predicts a very low energy absorption rate per electron due to the distributed energy over a large wavefront, resulting in an accumulation time of hours. In contrast, experiments show that electrons are emitted instantaneously, indicating a much higher effective energy transfer.",
    "explanation": "Calculations based on the wave picture estimate that the rate of energy absorption per electron is so low that it would take an impractically long time for an electron to reach the required energy to escape. This discrepancy highlights the failure of the continuous absorption model in explaining the prompt emission observed.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen085"
  },
  {
    "question_text": "Discuss in detail the limitations of the wave theory of light in explaining the key features of the photoelectric effect, particularly the role of light intensity and frequency.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The wave theory of light suggests that the energy of electromagnetic waves is distributed continuously, so that higher intensity light should result in a proportionally higher energy per electron and eventually cause photoelectron emission even at low frequencies, albeit after a delay. However, experiments show that photoelectron emission is instantaneous and that there exists a threshold frequency below which no emission occurs. This indicates that energy absorption is not continuous but quantized, with each photon carrying a fixed amount of energy proportional to its frequency. This quantization explains why electrons are emitted immediately once the energy of a single photon exceeds the work function, regardless of the overall intensity of light.",
    "explanation": "The wave theory fails because it cannot account for the fact that no matter how intense the light is, there is no emission below the threshold frequency. Furthermore, the predicted delay due to gradual energy build-up is not observed; emission occurs without measurable lag. These contradictions led to the development of the quantum theory of light where the photoelectric effect is explained by considering light as photons, each with energy given by E = hν.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen086"
  },
  {
    "question_text": "Evaluate the implications of the failure of the wave theory to explain the photoelectric effect on the development of quantum mechanics.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The failure of the wave theory to account for the instantaneous photoelectric emission and the existence of a threshold frequency significantly impacted the scientific community by highlighting the need for a new explanation of light-matter interactions. This discrepancy paved the way for the quantum hypothesis, where light is considered to be made up of discrete photons. In this quantum framework, the energy of each photon is proportional to its frequency (E = hν), which directly explains why electrons are only ejected when the incident photon has more energy than the work function. This revolutionary idea was a foundational step in the development of quantum mechanics.",
    "explanation": "The inability of the wave theory to explain the key experimental findings of the photoelectric effect led to a paradigm shift. It required the abandonment of the classical view of continuous energy distribution in favor of a quantized perspective. This not only resolved the inconsistencies in photoelectric emission but also provided a basis for understanding atomic and subatomic processes, ultimately culminating in the formulation of quantum mechanics.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen087"
  },
  {
    "question_text": "According to the wave theory of light, given sufficient time and intensity, electrons should be emitted even with low-frequency light. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The wave theory states that energy is absorbed continuously from the wavefront. Therefore, if an electron is exposed to a low-frequency but high-intensity light for a long enough time, it should eventually accumulate enough energy to be emitted, despite there being a threshold frequency according to observations.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen088"
  },
  {
    "question_text": "The wave picture of light predicts that the energy absorbed per electron is sufficient to cause immediate photoelectric emission. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "According to the wave theory, the energy from a light wave is spread over a large spatial region, meaning each electron absorbs energy at a slow, continuous rate. This would suggest a noticeable delay in reaching the energy required for emission, contradicting the observed instantaneous emission in the photoelectric effect.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen089"
  },
  {
    "question_text": "An electron requires an energy equal to 4 electron volts (eV) to be emitted from a metal surface. If the wave theory predicts that an electron absorbs energy at a rate of 1.0 × 10^-22 joules per second, calculate the approximate time required for an electron to accumulate 4 eV. (Note: 1 eV = 1.6 × 10^-19 joules)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 6400 seconds (or about 1.78 hours)",
    "explanation": "Step 1: Convert 4 eV to joules: 4 eV = 4 × 1.6 × 10^-19 J = 6.4 × 10^-19 J. Step 2: Use the energy absorption rate to calculate the time: Time = (6.4 × 10^-19 J) / (1.0 × 10^-22 J/s) = 6.4 × 10^3 seconds, which is about 6400 seconds or 1.78 hours. This long time contrasts with the instantaneous emission observed.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen090"
  },
  {
    "question_text": "Assume that the energy of an electromagnetic wave is proportional to the square of its amplitude. If the amplitude of the light wave is doubled, by what factor does the energy absorbed by an electron increase according to the wave theory?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The energy absorbed increases by a factor of 4.",
    "explanation": "Since energy is proportional to the square of the amplitude, doubling the amplitude increases the energy by 2^2 = 4. Therefore, the electron would absorb four times as much energy when the amplitude is doubled.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen091"
  },
  {
    "question_text": "A metal surface requires 5 eV of energy to emit electrons. If, according to the wave theory, an electron absorbs energy at a rate of 5.0 × 10^-23 joules per second, determine the minimum amount of time required for an electron to accumulate 5 eV. (Note: 1 eV = 1.6 × 10^-19 joules)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 16000 seconds (or about 4.44 hours)",
    "explanation": "Step 1: Convert 5 eV to joules: 5 eV = 5 × 1.6 × 10^-19 J = 8 × 10^-19 J. Step 2: Calculate the time: Time = (8 × 10^-19 J) / (5.0 × 10^-23 J/s) = 1.6 × 10^4 seconds, which is approximately 16000 seconds or about 4.44 hours.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen092"
  },
  {
    "question_text": "If a light wave has an energy density of 2 joules per cubic meter and its wavefront spans a length of 3 meters and an area of 1 square meter, what is the total energy contained in that wavefront?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "6 joules",
    "explanation": "The energy contained in the wavefront is given by multiplying the energy density by the volume. Volume = Area × Length = 1 m² × 3 m = 3 m³. Therefore, Total Energy = Energy Density × Volume = 2 J/m³ × 3 m³ = 6 joules.",
    "topic": "Photoelectric Effect and Wave Theory of Light",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "leph203",
    "section_id": "06_section_11_5",
    "question_id": "cbse_xii_leph2dd_c203_gen093"
  }
]