[
  {
    "question_text": "What does an electric circuit mean?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An electric circuit is a continuous and closed path through which electric current flows.",
    "explanation": "An electric circuit consists of a complete loop that allows electric charges to flow from the power source, through various components like bulbs and ammeters, and back to the power source. If the path is interrupted or broken, the current stops flowing, and the devices in the circuit, such as a bulb, will not function.",
    "topic": "Electric Circuit",
    "bloom_level": "Remember"
  },
  {
    "question_text": "Define the unit of current.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The unit of electric current is the ampere (A), which is defined as one coulomb of charge passing through a conductor per second, i.e., 1 A = 1 C/s.",
    "explanation": "Electric current is measured in amperes (A). One ampere is equivalent to the flow of one coulomb of electric charge moving past a point in a circuit per second. The ampere is the SI unit for current and is named after the French scientist André-Marie Ampère. Smaller units include the milliampere (mA) and microampere (μA), which are 10⁻³ A and 10⁻⁶ A respectively.",
    "topic": "Unit of Electric Current",
    "bloom_level": "Remember"
  },
  {
    "question_text": "Calculate the number of electrons constituting one coulomb of charge.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 6.25 × 10¹⁸ electrons constitute one coulomb of charge.",
    "explanation": "To find the number of electrons (n) that make up one coulomb of charge, use the formula Q = n × e, where Q is the charge and e is the elementary charge of an electron.\n\nGiven:\nQ = 1 C\n e = 1.6 × 10⁻¹⁹ C\n\nRearranging the formula to solve for n:\n\nn = Q / e = 1 C / 1.6 × 10⁻¹⁹ C = 6.25 × 10¹⁸\n\nTherefore, approximately 6.25 × 10¹⁸ electrons are needed to make up one coulomb of charge.",
    "topic": "Electric Charge",
    "bloom_level": "Apply"
  }
]