[
    {
      "question_text": "Which of the following best defines a set in mathematics?",
      "type": "MCQ",
      "difficulty": "Easy",
      "options": [
        "A collection of distinct objects",
        "A sequence of numbers in order",
        "A group of similar functions",
        "A type of polygon with many sides"
      ],
      "correct_answer": "A collection of distinct objects",
      "explanation": "A set is defined as a collection of distinct objects, where order does not matter and repetition is not allowed. This concept is fundamental to many areas of mathematics.",
      "topic": "Set Theory Basics",
      "bloom_level": "Remember",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen001"
    },
    {
      "question_text": "Who is credited with the development of the modern theory of sets?",
      "type": "MCQ",
      "difficulty": "Easy",
      "options": [
        "Isaac Newton",
        "Georg Cantor",
        "Leonhard Euler",
        "Carl Friedrich Gauss"
      ],
      "correct_answer": "Georg Cantor",
      "explanation": "Georg Cantor was the German mathematician who developed the modern theory of sets, significantly contributing to the foundation of mathematics.",
      "topic": "History of Set Theory",
      "bloom_level": "Remember",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen002"
    },
    {
      "question_text": "Which branch of mathematics is least likely to use set theory as a foundational tool?",
      "type": "MCQ",
      "difficulty": "Medium",
      "options": [
        "Probability",
        "Geometry",
        "Sequence Analysis",
        "None of the above"
      ],
      "correct_answer": "None of the above",
      "explanation": "Set theory is used widely across mathematics including in probability, geometry, and sequence analysis. Thus, all the branches mentioned utilize set theory as a basic concept.",
      "topic": "Applications of Sets",
      "bloom_level": "Understand",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen003"
    },
    {
      "question_text": "The ellipse shown in Figure (_page_0_Picture_7.jpeg) is defined as the set of all points for which the sum of the distances to two fixed points is constant. Which of the following statements is true about ellipses?",
      "type": "MCQ",
      "difficulty": "Medium",
      "options": [
        "An ellipse always has a constant distance from a single focus",
        "An ellipse can be formed by the intersection of a plane with a cone",
        "An ellipse is the set of all points equidistant from a center point",
        "An ellipse is the only conic section that is unbounded"
      ],
      "correct_answer": "An ellipse can be formed by the intersection of a plane with a cone",
      "explanation": "One of the key properties of ellipses is that they can be generated by the intersection of a plane with a cone, which is one of the conic sections. The other options do not correctly describe the geometric properties of ellipses.",
      "topic": "Ellipse and Conic Sections",
      "bloom_level": "Understand",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen004"
    },
    {
      "question_text": "Define a set and explain what distinguishes it from other mathematical collections.",
      "type": "Short Answer",
      "difficulty": "Easy",
      "options": null,
      "correct_answer": "A set is a well-defined collection of distinct objects, where each object is an element of the set. The key aspects that distinguish a set are that it contains unique items (no duplicates) and the order of the elements is irrelevant.",
      "explanation": "A set is defined as a collection of distinct objects. Unlike sequences or lists, sets disregard the order of elements and each element appears only once. This definition is central to set theory because it focuses on membership rather than order or repetition.",
      "topic": "Set Theory Basics",
      "bloom_level": "Remember",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen005"
    },
    {
      "question_text": "Briefly explain the contribution of Georg Cantor to the field of mathematics.",
      "type": "Short Answer",
      "difficulty": "Medium",
      "options": null,
      "correct_answer": "Georg Cantor established the modern theory of sets, developing concepts such as cardinality and different sizes of infinity. His work provided the foundation for many areas of mathematics including analysis, topology, and more.",
      "explanation": "Cantor's introduction of set theory and his work on understanding different degrees of infinity revolutionized mathematics. He showed that not all infinities are equal and introduced fundamental concepts that have influenced modern mathematical thinking.",
      "topic": "History of Set Theory",
      "bloom_level": "Understand",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen006"
    },
    {
      "question_text": "Describe the geometric definition of an ellipse based on the sum of distances from two fixed points.",
      "type": "Short Answer",
      "difficulty": "Medium",
      "options": null,
      "correct_answer": "An ellipse is defined as the set of all points in a plane for which the sum of the distances from two fixed points (called foci) is constant.",
      "explanation": "The geometric definition of an ellipse involves two fixed points called foci. For any point on the ellipse, the sum of the distances from that point to each focus remains constant. This property is fundamental in identifying an ellipse and is used in its standard derivation in analytic geometry.",
      "topic": "Ellipse and Conic Sections",
      "bloom_level": "Remember",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen007"
    },
    {
      "question_text": "Discuss how the concept of sets is used in defining relations and functions in mathematics. Provide examples to support your explanation.",
      "type": "Long Answer",
      "difficulty": "Medium",
      "options": null,
      "correct_answer": "Sets form the basic framework for defining relations and functions in mathematics. A relation is defined as a subset of the Cartesian product of two sets, meaning it consists of ordered pairs where the first element comes from one set and the second from another. For example, if A = {1, 2} and B = {2, 3}, then a relation R could be {(1,2), (2,3)}. A function is a special kind of relation where every element in the domain is paired with exactly one element in the codomain. For instance, the function f: A → B defined by f(1)=2 and f(2)=3 is a well-defined function because each element in A is mapped to one and only one element in B.",
      "explanation": "Sets are essential in forming the basis of relations and functions. A relation is essentially a connection between elements of two sets and is mathematically represented as a subset of the Cartesian product of these sets. A function adheres to a stricter condition where each element in the domain must map to a single element in the codomain. These definitions allow us to formally analyze and understand mathematical mappings and interactions across different fields.",
      "topic": "Set Theory Applications",
      "bloom_level": "Apply",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen008"
    },
    {
      "question_text": "Provide a proof or a detailed explanation showing that the ellipse is a conic section by deriving its standard equation using its geometric definition.",
      "type": "Long Answer",
      "difficulty": "Hard",
      "options": null,
      "correct_answer": "To prove that an ellipse is a conic section, start with its geometric definition: the set of all points (x, y) such that the sum of the distances to two fixed points (foci) F1 = (-c, 0) and F2 = (c, 0) is constant (2a). The distance from a point (x, y) to F1 is √((x + c)² + y²) and to F2 is √((x - c)² + y²). Setting up the equation √((x + c)² + y²) + √((x - c)² + y²) = 2a and then squaring both sides leads to the standard form of the ellipse after some algebraic manipulation. The final equation obtained is x²/a² + y²/b² = 1, where b² = a² - c². This derivation shows that the ellipse is indeed a conic section as it can be obtained by slicing a cone at an angle.",
      "explanation": "The proof begins with the geometric definition of the ellipse. By expressing the distances to the foci and using the constant sum property, we square the equation to eliminate the square roots, perform algebraic manipulations, and eventually isolate x and y terms to arrive at x²/a² + y²/b² = 1. This final equation is recognized as the standard form of an ellipse, thus proving that the ellipse is one of the conic sections.",
      "topic": "Ellipse and Conic Sections; Proofs",
      "bloom_level": "Create",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen009"
    },
    {
      "question_text": "Given the sets A = {1, 3, 5, 7} and B = {3, 4, 5, 6}, find the union, intersection, and difference A - B.",
      "type": "Numerical",
      "difficulty": "Easy",
      "options": null,
      "correct_answer": "Union: {1, 3, 4, 5, 6, 7}; Intersection: {3, 5}; Difference A - B: {1, 7}",
      "explanation": "Step 1: The union of A and B includes all elements present in either set: {1, 3, 5, 7} ∪ {3, 4, 5, 6} = {1, 3, 4, 5, 6, 7}.\nStep 2: The intersection of A and B consists of elements common to both sets: {3, 5}.\nStep 3: The difference A - B includes elements in A that are not in B: {1, 7}.",
      "topic": "Set Operations",
      "bloom_level": "Apply",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen010"
    },
    {
      "question_text": "Consider the ellipse with foci at (-3, 0) and (3, 0) and a constant sum of distances equal to 10. Determine the values of a, b, and c for the ellipse, and then write its standard equation.",
      "type": "Numerical",
      "difficulty": "Medium",
      "options": null,
      "correct_answer": "Given: foci at (-3, 0) and (3, 0) so c = 3, and constant sum 2a = 10, hence a = 5. Then b² = a² - c² = 25 - 9 = 16, so b = 4. The standard equation is: x²/25 + y²/16 = 1.",
      "explanation": "Step 1: The constant sum of the distances is given as 10, so 2a = 10, making a = 5.\nStep 2: The distance between the center and each focus is c = 3 (from the coordinates given).\nStep 3: Calculate b using the formula b² = a² - c² = 25 - 9 = 16, hence b = 4.\nStep 4: Substitute into the standard ellipse equation: x²/a² + y²/b² = x²/25 + y²/16 = 1.",
      "topic": "Ellipse and Conic Sections",
      "bloom_level": "Apply",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen011"
    },
    {
      "question_text": "If U is the universal set of integers from 1 to 12, let A = {2, 4, 6, 8, 10, 12} and B = {1, 2, 3, 5, 7, 11}. Determine the sets A ∪ B, A ∩ B, and A - B.",
      "type": "Numerical",
      "difficulty": "Medium",
      "options": null,
      "correct_answer": "A ∪ B: {1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12}; A ∩ B: {2}; A - B: {4, 6, 8, 10, 12}",
      "explanation": "Step 1: A ∪ B (union) includes all elements from both sets: {1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12}.\nStep 2: A ∩ B (intersection) includes the common element: {2}.\nStep 3: A - B (difference) includes elements in A that are not in B: {4, 6, 8, 10, 12}.",
      "topic": "Set Operations",
      "bloom_level": "Apply",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen012"
    },
    {
      "question_text": "For sets A, B, and C, let A = {1, 2}, B = {2, 3}, and C = {3, 4}. Compute (A ∪ B) ∩ C and explain each step in obtaining the result.",
      "type": "Numerical",
      "difficulty": "Easy",
      "options": null,
      "correct_answer": "(A ∪ B) = {1, 2, 3} and then (A ∪ B) ∩ C = {3}",
      "explanation": "Step 1: Calculate A ∪ B: combine all elements from A and B gives {1, 2, 3}.\nStep 2: Compute the intersection with C: {1, 2, 3} ∩ {3, 4} gives {3} as the only common element.",
      "topic": "Set Operations",
      "bloom_level": "Apply",
      "source": "generated",
      "chapter_id": "kemh101",
      "section_id": "02_section_1_1",
      "question_id": "cbse_xi_kemh1dd_c101_gen013"
    },
    {
        "question_text": "Which of the following collections is a well-defined set?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
        "A: The set of all tall people in the world",
        "B: The set of all odd natural numbers less than 10",
        "C: The set of all beautiful paintings in an art gallery",
        "D: The set of all famous movies"
        ],
        "correct_answer": "B: The set of all odd natural numbers less than 10",
        "explanation": "A well-defined set has a clear criterion to decide whether an element belongs or not. The set of odd natural numbers less than 10 (i.e. {1, 3, 5, 7, 9}) is well-defined because any natural number can clearly be checked for being odd and less than 10. The other options involve subjective or vague properties.",
        "topic": "Well-defined sets and definitions",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen014"
    },
    {
        "question_text": "In the roster form representation of a set, which of the following statements is true?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
        "A: The order in which elements are listed matters",
        "B: Elements can be repeated to stress importance",
        "C: All elements are taken as distinct and order is immaterial",
        "D: It can only represent finite sets"
        ],
        "correct_answer": "C: All elements are taken as distinct and order is immaterial",
        "explanation": "In roster form, each element of the set is listed only once, and the order in which the elements appear does not change the meaning of the set. Although infinite sets can sometimes be represented with ellipsis, the key point is that membership is independent of order and repetition.",
        "topic": "Representations of sets – Roster form",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen015"
    },
    {
        "question_text": "Select the correct set-builder form for the set {2, 4, 6, 8, ...}.",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
        "A: { x ∈ ℕ : x is even }",
        "B: { x : x = 2n, where n ∈ ℕ }",
        "C: Both A and B",
        "D: None of the above"
        ],
        "correct_answer": "C: Both A and B",
        "explanation": "Both options A and B correctly capture the idea that the set consists of all even natural numbers. Option A states x is even, while option B explicitly writes each element as 2n for some natural number n. Hence, both are correct representations.",
        "topic": "Set-builder notation",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen016"
    },
    {
        "question_text": "Define a well-defined set and provide one example to illustrate your definition.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A well-defined set is a collection of objects with a clear criterion for membership. For example, the set of vowels in the English alphabet V = {a, e, i, o, u} is well-defined because each letter can be decisively identified as a vowel or not.",
        "explanation": "A set is well-defined if for any given object, there is a clear rule determining whether it belongs to the set. In the example provided, the letters a, e, i, o, u clearly satisfy the property of being vowels, so the set is unambiguous.",
        "topic": "Well-defined sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen017"
    },
    {
        "question_text": "List the two methods used to represent sets and briefly explain each.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The two methods are: (1) Roster (or tabular) form – where elements of a set are listed inside braces, e.g., {1, 2, 3}, and (2) Set-builder form – where a set is described by a property that its elements satisfy, e.g., {x : x is a natural number less than 4}.",
        "explanation": "In roster form, all elements are listed explicitly (with repetition avoided and order irrelevant) while in set-builder form, one describes the property common to all elements in the set. Each method has its own uses depending on the set's characteristics (finite or infinite).",
        "topic": "Representations of sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen018"
    },
    {
        "question_text": "State and notate the set of positive rational numbers.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The set of positive rational numbers is denoted by Q⁺ and can be defined as {x ∈ Q : x > 0}.",
        "explanation": "Using standard notation, 'Q' represents rational numbers and the condition x > 0 ensures that only positive numbers are included. This provides a clear and concise description of Q⁺.",
        "topic": "Set notation and special sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen019"
    },
    {
        "question_text": "Explain why the collection of 'five most renowned mathematicians of the world' is not considered a well-defined set.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The collection is not well-defined because the criteria for being one of the 'five most renowned mathematicians' is subjective and can vary from person to person. Without clear, objective criteria, it is impossible to definitively determine membership.",
        "explanation": "For a collection to be well-defined, a precise and unambiguous rule must exist for determining membership. Since 'renowned' is a subjective measure and opinions differ, the set fails the test of being well-defined.",
        "topic": "Well-defined sets",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen020"
    },
    {
        "question_text": "Prove that the set of odd natural numbers is invariant under reordering in its roster form representation.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Proof: Let the set of odd natural numbers be O = {1, 3, 5, 7, ...}. By definition of a set, membership is determined solely by whether an element satisfies the property of being odd. Therefore, any arrangement of these elements (such as {3, 1, 7, 5, ...}) still includes exactly the same elements. Since the definition of equality for sets is that two sets are equal if they have precisely the same elements regardless of order, the reordering of elements in O does not change the set. Q.E.D.",
        "explanation": "The vital concept here is that in set theory the order of elements is irrelevant. The defining property of the set is that each element is odd. Reordering does not introduce or remove any element. Thus, regardless of how the elements are arranged, the set remains the same.",
        "topic": "Properties of sets – Roster form",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen021"
    },
    {
        "question_text": "Given the set A = {1, 2, 3, 6, 7, 14, 21, 42} (the set of all natural numbers that divide 42), convert it to set-builder form and explain why this form accurately captures every divisor of 42.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "Set-builder form: A = { x ∈ ℕ : x divides 42 }.\nExplanation: The condition 'x divides 42' is a precise statement about any natural number x. It means there exists an integer k such that 42 = x × k. This condition includes exactly those numbers which are divisors of 42, thereby ensuring that every and only those numbers appear in the set.",
        "explanation": "To convert from roster form to set-builder form, we identify the common property among the elements. Here, each element is a positive divisor of 42. By stating 'x divides 42,' we capture the precise necessary and sufficient condition for membership. Since any natural number satisfying x | 42 will be in the roster list, no element is omitted and no extraneous element is included.",
        "topic": "Set representations – Roster to set-builder conversion",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen022"
    },
    {
        "question_text": "Write the solution set of the equation x² + x - 2 = 0 in roster form.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "{1, -2}",
        "explanation": "Step 1: Factorize the equation x² + x - 2 = 0 as (x - 1)(x + 2) = 0.\nStep 2: Set each factor equal to zero: x - 1 = 0 implies x = 1 and x + 2 = 0 implies x = -2.\nThus, the solution set in roster form is {1, -2}.",
        "topic": "Equations and set representation",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen023"
    },
    {
        "question_text": "List in roster form all positive integers x such that x² < 40.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "{1, 2, 3, 4, 5, 6}",
        "explanation": "Step 1: Find the maximum integer x for which x² < 40. Since 6² = 36 and 7² = 49, x must be ≤ 6.\nStep 2: List all positive integers from 1 to 6. Hence, the set is {1, 2, 3, 4, 5, 6}.",
        "topic": "Inequalities and set representation",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen024"
    },
    {
        "question_text": "Write the set A = {1, 4, 9, 16, 25, ...} in set-builder form.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A = { x ∈ ℕ : ∃ n ∈ ℕ such that x = n² } or simply A = { x : x = n², where n ∈ ℕ }.",
        "explanation": "Each element of the set A is a perfect square of a natural number. The set-builder form encapsulates this by stating that there exists a natural number n such that x equals n².",
        "topic": "Set-builder notation",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen025"
    },
    {
        "question_text": "Express the set {½, 2/3, 3/4, 4/5, 5/6, 6/7} in set-builder form and explain why this representation uniquely describes the set.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The set can be expressed as { x : x = n/(n+1), where n ∈ ℕ and 1 ≤ n ≤ 6 }.",
        "explanation": "Step 1: Notice that in each fraction, the numerator is one less than the denominator.\nStep 2: Represent a generic term as n/(n+1), where n is the numerator.\nStep 3: Since the fractions given start from 1/2 (n=1) and end at 6/7 (n=6), the condition 1 ≤ n ≤ 6 is added. This set-builder notation precisely captures the pattern and ensures that only the given fractions are included.",
        "topic": "Set-builder notation and pattern recognition",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "03_section_1_2",
        "question_id": "cbse_xi_kemh1dd_c101_gen026"
    }, 

    {
        "question_text": "Which of the following are sets? Justify your answer. (i) The collection of all the months of a year beginning with the letter J. (ii) The collection of ten most talented writers of India. (iii) A team of eleven best‐cricket batsmen of the world. (iv) The collection of all boys in your class. (v) The collection of all natural numbers less than 100. (vi) A collection of novels written by the writer Munshi Prem Chand. (vii) The collection of all even integers. (viii) The collection of questions in this Chapter. (ix) A collection of most dangerous animals of the world.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A mathematical set must be a well-defined collection in which, for each object, there is a definite criterion to decide membership. In the given list: (i) is a set if all months beginning with J (January, June, July) are clearly defined. (ii) and (iii) are not well-defined because criteria (\"ten most talented\" or \"best\") are subjective. (iv) and (v) are sets provided that the class and natural numbers (<100) are clearly specified. (vi) is a set as the novels written by Munshi Prem Chand can be listed. (vii) is a set by virtue of the defining property (even integers). (viii) is a set if the chapter is fixed. (ix) is not well-defined because “most dangerous” is subjective.",
        "explanation": "To determine if a collection qualifies as a mathematical set, we check whether there is a clear and objective property that decides whether any given element should be included. Subjective terms such as 'talented', 'best', or 'most dangerous' lack the necessary precision. For collections like months or natural numbers less than 100, the property is clear and objective. Thus, by analyzing each item one by one, the answer classifies which collections meet the well-defined criterion.",
        "topic": "Set Theory – Well-defined Sets",
        "bloom_level": "Analyze",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex001"
      },
      {
        "question_text": "Let A = {1, 2, 3, 4, 5, 6}. Insert the appropriate symbol (∈ or ∉) in the blank spaces: (i) 5 __ A (ii) 8 __ A (iii) 0 __ A (iv) 4 __ A (v) 2 __ A (vi) 10 __ A",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "5 ∈ A, 8 ∉ A, 0 ∉ A, 4 ∈ A, 2 ∈ A, 10 ∉ A.",
        "explanation": "For a number to belong to the set A = {1, 2, 3, 4, 5, 6}, it must be one of the listed elements. Since 5, 4, and 2 are in the set, we write 5 ∈ A, 4 ∈ A, and 2 ∈ A. On the other hand, 8, 0, and 10 are not in the set, so we have 8 ∉ A, 0 ∉ A, and 10 ∉ A.",
        "topic": "Set Membership",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex002"
      },
      {
        "question_text": "Write the following sets in roster form: (i) A = { x : x is an integer and -3 ≤ x < 7 } (ii) B = { x : x is a natural number less than 6 } (iii) C = { x : x is a two-digit natural number such that the sum of its digits is 8 } (iv) D = { x : x is a prime number which is a divisor of 60 } (v) E = The set of all letters in the word TRIGONOMETRY (vi) F = The set of all letters in the word BETTER.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) A = {-3, -2, -1, 0, 1, 2, 3, 4, 5, 6}.\n(ii) B = {1, 2, 3, 4, 5}.\n(iii) C = {17, 26, 35, 44, 53, 62, 71, 80}.\n(iv) D = {2, 3, 5}.\n(v) E = {T, R, I, G, O, N, M, E, Y}.\n(vi) F = {B, E, T, R}.",
        "explanation": "For (i), list all integers starting at -3 up to but not including 7. For (ii), natural numbers less than 6 are 1 through 5. For (iii), identify two-digit numbers whose digits add up to 8 (e.g., 17: 1+7=8, 26: 2+6=8, etc.). For (iv), list the prime divisors of 60; since 60 factors as 2^2×3×5, the prime divisors are 2, 3, and 5. For (v) and (vi), list the unique letters from the given words, keeping in mind that repetition is omitted in set notation.",
        "topic": "Set Representations – Roster Form",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex003"
      },
      {
        "question_text": "Write the following sets in the set-builder form: (i) {3, 6, 9, 12} (ii) {2, 4, 8, 16, 32} (iii) {5, 25, 125, 625} (iv) {2, 4, 6, ...} (v) {1, 4, 9, ..., 100}.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) { x : x = 3n, where n ∈ {1,2,3,4} } or equivalently { x : x is a multiple of 3 and 3 ≤ x ≤ 12 }.\n(ii) { x : x = 2^n, where n ∈ {1,2,3,4,5} }.\n(iii) { x : x = 5^n, where n ∈ {1,2,3,4} }.\n(iv) { x : x = 2n, where n ∈ ℕ }.\n(v) { x : x = n^2, where n ∈ ℕ and 1 ≤ n ≤ 10 }.",
        "explanation": "For each set, recognize the underlying pattern. (i) numbers are 3, 6, 9, 12 which can be written as 3×n where n takes specific values. (ii) and (iii) are geometric sequences with bases 2 and 5, respectively. (iv) represents the even numbers and (v) represents perfect squares from 1^2 up to 10^2.",
        "topic": "Set Representations – Set-Builder Notation",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex004"
      },
      {
        "question_text": "List all the elements of the following sets: (i) A = { x : x is an odd natural number } (ii) B = { x : x is an integer, -½ ≤ x ≤ 9/2 } (iii) C = { x : x is an integer, x² ≤ 4 } (iv) D = { x : x is a letter in the word “LOYAL” } (v) E = { x : x is a month of a year not having 31 days } (vi) F = { x : x is a consonant in the English alphabet which precedes k }.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) A is infinite: {1, 3, 5, 7, ...}.\n(ii) B = {0, 1, 2, 3, 4} because these are the integers between -0.5 and 4.5.\n(iii) C = {-2, -1, 0, 1, 2} since x² ≤ 4 holds for these values.\n(iv) D = {L, O, Y, A} (unique letters in 'LOYAL').\n(v) E = {February, April, June, September, November} as these months do not have 31 days.\n(vi) F = {B, C, D, F, G, H, J} – the English alphabet letters before k, excluding vowels (A, E, I).",
        "explanation": "For (i), note that the set of odd natural numbers is unbounded, so we denote it with ellipsis. For (ii), list integers based on the given inequality. For (iii), solve x² ≤ 4, yielding x values from -2 to 2. For (iv), extract unique characters from the word. For (v), knowledge of the calendar is used to identify months without 31 days. For (vi), list the consonants that occur before the letter 'k' in the English alphabet (letters A to J, with vowels removed).",
        "topic": "Set Representations – Listing Elements",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex005"
      },
      {
        "question_text": "Match each of the sets on the left in roster form with the corresponding set on the right described in set-builder form: (i) {1, 2, 3, 6} (ii) {2, 3} (iii) {M, A, T, H, E, I, C, S} (iv) {1, 3, 5, 7, 9} with (a) { x : x is a prime number and a divisor of 6 } (b) { x : x is an odd natural number less than 10 } (c) { x : x is a natural number and divisor of 6 } (d) { x : x is a letter of the word MATHEMATICS }.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) {1, 2, 3, 6} matches (c) because these are all natural number divisors of 6. (ii) {2, 3} matches (a) since 2 and 3 are both prime numbers and divisors of 6. (iii) {M, A, T, H, E, I, C, S} matches (d) as they are the letters in the word MATHEMATICS (excluding the repeated letter). (iv) {1, 3, 5, 7, 9} matches (b) since these are odd natural numbers less than 10.",
        "explanation": "Analyze each set: (i) lists all divisors of 6, regardless of primality, which corresponds to option (c); (ii) only contains the prime divisors of 6, corresponding to (a); (iii) is a letter set from the word MATHEMATICS, matching (d); (iv) is clearly the set of odd natural numbers less than 10, matching (b).",
        "topic": "Set Theory – Matching Roster and Set-Builder Forms",
        "bloom_level": "Analyze",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex006"
      },

      {
        "question_text": "Which symbol is commonly used to denote the empty set?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "Ø",
          "ℕ",
          "ℝ",
          "ℤ"
        ],
        "correct_answer": "Ø",
        "explanation": "The empty set is denoted by Ø (or alternatively by {}), and it represents a set that contains no elements. The other symbols represent the sets of natural numbers (ℕ), real numbers (ℝ), and integers (ℤ).",
        "topic": "Empty Set Definition",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen027"
      },
      {
        "question_text": "Which of the following sets is an example of an empty set based on the given definitions?\n\nA = { x : x is an even prime number greater than 2 }\nB = { x : x^2 = 4 and x is odd }\nC = { x : 1 < x < 2, where x is a natural number }\nD = { x : x is a student presently studying in Class XI }",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "A only",
          "B and C only",
          "A, B and C",
          "All of the above"
        ],
        "correct_answer": "B and C only",
        "explanation": "Set A is defined as even prime numbers greater than 2. Since 2 is the only even prime number, there is no even prime number greater than 2, so A is empty. Set B is also empty because the equation x² = 4 has solutions 2 and -2, but neither is odd. Set C is empty because no natural number exists strictly between 1 and 2. However, set D is not empty because it represents actual students studying in Class XI. Although option A is also empty, note that the correct grouping provided in the options is B and C only. Hence, the intended correct answer according to the provided options is 'B and C only'.",
        "topic": "Examples of Empty Sets",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen028"
      },
      {
        "question_text": "Consider the set B = { x : x is a student presently studying in both Classes X and XI } as defined in the textbook. Which of the following statements is true?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "B contains exactly one element.",
          "B is a finite non-empty set.",
          "B is an infinite set.",
          "B is an empty set."
        ],
        "correct_answer": "B is an empty set.",
        "explanation": "A student cannot be studying in both Classes X and XI simultaneously. Hence, there are no elements in set B, which means that B is an empty set.",
        "topic": "Empty Set Concept",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen029"
      },
      {
        "question_text": "Define an empty set in your own words.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "An empty set is a set that contains no elements.",
        "explanation": "An empty set, also known as a null or void set, has no elements. This definition is straightforward and emphasizes the absence of any members in the set.",
        "topic": "Empty Set Definition",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen030"
      },
      {
        "question_text": "Explain why the set D = { x : x² = 4, where x is odd } is an empty set.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The equation x² = 4 has solutions x = 2 and x = -2, but neither of these values is odd. Therefore, the condition 'x is odd' cannot be satisfied, making the set D empty.",
        "explanation": "To solve x² = 4, we find x = 2 and x = -2. The property 'x is odd' requires that x must be an odd number. Since 2 and -2 are even numbers, no element in the solution set meets the oddness condition, leading to an empty set.",
        "topic": "Empty Set Examples",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen031"
      },
      {
        "question_text": "Provide an example of an empty set that is not mentioned in the textbook section and justify why it is empty.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Example: E = { x : x is a natural number such that 100 < x < 101 } is empty because no natural number exists between 100 and 101.",
        "explanation": "The set E is defined to contain natural numbers x that satisfy 100 < x < 101. Since there is no natural number between 100 and 101 (as natural numbers are whole numbers and consecutive), the set E contains no elements, making it empty.",
        "topic": "Creating Examples of Empty Sets",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen032"
      },
      {
        "question_text": "Prove that the set B = { x : x is a student presently studying in both Classes X and XI } is an empty set. Provide a detailed explanation based on the properties of classes.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Proof: By definition, a student is enrolled in only one class at a time in a typical school system. Since Classes X and XI are distinct and sequential, no student can be enrolled in both simultaneously. Therefore, the set B, which requires that a student belongs to both classes concurrently, must contain no elements. Hence, B is the empty set.",
        "explanation": "1. Understand that Class X and Class XI are distinct. \n2. A student can only be enrolled in one class level at any given time. \n3. The definition of set B insists on the simultaneous enrollment in both classes, which is impossible. \n4. Since no student meets this criterion, B has zero elements, and by definition, it is an empty set.",
        "topic": "Proofs Involving Empty Sets",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen033"
      },
      {
        "question_text": "Discuss why the set A = { x : 1 < x < 2, where x is a natural number } is empty even though the inequality 1 < x < 2 has solutions in the real numbers.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "The inequality 1 < x < 2 has many solutions if x is allowed to be any real number. However, when we restrict x to be a natural number (positive integers), no natural number exists between 1 and 2. Hence, the set A is empty because the property defining its elements cannot be satisfied by any natural number.",
        "explanation": "1. The inequality 1 < x < 2 is valid over the real numbers and has infinitely many solutions (such as 1.5, 1.7, etc.).\n2. The set A restricts x to natural numbers. The natural numbers are counting numbers: 1, 2, 3, ...\n3. There is no natural number between 1 and 2, as the natural numbers are discrete with a gap of at least 1 between consecutive elements.\n4. Consequently, even though the inequality has solutions in the reals, it has none in the natural numbers, making the set empty.",
        "topic": "Understanding Empty Sets",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen034"
      },
      {
        "question_text": "A school records that there are 40 students in Class XI. If set A is defined as the set of students in Class XI and set B is defined as the set of students enrolled in both Class X and Class XI, find the number of elements in each set.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "Set A contains 40 elements, while set B, due to the impossibility of dual enrollment, contains 0 elements.",
        "explanation": "Since set A represents the actual count of Class XI students, it contains 40 elements. Set B requires students to be simultaneously enrolled in Class X and XI. Given the structure of class enrollment, no student can belong to both classes at once, so set B is empty (0 elements).",
        "topic": "Application of Empty Set Concept",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen035"
      },
      {
        "question_text": "Determine whether the set E = { x : x² – 2 = 0 and x is a rational number } is empty. Provide a step-by-step justification.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The set E is empty because the solutions of x² – 2 = 0 are x = √2 and x = -√2, both of which are irrational numbers. Thus, there are no rational solutions.",
        "explanation": "Step 1: Solve the equation x² – 2 = 0. \n→ x² = 2 \n→ x = √2 or x = -√2. \nStep 2: Analyze the nature of the solutions. √2 and -√2 are irrational numbers. \nStep 3: Since the set E is restricted to rational numbers and neither solution is rational, E contains no elements and is therefore empty.",
        "topic": "Empty Set and Irrational Numbers",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen036"
      },
      {
        "question_text": "Let F = { x : x divides 6 and x is an odd integer }. List all the elements in F and determine its cardinality.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The divisors of 6 are ±1, ±2, ±3, ±6. The odd divisors among these are ±1 and ±3. However, if we consider only positive divisors as is customary, then F = {1, 3} with a cardinality of 2.",
        "explanation": "Step 1: Determine all divisors of 6: 1, 2, 3, 6 (and their negatives if considering all integers).\nStep 2: Identify the odd divisors. Among the positive divisors, 1 and 3 are odd.\nStep 3: Therefore, F = {1, 3} and the number of elements (cardinality) is 2.",
        "topic": "Cardinality and Set Composition",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen037"
      },
      {
        "question_text": "Calculate the cardinality of the empty set and explain why the result holds true.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The cardinality of the empty set is 0 because it contains no elements.",
        "explanation": "By definition, the empty set does not contain any elements. Cardinality refers to the number of elements in a set. Since there are 0 elements in the empty set, its cardinality is 0.",
        "topic": "Cardinality of Sets and Empty Set",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen038"
      },
      {
        "question_text": "Consider the set J = { x : x is a prime number less than 10 }. Find the elements of J and compute its cardinality.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The prime numbers less than 10 are 2, 3, 5, and 7. Thus, J = {2, 3, 5, 7} and its cardinality is 4.",
        "explanation": "Step 1: List all prime numbers less than 10: 2, 3, 5, and 7.\nStep 2: The set J therefore is {2, 3, 5, 7}.\nStep 3: Count the number of elements: there are 4 elements, so the cardinality is 4.",
        "topic": "Set Elements and Cardinality",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen039"
      },
      {
        "question_text": "If a teacher mistakenly creates the set K = { x : x is an even prime number } and then later refines it to L = { x : x is an even prime number greater than 2 }, find the cardinality of both sets and explain the difference.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The set K is not empty and contains one element, 2, because 2 is the only even prime number. The set L is empty because there is no even prime number greater than 2.",
        "explanation": "Step 1: For set K, the condition is 'even prime number'. The only even prime is 2, so K = {2} and its cardinality is 1.\nStep 2: For set L, the condition is 'even prime number greater than 2'. Since 2 is the only even prime and it does not satisfy 'greater than 2', L has no elements and its cardinality is 0.\nStep 3: This demonstrates how a slight change in conditions can turn a non-empty set into an empty set.",
        "topic": "Set Definitions and Cardinality",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "05_section_1_3",
        "question_id": "cbse_xi_kemh1dd_c101_gen040"
      },
      {
        "question_text": "Which of the following sets is infinite?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "{1, 2, 3, 4}",
          "{a, b, c, d, e, f}",
          "The set of all prime numbers",
          "{x ∈ ℕ : x² = 4}"
        ],
        "correct_answer": "The set of all prime numbers",
        "explanation": "The set of all prime numbers is infinite because there is no largest prime number; by Euclid's theorem, there are infinitely many primes. The other options are finite sets.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen041"
      },
      {
        "question_text": "Which of the following roster forms correctly represents an infinite set?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "{1, 2, 3, …}",
          "{a, b, c}",
          "{2, 4, 6, 8}",
          "{0, 1, 2, 3}"
        ],
        "correct_answer": "{1, 2, 3, …}",
        "explanation": "The notation with ellipsis (three dots) indicates an infinite sequence that goes on indefinitely. The other sets list a finite number of elements.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen042"
      },
      {
        "question_text": "For the set defined by S = {x ∈ ℕ: x² = 4}, which of the following is true?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "S is infinite because there are infinite x values.",
          "S is finite and S = {2}.",
          "S is infinite because natural numbers are infinite.",
          "S is finite and S = {–2, 2}."
        ],
        "correct_answer": "S is finite and S = {2}.",
        "explanation": "The equation x² = 4 has two solutions in ℤ, but the set is defined over ℕ (natural numbers), so only 2 qualifies. Therefore, S contains exactly one element and is finite.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen043"
      },
      {
        "question_text": "Why is it not possible to describe the set of all real numbers in roster form?",
        "type": "MCQ",
        "difficulty": "Hard",
        "options": [
          "Because the set of real numbers follows no particular pattern.",
          "Because the set of real numbers is finite.",
          "Because the real numbers only include rationals in roster form.",
          "Because the roster form is only used for prime numbers."
        ],
        "correct_answer": "Because the set of real numbers follows no particular pattern.",
        "explanation": "While many infinite sets can be partially described by a pattern followed by ellipsis, the set of real numbers is too complex and lacks a simple, uniform pattern that can be fully captured in roster form.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen044"
      },
      {
        "question_text": "Define a finite set and provide an example.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A finite set is a set that is either empty or consists of a definite, countable number of elements. For example, the set of days of the week, W = {Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday}, is finite.",
        "explanation": "A finite set has a specific number, or count, of elements. In the example, there are exactly 7 elements in the set of days of the week.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen045"
      },
      {
        "question_text": "Explain what is meant by representing a set in 'roster form'.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "Representing a set in roster form means listing all the elements of the set between braces {}. For infinite sets, a pattern is indicated with ellipsis (…), showing that the list continues.",
        "explanation": "The roster form is a method of specifying a set by explicitly writing its elements. When a set is infinite, it is impractical to list every element, so ellipsis is used after listing a few terms that indicate the pattern.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen046"
      },
      {
        "question_text": "Determine whether the set T = {x ∈ ℕ: x² – 9 = 0} is finite or infinite and justify your answer.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The set T is finite. Solving the equation x² – 9 = 0 gives x = 3 or x = -3, but since x ∈ ℕ, only x = 3 is valid. Thus, T = {3}, which is finite.",
        "explanation": "The equation x² – 9 = 0 factors to (x-3)(x+3)=0. Given the domain is natural numbers, only the positive solution is acceptable. A single-element set is finite.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen047"
      },
      {
        "question_text": "Using Euclid's method, prove that the set of prime numbers is infinite.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "Assume, for contradiction, that there are finitely many prime numbers: p₁, p₂, …, pₙ. Consider the number Q = p₁ × p₂ × … × pₙ + 1. Q is greater than 1 and is not divisible by any of the primes p₁, p₂, …, pₙ because it leaves a remainder of 1 when divided by any of them. Therefore, either Q is prime itself or it has prime factors not in our list, contradicting the assumption that we had all primes. Hence, the set of prime numbers is infinite.",
        "explanation": "This is the classical proof by contradiction. By constructing Q, we show that no finite list of primes can account for all prime numbers, as Q always gives a remainder of 1 when divided by any prime in the list. This logical contradiction implies there must be infinitely many primes.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen048"
      },
      {
        "question_text": "Provide a detailed proof to demonstrate that the set of natural numbers, ℕ, is infinite.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "We prove by contradiction. Suppose ℕ is finite and let its elements be 1, 2, …, N. Consider the number N + 1, which is also a natural number. However, N + 1 is not in the list {1, 2, …, N}. This contradiction shows that our assumption was incorrect, thereby proving that ℕ is infinite.",
        "explanation": "Assuming ℕ is finite leads to the logical contradiction that there exists a natural number (N+1) not included in the finite list from 1 to N. This demonstration utilizes the concept of contradiction to show that natural numbers extend indefinitely.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen049"
      },
      {
        "question_text": "Given the sets A = {1, 2, 3, 4, 5} and B = {a, b, c, d, e, g}, determine n(A) and n(B).",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "n(A) = 5 and n(B) = 6.",
        "explanation": "The notation n(S) denotes the number of elements in a set S. Counting the elements in set A gives 5, and in set B gives 6.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen050"
      },
      {
        "question_text": "For a set C which is known to contain a finite number n of elements, where n = 7, list a possible roster form representation of C.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A possible roster form for C is {c₁, c₂, c₃, c₄, c₅, c₆, c₇}.",
        "explanation": "Since the set has exactly 7 elements, they can be represented by any 7 distinct symbols or values. The roster form lists each element between braces.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen051"
      },
      {
        "question_text": "The set D is defined as the set of days in a week. Determine n(D) and explain why D is considered a finite set.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "n(D) = 7; D is finite because it contains exactly 7 distinct elements representing the days of the week.",
        "explanation": "There are 7 days in a week, each being distinct. Since the set has a specific and countable number of elements (7), it qualifies as a finite set.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen052"
      },
      {
        "question_text": "Consider the set E defined by {x ∈ ℕ : 2x – 1 = 0}. Calculate n(E) and justify your answer.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "n(E) = 0; solving 2x – 1 = 0 gives x = 0.5, which is not a natural number, hence E is the empty set.",
        "explanation": "Natural numbers (ℕ) are conventionally taken to be positive integers (or non-zero integers, depending on definition). Since the solution x = 0.5 does not belong to ℕ, the equation has no solution in ℕ, meaning E is empty. The empty set is finite and its cardinality is 0.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen053"
      },
      {
        "question_text": "For the set F = {x ∈ ℕ : x is odd}, determine whether F is finite or infinite and provide a rationale for your answer.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "F is infinite because there are infinitely many odd natural numbers.",
        "explanation": "The sequence of odd numbers continues without bound (1, 3, 5, 7, …). Since there is no largest odd number, the set F does not have a finite number of elements, making it infinite.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen054"
      },
      {
        "question_text": "Explain why the set of real numbers cannot be completely described using roster form.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The set of real numbers cannot be fully described in roster form because it is uncountably infinite and its elements do not follow a simple pattern that can be used to list them all.",
        "explanation": "A roster form requires explicitly listing all elements or showing a clear pattern. The real numbers are too vast (uncountably infinite) and lack a uniform pattern suitable for such representation, unlike sets such as natural numbers or odd numbers.",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "06_section_1_4",
        "question_id": "cbse_xi_kemh1dd_c101_gen055"
      },
      {
        "question_text": "Which of the following correctly defines equal sets?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "They have at least one common element.",
          "They have exactly the same elements.",
          "They have the same number of elements regardless of value.",
          "They share a common property but not necessarily all elements."
        ],
        "correct_answer": "They have exactly the same elements.",
        "explanation": "Two sets A and B are considered equal if every element of A is in B and every element of B is in A. This means that the sets have exactly the same elements regardless of the order or any repetition in the listing.",
        "topic": "Equal Sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen056"
      },
      {
        "question_text": "Consider the sets A = {4, 5, 6, 4} and B = {6, 4, 5}. Which statement is correct?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "A ≠ B because repetition in A makes it different.",
          "A = B because repetition does not affect the set's content.",
          "A ⊂ B but not equal to B.",
          "B is a proper subset of A due to extra occurrence of 4."
        ],
        "correct_answer": "A = B because repetition does not affect the set's content.",
        "explanation": "In set theory, repeated elements do not change the nature of the set. The distinct elements in both A and B are {4, 5, 6} so they are equal.",
        "topic": "Equal Sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen057"
      },
      {
        "question_text": "Let A be the set of prime numbers less than 7 and P be the set of prime factors of 42. Are these two sets equal?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "Yes, because both sets equal {2, 3, 5}.",
          "Yes, because both sets equal {2, 3, 7}.",
          "No, because A = {2, 3, 5} and P = {2, 3, 7}.",
          "No, because repetition in listing does not matter and so they cannot be equal."
        ],
        "correct_answer": "No, because A = {2, 3, 5} and P = {2, 3, 7}.",
        "explanation": "The set A contains prime numbers less than 7: {2, 3, 5}. The set P includes the prime factors of 42 which are {2, 3, 7}. Since 5 ≠ 7, the sets are not equal.",
        "topic": "Equal Sets",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen058"
      },
      {
        "question_text": "Which one of the following statements about sets is false?",
        "type": "MCQ",
        "difficulty": "Hard",
        "options": [
          "A set's description is determined solely by its distinct elements.",
          "The order of elements in a set does not affect its identity.",
          "Repeating an element in the description of a set changes the set.",
          "Two sets are equal if they have exactly the same elements."
        ],
        "correct_answer": "Repeating an element in the description of a set changes the set.",
        "explanation": "Repeating an element in a set's description does not change the set because sets are collections of distinct elements, regardless of repetition.",
        "topic": "Equal Sets",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen059"
      },
      {
        "question_text": "Define equal sets in your own words.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "Two sets are equal if every element of one set is also an element of the other, meaning they contain exactly the same distinct elements.",
        "explanation": "The definition requires showing that every element of set A is in set B and vice versa. This is the fundamental condition for two sets to be equal.",
        "topic": "Equal Sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen060"
      },
      {
        "question_text": "Explain why the sets A = {1, 2, 3} and B = {3, 1, 2, 2} are equal.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "They are equal because both sets have the same distinct elements: 1, 2, and 3. The repetition in B does not affect the actual elements of the set.",
        "explanation": "In set theory, each element is unique regardless of how many times it is listed. Therefore, the set B simplifies to {1, 2, 3} which is exactly A.",
        "topic": "Equal Sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen061"
      },
      {
        "question_text": "If C = {5} and D = {–5, 5}, explain why C and D are not equal.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "C and D are not equal because D contains an extra element (–5) that is not found in C.",
        "explanation": "For two sets to be equal, they must contain exactly the same elements. Since D includes –5 in addition to 5, while C only includes 5, the sets are unequal.",
        "topic": "Equal Sets",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen062"
      },
      {
        "question_text": "Describe what the empty set represents and give an example from the text.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The empty set, denoted by φ, represents a set with no elements. In Example 7 of the text, set B is given as an empty set.",
        "explanation": "An empty set is defined as a set that does not contain any elements. The notation φ is commonly used, and in the text, set B is compared with other non-empty sets to illustrate differences in equality.",
        "topic": "Equal Sets",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen063"
      },
      {
        "question_text": "Prove that if A = {1, 3, 5} and B = {5, 3, 1, 3, 1}, then A = B.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Step 1: Identify the distinct elements in A: {1, 3, 5}. Step 2: Identify the distinct elements in B: Although B is listed as {5, 3, 1, 3, 1}, its unique elements are {1, 3, 5}. Step 3: Since both sets contain exactly the same elements, we conclude that A = B.",
        "explanation": "A set is defined by its distinct members. Even though B lists some elements multiple times, only the unique elements determine the set. Listing the elements gives {1, 3, 5} for both A and B, proving the equality of the sets.",
        "topic": "Equal Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen064"
      },
      {
        "question_text": "Given three sets X = {1, 2, 3}, Y = {a, b, c} and Z = {1, 2, 3, a, b, c}, prove or disprove: If X ∩ Y = φ then X ∪ Y = Z.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "Since X ∩ Y = φ indicates that X and Y have no elements in common, the union X ∪ Y consists of all elements that are in either set, which is {1, 2, 3, a, b, c}. Given that Z is exactly defined as {1, 2, 3, a, b, c}, we have X ∪ Y = Z. Thus, the statement is true in this context.",
        "explanation": "Step 1: Note that X and Y are disjoint since their intersection is the empty set. Step 2: The union of two disjoint sets is simply the collection of all elements from both sets. Step 3: Here, X ∪ Y = {1, 2, 3} ∪ {a, b, c} = {1, 2, 3, a, b, c}, which is exactly Z. Hence the equality holds.",
        "topic": "Equal Sets",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen065"
      },
      {
        "question_text": "Let A = {2, 4, 6, 8} and B = {8, 6, 4, 2}. Determine if these sets are equal and justify your answer.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The sets A and B are equal because both contain exactly the same elements: {2, 4, 6, 8}. Order does not matter in a set.",
        "explanation": "Step 1: List the distinct elements of A: {2, 4, 6, 8}. Step 2: List the distinct elements of B: {8, 6, 4, 2}, which simplifies to the same set as A. Thus, A = B.",
        "topic": "Equal Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen066"
      },
      {
        "question_text": "Determine the sets C and D if C = {x: x – 3 = 0} and D = {x: x² = 9}. Then decide whether C and D are equal.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "For set C, solving x – 3 = 0 gives x = 3, so C = {3}. For set D, solving x² = 9 gives x = 3 and x = -3, so D = {3, -3}. Since D contains an extra element (-3) not in C, they are not equal.",
        "explanation": "Step 1: Solve x – 3 = 0 to get C = {3}. Step 2: Solve x² = 9 to get x = 3 or -3, hence D = {3, -3}. Step 3: Compare the two sets; because D ≠ C, the sets are not equal.",
        "topic": "Equal Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen067"
      },
      {
        "question_text": "Find the elements of the set E = {x: x² – 4 = 0} and set F = {x: x = 2 or x = -2}. Are E and F equal?",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Solve x² – 4 = 0 by factoring it as (x – 2)(x + 2) = 0, which gives x = 2 or x = -2, so E = {2, -2}. The set F is given as {2, -2}. Hence, E and F are equal.",
        "explanation": "Step 1: Factor the quadratic equation to obtain the roots x = 2 and x = -2. Step 2: Write E as {2, -2}. Step 3: Since F is defined explicitly as {2, -2}, they are equal.",
        "topic": "Equal Sets",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen068"
      },
      {
        "question_text": "Let A = {x: x ∈ ℤ and x² < 10} and B = {–3, –2, –1, 0, 1, 2, 3}. Determine if A and B are equal, showing all steps.",
        "type": "Numerical",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "To determine A, find all integers x such that x² < 10. Testing integers: (-3)² = 9, (-2)² = 4, (-1)² = 1, 0² = 0, 1² = 1, 2² = 4, 3² = 9; while 4² = 16 is too high. Thus, A = {–3, –2, –1, 0, 1, 2, 3}. Since B is defined as {–3, –2, –1, 0, 1, 2, 3}, A = B.",
        "explanation": "Step 1: Evaluate the inequality x² < 10 for integers. Step 2: Recognize that integers from -3 to 3 satisfy the inequality. Step 3: Compare A with B, noting that both sets contain the same elements.",
        "topic": "Equal Sets",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "07_section_1_5",
        "question_id": "cbse_xi_kemh1dd_c101_gen069"
      },
      {
        "question_text": "Which of the following are examples of the null (empty) set?\n(i) Set of odd natural numbers divisible by 2\n(ii) Set of even prime numbers\n(iii) { x : x is a natural number, x < 5 and x > 7 }\n(iv) { y : y is a point common to any two parallel lines }",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The null set is obtained in cases (i), (iii), and (iv). Explanation: (i) No natural number can be both odd and divisible by 2; (iii) The condition x < 5 and x > 7 is contradictory (no natural number satisfies both), and (iv) Two parallel lines do not intersect, so there is no common point. On the other hand, (ii) the set of even prime numbers is not empty because it contains the element 2.",
        "explanation": "Step 1: Analyze each option:\n• (i) The condition 'odd natural numbers divisible by 2' is impossible because an odd number cannot be divisible by 2; hence, the set is empty.\n• (ii) Even prime numbers: The only even prime is 2, so the set is {2}, which is non-empty.\n• (iii) The condition 'x < 5 and x > 7' has no solution among natural numbers; hence, the set is empty.\n• (iv) Any two parallel lines do not have any point in common; therefore, the set is empty.\nStep 2: Conclude that options (i), (iii), and (iv) yield the null set.\n\nTopic: Empty (Null) Sets\nBloom Level: Understand",
        "topic": "Empty Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex007"
      },
      {
        "question_text": "Which of the following sets are finite or infinite?\n(i) The set of months of a year\n(ii) {1, 2, 3, ...}\n(iii) {1, 2, 3, ...99, 100}\n(iv) The set of positive integers greater than 100\n(v) The set of prime numbers less than 99",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) Finite (12 months). (ii) Infinite (the pattern continues without end). (iii) Finite (exactly 100 elements with the first 100 positive integers). (iv) Infinite (there are infinitely many positive integers beyond 100). (v) Finite (only a limited number of prime numbers exist below 99).",
        "explanation": "Step 1: Evaluate each option:\n• (i) A year always has 12 months, hence finite.\n• (ii) The sequence {1, 2, 3, ...} denotes an infinite set (the natural numbers continue indefinitely).\n• (iii) The set from 1 to 100 includes exactly 100 numbers, making it finite.\n• (iv) The set of positive integers greater than 100 is unbounded, so it is infinite.\n• (v) There is a fixed, finite number of prime numbers less than 99.\n\nTopic: Finite and Infinite Sets\nBloom Level: Understand",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex008"
      },
      {
        "question_text": "State whether each of the following sets is finite or infinite:\n(i) The set of lines which are parallel to the x-axis\n(ii) The set of letters in the English alphabet\n(iii) The set of numbers which are multiples of 5\n(iv) The set of animals living on the earth\n(v) The set of circles passing through the origin (0, 0)",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) Infinite – every line parallel to the x-axis can be written as y = c, where c ∈ ℝ. (ii) Finite – there are 26 letters. (iii) Infinite – multiples of 5 continue indefinitely. (iv) Finite – at any given time, there is a finite number of animals. (v) Infinite – there are infinitely many circles that can pass through a fixed point.",
        "explanation": "Step 1: Analyze each option:\n• (i) Lines parallel to the x-axis have the form y = c for any real number c; since ℝ is infinite, the set is infinite.\n• (ii) The English alphabet consists of 26 unique letters, so it is finite.\n• (iii) Multiples of 5 take the form 5n for integer n, which are infinite in number.\n• (iv) Although the total count of animals is very large, it is bounded by physical and biological constraints; hence, finite.\n• (v) A circle passing through (0, 0) can be defined with many different centers and radii, making the set infinite.\n\nTopic: Finite and Infinite Sets\nBloom Level: Understand",
        "topic": "Finite and Infinite Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex009"
      },
      {
        "question_text": "In the following, state whether A = B or not:\n(i) A = { a, b, c, d } and B = { d, c, b, a }\n(ii) A = { 4, 8, 12, 16 } and B = { 8, 4, 16, 18 }\n(iii) A = { 2, 4, 6, 8, 10 } and B = { x : x is a positive even integer and x ≤ 10 }\n(iv) A = { x : x is a multiple of 10 } and B = { 10, 15, 20, 25, 30, … }",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) A = B because order does not matter in a set. (ii) A ≠ B because 12 is in A but 18 is in B. (iii) A = B because both represent the set {2, 4, 6, 8, 10}. (iv) A ≠ B because A contains all multiples of 10 while B includes elements (like 15, 25, …) that are not multiples of 10.",
        "explanation": "Step 1: Compare the elements of each set:\n• (i) Both sets contain the same four elements {a, b, c, d}; order is irrelevant in sets, so they are equal.\n• (ii) In the first set, the elements are {4, 8, 12, 16}; in the second set, notice the element 18 instead of 12, making them unequal.\n• (iii) The set defined in B includes all positive even integers up to 10 which exactly forms the set {2, 4, 6, 8, 10} identical to A.\n• (iv) A is defined as the set of all multiples of 10, while B starts with 10 but then includes numbers like 15 which are not multiples of 10. Hence, they are not equal.\n\nTopic: Equal Sets\nBloom Level: Understand",
        "topic": "Equal Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex010"
      },
      {
        "question_text": "From the sets given below, select equal sets:\nA = { 2, 4, 8, 12 }, B = { 1, 2, 3, 4 }, C = { 4, 8, 12, 14 }, D = { 3, 1, 4, 2 }, E = { -1, 1 }, F = { 0, a }, G = { 1, -1 }, H = { 0, 1 }",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The equal sets are: B and D (both equal to {1, 2, 3, 4}) and E and G (both equal to {-1, 1}). The other sets are distinct.",
        "explanation": "Step 1: Examine each set:\n• A = {2, 4, 8, 12} has no duplicate among other sets.\n• B = {1, 2, 3, 4} and D = {3, 1, 4, 2} contain exactly the same elements; order does not matter in sets.\n• C = {4, 8, 12, 14} differs by the element 14 instead of 12 compared to A.\n• E = {-1, 1} and G = {1, -1} are equal since they have the same two elements.\n• F = {0, a} and H = {0, 1} are different because the element 'a' (a variable or symbol) is not necessarily equal to 1.\nStep 2: Conclude that the only pairs of equal sets are B = D and E = G.\n\nTopic: Equal Sets\nBloom Level: Understand",
        "topic": "Equal Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex011"
      },
      {
        "question_text": "Which of the following notations represents an open interval on the real number line?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "(a, b)",
          "[a, b]",
          "[a, b)",
          "(a, b]"
        ],
        "correct_answer": "Option A: (a, b)",
        "explanation": "The notation (a, b) denotes an open interval, meaning that both endpoints a and b are not included in the interval.",
        "topic": "Intervals as subsets of R",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen070"
      },
      {
        "question_text": "Which of the following statements is true regarding the subset relation?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "A ⊆ A is false for non-empty sets.",
          "A ⊆ A is true only if A is non-empty.",
          "A ⊆ A is true for every set A.",
          "A ⊆ A is true only when A is a proper subset of itself."
        ],
        "correct_answer": "Option C: A ⊆ A is true for every set A.",
        "explanation": "By definition, every set is a subset of itself because each element of A is contained in A.",
        "topic": "Subsets and their properties",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen071"
      },
      {
        "question_text": "If A = {1, 3, 5} and B = {x: x is an odd natural number less than 6}, which of the following is true?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "A ⊂ B but B ⊄ A",
          "B ⊂ A but A ⊄ B",
          "A = B",
          "Neither A ⊂ B nor B ⊂ A"
        ],
        "correct_answer": "Option C: A = B",
        "explanation": "Since both sets contain exactly the elements {1, 3, 5}, they are equal, meaning A ⊆ B and B ⊆ A, hence A = B.",
        "topic": "Equality of sets and subsets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen072"
      },
      {
        "question_text": "Which statement correctly describes the empty set (∅) in terms of subsets?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "∅ is a subset of some sets but not all.",
          "∅ is not a subset of any set.",
          "∅ is a subset of every set.",
          "∅ is always equal to the set it is compared with."
        ],
        "correct_answer": "Option C: ∅ is a subset of every set.",
        "explanation": "By convention, the empty set is considered a subset of every set because the condition 'every element of ∅ is in any set' is vacuously true.",
        "topic": "Subsets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen073"
      },
      {
        "question_text": "Define what it means for a set A to be a subset of a set B. Provide one example with your definition.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A set A is a subset of a set B if every element of A is also an element of B. For example, if A = {2, 4} and B = {1, 2, 3, 4, 5}, then A ⊆ B.",
        "explanation": "The definition states that A ⊆ B if for all a ∈ A it is true that a ∈ B. The example provided demonstrates this relationship clearly.",
        "topic": "Subsets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen074"
      },
      {
        "question_text": "What is a proper subset? Provide the definition and give an illustrative example.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A set A is called a proper subset of B if every element of A is in B and there exists at least one element in B that is not in A. For example, A = {1, 2, 3} is a proper subset of B = {1, 2, 3, 4} since 4 ∈ B but 4 ∉ A.",
        "explanation": "The definition emphasizes that A must be contained in B, and besides equality, there must be an extra element in B, making the relationship proper.",
        "topic": "Proper Subsets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen075"
      },
      {
        "question_text": "Define a singleton set, and provide an example in your answer.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A singleton set is a set with exactly one element. For instance, the set {a} is a singleton set.",
        "explanation": "A singleton set has only one element. The example above clearly illustrates what a singleton set is by containing just a single element.",
        "topic": "Sets and Definitions",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen076"
      },
      {
        "question_text": "Express the set of all points between -3 and 5 (excluding the endpoints) using interval notation.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The interval notation is (-3, 5).",
        "explanation": "Since the endpoints -3 and 5 are not included, the notation uses parentheses: (-3, 5) represents an open interval.",
        "topic": "Intervals",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen077"
      },
      {
        "question_text": "Prove that every set A is a subset of itself using the definition of a subset.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Proof: By definition, A ⊆ A if for all x ∈ A, x is also in A. Since any element x that belongs to A obviously belongs to A (using the reflexive property of equality), the condition is satisfied for all x in A. Therefore, every set A is a subset of itself.",
        "explanation": "Step 1: Recall the definition of a subset: A ⊆ B if every element of A is in B. Step 2: Let B = A. Then for every x ∈ A, it is true that x belongs to A. This proves A ⊆ A by the definition, as no element violates the condition.",
        "topic": "Subset Properties",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen078"
      },
      {
        "question_text": "Let A, B, and C be sets such that A ∈ B and B ⊆ C. Investigate whether A ⊆ C always holds. Provide a proof or a counterexample.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "It is not necessarily true that A ⊆ C. Counterexample: Let A = {1}, B = {{1}, 2} and C = {{1}, 2, 3}. Here, A ∈ B because A = {1} is an element of B. Also, B ⊆ C because every element of B (namely {1} and 2) is in C. However, A ⊆ C does not hold because the element 1 ∈ A is not an element of C. Hence, A ⊆ C is false in this example.",
        "explanation": "Step 1: Understand that the relation A ∈ B means A is an element of B rather than a subset of B. Step 2: In the given counterexample, though B's elements are all in C, the individual elements from A may not be in C. Thus, the subset relation does not follow from A ∈ B and B ⊆ C.",
        "topic": "Subsets vs. Elements",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen079"
      },
      {
        "question_text": "Let A = {2, 4, 6, 8} and B = {x: x is an even number such that 2 ≤ x ≤ 10}. Determine whether A ⊆ B and whether B ⊆ A. Provide detailed reasoning.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A ⊆ B is True, since every element of A (2, 4, 6, 8) is in B. B ⊆ A is False, since B also contains 10, which is not in A.",
        "explanation": "Step 1: List elements in A (given) and B (even numbers from 2 to 10: {2, 4, 6, 8, 10}).\nStep 2: Check each element of A: 2, 4, 6, 8 are all in B. Therefore, A ⊆ B.\nStep 3: Check B: Since 10 ∈ B but 10 ∉ A, B is not a subset of A.",
        "topic": "Subset Relations",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen080"
      },
      {
        "question_text": "Let A be the set of all divisors of 24 and B be the set of all prime divisors of 24. Determine the subset relationship between A and B. Is B a proper subset of A?",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "B is a subset of A, and in this case a proper subset. Explanation: The divisors of 24 are {1, 2, 3, 4, 6, 8, 12, 24} and the prime divisors are {2, 3}. Since every prime divisor is a divisor of 24 and B does not equal A, B ⊂ A.",
        "explanation": "Step 1: List A = {1, 2, 3, 4, 6, 8, 12, 24}. Step 2: Identify prime divisors: only 2 and 3. Step 3: Since {2, 3} ⊆ A and B ≠ A, B is a proper subset of A.",
        "topic": "Divisor Sets and Subsets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen081"
      },
      {
        "question_text": "Express the set of non-negative real numbers in interval notation.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "[0, ∞)",
        "explanation": "Non-negative real numbers include all numbers starting from 0 and increasing to infinity. In interval notation, this is written as [0, ∞), where 0 is included (denoted by the square bracket) and ∞ is a concept, not an actual number, hence always used with a parenthesis.",
        "topic": "Intervals",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen082"
      },
      {
        "question_text": "Express the set {x: -3 ≤ x < 5} in interval notation, and then write it in set-builder form.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The interval notation is [-3, 5) and the set-builder form is {x ∈ ℝ: -3 ≤ x < 5}.",
        "explanation": "Step 1: The inequality -3 ≤ x < 5 shows that -3 is included (denoted by [) and 5 is excluded (denoted by )). Thus, the interval notation is [-3, 5).\nStep 2: Expressing it in set-builder notation gives: {x ∈ ℝ: -3 ≤ x < 5}.",
        "topic": "Intervals and Set-builder Notation",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen083"
      },
      {
        "question_text": "Let the interval A = (-2, 7] and the interval B = (-∞, 10). Determine whether A ⊆ B. Justify your answer.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A ⊆ B is True because every x in A satisfies -2 < x ≤ 7, and since all such x are less than 10 (and B extends to all numbers less than 10), every element of A is contained in B.",
        "explanation": "Step 1: Recognize that A consists of all real numbers greater than -2 and up to and including 7. Step 2: B is the set of all real numbers less than 10, which certainly includes all numbers from A because 7 ≤ 10. Therefore, A ⊆ B.",
        "topic": "Intervals",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "09_section_1_6",
        "question_id": "cbse_xi_kemh1dd_c101_gen084"
      },
      {
        "question_text": "Which of the following best defines the universal set in a given context?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "A set containing every object that exists in reality",
          "The basic set containing all elements of interest in a specific context",
          "A set of all prime numbers within natural numbers",
          "A set that is empty by definition"
        ],
        "correct_answer": "The basic set containing all elements of interest in a specific context",
        "explanation": "In mathematics, particularly in set theory for a given problem, the universal set is defined as the set that contains all items or elements under consideration. It is context-dependent and forms the basis for defining the subsets.",
        "topic": "Universal Set – Definition",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen085"
      },
      {
        "question_text": "In most textbooks, what symbol is used to denote the universal set?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "∅",
          "U",
          "ℕ",
          "R"
        ],
        "correct_answer": "U",
        "explanation": "The symbol 'U' is conventionally used to represent the universal set in problems where all subsets under discussion are contained within it.",
        "topic": "Universal Set – Notation",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen086"
      },
      {
        "question_text": "Consider the study of natural numbers. If A is the set of all even numbers (a subset of natural numbers), which statement is correct regarding the relationship between the universal set U and A?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "A is the universal set U",
          "U is a subset of A",
          "A is a subset of U",
          "A and U are disjoint sets"
        ],
        "correct_answer": "A is a subset of U",
        "explanation": "In this context, the universal set U consists of all elements (here, natural numbers) while A (set of even numbers) contains some of these elements. Therefore, A is a subset of U.",
        "topic": "Universal Set – Subsets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen087"
      },
      {
        "question_text": "In population studies, if U represents all people in the world, which of the following could serve as a valid subset?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "The set of all stars in the universe",
          "The set of all citizens of a particular country",
          "The set of all planets in the solar system",
          "The set of all colors in a rainbow"
        ],
        "correct_answer": "The set of all citizens of a particular country",
        "explanation": "When U is defined as all people in the world, a subset must be a group within that population. The citizens of a particular country form a subset of the universal set containing all people.",
        "topic": "Universal Set – Contextual Examples",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen088"
      },
      {
        "question_text": "Define the universal set in your own words.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The universal set is the complete set of elements under consideration in a given context.",
        "explanation": "The universal set is defined based on the context of the problem and includes all the elements from which subsets are drawn. For example, in a study of integers, the universal set might be the set of real numbers.",
        "topic": "Universal Set – Definition",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen089"
      },
      {
        "question_text": "Provide two examples of universal sets in different contexts and explain why they are chosen as universal sets.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Example 1: In a study of numbers, the universal set might be the set of natural numbers or real numbers, since these sets encompass all elements under investigation. Example 2: In a survey of high school students, the universal set might be the set of all enrolled students, as it represents the complete population considered.",
        "explanation": "Universal sets are chosen based on the context to ensure that all relevant elements are included. In numerical studies, the chosen set must contain all possible numbers under consideration, whereas in surveys, the universal set must include the entire population relevant to the study.",
        "topic": "Universal Set – Contextual Application",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen090"
      },
      {
        "question_text": "Explain the importance of choosing an appropriate universal set in solving problems involving subsets.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "An appropriate universal set is important because it provides a clear scope within which all subsets are defined, making it easier to apply set operations like unions, intersections, and complements, while avoiding ambiguity and ensuring consistent results.",
        "explanation": "Choosing a well-defined universal set ensures that all operations on subsets are logically consistent. It serves as a reference against which complements and other relationships are measured, which is critical in both theoretical and applied problems.",
        "topic": "Universal Set – Application",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen091"
      },
      {
        "question_text": "Describe how the concept of a universal set can be applied when analyzing the relationships between different subsets in a problem context.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The universal set provides the framework in which all subsets are considered. When analyzing relationships, such as intersections or complements, every operation is defined relative to this universal set. This helps in clearly demarcating what is included and what is left out.",
        "explanation": "By setting the boundaries through the universal set, one can precisely define operations like union (the combination of subsets), intersection (common elements), and complement (elements not in a given subset). This establishes consistency and clarity in problem-solving.",
        "topic": "Universal Set – Relationships",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen092"
      },
      {
        "question_text": "Discuss the role of the universal set in probability theory where events are subsets of a universal set and provide an example involving dice rolls or card draws.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "In probability theory, the universal set is the sample space, which includes all possible outcomes. For example, when rolling a six-sided die, the universal set is {1, 2, 3, 4, 5, 6}. Events are considered as subsets of this sample space. If an event is rolling an even number, then its subset is {2, 4, 6}. The probability is calculated by taking the number of favorable outcomes divided by the total number of outcomes in the universal set (sample space).",
        "explanation": "The universal set in probability acts as the basis for all calculations. It defines the context in which events occur. In the dice example, each outcome in the set has an equal chance of occurring. By identifying the subset corresponding to the event (even numbers) and performing the division, probability is determined. This method is essential for accurately assessing risk and chance in various scenarios.",
        "topic": "Universal Set – Applications in Probability",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen093"
      },
      {
        "question_text": "Prove that if A is a subset of the universal set U, then the complement of A (denoted by A') is also a subset of U.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "Proof: By definition, A ⊆ U means every element of A is also in U. The complement A' is defined as {x ∈ U | x ∉ A}. Since every element x in A' is explicitly taken from U, it follows that A' ⊆ U.",
        "explanation": "Step 1: Let x be an arbitrary element of A'. By the definition of the complement, x ∈ U and x ∉ A. Step 2: Since x is chosen from U, all elements of A' are contained in U by definition. Therefore, A' ⊆ U.\nThis straightforward argument demonstrates that complements, as defined within the universal set, will always be subsets of U.",
        "topic": "Universal Set – Properties of Complements",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen094"
      },
      {
        "question_text": "Given the universal set U = {1, 2, 3, …, 100} and the subset A as the set of all prime numbers in U, determine the number of elements in the complement of A.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The number of elements in A' is 100 minus the number of prime numbers between 1 and 100. There are 25 prime numbers between 1 and 100; hence, |A'| = 100 - 25 = 75.",
        "explanation": "Step 1: Identify the total number of elements in U, which is 100.\nStep 2: Count the number of prime numbers between 1 and 100 (which is 25).\nStep 3: Compute the complement by subtracting the count of primes from the total; therefore, |A'| = 100 - 25 = 75.",
        "topic": "Universal Set – Numerical Computation",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen095"
      },
      {
        "question_text": "In a school of 500 students, let U be the universal set of students. If 200 students participate in soccer, 150 in basketball, and 50 in both, calculate the number of students who participate in at least one sport.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Number of students in at least one sport = 200 + 150 - 50 = 300.",
        "explanation": "Step 1: Start with the number of students participating in soccer (200) and basketball (150).\nStep 2: Since 50 students play both sports, they are counted twice; subtract the overlap: 200 + 150 - 50 = 300.\nStep 3: Therefore, 300 students are involved in at least one sport.",
        "topic": "Universal Set – Inclusion-Exclusion Principle",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen096"
      },
      {
        "question_text": "In a survey of 1000 residents, 300 are left-handed and 200 wear glasses with 100 residents being both left-handed and wearing glasses. Calculate the number of residents who are neither left-handed nor wear glasses.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Number of residents with neither property = 1000 - (300 + 200 - 100) = 1000 - 400 = 600.",
        "explanation": "Step 1: Use the inclusion-exclusion principle: Total with at least one property = 300 + 200 - 100 = 400.\nStep 2: Subtract from the universal set: 1000 - 400 = 600 residents are neither left-handed nor wear glasses.",
        "topic": "Universal Set – Inclusion-Exclusion Principle",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen097"
      },
      {
        "question_text": "Let U be the set of integers from 1 to 50 and A be the set of even numbers within U. Find the cardinality of A and the cardinality of the complement A'.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "|A| = 25 and |A'| = 25.",
        "explanation": "Step 1: The even numbers between 1 and 50 are 2, 4, ..., 50. There are 25 even numbers (since 50/2 = 25).\nStep 2: Since U has 50 elements, the number in the complement A' is 50 - 25 = 25.",
        "topic": "Universal Set – Count and Complements",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen098"
      },
      {
        "question_text": "Given the universal set U = {1, 2, 3, …, 50} and two subsets A = {multiples of 3 in U} and B = {multiples of 5 in U}, compute the number of elements in A ∪ B.",
        "type": "Numerical",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "There are 16 multiples of 3, 10 multiples of 5, and 3 multiples of 15 in U. Therefore, |A ∪ B| = 16 + 10 - 3 = 23.",
        "explanation": "Step 1: Count the multiples of 3 between 1 and 50: Floor(50/3) = 16.\nStep 2: Count the multiples of 5 between 1 and 50: Floor(50/5) = 10.\nStep 3: Count the multiples of both 3 and 5 (i.e., 15): Floor(50/15) = 3.\nStep 4: Apply the inclusion-exclusion principle: |A ∪ B| = 16 + 10 - 3 = 23.",
        "topic": "Universal Set – Union and Inclusion-Exclusion",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "10_section_1_7",
        "question_id": "cbse_xi_kemh1dd_c101_gen099"
      },
      {
        "question_text": "Make correct statements by filling in the symbols ⊆ or ⊄ in the blank spaces: (i) {2, 3, 4} . . . {1, 2, 3, 4, 5}; (ii) {a, b, c} . . . {b, c, d}; (iii) {x : x is a student of Class XI of your school} . . . {x : x is a student of your school}; (iv) {x : x is a circle in the plane} . . . {x : x is a circle in the same plane with radius 1 unit}; (v) {x : x is a triangle in a plane} . . . {x : x is a rectangle in the plane}; (vi) {x : x is an equilateral triangle in a plane} . . . {x : x is a triangle in the same plane}; (vii) {x : x is an even natural number} . . . {x : x is an integer}",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) {2, 3, 4} ⊆ {1, 2, 3, 4, 5}; (ii) {a, b, c} ⊄ {b, c, d}; (iii) {x : x is a student of Class XI of your school} ⊆ {x : x is a student of your school}; (iv) {x : x is a circle in the plane} ⊄ {x : x is a circle in the same plane with radius 1 unit}; (v) {x : x is a triangle in a plane} ⊄ {x : x is a rectangle in the plane}; (vi) {x : x is an equilateral triangle in a plane} ⊆ {x : x is a triangle in the same plane}; (vii) {x : x is an even natural number} ⊆ {x : x is an integer}",
        "explanation": "For each statement, we verify whether every element of the first set is also an element of the second set. (i) 2, 3, and 4 are all present in {1, 2, 3, 4, 5} so the correct symbol is ⊆. (ii) Since 'a' is missing from {b, c, d}, the relation does not hold, thus ⊄ is used. (iii) Every student of Class XI is a student in the school, confirming the subset relation (⊆). (iv) Not all circles in the plane have radius 1 unit, so the relation is ⊄. (v) Triangles and rectangles are different figures, hence the relation is ⊄. (vi) Every equilateral triangle is a triangle, so ⊆ is correct. (vii) Every even natural number is an integer, so the relation is ⊆.",
        "topic": "Subsets",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex012"
      },
      {
        "question_text": "Examine whether the following statements are true or false: (i) {a, b} ⊄ {a, b, c}; (ii) {a, e} ⊆ {x : x is a vowel in the English alphabet}; (iii) {1, 2, 3} ⊂ {1, 3, 5}; (iv) {a} ⊂ {a, b, c}; (v) {a} ∈ {a, b, c}; (vi) {x : x is an even natural number less than 6} ⊆ {x : x is a natural number which divides 36}",
        "type": "True/False",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) False; (ii) True; (iii) False; (iv) True; (v) False; (vi) True",
        "explanation": "(i) Although {a, b} is indeed a subset of {a, b, c}, the statement uses ⊄, so it is false. (ii) The set {a, e} is correctly contained within the set of English vowels. (iii) The set {1, 2, 3} is not a subset of {1, 3, 5} because 2 is missing. (iv) {a} is a subset of {a, b, c} since its only element is contained. (v) The notation {a} ∈ {a, b, c} is false because a is an element of the set, not {a} as a set. (vi) The even natural numbers less than 6 are {2, 4}, and both 2 and 4 divide 36, so the subset relation is true.",
        "topic": "Subsets and Element vs. Subset Distinction",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex013"
      },
      {
        "question_text": "Let A = {1, 2, {3, 4}, 5}. Which of the following statements are incorrect and why? (i) {3, 4} ⊆ A; (ii) {3, 4} ∈ A; (iii) {{3, 4}} ⊆ A; (vii) {1, 2, 5} ∉ A; (viii) {1, 2, 3} ⊆ A; (ix) ∅ ∈ A",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) Incorrect – {3, 4} is not a subset of A since 3 and 4 are not individually elements of A; (ii) Correct – {3, 4} is an element of A; (iii) Correct – {{3, 4}} is a subset of A because its sole element, {3, 4}, is in A; (vii) Correct – {1, 2, 5} is not an element of A; (viii) Incorrect – {1, 2, 3} is not a subset because 3 is not in A; (ix) Incorrect – ∅ is not an element of A (though it is a subset of any set).",
        "explanation": "Analyze the structure of set A = {1, 2, {3, 4}, 5}. For (i), the set {3, 4} would be a subset of A only if both 3 and 4 were individual elements of A, which they are not. In (ii), {3, 4} is explicitly an element of A. For (iii), since the single element {3, 4} exists in A, the set {{3, 4}} is a subset. In (vii), although 1, 2, and 5 are in A individually, the set {1, 2, 5} as a whole does not appear as an element. In (viii), because 3 is missing from A, the subset relation fails. Finally, (ix) is incorrect because the empty set is a subset of every set but is not automatically an element unless specified.",
        "topic": "Subsets vs. Elements",
        "bloom_level": "Analyze",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex014"
      },
      {
        "question_text": "Write down all the subsets of the following sets: (i) {a}; (ii) {a, b}; (iii) {1, 2, 3}; (iv) ∅",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) Subsets of {a}: ∅, {a}; (ii) Subsets of {a, b}: ∅, {a}, {b}, {a, b}; (iii) Subsets of {1, 2, 3}: ∅, {1}, {2}, {3}, {1, 2}, {1, 3}, {2, 3}, {1, 2, 3}; (iv) Subsets of ∅: ∅",
        "explanation": "The number of subsets that can be formed from a set with n elements is 2ⁿ. Thus, for {a} (n=1) there are 2 subsets, for {a, b} (n=2) there are 4 subsets, and for {1, 2, 3} (n=3) there are 8 subsets. The empty set, having no elements, only has itself as a subset.",
        "topic": "Subsets and Power Sets",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex015"
      },
      {
        "question_text": "Write the following set expressions as intervals: (i) {x : x ∈ ℝ, -4 < x ≤ 6}; (ii) {x : x ∈ ℝ, -12 < x < -10}; (iii) {x : x ∈ ℝ, 0 ≤ x < 7}; (iv) {x : x ∈ ℝ, 3 ≤ x ≤ 4}",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) (-4, 6]; (ii) (-12, -10); (iii) [0, 7); (iv) [3, 4]",
        "explanation": "Interval notation provides a concise way to denote sets of real numbers. For (i), the inequality -4 < x ≤ 6 converts to (-4, 6] (with -4 excluded and 6 included). Similar reasoning applies to the rest: (ii) corresponds to (-12, -10), (iii) to [0, 7), and (iv) to [3, 4], based on whether end points are included or excluded.",
        "topic": "Intervals as Subsets of ℝ",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex016"
      },
      {
        "question_text": "Write the following intervals in set-builder form: (i) (-3, 0); (ii) [6, 12]; (iii) (6, 12]; (iv) [–23, 5)",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) {x ∈ ℝ : -3 < x < 0}; (ii) {x ∈ ℝ : 6 ≤ x ≤ 12}; (iii) {x ∈ ℝ : 6 < x ≤ 12}; (iv) {x ∈ ℝ : -23 ≤ x < 5}",
        "explanation": "To convert interval notation into set-builder form, express the condition on x that captures the interval. For example, (-3, 0) indicates all real x such that -3 < x < 0. Apply this process for the other intervals accordingly.",
        "topic": "Intervals and Set-Builder Notation",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex017"
      },
      {
        "question_text": "What universal set(s) would you propose for each of the following: (i) the set of right triangles; (ii) the set of isosceles triangles.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A suitable universal set for both cases is the set of all triangles in the Euclidean plane.",
        "explanation": "The universal set in a given context should include all objects under consideration. For problems dealing with triangles, considering the set of all triangles in the Euclidean plane is appropriate, since it covers all types of triangles, including right and isosceles triangles.",
        "topic": "Universal Set",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex018"
      },
      {
        "question_text": "Given the sets A = {1, 3, 5}, B = {2, 4, 6} and C = {0, 2, 4, 6, 8}, which of the following may be considered as universal set(s) for all the three sets: (i) {0, 1, 2, 3, 4, 5, 6}; (ii) ∅; (iii) {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10}; (iv) {1, 2, 3, 4, 5, 6, 7, 8}",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "(i) and (iii)",
          "(i) and (iv)",
          "(ii) only",
          "(iii) only"
        ],
        "correct_answer": "(iii) only",
        "explanation": "A universal set for A, B, and C must contain every element of these sets. Set A contains {1, 3, 5}, B contains {2, 4, 6}, and C contains {0, 2, 4, 6, 8}. In order to cover all these elements, the universal set must include 0, 1, 2, 3, 4, 5, 6, and 8. Option (i) {0, 1, 2, 3, 4, 5, 6} is missing 8, option (iv) {1, 2, 3, 4, 5, 6, 7, 8} is missing 0, and (ii) is the empty set, which cannot serve as a universal set. Only option (iii) {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10} contains all the required elements.",
        "topic": "Universal Sets and Subsets",
        "bloom_level": "Analyze",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex019"
      },
      {
        "question_text": "Which diagram is used to represent the relationships between sets?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "Bar Diagram",
          "Venn Diagram",
          "Pie Chart",
          "Flowchart"
        ],
        "correct_answer": "Venn Diagram",
        "explanation": "Venn diagrams are specifically designed to represent relationships between sets using circles (for subsets) inside a rectangle (for the universal set).",
        "topic": "Venn Diagrams",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen100"
      },
      {
        "question_text": "Given U = {1,2,...,10}, A = {2,4,6,8,10} and B = {4,6}, which of the following statements is correct?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "A ⊂ B",
          "B ⊂ A",
          "A and B are disjoint",
          "B = A"
        ],
        "correct_answer": "B ⊂ A",
        "explanation": "Every element in set B (4 and 6) is also in set A (which is {2,4,6,8,10}), hence B is a subset of A (B ⊂ A).",
        "topic": "Subsets in Venn Diagrams",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen101"
      },
      {
        "question_text": "In a Venn diagram, which shape is commonly used to represent the universal set?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "Rectangle",
          "Circle",
          "Triangle",
          "Ellipse"
        ],
        "correct_answer": "Rectangle",
        "explanation": "The universal set is typically represented by a rectangle that encloses all subsets depicted by circles.",
        "topic": "Venn Diagram Structure",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen102"
      },
      {
        "question_text": "Which of the following set operations is least likely to be depicted accurately using Venn diagrams?",
        "type": "MCQ",
        "difficulty": "Hard",
        "options": [
          "Union",
          "Intersection",
          "Difference",
          "Cartesian Product"
        ],
        "correct_answer": "Cartesian Product",
        "explanation": "Venn diagrams are designed to represent unions, intersections, and differences among sets but are not typically used to represent Cartesian products, which involve ordered pairs.",
        "topic": "Set Operations in Venn Diagrams",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen103"
      },
      {
        "question_text": "Define a Venn diagram. Also, describe its main components.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A Venn diagram is a diagram that represents sets and their relationships using closed curves (usually circles) to depict subsets and a rectangle to represent the universal set. Its main components include the universal set (rectangle), subsets (circles), and regions that show how these sets intersect, unite, or differ.",
        "explanation": "A clear definition explains that Venn diagrams use a rectangle to show the universal set and circles for each subset. The overlapping areas between circles represent intersections (common elements) and the non-overlapping parts depict set differences.",
        "topic": "Introduction to Venn Diagrams",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen104"
      },
      {
        "question_text": "Explain the significance of the universal set in a Venn diagram.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The universal set in a Venn diagram represents all the elements under consideration. It provides the boundary within which every subset is contained, ensuring that all possible elements are accounted for when analyzing relationships between sets.",
        "explanation": "The universal set is crucial because it defines the context for the subsets. By representing all possible elements, it helps in identifying which elements are part of a specific subset and which are not, especially when computing complements or differences.",
        "topic": "Universal Set in Venn Diagrams",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen105"
      },
      {
        "question_text": "Discuss how Venn diagrams can be used to represent the intersection of two sets, A and B.",
        "type": "Short Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "In a Venn diagram, two overlapping circles represent sets A and B. The area where the two circles overlap corresponds to the intersection (A ∩ B), which contains all elements that A and B have in common.",
        "explanation": "When two sets are represented as circles, their overlapping region is a visual representation of the intersection. This diagrammatic approach makes it easy to identify common elements between sets A and B.",
        "topic": "Intersection in Venn Diagrams",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen106"
      },
      {
        "question_text": "How can the difference of two sets be depicted using a Venn diagram? Provide an explanation.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The difference of two sets A and B (written as A - B) is depicted in a Venn diagram as the portion of A's circle that does not overlap with B's circle. This part contains elements that belong exclusively to A and not to B.",
        "explanation": "By drawing two overlapping circles, one for each set, the area of A that does not intersect with the area of B visually illustrates the set difference A - B. This method clearly demarcates the elements that are unique to A.",
        "topic": "Set Difference in Venn Diagrams",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen107"
      },
      {
        "question_text": "Illustrate and explain with a Venn diagram how to represent the union of three sets, A, B, and C, given that some elements may belong to more than one set.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "To represent the union of three sets A, B, and C, draw a rectangle to denote the universal set. Inside this rectangle, draw three overlapping circles labeled A, B, and C. The union (A ∪ B ∪ C) is the area covered by all three circles combined, including their intersections. Even if elements appear in more than one set, they are included in the union as they exist in at least one of the sets.",
        "explanation": "Step 1: Draw a rectangle to represent the universal set. \nStep 2: Within the rectangle, draw three circles that partially overlap each other, labeling them as A, B, and C. \nStep 3: The union A ∪ B ∪ C is the total area covered by the three circles. \nThis shaded region shows all elements that are present in any of the sets, regardless of overlaps.",
        "topic": "Union of Sets in Venn Diagrams",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen108"
      },
      {
        "question_text": "Prove that for any sets A, B, and C, the intersection distributes over the union, i.e., A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C), using Venn diagrams as part of your explanation.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "Proof: Let x be an arbitrary element. \n1. If x ∈ A ∩ (B ∪ C), then x ∈ A and x ∈ (B ∪ C), so x ∈ A and (x ∈ B or x ∈ C). Therefore, x ∈ (A ∩ B) or x ∈ (A ∩ C), implying x ∈ (A ∩ B) ∪ (A ∩ C). \n2. Conversely, if x ∈ (A ∩ B) ∪ (A ∩ C), then either x ∈ A ∩ B or x ∈ A ∩ C. In either case, x ∈ A and (x ∈ B or x ∈ C), so x ∈ A ∩ (B ∪ C). \nThus, A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C). \nA Venn diagram with three circles clearly shows that the overlapping region of A with (B ∪ C) exactly matches the combined overlapping regions of A with B and A with C.",
        "explanation": "Step 1: Assume x is in A ∩ (B ∪ C), meaning it is in A and also in either B or C. This implies x will be found in A ∩ B or A ∩ C, thus in their union. \nStep 2: Conversely, if x is in (A ∩ B) ∪ (A ∩ C), then x is in A and in B or C, so x must belong to A ∩ (B ∪ C). \nThe Venn diagram visualizes these regions, confirming the equality.",
        "topic": "Set Theory - Distributive Laws",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen109"
      },
      {
        "question_text": "Given U = {1,2,3,...,10} and A = {2,4,6,8,10}, list the elements in the complement of A (U - A).",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The complement of A is {1,3,5,7,9}.",
        "explanation": "The universal set U = {1,2,...,10}. Removing elements of A ({2,4,6,8,10}) from U results in the complement: {1,3,5,7,9}.",
        "topic": "Set Complements in Venn Diagrams",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen110"
      },
      {
        "question_text": "For U = {1,2,3,...,10}, A = {2,4,6,8,10} and B = {3,6,9}, draw a Venn diagram and list the elements in A ∩ B.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The intersection A ∩ B is {6}.",
        "explanation": "Draw two overlapping circles within a rectangle representing U. Circle A includes {2,4,6,8,10} and circle B includes {3,6,9}. Their overlapping region contains the common element {6}.",
        "topic": "Intersection of Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen111"
      },
      {
        "question_text": "Using U = {1,2,3,...,10}, A = {2,4,6,8,10} and B = {4,6} (note B ⊂ A), find the number of elements in A - B.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A - B = {2,8,10}, so there are 3 elements.",
        "explanation": "The set A is {2,4,6,8,10} and B is {4,6}. Removing B's elements from A leaves {2,8,10}, which contains 3 elements.",
        "topic": "Set Difference",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen112"
      },
      {
        "question_text": "Consider three subsets A, B, and C within U = {1,2,3,...,15}: A = {2,4,6,8,10}, B = {3,6,9,12,15} and C = {1,2,3,4,5}. Draw a Venn diagram for these sets and determine: (i) A ∪ B ∪ C, (ii) A ∩ B, (iii) (A ∩ C) ∪ (B ∩ C).",
        "type": "Numerical",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "(i) A ∪ B ∪ C = {1,2,3,4,5,6,8,9,10,12,15}; (ii) A ∩ B = {6}; (iii) A ∩ C = {2,4} and B ∩ C = {3}, so (A ∩ C) ∪ (B ∩ C) = {2,3,4}.",
        "explanation": "Step 1: Find the union A ∪ B ∪ C by combining all unique elements from A = {2,4,6,8,10}, B = {3,6,9,12,15}, and C = {1,2,3,4,5} to get {1,2,3,4,5,6,8,9,10,12,15}. \nStep 2: For A ∩ B, compare A and B to find the common element {6}. \nStep 3: For A ∩ C, the common elements between A and C are {2,4}; for B ∩ C, the common element is {3}. Their union gives {2,3,4}. \nA Venn diagram with three overlapping circles would visually verify these results.",
        "topic": "Advanced Set Operations with Venn Diagrams",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "12_section_1_8",
        "question_id": "cbse_xi_kemh1dd_c101_gen113"
      },
      {
        "question_text": "Which property of set union states that A ∪ ∅ = A?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "Identity Law",
          "Commutative Law",
          "Associative Law",
          "Distributive Law"
        ],
        "correct_answer": "Identity Law",
        "explanation": "For any set A, union with the empty set (∅) leaves A unchanged. This is known as the Identity Law: A ∪ ∅ = A.",
        "topic": "Union of sets, properties",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen114"
      },
      {
        "question_text": "If B ⊆ A, then what is A ∪ B equal to?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "A",
          "B",
          "A ∩ B",
          "∅"
        ],
        "correct_answer": "A",
        "explanation": "When B is a subset of A, all elements of B are already in A, so the union A ∪ B = A.",
        "topic": "Union of sets, subset",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen115"
      },
      {
        "question_text": "Which property is depicted by the equality A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C)?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "Commutative Law",
          "Associative Law",
          "Distributive Law",
          "Identity Law"
        ],
        "correct_answer": "Distributive Law",
        "explanation": "The equality A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C) shows that the intersection distributes over the union. This is known as the Distributive Law in set theory.",
        "topic": "Properties of sets (Distributive Law)",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen116"
      },
      {
        "question_text": "Which of the following statements is always true for any two sets A and B?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "A – B = B – A",
          "A – B ∩ (A ∩ B) = ∅",
          "The sets A – B, A ∩ B, and B – A are mutually disjoint",
          "A – B ⊆ B"
        ],
        "correct_answer": "The sets A – B, A ∩ B, and B – A are mutually disjoint",
        "explanation": "By definition, A – B, A ∩ B, and B – A are separated according to the element's membership in A and/or B, ensuring that no element belongs to more than one of these sets. Hence, they are mutually disjoint.",
        "topic": "Difference and Intersection of sets, Disjoint sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen117"
      },
      {
        "question_text": "Define the union of two sets and give its set-builder notation.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The union of two sets A and B is the set that contains all elements which are in A, or in B, or in both. In set-builder notation, it is written as A ∪ B = { x : x ∈ A or x ∈ B }.",
        "explanation": "The union operation combines all unique elements of both sets, and repeated elements are not listed more than once. The set-builder notation clearly expresses that an element belongs to the union if it is in either set.",
        "topic": "Union of sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen118"
      },
      {
        "question_text": "Explain the difference between A – B and B – A with an example.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A – B contains the elements that are in A but not in B, while B – A contains the elements that are in B but not in A. For example, if A = {1, 2, 3, 4} and B = {3, 4, 5}, then A – B = {1, 2} and B – A = {5}.",
        "explanation": "The difference operation removes the elements of the second set from the first set. Note that the operation is not commutative; swapping the sets produces different results, as demonstrated in the example.",
        "topic": "Difference of sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen119"
      },
      {
        "question_text": "Describe and explain the distributive law of intersection over union using appropriate notation and a brief reference to its Venn diagram representation.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The distributive law of intersection over union is expressed as A ∩ (B ∪ C) = (A ∩ B) ∪ (A ∩ C). This means that intersecting A with the union of B and C yields the same set as taking the union of the intersections of A with B and A with C. In a Venn diagram, the region representing A ∩ (B ∪ C) will be identical to the combined regions of A ∩ B and A ∩ C.",
        "explanation": "This property allows you to distribute the intersection operation over the union operation. The Venn diagram visually confirms that the overlapping areas between A and the union of B and C match exactly with the union of the individual overlaps of A with B and A with C.",
        "topic": "Properties of Set Operations (Distributive Law)",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen120"
      },
      {
        "question_text": "Prove that if B ⊆ A, then A ∪ B = A.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Proof: Assume B ⊆ A. Let x be an arbitrary element of A ∪ B. Then x is in A or in B. Since B ⊆ A, if x is in B, then x is also in A. Thus, every x in A ∪ B is in A, implying A ∪ B ⊆ A. Conversely, every element in A is clearly in A ∪ B, so A ⊆ A ∪ B. Therefore, A ∪ B = A.",
        "explanation": "The proof uses the definition of subset and union. By showing that every element of the union is in A and every element of A is in the union, we establish equality between A and A ∪ B.",
        "topic": "Union of sets, Subset Proof",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen121"
      },
      {
        "question_text": "Demonstrate with a proof that the sets A – B, A ∩ B, and B – A are mutually disjoint.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "Proof: Define three sets: S₁ = A – B, S₂ = A ∩ B, and S₃ = B – A. If x ∈ S₁, then x ∈ A and x ∉ B, so x cannot belong to S₂ (which requires x ∈ B) or to S₃ (which requires x ∈ B). If x ∈ S₂, then x ∈ A and x ∈ B, so x cannot be in S₁ (as it would require x ∉ B) nor in S₃ (since x ∈ A implies x is not in B – A). Similarly, if x ∈ S₃, then x ∈ B and x ∉ A, so x cannot be in S₁ or S₂. Hence, S₁, S₂, and S₃ have no common elements and are mutually disjoint.",
        "explanation": "The proof carefully examines each possible membership scenario for an element x and shows that the definitions of A – B, A ∩ B, and B – A ensure that no element can belong to more than one of these sets at a time, thus proving they are mutually disjoint.",
        "topic": "Disjoint sets",
        "bloom_level": "Create",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen122"
      },
      {
        "question_text": "Let A = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10} and B = {2, 3, 5, 7}. Find A ∩ B and explain why A ∩ B equals B.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A ∩ B = {2, 3, 5, 7}. Since every element of B is also present in A, the intersection yields exactly B.",
        "explanation": "The intersection of two sets contains only the elements common to both. Because B is a subset of A, all its elements are naturally contained in A, so A ∩ B equals B.",
        "topic": "Intersection of sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen123"
      },
      {
        "question_text": "For sets C = {a, e, i, o, u} and D = {a, i, u}, compute C ∪ D and explain your result.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "C ∪ D = {a, e, i, o, u}. Since every element in D is already present in C, the union is identical to C.",
        "explanation": "The union of two sets combines all distinct elements. Here, as D is a subset of C, there are no new elements to add, so the result is simply the set C.",
        "topic": "Union of sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen124"
      },
      {
        "question_text": "Let A = {1, 2, 3, 4, 5, 6} and B = {2, 4, 6, 8}. Compute A – B and B – A.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A – B = {1, 3, 5} and B – A = {8}.",
        "explanation": "A – B represents the elements in A that are not in B. Since 1, 3, and 5 are exclusive to A, A – B = {1, 3, 5}. Conversely, B – A contains the element(s) in B not found in A; here, 8 is the only such element, so B – A = {8}.",
        "topic": "Difference of sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen125"
      },
      {
        "question_text": "Given the universal set U = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10} and set A = {2, 4, 6, 8, 10}, find the complement of A in U.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The complement of A in U is {1, 3, 5, 7, 9}.",
        "explanation": "The complement of a set consists of all those elements in the universal set that are not in the given set. Removing the even numbers in A from U leaves the odd numbers {1, 3, 5, 7, 9}.",
        "topic": "Complement of a set",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "13_section_1_9",
        "question_id": "cbse_xi_kemh1dd_c101_gen126"
      },
      {
        "question_text": "Find the union of each of the following pairs of sets:\n(i) X = {1, 3, 5} and Y = {1, 2, 3}.\n(ii) A = {a, e, i, o, u} and B = {a, b, c}.\n(iii) A = {x : x is a natural number and a multiple of 3} and B = {x : x is a natural number less than 6}.\n(iv) A = {x : x is a natural number and 1 < x ≤ 6} and B = {x : x is a natural number and 6 < x < 10}.\n(v) A = {1, 2, 3} and B = ∅.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) {1, 2, 3, 5}.\n(ii) {a, b, c, e, i, o, u}.\n(iii) {x ∈ ℕ : x < 6 or x is a multiple of 3} (explicitly, {1, 2, 3, 4, 5} ∪ {3, 6, 9, …}); note that 3 appears in both sets so it is not repeated.\n(iv) {2, 3, 4, 5, 6, 7, 8, 9}.\n(v) {1, 2, 3}.",
        "explanation": "For each pair, take all elements that appear in either set (without repetition). \n(i) X ∪ Y: X = {1, 3, 5} and Y = {1, 2, 3}; combine to get {1, 2, 3, 5}.\n(ii) A ∪ B: A = {a, e, i, o, u} and B = {a, b, c}; the union is {a, b, c, e, i, o, u}.\n(iii) Write A in set‐builder notation as all natural numbers divisible by 3 (i.e. {3, 6, 9, …}) and B = {1, 2, 3, 4, 5}. Their union is the set of all numbers that satisfy at least one of the conditions, which may be expressed as {x ∈ ℕ : (x < 6) or (x is a multiple of 3)}. (Listing elements explicitly up to a point: {1,2,3,4,5,6,9, …}).\n(iv) A = {x ∈ ℕ : 1 < x ≤ 6} gives {2, 3, 4, 5, 6} and B = {x ∈ ℕ : 6 < x < 10} gives {7, 8, 9}. Their union is {2, 3, 4, 5, 6, 7, 8, 9}.\n(v) The union of any set with the empty set ∅ is the set itself, so {1, 2, 3} ∪ ∅ = {1, 2, 3}.",
        "topic": "Union of Sets",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex020"
      },
      {
        "question_text": "Let 𝒜 = {a, b} and ℬ = {a, b, c}. Determine whether 𝒜 ⊂ ℬ and find 𝒜 ∪ ℬ.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "𝒜 ⊂ ℬ is true because every element of {a, b} is in {a, b, c}. The union 𝒜 ∪ ℬ is {a, b, c}.",
        "explanation": "Since all elements of 𝒜 = {a, b} are contained in ℬ = {a, b, c}, we have 𝒜 ⊂ ℬ. The union operation takes all unique elements from both sets, so {a, b} ∪ {a, b, c} yields {a, b, c}.",
        "topic": "Subset and Union of Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex021"
      },
      {
        "question_text": "If A and B are two sets such that A ⊆ B, what is A ∪ B?",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A ∪ B = B.",
        "explanation": "When A is a subset of B, every element of A is already in B. Therefore, taking the union of A with B does not introduce any new elements; the result is simply B.",
        "topic": "Union of Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex022"
      },
      {
        "question_text": "Given A = {1, 2, 3, 4}, B = {3, 4, 5, 6}, C = {5, 6, 7, 8}, and D = {7, 8, 9, 10}, find:\n(i) A ∪ B\n(ii) A ∪ C\n(iii) B ∪ C\n(iv) B ∪ D\n(v) A ∪ B ∪ C\n(vi) A ∪ B ∪ D\n(vii) B ∪ C ∪ D",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) A ∪ B = {1, 2, 3, 4, 5, 6}.\n(ii) A ∪ C = {1, 2, 3, 4, 5, 6, 7, 8}.\n(iii) B ∪ C = {3, 4, 5, 6, 7, 8}.\n(iv) B ∪ D = {3, 4, 5, 6, 7, 8, 9, 10}.\n(v) A ∪ B ∪ C = {1, 2, 3, 4, 5, 6, 7, 8}.\n(vi) A ∪ B ∪ D = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}.\n(vii) B ∪ C ∪ D = {3, 4, 5, 6, 7, 8, 9, 10}.",
        "explanation": "Each union is found by combining the elements from the sets involved without duplication. For example, in (i), A has {1, 2, 3, 4} and B has {3, 4, 5, 6}. Their union is {1, 2, 3, 4, 5, 6}. The other parts follow similarly by taking all unique elements from the specified sets.",
        "topic": "Union of Sets",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex023"
      },
      {
        "question_text": "Using the sets provided in Question 1, find the intersection of each pair:\n(i) X = {1, 3, 5} and Y = {1, 2, 3}.\n(ii) A = {a, e, i, o, u} and B = {a, b, c}.\n(iii) A = {x : x is a natural number and a multiple of 3} and B = {x : x is a natural number less than 6}.\n(iv) A = {x : x is a natural number and 1 < x ≤ 6} and B = {x : x is a natural number and 6 < x < 10}.\n(v) A = {1, 2, 3} and B = ∅.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) {1, 3}.\n(ii) {a}.\n(iii) {3}.\n(iv) ∅.\n(v) ∅.",
        "explanation": "The intersection of two sets contains only the elements common to both sets. \n(i) Both X and Y share 1 and 3, so the intersection is {1, 3}.\n(ii) The only common element between {a, e, i, o, u} and {a, b, c} is a.\n(iii) The only multiple of 3 that is less than 6 is 3.\n(iv) There are no common elements between a set of numbers greater than 1 and up to 6, and a set of numbers strictly between 6 and 10.\n(v) The intersection with the empty set is always empty.",
        "topic": "Intersection of Sets",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex024"
      },
      {
        "question_text": "Given A = {3, 5, 7, 9, 11}, B = {7, 9, 11, 13}, C = {11, 13, 15}, and D = {15, 17}, find:\n(i) A ∩ B\n(ii) B ∩ C\n(iii) A ∩ C ∩ D\n(iv) A ∩ C\n(v) B ∩ D\n(vi) A ∩ (B ∪ C)\n(vii) A ∩ D\n(viii) A ∩ (B ∪ D)\n(ix) (A ∩ B) ∩ (B ∪ C)\n(x) (A ∪ D) ∩ (B ∪ C)",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) {7, 9, 11}.\n(ii) {11, 13}.\n(iii) ∅.\n(iv) {11}.\n(v) ∅.\n(vi) {7, 9, 11}.\n(vii) ∅.\n(viii) {7, 9, 11}.\n(ix) {7, 9, 11}.\n(x) {7, 9, 11, 15}.",
        "explanation": "Determine each intersection step by step:\n(i) The common elements between A and B are 7, 9, and 11.\n(ii) B and C share 11 and 13.\n(iii) The only common element between A and C is 11, but 11 is not in D; hence, the triple intersection is empty.\n(iv) A ∩ C gives {11}.\n(v) B and D have no element in common.\n(vi) First, compute B ∪ C = {7, 9, 11, 13, 15}; then A ∩ (B ∪ C) = {7, 9, 11}.\n(vii) A and D are disjoint, so their intersection is ∅.\n(viii) B ∪ D = {7, 9, 11, 13, 15, 17}; intersecting this with A gives {7, 9, 11}.\n(ix) (A ∩ B) is {7, 9, 11} and B ∪ C contains all those elements, so the intersection remains {7, 9, 11}.\n(x) A ∪ D = {3, 5, 7, 9, 11, 15, 17} and B ∪ C = {7, 9, 11, 13, 15}; their intersection is {7, 9, 11, 15}.",
        "topic": "Intersection and Union of Sets",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex025"
      },
      {
        "question_text": "Let A = {x : x is a natural number}, B = {x : x is an even natural number}, C = {x : x is an odd natural number}, and D = {x : x is a prime number}. Find:\n(i) A ∩ B\n(ii) A ∩ C\n(iii) A ∩ D\n(iv) B ∩ C\n(v) B ∩ D\n(vi) C ∩ D",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) A ∩ B is the set of even natural numbers (i.e. B).\n(ii) A ∩ C is the set of odd natural numbers (i.e. C).\n(iii) A ∩ D is the set of prime numbers.\n(iv) B ∩ C = ∅, since no number can be both even and odd.\n(v) B ∩ D = {2}, as 2 is the only even prime.\n(vi) C ∩ D = {all odd prime numbers} (i.e. primes excluding 2).",
        "explanation": "Since A represents all natural numbers, intersecting with B (even numbers) or C (odd numbers) returns B or C respectively. The set D is the set of prime numbers. Only 2 is both even and prime, hence B ∩ D = {2}. No number can simultaneously be even and odd, which means B ∩ C is empty. The intersection of C and D gives the set of primes that are odd (3, 5, 7, …).",
        "topic": "Intersection of Sets",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex026"
      },
      {
        "question_text": "Determine which of the following pairs of sets are disjoint:\n(i) {1, 2, 3, 4} and {x : x is a natural number and 4 ≤ x ≤ 6}.\n(ii) {a, e, i, o, u} and {c, d, e, f}.\n(iii) {x : x is an even integer} and {x : x is an odd integer}.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) Not disjoint (they share 4).\n(ii) Not disjoint (they share e).\n(iii) Disjoint.",
        "explanation": "Two sets are disjoint if they have no elements in common. \n(i) The set {1, 2, 3, 4} and the set {4, 5, 6} share the element 4 and are therefore not disjoint.\n(ii) The vowels set {a, e, i, o, u} and the set {c, d, e, f} share the element e, so they are not disjoint.\n(iii) By definition, even integers and odd integers have no member in common, making them disjoint.",
        "topic": "Disjoint Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex027"
      },
      {
        "question_text": "Given A = {3, 6, 9, 12, 15, 18, 21}, B = {4, 8, 12, 16, 20}, C = {2, 4, 6, 8, 10, 12, 14, 16}, and D = {5, 10, 15, 20}, find the following set differences:\n(i) A – B\n(ii) A – C\n(iii) A – D\n(iv) B – A\n(v) C – A\n(vi) D – A\n(vii) B – C\n(viii) B – D\n(ix) C – B\n(x) D – B\n(xi) C – D\n(xii) D – C",
        "type": "Short Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "(i) A – B = {3, 6, 9, 15, 18, 21}.\n(ii) A – C = {3, 9, 15, 18, 21}.\n(iii) A – D = {3, 6, 9, 12, 18, 21}.\n(iv) B – A = {4, 8, 16, 20}.\n(v) C – A = {2, 4, 8, 10, 14, 16}.\n(vi) D – A = {5, 10, 20}.\n(vii) B – C = {20}.\n(viii) B – D = {4, 8, 12, 16}.\n(ix) C – B = {2, 6, 10, 14}.\n(x) D – B = {5, 10, 15}.\n(xi) C – D = {2, 4, 6, 8, 12, 14, 16}.\n(xii) D – C = {5, 15, 20}.",
        "explanation": "For each difference A – B, we list all elements in A that are not in B. For example, in (i), A = {3, 6, 9, 12, 15, 18, 21} and B = {4, 8, 12, 16, 20}. The common element is 12, so removing 12 from A gives {3, 6, 9, 15, 18, 21}. The remaining parts are computed with the same idea by identifying common elements and removing them from the first set.",
        "topic": "Difference of Sets",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex028"
      },
      {
        "question_text": "Let X = {a, b, c, d} and Y = {f, b, d, g}. Find:\n(i) X – Y\n(ii) Y – X\n(iii) X ∩ Y",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) X – Y = {a, c}.\n(ii) Y – X = {f, g}.\n(iii) X ∩ Y = {b, d}.",
        "explanation": "Subtracting Y from X means removing the elements of Y from X. Since b and d are common to both, X – Y = {a, c}. Similarly, Y – X removes b and d from Y, resulting in {f, g}. The intersection takes the common elements of both sets, which are {b, d}.",
        "topic": "Set Difference and Intersection",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex029"
      },
      {
        "question_text": "If ℝ is the set of real numbers and ℚ is the set of rational numbers, what is ℝ – ℚ?",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "ℝ – ℚ is the set of irrational numbers.",
        "explanation": "The set of real numbers consists of both rational and irrational numbers. Removing all rational numbers ℚ from ℝ leaves only those numbers that cannot be expressed as the ratio of two integers, which are defined as the irrational numbers.",
        "topic": "Set Difference (Irrational Numbers)",
        "bloom_level": "Remember",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex030"
      },
      {
        "question_text": "For each of the following statements, state whether it is true or false and justify your answer:\n(i) {2, 3, 4, 5} and {3, 6} are disjoint sets.\n(ii) {a, e, i, o, u} and {a, b, c, d} are disjoint sets.\n(iii) {2, 6, 10, 14} and {3, 7, 11, 15} are disjoint sets.\n(iv) {2, 6, 10} and {3, 7, 11} are disjoint sets.",
        "type": "True/False",
        "difficulty": "Easy",
        "options": [
          "True",
          "False"
        ],
        "correct_answer": "(i) False; (ii) False; (iii) True; (iv) True.",
        "explanation": "Two sets are disjoint if they have no elements in common. In (i), the sets share the element 3, and in (ii) they share the element a, so those are false. In (iii) and (iv), there are no common elements between the two sets, making the statements true.",
        "topic": "Disjoint Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex031"
      },
      {
        "question_text": "Which of the following best defines the complement of a set A with respect to the universal set U?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "A' = {x : x ∈ A and x ∉ U}",
          "A' = {x : x ∈ U and x ∉ A}",
          "A' = {x : x ∉ U and x ∈ A}",
          "A' = {x : x ∉ A and x ∉ U}"
        ],
        "correct_answer": "A' = {x : x ∈ U and x ∉ A}",
        "explanation": "By definition, the complement of A with respect to U is the set of all elements in U that are not in A. This is expressed as A' = {x : x ∈ U and x ∉ A}.",
        "topic": "Complement of a Set",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen127"
      },
      {
        "question_text": "Let U be the universal set of all prime numbers and A be the set of those primes which are not divisors of 42. Which of the following is the complement A'?",
        "type": "MCQ",
        "difficulty": "Easy",
        "options": [
          "{2, 3, 7}",
          "{all primes except 2, 3, 7}",
          "{2, 3, 7, ...}",
          "{primes that are divisors of 42 along with others}"
        ],
        "correct_answer": "{2, 3, 7}",
        "explanation": "Since the only prime divisors of 42 are 2, 3, and 7, these are not included in A. Hence, A' consists solely of these elements i.e., {2, 3, 7}.",
        "topic": "Complement of a Set",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen128"
      },
      {
        "question_text": "De Morgan's law states which of the following equivalences?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "(A ∪ B)' = A' ∪ B'",
          "(A ∪ B)' = A' ∩ B'",
          "(A ∩ B)' = A' ∩ B'",
          "(A ∩ B)' = A' - B'"
        ],
        "correct_answer": "(A ∪ B)' = A' ∩ B'",
        "explanation": "De Morgan's law for union states that the complement of the union of two sets is equal to the intersection of their complements, i.e., (A ∪ B)' = A' ∩ B'.",
        "topic": "De Morgan's Laws",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen129"
      },
      {
        "question_text": "Which of the following is always true for any subset A of U?",
        "type": "MCQ",
        "difficulty": "Medium",
        "options": [
          "A ∪ A' = ∅",
          "A ∩ A' = U",
          "A ∪ A' = U",
          "A ∩ A' = A"
        ],
        "correct_answer": "A ∪ A' = U",
        "explanation": "By the definition of complement, the union of a set and its complement covers the entire universal set U, so A ∪ A' = U.",
        "topic": "Properties of Complement Sets",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen130"
      },
      {
        "question_text": "Define the complement of a set in your own words.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The complement of a set A is the collection of all elements in the universal set U that are not in A.",
        "explanation": "The complement A' of a set A is defined as {x ∈ U : x ∉ A}. It includes every element in the universal set that does not belong to A.",
        "topic": "Complement of a Set",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen131"
      },
      {
        "question_text": "Explain De Morgan's law in set theory in your own words.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "De Morgan's law states that the complement of the union of two sets is the same as the intersection of their complements, and similarly, the complement of the intersection is the union of their complements.",
        "explanation": "Specifically, the laws are: (A ∪ B)' = A' ∩ B' and (A ∩ B)' = A' ∪ B'. They provide a way to distribute the complement operation over unions and intersections.",
        "topic": "De Morgan's Laws",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen132"
      },
      {
        "question_text": "State and explain the law of double complementation.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "The law of double complementation states that the complement of the complement of a set A is A itself, i.e., (A')' = A.",
        "explanation": "This law implies that if you take the complement of A and then take the complement of the result, you recover the original set A. It is a fundamental property of set complements.",
        "topic": "Properties of Complement Sets",
        "bloom_level": "Understand",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen133"
      },
      {
        "question_text": "Describe the relationship between a universal set and its empty set in terms of complementation.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "The complement of the empty set is the universal set itself (∅' = U), and the complement of the universal set is the empty set (U' = ∅).",
        "explanation": "Since the empty set has no elements, every element of U is not in ∅, thus ∅' = U. Conversely, U contains every element, so nothing is left outside U, making U' = ∅.",
        "topic": "Properties of Complement Sets",
        "bloom_level": "Remember",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen134"
      },
      {
        "question_text": "Prove that for any two subsets A and B of a universal set U, (A ∪ B)' = A' ∩ B'.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "To prove (A ∪ B)' = A' ∩ B':\nLet x ∈ (A ∪ B)'. Then x ∉ (A ∪ B), which means x ∉ A and x ∉ B. Therefore, x ∈ A' and x ∈ B', hence x ∈ (A' ∩ B'). Conversely, if x ∈ A' ∩ B', then x ∉ A and x ∉ B, so x ∉ (A ∪ B). Thus, x ∈ (A ∪ B)'. Therefore, (A ∪ B)' = A' ∩ B'.",
        "explanation": "The proof is done by showing mutual inclusion. First, assume x belongs to the complement of A ∪ B. By definition, x is not in A ∪ B, implying it is not in either A or B, hence it belongs to A' ∩ B'. Then, assuming x ∈ A' ∩ B' means x is not in A and not in B so it cannot be in A ∪ B, hence x ∈ (A ∪ B)'. This confirms the equality.",
        "topic": "De Morgan's Laws",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen135"
      },
      {
        "question_text": "Prove that for any two subsets A and B of a universal set U, (A ∩ B)' = A' ∪ B'.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "Proof:\n1. Let x ∈ (A ∩ B)'. Then x ∉ (A ∩ B). This means that it is not true that x ∈ A and x ∈ B simultaneously. So, either x ∉ A or x ∉ B, implying x ∈ A' or x ∈ B'. Thus, x ∈ A' ∪ B'.\n2. Conversely, let x ∈ A' ∪ B'. Then either x ∉ A or x ∉ B. Therefore, it cannot be that x ∈ A and x ∈ B at the same time, hence x ∉ (A ∩ B), so x ∈ (A ∩ B)'.\nThus, (A ∩ B)' = A' ∪ B'.",
        "explanation": "The proof involves showing that any element not in the intersection of A and B must be missing from at least one of the sets, which places it in the union of their complements, and vice versa. This establishes De Morgan’s law for intersections.",
        "topic": "De Morgan's Laws",
        "bloom_level": "Analyze",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen136"
      },
      {
        "question_text": "Let U = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10} and A = {1, 3, 5, 7, 9}. Find the complement A'.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A' = {2, 4, 6, 8, 10}",
        "explanation": "Since A contains all odd numbers from 1 to 10, the complement A' includes all numbers in U that are not in A, which are the even numbers {2, 4, 6, 8, 10}.",
        "topic": "Complement of a Set",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen137"
      },
      {
        "question_text": "Given U = {2, 3, 5, 7, 11, 13} and A = {3, 7, 11}, determine A' and verify the law A ∪ A' = U.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A' = {2, 5, 13}. Then, A ∪ A' = {2, 3, 5, 7, 11, 13} which equals U.",
        "explanation": "Step 1: Identify A = {3, 7, 11} and U = {2, 3, 5, 7, 11, 13}.\nStep 2: The complement A' consists of elements in U not in A, i.e., {2, 5, 13}.\nStep 3: The union A ∪ A' combines both sets giving {2, 3, 5, 7, 11, 13}, which is exactly U, confirming the complement law.",
        "topic": "Complement Laws",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen138"
      },
      {
        "question_text": "Let U = {1, 2, 3, 4, 5, 6} with A = {2, 3} and B = {3, 4, 5}. Compute A', B', the intersection A' ∩ B', the union A ∪ B, and then verify that (A ∪ B)' = A' ∩ B'.",
        "type": "Numerical",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A' = {1, 4, 5, 6}, B' = {1, 2, 6}; A' ∩ B' = {1, 6}; A ∪ B = {2, 3, 4, 5}; (A ∪ B)' = {1, 6}.",
        "explanation": "Step 1: Calculate A' by listing U elements not in A: {1, 4, 5, 6}.\nStep 2: Calculate B' by listing U elements not in B: {1, 2, 6}.\nStep 3: Find the intersection: A' ∩ B' = {1, 6}.\nStep 4: Find A ∪ B = {2, 3, 4, 5}, and its complement in U is {1, 6}.\nStep 5: Since (A ∪ B)' = {1, 6} equals A' ∩ B', the law is verified.",
        "topic": "De Morgan's Laws and Complement Properties",
        "bloom_level": "Evaluate",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen139"
      },
      {
        "question_text": "In a class, the universal set U represents all students. If A represents the set of all girls in the class, describe set A' and explain its significance.",
        "type": "Numerical",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A' represents the set of all boys in the class.",
        "explanation": "Since the universal set U comprises all the students and A comprises all the girls, the complement A' consists of those students not in A, i.e., the boys. This showcases the practical application of the complement in categorizing groups.",
        "topic": "Complement of a Set",
        "bloom_level": "Apply",
        "source": "generated",
        "chapter_id": "kemh101",
        "section_id": "15_section_1_10",
        "question_id": "cbse_xi_kemh1dd_c101_gen140"
      },
      {
        "question_text": "Let U = {1, 2, 3, 4, 5, 6, 7, 8, 9}, A = {1, 2, 3, 4}, B = {2, 4, 6, 8} and C = {3, 4, 5, 6}. Find (i) A' (ii) B' (iii) (A ∪ C)' (iv) (A ∪ B)' (v) (A')' (vi) (B – C)'.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) A' = {5, 6, 7, 8, 9};\n(ii) B' = {1, 3, 5, 7, 9};\n(iii) (A ∪ C)' = {7, 8, 9};\n(iv) (A ∪ B)' = {5, 7, 9};\n(v) (A')' = {1, 2, 3, 4} (i.e., A itself);\n(vi) (B – C)' = {1, 3, 4, 5, 6, 7, 9}.",
        "explanation": "Step 1: Compute A' = U – A = {1,2,3,4,5,6,7,8,9} \\ {1,2,3,4} = {5,6,7,8,9}.\nStep 2: Compute B' = U – B = {1,2,3,4,5,6,7,8,9} \\ {2,4,6,8} = {1,3,5,7,9}.\nStep 3: A ∪ C = {1,2,3,4} ∪ {3,4,5,6} = {1,2,3,4,5,6} so (A ∪ C)' = U – {1,2,3,4,5,6} = {7,8,9}.\nStep 4: A ∪ B = {1,2,3,4} ∪ {2,4,6,8} = {1,2,3,4,6,8} so (A ∪ B)' = U – {1,2,3,4,6,8} = {5,7,9}.\nStep 5: (A')' is the complement of A' relative to U; since A' = U – A, we have (A')' = A = {1,2,3,4}.\nStep 6: B – C = elements in B but not in C. B = {2,4,6,8} and C = {3,4,5,6} → B – C = {2,8}. Thus, (B – C)' = U – {2,8} = {1,3,4,5,6,7,9}.",
        "topic": "Complement of a Set, Set Operations",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex032"
      },
      {
        "question_text": "If U = {a, b, c, d, e, f, g, h}, find the complements of the following sets: (i) A = {a, b, c} (ii) B = {d, e, f, g} (iii) C = {a, c, e, g} (iv) D = {f, g, h, a}.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) A' = {d, e, f, g, h};\n(ii) B' = {a, b, c, h};\n(iii) C' = {b, d, f, h};\n(iv) D' = {b, c, d, e}.",
        "explanation": "For each set, the complement is obtained by subtracting the set from U.\n(i) A' = U – {a, b, c} = {d, e, f, g, h}.\n(ii) B' = U – {d, e, f, g} = {a, b, c, h}.\n(iii) C' = U – {a, c, e, g} = {b, d, f, h}.\n(iv) D' = U – {f, g, h, a} = {b, c, d, e}.",
        "topic": "Complement of a Set",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex033"
      },
      {
        "question_text": "Taking the set of natural numbers as the universal set, write down the complements of the following sets:\n(i) {x : x is an even natural number}\n(ii) {x : x is an odd natural number}\n(iii) {x : x is a positive multiple of 3}\n(iv) {x : x is a prime number}\n(v) {x : x is a natural number divisible by 3 and 5}\n(vi) {x : x is a perfect square}\n(vii) {x : x is a perfect cube}\n(viii) {x : x + 5 = 8}\n(ix) {x : 2x + 5 = 9}\n(x) {x : x ≥ 7}\n(xi) {x : x ∈ N and 2x + 1 > 10}.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) Complement: {x ∈ N : x is not even} i.e., odd natural numbers.\n(ii) Complement: {x ∈ N : x is not odd} i.e., even natural numbers.\n(iii) Complement: {x ∈ N : x is not a positive multiple of 3}.\n(iv) Complement: {x ∈ N : x is not a prime number} (includes 1 and composite numbers).\n(v) Complement: {x ∈ N : x is not divisible by 15}.\n(vi) Complement: {x ∈ N : x is not a perfect square}.\n(vii) Complement: {x ∈ N : x is not a perfect cube}.\n(viii) {x + 5 = 8} gives x = 3, so complement: N – {3}.\n(ix) {2x + 5 = 9} gives x = 2, so complement: N – {2}.\n(x) Complement: {x ∈ N : x < 7} = {1, 2, 3, 4, 5, 6}.\n(xi) 2x + 1 > 10 implies x > 4.5, so all natural numbers x ≥ 5 satisfy the condition; hence, complement: {x ∈ N : x ≤ 4} = {1, 2, 3, 4}.",
        "explanation": "For each part, we obtain the complement by considering all natural numbers that do NOT satisfy the given property.\n(i) Even numbers are removed to leave odd numbers.\n(ii) Removing odd numbers leaves even numbers.\n(iii) Remove multiples of 3 to leave numbers that are not multiples of 3.\n(iv) The primes are removed; note that 1 is included in the complement as it is not considered prime.\n(v) Divisibility by both 3 and 5 means divisibility by 15; remove these to get the complement.\n(vi) Remove perfect squares from N.\n(vii) Remove perfect cubes from N.\n(viii) Solve x+5=8 to get x=3; complement is N excluding 3.\n(ix) Solve 2x+5=9 to get x=2; complement is N excluding 2.\n(x) The set {x: x ≥ 7} has complement {x in N: x < 7}.\n(xi) The inequality 2x+1 > 10 gives x ≥ 5; hence, the complement is the set of natural numbers less than 5.",
        "topic": "Complement of Sets in Set Builder Notation",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex034"
      },
      {
        "question_text": "Let U = {1, 2, 3, 4, 5, 6, 7, 8, 9}, A = {2, 4, 6, 8} and B = {2, 3, 5, 7}. Verify that (i) (A ∪ B)' = A' ∩ B' and (ii) (A ∩ B)' = A' ∪ B'.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) First, A ∪ B = {2,3,4,5,6,7,8} so (A ∪ B)' = U – {2,3,4,5,6,7,8} = {1,9}. Also, A' = U – A = {1,3,5,7,9} and B' = U – B = {1,4,6,8,9} so A' ∩ B' = {1,9}.\n(ii) Next, A ∩ B = {2} so (A ∩ B)' = U – {2} = {1,3,4,5,6,7,8,9}. Also, A' ∪ B' = {1,3,5,7,9} ∪ {1,4,6,8,9} = {1,3,4,5,6,7,8,9}.",
        "explanation": "Step 1: Calculate A ∪ B = {2,3,4,5,6,7,8} and then find its complement: (A ∪ B)' = U – (A ∪ B) = {1,9}.\nStep 2: Compute A' = U – A = {1,3,5,7,9} and B' = U – B = {1,4,6,8,9}. Their intersection A' ∩ B' gives {1,9}.\nStep 3: For (ii), find A ∩ B = {2}. Its complement is (A ∩ B)' = U – {2} = {1,3,4,5,6,7,8,9}.\nStep 4: The union A' ∪ B' is {1,3,5,7,9} ∪ {1,4,6,8,9} = {1,3,4,5,6,7,8,9}.\nThus, both identities are verified, which are examples of De Morgan's Laws.",
        "topic": "De Morgan's Laws, Complement of a Set",
        "bloom_level": "Analyze",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex035"
      },
      {
        "question_text": "Draw appropriate Venn diagram for each of the following: (i) (A ∪ B)', (ii) A' ∩ B', (iii) (A ∩ B)', (iv) A' ∪ B'.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "For (i) and (ii): The diagram consists of a universal set U with two overlapping circles for A and B. For (A ∪ B)', shade the region outside both circles. This is identical to shading the intersection of A' and B'.\nFor (iii) and (iv): In the same diagram, (A ∩ B)' is represented by shading everything except the overlapping region of A and B, which is identical to shading A' ∪ B'.",
        "explanation": "Step 1: Draw a rectangle representing U and two overlapping circles labeled A and B.\nStep 2: For (A ∪ B)', note that A ∪ B is the region covered by both circles. Its complement is the area in U outside both circles. This shaded area represents (A ∪ B)'.\nStep 3: Similarly, A' ∩ B' means the intersection of the regions outside A and outside B, which is exactly the area outside both circles.\nStep 4: For (A ∩ B)', since A ∩ B is the overlapping region of A and B, its complement is all areas of U except the intersection. This is identical to the union of A' (outside A) and B' (outside B).\nStep 5: Clearly label the diagram to indicate the shaded regions corresponding to each expression.\nNote: In exam or assignment solutions, you would provide a clear hand-drawn or computer-generated Venn diagram with appropriate shading.",
        "topic": "Venn Diagrams, Complement of Sets",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex036"
      },
      {
        "question_text": "Let U be the set of all triangles in a plane. If A is the set of all triangles with at least one angle different from 60°, what is A'?",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A' is the set of all triangles in the plane that do not have any angle different from 60°. In other words, A' is the set of all equilateral triangles (triangles in which all angles are 60°).",
        "explanation": "Step 1: A consists of triangles with at least one angle that is not 60°. \nStep 2: The complement A' includes all triangles that do not satisfy that property, meaning every angle must be 60°.\nStep 3: A triangle with all angles 60° is an equilateral triangle. Thus, A' is the set of all equilateral triangles.",
        "topic": "Complement of a Set (Application in Geometry)",
        "bloom_level": "Apply",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex037"
      },
      {
        "question_text": "Fill in the blanks to make each of the following true statements:\n(i) A ∪ A' = ...\n(ii) ∅' ∩ A = ...\n(iii) A ∩ A' = ...\n(iv) U' ∩ A = ...",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) A ∪ A' = U\n(ii) ∅' ∩ A = U ∩ A = A\n(iii) A ∩ A' = ∅\n(iv) U' ∩ A = ∅ ∩ A = ∅",
        "explanation": "Step 1: By definition, A ∪ A' equals the universal set U because every element of U is either in A or not in A.\nStep 2: The complement of the empty set is U (∅' = U). Then U ∩ A equals A.\nStep 3: A ∩ A' must be empty, since A and its complement have no elements in common.\nStep 4: The complement of U is the empty set (U' = ∅); thus, ∅ ∩ A is ∅.",
        "topic": "Properties of Complements, Set Laws",
        "bloom_level": "Remember",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex038"
      },
      {
        "question_text": "Decide, among the following sets, which sets are subsets of one another: A = { x ∈ ℝ : x² – 8x + 12 = 0 }, B = {2, 4, 6}, C = {2, 4, 6, 8, …}, D = {6}.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "A = {2, 6}. Since 2 and 6 are in B and C, we have A ⊆ B and A ⊆ C. Also, B ⊆ C because every element of B is in C. Additionally, D = {6} is a subset of A, B, and C.",
        "explanation": "Step 1: Solve the quadratic in set A: x² – 8x + 12 = 0 factors as (x – 2)(x – 6) = 0, so A = {2, 6}.\nStep 2: Check subsets:\n • A ⊆ B because B = {2, 4, 6} contains both 2 and 6.\n • A ⊆ C because C = {2, 4, 6, 8, …} (the set of even numbers beginning with 2) contains 2 and 6.\n • B ⊆ C because every element of B (which are even numbers 2, 4, 6) appears in C.\n • D = {6} is clearly a subset of A (since 6 ∈ {2,6}), of B, and of C.\nThus the subset relationships are: A ⊆ B ⊆ C and D ⊆ A, D ⊆ B, D ⊆ C.",
        "topic": "Subsets of Sets",
        "bloom_level": "Analyze",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex039"
      },
      {
        "question_text": "For each of the following statements, determine whether it is true or false. If true, prove it; if false, provide a counterexample.\n(i) If x ∈ A and A ∈ B, then x ∈ B.\n(ii) If A ⊂ B and B ∈ C, then A ∈ C.\n(iii) If A ⊂ B and B ⊂ C, then A ⊂ C.\n(iv) If A ⊈ B and B ⊈ C, then A ⊈ C.\n(v) If x ∈ A and A ⊈ B, then x ∈ B.\n(vi) If A ⊂ B and x ∉ B, then x ∉ A.",
        "type": "True/False",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "(i) False. (ii) False. (iii) True. (iv) False. (v) False. (vi) True.",
        "explanation": "Explanation for each part:\n(i) The statement confuses the element-membership relation (∈) with the subset relation. For example, let A = {1} and B = {{1}}. Here, 1 ∈ A and A ∈ B, but 1 ∉ B since the only element of B is the set {1}.\n(ii) Even if A ⊂ B (i.e. every element of A is in B) and B ∈ C, it does not ensure that A ∈ C because membership of B in C does not transfer to its subsets. For example, take A = {1}, B = {1,2} with A ⊂ B, and let C = {{1,2}, 3}; here, B ∈ C but A is not an element of C.\n(iii) This is true. If every element of A is in B and every element of B is in C, then every element of A is in C, so A ⊂ C.\n(iv) This is false. A counterexample: Let A = {1}, B = {1,2}, and C = {1}. Here, A ⊈ B is false because actually A ⊆ B; to get the intended idea, consider instead A = {2}, B = {1,2} and C = {2,3}. Then A ⊆ B (so A ⊈ B is false) — thus one must choose an example where neither subset relation holds, yet it can happen that A ⊆ C. For instance, let A = {1,4}, B = {1,2}, and C = {1,4,5}. Here, A is not a subset of B and B is not a subset of C, but A ⊆ C. This shows the given statement does not necessarily hold.\n(v) False. For example, let A = {2,3} and B = {2}. Here, 3 ∈ A but A ⊈ B (since 3 ∉ B) and yet 3 ∉ B.\n(vi) True. If A ⊂ B then every element of A is in B. So if x ∉ B, then x could not have been in A.",
        "topic": "Membership and Subset Relationships",
        "bloom_level": "Evaluate",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex040"
      },
      {
        "question_text": "Let A, B, and C be sets such that A ∩ B = A ∩ C and A ∪ B = A ∪ C. Show that B = C.",
        "type": "Long Answer",
        "difficulty": "Hard",
        "options": null,
        "correct_answer": "To prove B = C, show that every element of B is in C and vice versa. Using the given conditions and the partition of any set into elements in A and not in A, one can deduce that B \\ A = C \\ A and that B ∩ A = C ∩ A, which together imply B = C.",
        "explanation": "Proof:\n1. Let x be any element in B. Consider two cases:\n   a. If x ∈ A, then since A ∩ B = A ∩ C, we have x ∈ C.\n   b. If x ∉ A, then x ∈ B \\ A. Now, observe that\n      A ∪ B = A ∪ C implies B \\ A = C \\ A (because the elements outside A in the union must coincide). Therefore, x ∈ C.\n   Hence, every x ∈ B is in C. \n2. Similarly, let x be any element in C. By a parallel argument (dividing into cases x ∈ A and x ∉ A), one shows x ∈ B.\nThus, B ⊆ C and C ⊆ B, so B = C.\nKey idea: Partition the sets into parts inside A and outside A, and use the given equalities of intersections and unions.",
        "topic": "Set Equality, Union and Intersection",
        "bloom_level": "Evaluate",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex041"
      },
      {
        "question_text": "Show that the following four conditions are equivalent:\n(i) A ∩ B = A\n(ii) A – B = ∅\n(iii) A ∪ B = B\n(iv) A ⊆ B",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "All four statements express the idea that every element of A is contained in B. In particular:\n– (i) says that the common elements of A and B are exactly A, so A ⊆ B.\n– (ii) says that there is no element in A that is not in B.\n– (iii) means that when you add A to B, nothing extra is added, implying A ⊆ B.\n– (iv) is the definition of A being a subset of B.\nThus, (i), (ii), (iii), and (iv) are equivalent.",
        "explanation": "Proof of equivalence:\n• (i) ⇒ (iv): If A ∩ B = A, every x ∈ A is in B.\n• (iv) ⇒ (ii): If A ⊆ B, then there is no x ∈ A with x ∉ B, so A – B = ∅.\n• (ii) ⇒ (iii): If A – B = ∅, then every x ∈ A is in B, so A ∪ B = B.\n• (iii) ⇒ (i): If A ∪ B = B, then A ⊆ B and hence A ∩ B = A.\nThus, all four conditions are equivalent.",
        "topic": "Subsets and Set Operations",
        "bloom_level": "Evaluate",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex042"
      },
      {
        "question_text": "Show that if A ⊆ B, then C – B ⊆ C – A.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Assume A ⊆ B. Take any x ∈ C – B. Then x ∈ C and x ∉ B. Since A ⊆ B, x cannot be in A. Hence, x ∈ C – A, proving that C – B ⊆ C – A.",
        "explanation": "Proof:\n1. Let x be any element in C – B. By definition, x ∈ C and x ∉ B.\n2. Given that A ⊆ B, every element of A is in B. Therefore, if x were in A, then x would be in B. Since x ∉ B, it follows that x ∉ A.\n3. Hence, x ∈ C and x ∉ A, so x ∈ C – A.\nThus, C – B ⊆ C – A.",
        "topic": "Set Difference and Subset Relations",
        "bloom_level": "Analyze",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex043"
      },
      {
        "question_text": "Show that for any sets A and B, (i) A = (A ∩ B) ∪ (A – B) and (ii) (A ∩ B) ∩ (A – B) = ∅.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "(i) Every element of A either belongs to B or does not. Thus, A can be partitioned as (A ∩ B) and (A – B), whose union is A. (ii) The sets A ∩ B and A – B are disjoint because by definition A – B contains only those elements of A that are not in B. Therefore, their intersection is ∅.",
        "explanation": "Proof:\n(i) Let x ∈ A. Then either x ∈ B or x ∉ B. If x ∈ B, then x ∈ A ∩ B; if x ∉ B, then x ∈ A – B. Hence, x is in the union (A ∩ B) ∪ (A – B), so A ⊆ (A ∩ B) ∪ (A – B). Conversely, every element in (A ∩ B) ∪ (A – B) is clearly in A. Thus, A = (A ∩ B) ∪ (A – B).\n(ii) Suppose for contradiction that there exists x ∈ (A ∩ B) ∩ (A – B). Then x ∈ A ∩ B means x ∈ B, while x ∈ A – B means x ∉ B, a contradiction. Therefore, (A ∩ B) ∩ (A – B) = ∅.",
        "topic": "Set Partition and Disjointness",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex044"
      },
      {
        "question_text": "Using properties of sets, show that (i) A ∪ (A ∩ B) = A and (ii) A ∩ (A ∪ B) = A.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "These are the absorption laws. (i) A ∪ (A ∩ B) = A because every element of A is already included in A ∪ (A ∩ B). (ii) A ∩ (A ∪ B) = A for a similar reason.",
        "explanation": "Proof:\n(i) For any x ∈ A, clearly x is in A ∪ (A ∩ B). Conversely, if x ∈ A ∪ (A ∩ B) then either x ∈ A or x ∈ (A ∩ B); in either case x ∈ A. Hence, A ∪ (A ∩ B) = A.\n(ii) For any x ∈ A, since A ⊆ A ∪ B, we have x ∈ A ∩ (A ∪ B). Conversely, if x ∈ A ∩ (A ∪ B) then x ∈ A. Thus, A ∩ (A ∪ B) = A.",
        "topic": "Set Laws (Absorption Laws)",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex045"
      },
      {
        "question_text": "Show that A ∩ B = A ∩ C need not imply B = C.",
        "type": "Short Answer",
        "difficulty": "Easy",
        "options": null,
        "correct_answer": "A counterexample is sufficient. For instance, let A = {1}, B = {1, 2} and C = {1, 3}. Then A ∩ B = {1} = A ∩ C, but clearly B ≠ C.",
        "explanation": "Explanation:\nChoose A = {1}, B = {1,2}, and C = {1,3}.\nThen, A ∩ B = {1} and A ∩ C = {1} because the only element A has is 1, which appears in both B and C. However, B and C differ (B has 2 while C has 3). Thus, the equality of intersections with A does not force B and C to be equal.",
        "topic": "Set Equality and Counterexamples",
        "bloom_level": "Understand",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex046"
      },
      {
        "question_text": "Let A and B be sets. If there exists a set X such that A ∪ X = B ∪ X and A ∩ X = B ∩ X, show that A = B.",
        "type": "Long Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "Using the partition of sets relative to X, write A = (A ∩ X) ∪ (A – X) and likewise for B. The conditions A ∩ X = B ∩ X and A ∪ X = B ∪ X imply that the parts outside of X (i.e. A – X and B – X) are equal. Hence, A = B.",
        "explanation": "Proof:\n1. Express A as (A ∩ X) ∪ (A – X) and B as (B ∩ X) ∪ (B – X).\n2. Since A ∩ X = B ∩ X (given), the only difference between A and B could come from their differences with X.\n3. Note that A ∪ X = B ∪ X. This implies that the elements not in X are the same for both A and B; formally, (A ∪ X) – X = (B ∪ X) – X. But (A ∪ X) – X = A – X and similarly for B.\n4. Thus, A – X = B – X.\n5. Combining, we have A = (A ∩ X) ∪ (A – X) = (B ∩ X) ∪ (B – X) = B, as required.",
        "topic": "Set Operations and Partitioning",
        "bloom_level": "Evaluate",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex047"
      },
      {
        "question_text": "Find sets A, B, and C such that the pairwise intersections A ∩ B, B ∩ C, and A ∩ C are non-empty, yet the triple intersection A ∩ B ∩ C is empty.",
        "type": "Short Answer",
        "difficulty": "Medium",
        "options": null,
        "correct_answer": "One valid example is: A = {1, 2}, B = {2, 3}, and C = {1, 3}. Then A ∩ B = {2}, B ∩ C = {3}, A ∩ C = {1}, and A ∩ B ∩ C = ∅.",
        "explanation": "Solution:\nChoose the sets as follows:\n• A = {1, 2}\n• B = {2, 3}\n• C = {1, 3}\nThen:\n– A ∩ B = {2} (non-empty),\n– B ∩ C = {3} (non-empty),\n– A ∩ C = {1} (non-empty), but\n– A ∩ B ∩ C = ∅ because there is no element common to all three sets.\nThis example satisfies the required condition.",
        "topic": "Set Intersection and Venn Diagrams",
        "bloom_level": "Create",
        "source": "exercise",
        "chapter_id": "kemh101",
        "question_id": "cbse_xi_kemh1dd_c101_ex048"
      }
    ]
    
    
    
    
       
    