[
  {
    "question_text": "Given a parallelogram ABCD, complete each statement along with the definition or property used:\n(i) AD = ______\n(ii) ∠DCB = ______\n(iii) OC = ______\n(iv) m∠DAB + m∠CDA = ______",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) AD = BC  [Opposite sides of a parallelogram are equal]\n(ii) ∠DCB = ∠DAB  [Opposite angles of a parallelogram are equal]\n(iii) OC = OA  [The diagonals of a parallelogram bisect each other]\n(iv) m∠DAB + m∠CDA = 180°  [Adjacent angles in a parallelogram are supplementary]",
    "explanation": "For any parallelogram: (i) the side AD is equal to the side BC as opposite sides have equal length; (ii) the angle at vertex C (formed by sides DC and CB) equals the angle at vertex A (formed by sides DAB) because opposite angles are equal; (iii) the point O where the diagonals intersect divides each diagonal into two equal parts (bisector property); (iv) consecutive (adjacent) angles in a parallelogram sum to 180°.",
    "topic": "Parallelogram properties",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex009"
  },
  {
    "question_text": "Consider the following parallelograms. Find the values of the unknowns x, y, and z.\n(i) Parallelogram ABCD with ∠B = 100°, ∠C = x, ∠D = y, ∠A = z.\n(ii) A parallelogram with interior angles 50°, x, y and an exterior angle z.\n(iii) A rhombus‐like quadrilateral (with diagonals intersecting at right angles) with angles x, y, 30°, and 90°.\n(iv) A parallelogram with one interior angle 80°, and the other angles as x, y and an exterior angle z.\n(v) A parallelogram (with a drawn diagonal) where the angles are given as y, 112°, x, 40°, and z (with the diagram indicating the arrangement).",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Answers (based on standard parallelogram properties):\n(i) Since adjacent angles are supplementary and opposite angles equal, if ∠B = 100° then ∠D = 100° and ∠A = ∠C = 80°. Thus, x = 80°, y = 100°, and z = 80°.\n(ii) If one interior angle is 50°, its adjacent angle must be 130° (since 50° + 130° = 180°). Then by the property of opposite angles, the remaining interior angle is 50°. The exterior angle adjacent to a 50° interior angle is 130°. Thus, one set of answers is: x = 130°, y = 50°, and z = 130°.\n(iii) Using the properties of a rhombus (opposite angles equal and adjacent angles supplementary) and given two angles 30° and 90°, one would normally set up equations from the fact that the sum of angles is 360°. (This part requires a careful reading of the diagram; one potential solution is to assign the unknowns so that the angles satisfy 30° + 90° + x + y = 360° with x = y = 120°, though the diagram’s configuration may lead to a different unique answer.)\n(iv) For an interior angle of 80°, the adjacent angle must be 100° (since 80° + 100° = 180°). Then the opposite angle is 80° and its adjacent exterior angle is 100°. Thus, a possible answer is: x = 100°, y = 80°, and z = 100°.\n(v) When a diagonal is drawn, relationships from the congruency of triangles can be used along with the fact that the sum of interior angles is 360°. (The precise answers for x, y, and z depend on the exact layout shown in the diagram; use properties such as opposite angles equal and adjacent angles supplementary to solve the equations.)",
    "explanation": "In a parallelogram, opposite angles are equal and consecutive angles are supplementary. For (i) if one angle is 100°, then its adjacent angles are 80° since 180° – 100° = 80°. For (ii) the given interior angle of 50° forces its adjacent angle to be 130°, and by opposite equality the remaining angles are determined. In parts (iii)–(v), additional relationships provided by diagonals (e.g. bisection and the congruence of triangles created by the diagonal) are used. Note that some parts require interpretation of a diagram; set up equations based on the sum of angles in a quadrilateral (360°) and use the properties of a parallelogram.",
    "topic": "Parallelogram angle properties and diagonal properties",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex010"
  },
  {
    "question_text": "Can a quadrilateral ABCD be a parallelogram if:\n(i) ∠D + ∠B = 180°?\n(ii) AB = DC = 8 cm, AD = 4 cm and BC = 4.4 cm?\n(iii) ∠A = 70° and ∠C = 65°?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Not necessarily. Although in a parallelogram adjacent angles are supplementary (sum to 180°), the condition ∠D + ∠B = 180° alone does not guarantee that the quadrilateral is a parallelogram.\n(ii) No; in a parallelogram, both pairs of opposite sides must be equal. Here AD ≠ BC, so the quadrilateral cannot be a parallelogram.\n(iii) No; because in a parallelogram, opposite angles are equal. Since 70° ≠ 65°, ABCD cannot be a parallelogram.",
    "explanation": "For (i), while it is true that in a parallelogram any two consecutive angles are supplementary, having just one pair of angles summing to 180° is not sufficient to conclude a quadrilateral is a parallelogram because other conditions (like both pairs of opposite sides being equal or parallel) must also be met. For (ii), the equality of opposite sides (AB = DC and AD = BC) is necessary. The given side lengths violate this since 4 ≠ 4.4. For (iii), a fundamental property of parallelograms is that opposite angles are congruent; since 70° and 65° are not equal, the condition fails.",
    "topic": "Parallelogram properties",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex011"
  },
  {
    "question_text": "Draw a rough figure of a quadrilateral that is not a parallelogram but has exactly two opposite angles of equal measure.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "One acceptable answer is a trapezium where only the pair of base (or sole pair of) angles are equal while the other pair are not. For example, a quadrilateral with one pair of parallel sides (making it a trapezium), arranged so that only one pair of opposite angles (at the parallel sides) are equal.",
    "explanation": "A parallelogram requires both pairs of opposite angles to be equal. To create a quadrilateral that is not a parallelogram yet has exactly two opposite angles equal, you can start with a trapezium (a quadrilateral with one pair of parallel sides) and adjust the non‐parallel sides so that only one pair of opposite angles end up equal. This drawing exercise tests your ability to combine knowledge of quadrilateral definitions with creative construction.",
    "topic": "Quadrilaterals and their properties",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex012"
  },
  {
    "question_text": "The measures of two adjacent angles of a parallelogram are in the ratio 3:2. Find the measure of each of the angles of the parallelogram.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Let the two adjacent angles be 3k and 2k. Since they are supplementary, 3k + 2k = 180° which gives 5k = 180°; hence, k = 36°. Therefore, the angles are 3k = 108° and 2k = 72°. In a parallelogram, opposite angles are equal, so the four angles are 108°, 72°, 108°, and 72°.",
    "explanation": "Assign variables to the adjacent angles (3k and 2k). Use the fact that in a parallelogram the sum of adjacent angles is 180° to set up the equation 3k + 2k = 180°. Solving yields k = 36°. Multiply back to find the actual angle measures. Finally, note that opposite angles in a parallelogram are congruent.",
    "topic": "Parallelogram angles",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex013"
  },
  {
    "question_text": "Two adjacent angles of a parallelogram have equal measure. Find the measure of each of the angles of the parallelogram.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "If two adjacent angles are equal and their sum is 180° (since in a parallelogram, adjacent angles are supplementary), then each angle must be 90°. Therefore, each angle of the parallelogram is 90°, making it a rectangle.",
    "explanation": "Let the equal adjacent angles be x. Since x + x = 180°, we have 2x = 180° which gives x = 90°. Because opposite angles in a parallelogram are equal, all four angles are 90°, satisfying the properties of a rectangle.",
    "topic": "Parallelogram angles",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex014"
  },
  {
    "question_text": "The adjacent figure HOPE is a parallelogram. Find the angle measures x, y, and z. State the properties you use to find them. (Refer to the diagram which shows an exterior angle of 70° adjacent to vertex E, a diagonal HP drawn, and angles labeled y, x, 40°, and z.)",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "One acceptable solution (subject to the given diagram details) is: x = 40°, y = 70°, and z = 110°. The properties used include: (1) Opposite angles of a parallelogram are equal; (2) Adjacent angles are supplementary; (3) The diagonal divides the parallelogram into congruent triangles, which helps in relating some of the given angles.",
    "explanation": "From the diagram, the exterior angle of 70° at vertex E implies that the interior angle at E is 110° (since they form a linear pair). By the property that opposite angles in a parallelogram are equal, the angle at the vertex opposite E is also 110°. Using the fact that adjacent angles are supplementary, the remaining angles can be determined. The diagonal further creates triangles with congruent angle measures, which confirms the computed values. (Note: Depending on the exact diagram, minor variations in the labels may occur, so justify your answer using the stated properties.)",
    "topic": "Parallelogram angle properties",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex015"
  },
  {
    "question_text": "The following figures GUNS and RUNS are parallelograms. Find x and y.\n(i) In parallelogram GUNS, the side lengths are given as: GU = 3y – 1, SN = 26, GS = 3x, and NU = 18.\n(ii) In parallelogram RUNS, the diagonals intersect and the segment lengths are given as: y + 7, 20, x + y, and 16.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) For parallelogram GUNS, since opposite sides are equal: 3y – 1 = 26, which gives 3y = 27 and hence y = 9; also, 3x = 18 so x = 6.\n(ii) For parallelogram RUNS, using the property that the diagonals bisect each other, set the corresponding segments equal: y + 7 = 20, so y = 13; and x + y = 16, thus x = 16 – 13 = 3.",
    "explanation": "In any parallelogram:\n(i) Opposite sides are equal. Setting GU equal to SN gives the equation 3y – 1 = 26, from which y is determined. Similarly, setting GS equal to NU provides 3x = 18.\n(ii) The diagonals of a parallelogram bisect each other. Therefore, the segments on each diagonal must be equal. Equating y + 7 to 20 and x + y to 16 yields the values of y and x respectively.",
    "topic": "Parallelogram properties (side equality and diagonal bisection)",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex016"
  },
  {
    "question_text": "In the diagram, two parallelograms named RISK and CLUE intersect. Given that in these figures, angle K = 120° and angle L = 70°, and the angle at their intersection is marked as x, find the value of x.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Using the properties of parallelograms and the relationships between the intersecting angles, one finds that x = 50°. (A detailed solution involves considering the supplementary and corresponding angles in the overlapping region.)",
    "explanation": "In the overlapping region of the two parallelograms, use the facts that (a) opposite angles in each parallelogram are equal and (b) adjacent angles are supplementary. By analyzing the given angle measures (120° and 70°) and tracing the relationships through the diagram, the angle at the intersection (x) can be computed as 50°. A clear diagram analysis and step‐by‐step angle chasing using these properties will lead to this result.",
    "topic": "Parallelogram angle properties",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex017"
  },
  {
    "question_text": "Explain how the figure (Fig 3.26) is a trapezium. Which of its two sides are parallel? (Refer to the diagram showing quadrilateral KLMN with ∠L = 80° and ∠M = 100°.)",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A trapezium is defined as a quadrilateral with at least one pair of parallel sides. In the given figure, only one pair of sides is parallel. Based on the diagram’s orientation and angle measures, the parallel sides can be identified (for instance, sides KL and MN may be parallel).",
    "explanation": "Examine the diagram carefully. The key property of a trapezium is that it has exactly one pair of parallel sides. By analyzing the given angles (80° and 100°) and the positioning of the sides, one can deduce which sides are parallel. A proper explanation should mention that the presence of only one pair of parallel sides (and not both pairs, as in a parallelogram) confirms that the figure is a trapezium.",
    "topic": "Trapezium (quadrilateral) definition",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex018"
  },
  {
    "question_text": "Find m∠C in Fig 3.27 if AB || DC in the trapezium ABCD, given that ∠B = 120°.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Since AB is parallel to DC, the consecutive interior angles ∠B and ∠C are supplementary. Thus, m∠C = 180° – 120° = 60°.",
    "explanation": "In any trapezium (or more generally, when one pair of sides is parallel), the angles adjacent to each leg are supplementary. Given that ∠B is 120°, its adjacent angle ∠C must be 60° in order for their sum to equal 180°.",
    "topic": "Trapezium angle properties",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex019"
  },
  {
    "question_text": "Find the measures of ∠P and ∠S in Fig 3.28, given that SP is parallel to RQ in quadrilateral PQRS, and that ∠R = 90° and ∠Q = 130°. (Hint: Once m∠R is determined, consider if there is more than one method to find m∠P.)",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Since SP || RQ, the quadrilateral PQRS is a trapezium with bases SP and RQ. In a trapezium, the angles adjacent to the same base are supplementary. Thus, ∠P and ∠Q are on the same leg, so ∠P = 180° – 130° = 50°. Similarly, ∠R and ∠S are on the same leg, so ∠S = 180° – 90° = 90°. Hence, m∠P = 50° and m∠S = 90°.",
    "explanation": "For a trapezium (a quadrilateral with one pair of parallel sides), the angles adjacent to each of the parallel sides are supplementary. Since SP and RQ are parallel, angles at vertices P and Q form a supplementary pair (thus, 180° – 130° = 50° for ∠P), and angles at vertices R and S are also supplementary (180° – 90° = 90° for ∠S). The solution can be verified by checking that the sum of all interior angles equals 360°.",
    "topic": "Trapezium angle properties",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh103",
    "question_id": "cbse_viii_hemh1dd_c103_ex020"
  }
]