[
  {
    "question_text": "A survey was made to find the type of music that a certain group of young people liked in a city. The adjoining pie chart shows the findings of the survey (Music preference: Light 40%, Folk 30%, Classical 10%, Semi Classical 20%). From this pie chart answer the following:\n(i) If 20 people liked classical music, how many young people were surveyed?\n(ii) Which type of music is liked by the maximum number of people?\n(iii) If a cassette company were to make 1000 CDs, how many of each type would they make?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Total surveyed = 20 / 0.10 = 200 people; (ii) Light music (40% corresponds to the highest portion); (iii) CDs distribution: Light = 40% of 1000 = 400, Folk = 30% of 1000 = 300, Classical = 10% of 1000 = 100, Semi Classical = 20% of 1000 = 200.",
    "explanation": "Step 1: Identify the proportion for Classical music which is 10%. Since 10% of the total equals 20 people, the total is computed by 20 ÷ 0.10 = 200.\nStep 2: Review the percentages: Light (40%), Folk (30%), Classical (10%), Semi Classical (20%). The highest percentage is 40%, corresponding to Light music.\nStep 3: For making 1000 CDs, use the percentage for each type: Light = 0.40×1000 = 400, Folk = 0.30×1000 = 300, Classical = 0.10×1000 = 100, Semi Classical = 0.20×1000 = 200.\nThus, the answers follow directly from proportional reasoning using percentages.",
    "topic": "Pie Charts, Data Interpretation, Percentages",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex001"
  },
  {
    "question_text": "A group of 360 people were asked to vote for their favourite season from the three seasons: Summer, Rainy, and Winter. The votes obtained were: Summer = 90, Rainy = 120, Winter = 150.\nAnswer the following:\n(i) Which season got the most votes?\n(ii) Find the central angle of each sector in the corresponding pie chart.\n(iii) Draw a pie chart to show this information.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Winter received the most votes (150 votes).\n(ii) Central angles: Summer = (90/360)×360 = 90°; Rainy = (120/360)×360 = 120°; Winter = (150/360)×360 = 150°.\n(iii) A pie chart should be drawn with a circle divided into sectors with angles of 90°, 120°, and 150° corresponding to Summer, Rainy, and Winter respectively.",
    "explanation": "Step 1: Identify the highest number of votes; Winter has 150 which is the largest.\nStep 2: To calculate the central angle, use the formula: (Votes / Total Votes) × 360°. For Summer: (90/360)×360 = 90°; Rainy: (120/360)×360 = 120°; Winter: (150/360)×360 = 150°.\nStep 3: When drawing the pie chart, start by drawing a circle, then use a protractor to measure the calculated angles from a reference line to form each sector.\nThus, the data is accurately represented by the pie chart.",
    "topic": "Pie Charts, Data Interpretation, Proportions",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex002"
  },
  {
    "question_text": "Draw a pie chart showing the following information about colour preferences among a group of people:\n\nColours and Number of People:\nBlue = 18, Green = 9, Red = 6, Yellow = 3 (Total = 36).\n(Note: Find the proportion of each sector; for example, Blue is 18/36 which simplifies to 1/2, and so on. Use these fractions to determine the corresponding angles.)",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For Blue: 18/36 = 1/2 → Angle = 1/2×360 = 180°; For Green: 9/36 = 1/4 → Angle = 1/4×360 = 90°; For Red: 6/36 = 1/6 → Angle = 1/6×360 = 60°; For Yellow: 3/36 = 1/12 → Angle = 1/12×360 = 30°. Draw a circle and use these angles to represent each colour's portion.",
    "explanation": "Step 1: Calculate the fraction for each colour:\n• Blue: 18/36 = 1/2 → 1/2 of 360° = 180°.\n• Green: 9/36 = 1/4 → 1/4 of 360° = 90°.\n• Red: 6/36 = 1/6 → 1/6 of 360° = 60°.\n• Yellow: 3/36 = 1/12 → 1/12 of 360° = 30°.\nStep 2: Draw a circle and mark its center. Using a protractor, measure out the calculated central angles from a starting line to form the sectors for each colour.\nThis method accurately displays the colour preferences as indicated by the data.",
    "topic": "Pie Charts, Fractions, Data Representation",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex003"
  },
  {
    "question_text": "The adjoining pie chart represents the marks scored by a student in an examination for the subjects: Mathematics, Social Science, Science, Hindi, and English. The central angles for each subject are: Mathematics = 90°, Social Science = 65°, Science = 80°, Hindi = 70°, and English = 55°. The total marks obtained by the student are 540. Answer the following:\n(i) In which subject did the student score 105 marks? (Hint: For 540 marks, the total central angle is 360°. Find the marks corresponding to the central angle that represents 105 marks.)\n(ii) How many more marks were obtained in Mathematics than in Hindi?\n(iii) Examine whether the sum of the marks obtained in Social Science and Mathematics is more than the sum of marks in Science and Hindi.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) First, determine the conversion factor: 360° corresponds to 540 marks, so each degree represents 540/360 = 1.5 marks. For 105 marks, the corresponding angle = 105 / 1.5 = 70°. The subject with a central angle of 70° is Hindi, so the student scored 105 marks in Hindi.\n(ii) Marks in Mathematics = 90° × 1.5 = 135 marks; Marks in Hindi = 70° × 1.5 = 105 marks; Difference = 135 − 105 = 30 marks.\n(iii) Sum of Mathematics and Social Science marks = (90° + 65°)×1.5 = 155°×1.5 = 232.5 marks; Sum of Science and Hindi marks = (80° + 70°)×1.5 = 150°×1.5 = 225 marks. Therefore, the sum for Social Science and Mathematics is greater by 7.5 marks.",
    "explanation": "Step 1: Determine the marks per degree using the total: 540 marks / 360° = 1.5 marks/degree.\nStep 2: For part (i), find the angle corresponding to 105 marks: 105 ÷ 1.5 = 70°. Since the pie chart shows Hindi with a 70° arc, the student scored 105 in Hindi.\nStep 3: For part (ii), calculate marks in Mathematics (90°×1.5 = 135) and in Hindi (70°×1.5 = 105). The difference is 30 marks.\nStep 4: For part (iii), add the central angles for Mathematics and Social Science: 90° + 65° = 155°, which corresponds to 155×1.5 = 232.5 marks. Then add for Science and Hindi: 80° + 70° = 150°, which corresponds to 150×1.5 = 225 marks. Comparing these shows that Mathematics and Social Science yield 7.5 marks more.\nThis process applies proportional reasoning and comparison of sums based on the pie chart's sectors.",
    "topic": "Pie Charts, Proportions, Data Analysis",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex004"
  },
  {
    "question_text": "The following data represents the number of students in a hostel speaking different languages:\n\nLanguages and Number of Students:\nHindi = 40, English = 12, Marathi = 9, Tamil = 7, Bengali = 4 (Total = 72).\nDisplay this data in a pie chart.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Calculate the fraction for each language and then the corresponding central angle:\n• Hindi: 40/72 → (40/72)×360 = 200°\n• English: 12/72 → (12/72)×360 = 60°\n• Marathi: 9/72 → (9/72)×360 = 45°\n• Tamil: 7/72 → (7/72)×360 = 35°\n• Bengali: 4/72 → (4/72)×360 = 20°\nDraw a circle and partition it into sectors with the above-calculated angles.",
    "explanation": "Step 1: Determine the fraction of the total each language represents. For example, for Hindi: 40/72 simplifies to approximately 0.5556; multiply by 360° to get 200°.\nStep 2: Repeat the calculation for each language:\n- English: (12/72)×360 = 60°\n- Marathi: (9/72)×360 = 45°\n- Tamil: (7/72)×360 = 35°\n- Bengali: (4/72)×360 = 20°\nStep 3: Draw the circle and using a protractor, mark the center and draw radii to create sectors with central angles of 200°, 60°, 45°, 35°, and 20° respectively.\nThis pie chart will accurately display the language distribution among the students.",
    "topic": "Pie Charts, Data Representation, Proportions",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex005"
  },
  {
    "question_text": "In the pictograph representing car production, one full car symbol stands for 100 cars and one half car symbol stands for 50 cars. If the pictograph for July shows 2 full car symbols and 1 half car symbol, what is the total number of cars produced in July?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "200",
      "250",
      "300",
      "350"
    ],
    "correct_answer": "250",
    "explanation": "Each full car symbol represents 100 cars. Thus, 2 full symbols equal 2 × 100 = 200 cars. One half symbol represents 50 cars. So, total = 200 + 50 = 250 cars.",
    "topic": "Pictograph interpretation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen001"
  },
  {
    "question_text": "A bar graph shows the number of students in Class VIII for the academic years 2003-04 to 2007-08 with the following heights: 100, 200, 250, 300, and 350 respectively. In which academic year does the graph indicate the maximum number of students?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "2003-04",
      "2004-05",
      "2005-06",
      "2007-08"
    ],
    "correct_answer": "2007-08",
    "explanation": "The bar corresponding to 2007-08 has the maximum height indicating 350 students, which is the highest among all the values.",
    "topic": "Bar graph interpretation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen002"
  },
  {
    "question_text": "In a double bar graph comparing marks obtained in different subjects over two academic years (2005-06 and 2006-07), one subject shows a significant improvement in marks from one year to the next. Which subject is most likely to have shown this improvement if the data indicates Maths marks increased the most?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Maths",
      "Science",
      "English",
      "Hindi"
    ],
    "correct_answer": "Maths",
    "explanation": "The double bar graph clarifies that among the subjects compared, Maths had the largest increase in marks, hence implying the maximum improvement.",
    "topic": "Double bar graph comparison",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen003"
  },
  {
    "question_text": "Define data in the context of a classroom scenario and explain its importance in statistical representation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Data refers to the recorded values or measurements related to a particular situation. In a classroom scenario, data could be the marks scored by students in a test or their heights. Its importance lies in organizing, analyzing, and interpreting these observations to make informed decisions like calculating averages or assessing performance.",
    "explanation": "Data is the collection of numerical or categorical measurements that represent aspects of a situation. In educational settings, accurate and effectively represented data help in tracking student performance, identifying trends, and planning further instructional strategies.",
    "topic": "Introduction to Data",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen004"
  },
  {
    "question_text": "Explain the difference between a pictograph and a bar graph in data representation.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A pictograph represents data using symbols or pictures where each symbol corresponds to a certain number of units, while a bar graph represents data using rectangular bars whose lengths or heights are proportional to the values they represent.",
    "explanation": "The pictograph uses images to represent data values which makes it visually appealing and easier for basic comparisons. A bar graph, on the other hand, uses uniform bars that clearly present quantitative differences; the height of each bar directly corresponds to its numerical value, making it better for precise data comparison.",
    "topic": "Graphical representation of data",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen005"
  },
  {
    "question_text": "Discuss how the order or position of the bars in a bar graph affects (or does not affect) the information being conveyed. Provide reasons for your answer.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The position or order of the bars does not affect the information being conveyed because the key information is given by the height of each bar which represents the numerical value. Rearranging the bars might change the visual order, but the data itself remains unchanged.",
    "explanation": "In a bar graph, the numerical values are represented by the heights or lengths of the bars. Even if the bars are rearranged, the comparative sizes, which are the true carriers of information, remain the same. However, logical ordering (like chronological) can help better understand trends.",
    "topic": "Bar graph interpretation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen006"
  },
  {
    "question_text": "Examine a scenario: A teacher collects the heights of all students in her class and represents them using a bar graph. Detail the step-by-step process documenting how the teacher should collect, organize, and graphically represent this data.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Step 1: Collect the data by measuring the height of every student accurately. Step 2: Organize the data in a tabular form, possibly in increasing order or grouped by intervals. Step 3: Choose the appropriate type of graph (here, a bar graph) to represent the data. Step 4: Draw the X-axis to represent height intervals and Y-axis to represent the frequency (number of students) in each interval. Step 5: Plot and draw bars corresponding to each interval based on the frequency. Step 6: Label the graph appropriately and provide a title.",
    "explanation": "The teacher should first gather all individual height measurements. Then, by organizing these measurements into intervals or groups, it becomes easier to see the distribution of heights. Next, a bar graph is constructed where the x-axis represents height intervals and the y-axis the frequency. Drawing accurate bars helps in providing a clear interpretation of the data. This process includes recording, categorizing, graphical representation, and interpretation.",
    "topic": "Data collection and graphical representation",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen007"
  },
  {
    "question_text": "Using a double bar graph, discuss how one can compare marks obtained by a student in different subjects over two different academic years. Illustrate your answer with an example that includes at least three subjects.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In a double bar graph, two bars for each subject are plotted side by side to represent the marks for each academic year. For example, if a student scored in Maths, Science, and English over two years, the graph can show each subject on the x-axis. Two bars for Maths would represent the two years, and similarly for Science and English. By comparing the heights of the bars for each subject, one can easily observe in which subject there was an improvement, decline, or no change in the performance.",
    "explanation": "The double bar graph is designed to compare two sets of data simultaneously. In our example, plotting the subjects on the x-axis and the marks on the y-axis, two bars (each for a different academic year) are drawn for each subject. The difference in the height of each bar juxtaposed side by side allows for an immediate visual comparison of performance trends. Such a graph highlights improvements if the bar for the later year is taller and declines if it is shorter.",
    "topic": "Double bar graph analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen008"
  },
  {
    "question_text": "Construct a bar graph to represent the following data: Number of watches sold per month – July: 1000, August: 1500, September: 1500, October: 2000, November: 2500, December: 1500. Describe the steps required to create the graph.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Step 1: Draw two perpendicular axes. Label the horizontal axis with the months (July to December) and the vertical axis with a suitable range covering from 0 to at least 2500. Step 2: Mark the appropriate scales on the vertical axis (e.g., in steps of 500). Step 3: For each month, draw a bar whose height corresponds to the number of watches sold (e.g., for July, a bar reaching up to 1000; for November, up to 2500). Step 4: Title the graph and label axes appropriately.",
    "explanation": "Begin by drawing the x-axis (months) and y-axis (number of watches sold). Choose an appropriate scale for the vertical axis so that all values can be plotted accurately. Draw a bar for each month based on its sales figure. Finally, add a title and label both axes, ensuring the graph is clear and easy to understand.",
    "topic": "Bar graph construction",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen009"
  },
  {
    "question_text": "You are given the following data: Number of children who prefer walking and cycling at three schools – School A: Walking-40, Cycling-45; School B: Walking-55, Cycling-25; School C: Walking-15, Cycling-35. Construct a double bar graph to represent this data. Explain how the double bar graph helps in comparing the two modes of transport across schools.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Step 1: Draw the x-axis with three categories representing School A, School B, and School C. Step 2: Draw the y-axis with a scale that covers the maximum number from the data (e.g., up to 60). Step 3: For each school, draw two bars side by side: one for walking, one for cycling. For School A, draw bars of heights 40 (walking) and 45 (cycling); for School B, 55 and 25; for School C, 15 and 35. Step 4: Use different colors or patterns to distinguish between walking and cycling. Step 5: Add a legend, title, and axis labels. This graph visually compares the preferences of children in each school.",
    "explanation": "The double bar graph allows you to plot two data sets (walking and cycling) next to one another for each school. This side-by-side comparison makes it easy to see which mode of transport is preferred in each school and how the preferences differ from school to school. The visual clarity helps in quickly drawing comparisons.",
    "topic": "Double bar graph construction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen010"
  },
  {
    "question_text": "Given a pictograph where one full car symbol represents 100 cars and a half car symbol denotes 50 cars, if you are required to represent 400 cars entirely using full and half symbols, what is the minimum number of symbols required and how would you arrange them?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "To represent 400 cars, one can use 3 full symbols and 2 half symbols. Calculation: 3 full symbols = 3×100 = 300 cars, and 2 half symbols = 2×50 = 100 cars. Total = 300 + 100 = 400 cars. Thus, minimum symbols required = 3 + 2 = 5 symbols.",
    "explanation": "Start with the maximum full symbols without exceeding 400. Three full symbols give 300. The remaining 100 is exactly provided by 2 half symbols (since each is equivalent to 50). Therefore, using 3 full symbols and 2 half symbols accurately represents 400 cars using 5 symbols in total.",
    "topic": "Pictograph interpretation and calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen011"
  },
  {
    "question_text": "Examine the following data for cricket teams: South Africa (75% to 78%), Australia (61% to 40%), Sri Lanka (54% to 38%), New Zealand (47% to 50%), England (46% to 50%), Pakistan (45% to 44%), West Indies (44% to 30%), India (43% to 56%). Construct a double bar graph to represent the percentages for two different series (‘Champions Trophy to World Cup-06’ and ‘Last 10 ODI in 07’). Explain how you determine which team showed the most improvement and which showed a decline.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Step 1: Label the x-axis with the names of the teams and the y-axis with percentage values (ensure the scale covers at least 0% to 100%). Step 2: For each team, draw two adjacent bars: one for the first series and one for the second series using different colors/patterns. Step 3: Once the graph is drawn, compare the heights of the paired bars for each team. For instance, India’s bar increases from 43% to 56%, indicating improvement, while Australia’s bar drops from 61% to 40%, indicating a decline.",
    "explanation": "A double bar graph allows side-by-side visual comparison of the two series for each team. Look for increases by comparing the height difference of the two bars for a team. The greatest positive difference indicates the most improvement (for example, India), while the largest negative difference indicates a decline (for example, Australia). The graph thus helps in quickly identifying performance trends.",
    "topic": "Double bar graph analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen012"
  },
  {
    "question_text": "What are the possible outcomes when a coin is tossed?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) {Head, Tail}",
      "B) {Head only}",
      "C) {Tail only}",
      "D) {Edge, Face}"
    ],
    "correct_answer": "A) {Head, Tail}",
    "explanation": "A fair coin produces 2 outcomes: Head and Tail. Both outcomes are equally likely.",
    "topic": "Random Experiments & Equally Likely Outcomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen025"
  },
  {
    "question_text": "When a fair die is thrown, what is the probability of obtaining the outcome '2'?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) 1/2",
      "B) 1/6",
      "C) 2/6",
      "D) 1/3"
    ],
    "correct_answer": "B) 1/6",
    "explanation": "A die has 6 equally likely outcomes. Only one outcome gives '2'. Therefore, the probability is 1/6.",
    "topic": "Probability & Equally Likely Outcomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen026"
  },
  {
    "question_text": "A spinner is divided into 3 sectors labeled A, B, and C. What is the probability of landing on sector A?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) 1/3",
      "B) 1/2",
      "C) 1/4",
      "D) 1/6"
    ],
    "correct_answer": "A) 1/3",
    "explanation": "Since there are 3 equally likely sectors (A, B, C), the probability of landing on any one sector is 1/3.",
    "topic": "Probability & Equally Likely Outcomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen027"
  },
  {
    "question_text": "A bag contains 4 red balls and 2 yellow balls. What is the probability of drawing a red ball without looking?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) 1/2",
      "B) 2/3",
      "C) 4/6",
      "D) 1/3"
    ],
    "correct_answer": "B) 2/3",
    "explanation": "Total balls = 4 + 2 = 6. Red balls = 4. The probability is 4/6 which simplifies to 2/3.",
    "topic": "Probability in Real Life",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen028"
  },
  {
    "question_text": "Define the term 'random experiment' and provide one example from everyday life.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A random experiment is an experiment where the outcomes are uncertain and cannot be predicted with certainty, though all outcomes are known. An example is tossing a coin.",
    "explanation": "A random experiment has a set of possible outcomes that arise due to chance. For example, in a coin toss, you cannot control whether it lands as head or tail, making it a classic random experiment.",
    "topic": "Random Experiments",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen029"
  },
  {
    "question_text": "Explain the concept of 'equally likely outcomes' using the example of tossing a coin repeatedly.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Equally likely outcomes are outcomes that have the same chance of occurring. In tossing a coin, the outcomes 'Head' and 'Tail' both have a probability of ½, which shows that each coin toss outcome is equally likely.",
    "explanation": "When a coin is tossed, both outcomes (Head and Tail) are equally likely because there is no bias. This is an ideal example illustrating that each outcome has an equal chance of occurring.",
    "topic": "Equally Likely Outcomes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen030"
  },
  {
    "question_text": "When a die is thrown, calculate the probability of getting an even number. Show your working.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The even numbers on a die are 2, 4, and 6. Since there are 3 even numbers out of 6 possible outcomes, the probability is 3/6, which simplifies to 1/2.",
    "explanation": "Total outcomes = {1, 2, 3, 4, 5, 6}. Even number outcomes = {2, 4, 6}. Thus, probability = (Number of favorable outcomes) / (Total outcomes) = 3/6 = 1/2.",
    "topic": "Probability Calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen031"
  },
  {
    "question_text": "Prove that when a fair die is thrown, the probability of obtaining an even number is ½, given that all outcomes are equally likely.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A fair die has 6 outcomes, each with probability 1/6. The even numbers are 2, 4, and 6 (3 outcomes). Thus, the probability P(even) = Number of even outcomes / Total outcomes = 3/6 = 1/2.",
    "explanation": "Step 1: List outcomes: {1, 2, 3, 4, 5, 6}. Step 2: Identify even numbers: {2,4,6} (3 outcomes). Step 3: Since the outcomes are equally likely, each has probability 1/6. Step 4: Sum probabilities of even outcomes: 1/6 + 1/6 + 1/6 = 3/6 = 1/2. Hence, the probability of an even number is ½.",
    "topic": "Probability & Equally Likely Outcomes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen032"
  },
  {
    "question_text": "Discuss how probability is used to make predictions in real-life situations like exit polls and weather forecasts. Include the role of historical data in your discussion.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Probability is used in real-life predictions by analyzing a representative sample or historical data to estimate and forecast future events. In exit polls, a small group of voters' choices is used to predict election results, assuming that the sample accurately reflects the larger population. Similarly, weather forecasts are made by using historical weather data to identify trends, which help in predicting future weather conditions. The reliability of these predictions relies on how representative the sample is and how well past data predicts current outcomes.",
    "explanation": "Step 1: For exit polls, data is collected from a sample that reflects the voting population, and probability principles help extrapolate these results to determine overall voting patterns. Step 2: In weather forecasting, long-term historical data is analyzed to recognize patterns and trends. Step 3: These data-driven approaches employ probability theory to quantify uncertainties, enhancing the reliability of predictions in both fields.",
    "topic": "Applications of Probability in Real Life",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen033"
  },
  {
    "question_text": "A bag contains 4 red balls and 2 yellow balls. If a ball is drawn at random, calculate the probability of drawing a yellow ball. Provide a detailed solution.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Total balls = 4 + 2 = 6. The probability of drawing a yellow ball is 2/6, which simplifies to 1/3.",
    "explanation": "Step 1: Count the total number of balls: 6. Step 2: Identify the favorable outcomes (yellow balls): 2. Step 3: Calculate the probability: (favorable outcomes)/(total outcomes) = 2/6 = 1/3.",
    "topic": "Probability Calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen034"
  },
  {
    "question_text": "A spinner is divided into 8 sectors with 5 green and 3 red sectors. (i) List the number of outcomes for landing on a green sector and not landing on a green sector. (ii) Calculate the probability of each event.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) Green outcomes = 5, Not green outcomes = 3. (ii) Probability of green sector = 5/8; Probability of not green sector = 3/8.",
    "explanation": "Step 1: Total sectors = 8 with 5 green and 3 red. Step 2: For green, favorable outcomes = 5 and total outcomes = 8, so probability = 5/8. Similarly, for not green (red), probability = 3/8.",
    "topic": "Probability in Games",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen035"
  },
  {
    "question_text": "In an experiment of tossing a coin 100 times, Heads occurred 48 times and Tails occurred 52 times. Analyze this data to comment on how it reflects the concept of equally likely outcomes.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The experimental probabilities are 48/100 for Heads and 52/100 for Tails, which are close to the theoretical probability of ½ for each. This slight difference is due to randomness and experimental error but as the number of tosses increases the experimental probabilities tend to approach ½.",
    "explanation": "Step 1: Theoretical probability for a fair coin: ½ or 50% for Heads and Tails. Step 2: Experimental results are 48% for Heads and 52% for Tails. Step 3: The small deviation illustrates random variation that diminishes as the number of trials increases. This exemplifies the law of large numbers, where experimental outcomes converge on theoretical probabilities.",
    "topic": "Law of Large Numbers & Equally Likely Outcomes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_viii_hemh1dd_c104_gen036"
  },
  {
    "question_text": "In a pie chart, what does each sector represent?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A part of the whole",
      "The whole data",
      "A specific point",
      "An unrelated value"
    ],
    "correct_answer": "A part of the whole",
    "explanation": "A pie chart divides a circle (the whole) into sectors, where each sector represents a part or fraction of the whole data set.",
    "topic": "Circle Graphs and Pie Charts",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen013"
  },
  {
    "question_text": "If a particular sector of a pie chart represents 1/4 of the data, what is its corresponding central angle?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "45°",
      "90°",
      "120°",
      "180°"
    ],
    "correct_answer": "90°",
    "explanation": "Since the total angle of a circle is 360°, a sector representing 1/4 of the data will have a central angle of 1/4 × 360° = 90°.",
    "topic": "Circle Graphs and Pie Charts",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen014"
  },
  {
    "question_text": "Which type of graph is most suitable for displaying parts of a whole?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Bar Graph",
      "Line Graph",
      "Pie Chart",
      "Histogram"
    ],
    "correct_answer": "Pie Chart",
    "explanation": "A pie chart, also known as a circle graph, visually represents parts of a whole by dividing a circle into proportional sectors.",
    "topic": "Circle Graphs and Pie Charts",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen015"
  },
  {
    "question_text": "In a pie chart representing sales data, if an item contributes 1/6 of the total sales, what is its central angle in degrees?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "30°",
      "60°",
      "90°",
      "120°"
    ],
    "correct_answer": "60°",
    "explanation": "The central angle is calculated by multiplying the fraction by 360°. For 1/6 of the data: (1/6) × 360° = 60°.",
    "topic": "Circle Graphs and Pie Charts",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen016"
  },
  {
    "question_text": "Define a circle graph (pie chart) and describe its main components.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A circle graph, or pie chart, is a circular statistical graphic divided into slices to illustrate numerical proportions. Its main components include the circle (representing the whole), sectors (parts of the circle), and the central angles which are proportional to the represented data.",
    "explanation": "A circle graph shows the relationship between the whole and its parts. Each sector's size is proportional to the corresponding data value, and calculating the central angle usually involves multiplying the data fraction by 360°.",
    "topic": "Circle Graphs and Pie Charts",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen017"
  },
  {
    "question_text": "Explain how to calculate the central angle of a sector in a pie chart given the percentage or fraction of the whole.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "To calculate the central angle for a sector, first express the given percentage as a fraction of 100. Then, multiply the fraction by 360° (since a full circle is 360°).",
    "explanation": "For example, if a sector represents 25% of the whole, convert 25% to a fraction (25/100 = 1/4). Then calculate the angle as (1/4) × 360° = 90°. This approach works for any percentage.",
    "topic": "Circle Graphs and Pie Charts",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen018"
  },
  {
    "question_text": "A pie chart represents the day's activities of a child, where sleeping is 8 hours out of 24 hours. What fraction of the pie chart does sleeping represent?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Sleeping represents 8/24, which simplifies to 1/3 of the pie chart.",
    "explanation": "Since there are 24 hours in a day, the fraction for sleeping is calculated as 8 ÷ 24 = 1/3. This means 1/3 of the circle should be allocated for sleeping.",
    "topic": "Circle Graphs and Pie Charts",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen019"
  },
  {
    "question_text": "Using the following data on ice-cream flavor preferences in a school: Chocolate – 50%, Vanilla – 25%, Other – 25%, derive the central angles for each flavor and describe the steps to construct the corresponding pie chart.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Chocolate: (50/100)×360° = 180°, Vanilla: (25/100)×360° = 90°, Other: (25/100)×360° = 90°. To draw the pie chart, draw a circle, choose a radius, mark the center, measure out the 180° angle for chocolate, then measure 90° for vanilla, and the remaining 90° will represent other flavors.",
    "explanation": "Step 1: Convert percentages into fractions (Chocolate: 1/2, Vanilla: 1/4, Other: 1/4). Step 2: Multiply each fraction by 360° to get the central angles. Step 3: Using a protractor, draw the first sector with a 180° angle for Chocolate, then mark the next 90° for Vanilla and then the remaining 90° for Other flavors. Step 4: Label each sector accordingly.",
    "topic": "Drawing Pie Charts",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen020"
  },
  {
    "question_text": "A baker's shop has the following sales: Ordinary bread: ₹320, Fruit bread: ₹80, Cakes and pastries: ₹160, Biscuits: ₹120, Others: ₹40. Calculate the fraction and central angle for each item. Provide a step-by-step explanation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Total sales = ₹720. Ordinary Bread: 320/720 = 4/9, so angle = (4/9)*360° = 160°. Fruit Bread: 80/720 = 1/9, angle = (1/9)*360° = 40°. Cakes & Pastries: 160/720 = 2/9, angle = (2/9)*360° = 80°. Biscuits: 120/720 = 1/6, angle = (1/6)*360° = 60°. Others: 40/720 = 1/18, angle = (1/18)*360° = 20°.",
    "explanation": "Step 1: Sum all sales: 320 + 80 + 160 + 120 + 40 = 720. Step 2: Calculate each item's fraction (e.g., Ordinary Bread: 320/720 = 4/9). Step 3: Multiply each fraction by 360° to get the central angle (e.g., Ordinary Bread: 4/9 × 360° = 160°). Follow similar steps for each item.",
    "topic": "Drawing Pie Charts and Data Representation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen021"
  },
  {
    "question_text": "A child spends 8 hours sleeping, 6 hours at school, 4 hours doing homework, 4 hours playing, and 2 hours on other activities. Calculate the central angle for each activity in a pie chart that represents a 24-hour day.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sleep: (8/24)*360° = 120°; School: (6/24)*360° = 90°; Homework: (4/24)*360° = 60°; Play: (4/24)*360° = 60°; Others: (2/24)*360° = 30°.",
    "explanation": "Step 1: Total time = 24 hours. Step 2: For each activity, determine the fraction of 24. For example, sleep = 8/24 = 1/3, so angle = 1/3 × 360° = 120°. Similarly, calculate for the rest: School: 6/24 = 1/4, angle = 90°; Homework: 4/24 = 1/6, angle = 60°; Play: 4/24 = 1/6, angle = 60°; Others: 2/24 = 1/12, angle = 30°.",
    "topic": "Numerical Application of Pie Charts",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen022"
  },
  {
    "question_text": "A family has a monthly expenditure pie chart with the following data: Food: 25%, Others: 20%, Savings: 15%, Clothes: 10%, Transport: 5%, House Rent: 10%, Education for children: 15%. If the monthly savings is ₹3000, determine (a) the value corresponding to 1% of the family's expenditure, and (b) the monthly expenditure on clothes.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Given 15% corresponds to ₹3000, so 1% = ₹3000/15 = ₹200. Therefore, Clothes (10%) expenditure = 10 × ₹200 = ₹2000.",
    "explanation": "Step 1: Identify the proportion: 15% savings = ₹3000. Step 2: Calculate the value of 1%: ₹3000 ÷ 15 = ₹200. Step 3: Multiply by the percentage for clothes: 10% × ₹200 = ₹2000.",
    "topic": "Application of Pie Charts in Real Life",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen023"
  },
  {
    "question_text": "A baker’s shop recorded the following sales: Ordinary Bread: ₹320, Fruit Bread: ₹80, Cakes and Pastries: ₹160, Biscuits: ₹120, Others: ₹40. Verify that the sum of the computed central angles of the pie chart is equal to 360°, and explain why this must always be the case.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Computed angles: Ordinary Bread: 160°, Biscuits: 60°, Cakes and Pastries: 80°, Fruit Bread: 40°, Others: 20°. Sum = 160° + 60° + 80° + 40° + 20° = 360°. This is always true because the angles represent the entire circle which sums to 360°.",
    "explanation": "Step 1: Calculate each central angle using the formula (Sales/Total Sales)×360°. Step 2: Add all the central angles. Because the pie chart represents the whole data set, the sum must equal 360°, which is the total angle measure of a circle.",
    "topic": "Verification in Pie Chart Construction",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "02_section_4_2",
    "question_id": "cbse_viii_hemh1dd_c104_gen024"
  },
  {
    "question_text": "List the outcomes you can see in these experiments: (a) Spinning a wheel with sectors A, B, C, D, A; (b) Tossing two coins together.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "For (a), the outcomes are A, B, C, D, and A appears twice indicating that the wheel has two sectors labelled A. If we consider distinct outcomes, they are A, B, C, D. For (b), the outcomes when tossing two coins are: HH, HT, TH, TT.",
    "explanation": "For experiment (a), list every outcome as marked on the spinner. Note that the letter A appears twice, which may be considered as two separate occurrences depending on the context. For (b), each coin has two possible outcomes (Head or Tail) and when two coins are tossed together, the total number of outcomes is 2×2 = 4. These outcomes are: HH, HT, TH, TT.",
    "topic": "Random experiments and outcomes",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex006"
  },
  {
    "question_text": "When a die is thrown, list the outcomes of an event of getting: (i) (a) a prime number, (b) not a prime number; (ii) (a) a number greater than 5, (b) a number not greater than 5.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) a. Prime numbers on a die are 2, 3, and 5; b. Not prime numbers are 1, 4, and 6. (ii) a. A number greater than 5 on a die is only 6; b. Numbers not greater than 5 are 1, 2, 3, 4, and 5.",
    "explanation": "A standard die has six faces numbered 1 to 6. For part (i), identify the prime numbers: 2, 3 and 5 (note that 1 is not considered prime), and thus the non-prime outcomes are the remaining numbers: 1, 4, and 6. For part (ii), the only number greater than 5 is 6, so the event 'a number greater than 5' has one outcome, while the event 'a number not greater than 5' includes the outcomes 1, 2, 3, 4, and 5.",
    "topic": "Events and outcomes in probability",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex007"
  },
  {
    "question_text": "Find the following probabilities: (a) the probability of the pointer stopping on D in the spinner (from question 1-(a)); (b) the probability of getting an ace from a well shuffled deck of 52 playing cards; (c) the probability of getting a red apple from a figure showing a circle containing 4 green apples and 3 red apples.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) The probability is 1/5 because there are 5 outcomes on the spinner and only one is D. (b) The probability of getting an ace is 4/52, which simplifies to 1/13. (c) The probability of getting a red apple is 3/7, since there are 3 red apples out of a total of 7 apples.",
    "explanation": "For (a), the spinner has 5 outcomes (noting that one sector, A, appears twice but still counts as a separate outcome instance), hence the probability for any one specified outcome (in this case D) is 1 divided by 5. For (b), in a deck of 52 cards, there are 4 aces. Therefore, the probability = 4/52 = 1/13. For (c), the total number of apples is 4 + 3 = 7. The event 'drawing a red apple' has 3 favorable outcomes. So, the probability = 3/7.",
    "topic": "Classical probability",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex008"
  },
  {
    "question_text": "Numbers 1 to 10 are written on ten separate slips and placed in a box. One slip is chosen without looking. What is the probability of: (i) getting the number 6; (ii) getting a number less than 6; (iii) getting a number greater than 6; (iv) getting a 1-digit number?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) 1/10; (ii) For numbers less than 6 (i.e., 1, 2, 3, 4, 5), probability = 5/10 = 1/2; (iii) For numbers greater than 6 (i.e., 7, 8, 9, 10), probability = 4/10 = 2/5; (iv) A 1-digit number is any number from 1 to 9, so probability = 9/10.",
    "explanation": "There are 10 slips numbered 1 through 10. For (i), only one slip has the number 6, giving a probability of 1/10. For (ii), the numbers less than 6 are 1-5, hence 5 favorable outcomes which gives 5/10 or 1/2. For (iii), the numbers greater than 6 are 7, 8, 9, and 10, resulting in 4/10 or 2/5. For (iv), since only the number 10 is a 2-digit number, the 1-digit numbers count 9 out of 10 outcomes, so the probability is 9/10.",
    "topic": "Basic probability with uniform outcomes",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex009"
  },
  {
    "question_text": "If you have a spinning wheel with 3 green sectors, 1 blue sector, and 1 red sector, what is the probability of getting a green sector? What is the probability of getting a non blue sector?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The total number of sectors is 5. Therefore, the probability of getting a green sector is 3/5. For a non blue sector, add the green (3 sectors) and red (1 sector) outcomes to get 4, so the probability is 4/5.",
    "explanation": "Count the total outcomes on the spinning wheel which is 3 (green) + 1 (blue) + 1 (red) = 5. The event of getting a green sector has 3 favorable outcomes, thus probability = 3/5. For a non blue outcome, there are 4 favorable sectors (green and red), which gives probability = 4/5.",
    "topic": "Probability using equally likely outcomes",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex010"
  },
  {
    "question_text": "Find the probabilities of the events given in Question 2 (i.e., for a die toss, determine: (i) probability of getting a prime number and not a prime number; (ii) probability of getting a number greater than 5 and not greater than 5).",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For a die: Total outcomes = 6. (i) Prime numbers on a die are 2, 3, and 5, so probability = 3/6 = 1/2; non prime numbers are 1, 4, 6, so probability = 3/6 = 1/2. (ii) The only number greater than 5 is 6, so probability = 1/6; numbers not greater than 5 are 1, 2, 3, 4, and 5, so probability = 5/6.",
    "explanation": "A standard die has six faces numbered 1 to 6. For part (i), the prime outcomes are 2, 3, and 5 (3 outcomes), and the non prime outcomes are 1, 4, and 6 (3 outcomes), each giving a probability of 3/6 or 1/2. For part (ii), only 6 is greater than 5, so its probability is 1/6, while the complement (numbers 1 through 5) yields 5/6.",
    "topic": "Events and probability calculation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hemh104",
    "question_id": "cbse_viii_hemh1dd_c104_ex011"
  }
]