[
  {
    "question_text": "The following graph shows the temperature of a patient in a hospital, recorded every hour (from 9 am to 3 pm) with temperature values on the y-axis from 34°C to 39°C. (a) What was the patient’s temperature at 1 p.m.? (b) When was the patient’s temperature 38.5°C? (c) The patient’s temperature was the same two times during the period given. What were these two times? (d) What was the temperature at 1.30 p.m.? How did you arrive at your answer? (e) During which periods did the patient’s temperature show an upward trend?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) At 1 p.m., the reading on the graph shows approximately 37°C. b) The graph reaches 38.5°C between the markings for 12 p.m. and 1 p.m., approximately at 12:30 p.m. c) The graph shows the same temperature at two different times; for example, if the reading of 36.5°C occurs at both 9:30 a.m. and 2:30 p.m., then those are the two times. (The exact times depend on the plotted points on the graph.) d) At 1.30 p.m., by estimating between the plotted points at 1 p.m. and 2 p.m., the temperature is approximately 37.5°C; this is found by interpolation between the two values. e) An upward trend is seen in the periods where the graph is rising – for instance, from 9 a.m. to 10 a.m. and again from 12 p.m. to 1 p.m. (based on the visual slope of the graph.)",
    "explanation": "To solve these subquestions, first read off the value corresponding to each time point on the graph. For (a), locate 1 p.m. on the x-axis and read the corresponding y-value. For (b), identify the point or interval where the temperature equals 38.5°C by observing where the smooth curve crosses that level. For (c), look for two distinct time points where the y-values are equal. For (d), use interpolation – if the temperature at 1 p.m. and 2 p.m. are known, estimate the value at 1:30 p.m. by averaging or using the linear path between the two points. For (e), by observing the portions of the line where the graph ascends, those intervals represent an upward trend. This problem tests your ability to interpret data from a line graph.",
    "topic": "Graph Interpretation (Line Graphs)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex001"
  },
  {
    "question_text": "The following line graph shows the yearly sales figures for a manufacturing company with the x-axis representing the years 2002 to 2006 and the y-axis representing sales in Rs Crores (from 0 to 12). (a) What were the sales in (i) 2002 and (ii) 2006? (b) What were the sales in (i) 2003 and (ii) 2005? (c) Compute the difference between the sales in 2002 and 2006. (d) In which year was there the greatest difference between the sales as compared to its previous year?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) From the graph, assume the sales in 2002 were approximately 3 Crores and in 2006 approximately 10 Crores. b) Similarly, the sales in 2003 can be read as about 5 Crores and in 2005 as about 7 Crores. c) The difference between 2002 and 2006 is 10 - 3 = 7 Crores. d) By comparing year-on-year differences, the largest jump occurs between 2005 and 2006 (i.e. a difference of 3 Crores), assuming that is the largest increment shown on the graph.",
    "explanation": "Begin by reading the graph carefully: for each specified year, note the corresponding sales figure. For part (a) and (b), use the coordinates where the plotted points lie. For part (c), subtract the 2002 figure from the 2006 figure to obtain the absolute increase in sales. For part (d), compute the differences between each pair of consecutive years and identify which year to year change is greatest. This exercise tests the ability to extract numerical data from a line graph and perform basic arithmetic operations on the data.",
    "topic": "Graph Interpretation (Line Graphs & Data Analysis)",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex002"
  },
  {
    "question_text": "For an experiment in Botany, two different plants, Plant A (dotted line) and Plant B (solid line), were grown under similar laboratory conditions and their heights (in cm, ranging from 0 to 14) were measured at the end of each week for 3 weeks. (a) How high was Plant A after (i) 2 weeks and (ii) 3 weeks? (b) How high was Plant B after (i) 2 weeks and (ii) 3 weeks? (c) How much did Plant A grow during the 3rd week? (d) How much did Plant B grow from the end of the 2nd week to the end of the 3rd week? (e) During which week did Plant A grow the most? (f) During which week did Plant B grow the least? (g) Were the two plants of the same height during any week shown here? Specify.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) By reading the graph, suppose Plant A reached 8 cm after 2 weeks and 12 cm after 3 weeks. b) For Plant B, the readings may be 10 cm after 2 weeks and 13 cm after 3 weeks. c) Growth of Plant A during the 3rd week = 12 cm - 8 cm = 4 cm. d) Growth of Plant B from week 2 to week 3 = 13 cm - 10 cm = 3 cm. e) If Plant A’s growth in week 1, 2, and 3 are determined (for example, if week 2 shows an increase from 3 cm to 8 cm, a growth of 5 cm, which is more than the other weeks), then the maximum growth occurred in the 2nd week. f) For Plant B, if the smallest increase was during week 3 (3 cm), then that is the week with the least growth. g) Both plants start at 0 cm at the beginning of the experiment; apart from the initial value, if no other point shows identical heights, then they were only equal at the start.",
    "explanation": "Read off the heights from the graph at the end of each week for both plants. For parts (a) and (b), note the values at the 2nd and 3rd weeks. For part (c) and (d), calculate the difference in heights between consecutive weeks. For (e) and (f), compare the weekly growth increments for each plant to identify the greatest and the least increases. Finally, for (g), observe if the curves intersect at any point other than the starting point (0 cm). This question assesses your ability to interpret and analyze data from a comparative line graph.",
    "topic": "Graph Interpretation (Comparative Line Graphs)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex003"
  },
  {
    "question_text": "The following graph shows the temperature forecast and the actual temperature for each day of a week. The x-axis represents the days from Monday to Sunday and the y-axis represents temperature (from 5°C to 35°C). (a) On which days was the forecast temperature the same as the actual temperature? (b) What was the maximum forecast temperature during the week? (c) What was the minimum actual temperature during the week? (d) On which day did the actual temperature differ the most from the forecast temperature?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) By comparing the two curves (dotted for forecast and solid for actual), the temperatures coincide on, for example, Wednesday and Friday. b) The maximum forecast temperature as read from the dotted line is approximately 35°C. c) The minimum actual temperature from the solid line could be about 5°C. d) The day with the greatest difference between the forecast and actual temperatures is identified by the largest vertical gap on the graph; assume this is Monday.",
    "explanation": "To answer these questions, compare the two plotted lines on the graph. For (a), look for points where the forecast and actual curves meet. For (b) and (c), scan the forecast and actual curves respectively to find their extreme values. For (d), measure the vertical distance between the two curves for every day and pick the day with the maximum difference. This exercise tests your skills in extracting and comparing data from overlaid line graphs.",
    "topic": "Graph Interpretation (Overlay Comparison)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex004"
  },
  {
    "question_text": "Use the tables below to draw linear graphs.\n(a) The number of days a hill side city received snow in different years:\n  Year: 2003, 2004, 2005, 2006\n  Days: 8, 10, 5, 12\n(b) Population (in thousands) of men and women in a village in different years:\n  Year: 2003, 2004, 2005, 2006, 2007\n  Number of Men: 12, 12.5, 13, 13.2, 13.5\n  Number of Women: 11.3, 11.9, 13, 13.6, 12.8\nDraw linear graphs for each dataset using appropriate scales and label the axes.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For (a), plot the years (2003 to 2006) along the x-axis and the corresponding number of snowy days on the y-axis; mark the points (2003, 8), (2004, 10), (2005, 5) and (2006, 12) then connect them with straight line segments. For (b), prepare a graph with the years (2003–2007) on the x-axis and population (in thousands) on the y-axis; plot two sets of points—one for men [ (2003, 12), (2004, 12.5), (2005, 13), (2006, 13.2), (2007, 13.5) ] and one for women [ (2003, 11.3), (2004, 11.9), (2005, 13), (2006, 13.6), (2007, 12.8) ]—and join each set with a straight line. Label each graph appropriately and include a legend in (b) to indicate which line represents which gender.",
    "explanation": "To create a linear graph from a table of values, first choose a suitable scale for both the x-axis (years) and y-axis (values such as days or population). Plot the given data points according to the table, using the scale to correctly place each point. Then, connect the points with straight lines to visualize the trend. Ensure that the axes are labelled clearly, and for multiple datasets (as in part (b)), include a legend. This question tests your ability to convert tabular data into a graphical representation.",
    "topic": "Data Representation (Drawing Line Graphs)",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex005"
  },
  {
    "question_text": "A courier-person cycles from a town to a neighbouring suburban area to deliver a parcel to a merchant. The graph (with the x-axis showing Time from 8 am to 12 noon and the y-axis showing Distance from the town in km from 0 to 22) represents his journey. (a) What is the scale taken for the time axis? (b) How much time did the person take for the travel? (c) How far is the place of the merchant from the town? (d) Did the person stop on his way? Explain. (e) During which period did he ride the fastest?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) The scale on the time axis is such that each division represents 1 hour (from 8 am to 12 noon covers 4 hours). b) The total time taken for the travel is 4 hours. c) The final point on the graph shows the distance from the town to the merchant’s location, which is approximately 22 km. d) If there exists a horizontal segment in the graph (indicating no change in distance for a period of time), then the courier must have stopped; for example, a flat segment between 10 and 11 am would suggest a pause. e) The fastest riding period is indicated by the steepest segment on the graph; if the graph rises most sharply between 9 am and 10 am, that is the period during which he rode the fastest.",
    "explanation": "Examine the graph carefully: for (a) determine how many hours are represented per division; from 8 am to 12 noon, a consistent hourly scale is assumed. For (b), subtract the start time from the end time to find the total journey time. For (c), read the final distance value from the y-axis at 12 noon. For (d), identify any segments where the line is horizontal, indicating that the distance did not change over that interval. For (e), assess the slope (steepness) of the line in different segments; the steepest slope corresponds to the highest speed. This question examines your capability to analyze motion graphs.",
    "topic": "Graph Interpretation (Motion and Speed Analysis)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex006"
  },
  {
    "question_text": "Can there be a time–temperature graph as follows? (i) A graph showing temperature increasing linearly with time. (ii) A graph showing temperature decreasing linearly with time. (iii) A graph showing temperature constant over time. (iv) A graph showing time constant while temperature changes vertically. Justify your answer for each case.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "i) Yes, a graph showing temperature increasing linearly with time is possible when the temperature rises at a constant rate over a period. ii) Yes, a graph showing temperature decreasing linearly with time is possible if the temperature falls at a constant rate. iii) Yes, a constant temperature over time can be depicted if the measured temperature remains unchanged over the duration. iv) No, a graph where time is constant while temperature changes vertically is not valid for a time–temperature graph because time must always progress along the horizontal axis; a vertical line would mean multiple temperature values at the same time, which is not realistic.",
    "explanation": "For (i) and (ii), if the rate of increase or decrease in temperature throughout the observed period is uniform, the graph will be a straight line with a positive or negative slope respectively. For (iii), if there is no change in temperature, the graph is a horizontal line, indicating a constant value. For (iv), the x-axis of a time–temperature graph represents time and must move forward; a vertical line suggests that time is frozen while temperature changes, which contradicts the definition of a function controlling time. This problem assesses your conceptual understanding of graphing functions and the meaning of their axes.",
    "topic": "Graph Theory and Function Representation",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex007"
  },
  {
    "question_text": "In the context of electricity billing, which of the following is the independent variable?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The amount of the electric bill",
      "B. The quantity of electricity used",
      "C. Both the bill and consumption",
      "D. None of the above"
    ],
    "correct_answer": "B. The quantity of electricity used",
    "explanation": "The independent variable is the quantity that is controlled or varied. In this scenario, the quantity of electricity used affects the bill, making it the independent variable.",
    "topic": "Independent and Dependent Variables",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen013"
  },
  {
    "question_text": "Why does the graph of the cost versus litres of petrol pass through the origin?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Because the petrol cost is fixed regardless of litres bought",
      "B. Because when no petrol is purchased, no cost is incurred",
      "C. Because the graph is exponential in nature",
      "D. Because of experimental measurement errors"
    ],
    "correct_answer": "B. Because when no petrol is purchased, no cost is incurred",
    "explanation": "A direct variation implies that if the independent variable (litres of petrol) is 0, the dependent variable (cost) must also be 0. Thus, the line passes through the origin.",
    "topic": "Direct Variation and Graphs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen014"
  },
  {
    "question_text": "Consider a modified petrol pricing scenario where a fixed service charge is added to the total cost. Which statement best describes the graph of cost vs. litres in this case?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. The graph remains linear and passes through the origin",
      "B. The graph becomes exponential",
      "C. The graph remains linear but has a non-zero y-intercept",
      "D. The graph forms a parabolic curve"
    ],
    "correct_answer": "C. The graph remains linear but has a non-zero y-intercept",
    "explanation": "When a fixed charge is added, the relationship is still linear with the quantity of petrol bought; however, when no petrol is purchased, the bill still amounts to the fixed charge. Thus, the y-intercept is not zero.",
    "topic": "Graphical Interpretation of Linear Relations",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen015"
  },
  {
    "question_text": "According to the principal and simple interest example, if a senior citizen wishes to earn an annual interest of ₹70 at a 10% rate, what deposit should be made?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. ₹600",
      "B. ₹700",
      "C. ₹750",
      "D. ₹770"
    ],
    "correct_answer": "B. ₹700",
    "explanation": "Simple Interest (SI) for one year at 10% is calculated by SI = (Deposit × 10) / 100. To get ₹70 interest, Deposit = (70×100)/10 = ₹700.",
    "topic": "Simple Interest and Direct Variation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen016"
  },
  {
    "question_text": "Define the terms 'independent variable' and 'dependent variable' in your own words based on their usage in everyday applications like electricity billing.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An independent variable is the one that is controlled or changed (for example, the amount of electricity used), while a dependent variable is the one that changes in response to the independent variable (for example, the electric bill).",
    "explanation": "The independent variable is the factor you change or that has variability in an experiment or real-life scenario, whereas the dependent variable is the outcome or result that changes in direct response to this variation.",
    "topic": "Variables in Direct Variation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen017"
  },
  {
    "question_text": "Explain why a graph representing direct variation is always a straight line.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A graph of a direct variation is a straight line because the ratio of the dependent variable to the independent variable remains constant, leading to a linear relationship.",
    "explanation": "In direct variation, any change in the independent variable results in a proportional change in the dependent variable. This consistent ratio means the graph has a constant slope and thus is a straight line.",
    "topic": "Direct Variation and Linear Graphs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen018"
  },
  {
    "question_text": "Using the time-distance graph concept, describe the procedure to determine the time taken to cover a specific distance.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "To determine the time taken to cover a distance, locate the given distance on the vertical axis of the graph, draw a horizontal line toward the graph, then drop a vertical line from the point where it meets the graph down to the time (horizontal) axis. The crossing point indicates the time taken.",
    "explanation": "This method uses the coordinates on the graph: the vertical coordinate gives the distance while the corresponding horizontal coordinate gives the time. It is a graphical representation of the relation Distance = Speed × Time.",
    "topic": "Graph Interpretation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen019"
  },
  {
    "question_text": "What does 'direct variation' mean? Provide an example from everyday life to illustrate your explanation.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Direct variation means that two quantities change in such a way that one is a constant multiple of the other. For example, the cost of petrol varies directly with the number of litres purchased; doubling the litres doubles the cost.",
    "explanation": "In direct variation, the relationship between the variables can be expressed as y = kx, where k is the constant of variation. In our everyday life, the cost of buying a product in bulk (like petrol) increases in direct proportion to the quantity purchased.",
    "topic": "Direct Variation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen020"
  },
  {
    "question_text": "Derive the equation of the line representing the cost of petrol based on this table:\n\nNo. of Litres: 10, 15, 20, 25\nCost (in ₹): 500, 750, 1000, 1250\n\nShow all steps and explain why the graph is linear.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The cost per litre can be found by dividing the cost by the number of litres. For 10 litres, cost = ₹500. Thus, price per litre = 500/10 = ₹50. Therefore, the equation of the line is Cost = 50 × (Number of Litres). The graph is linear because it represents a direct variation with a constant rate of change, and it passes through the origin.",
    "explanation": "Step 1: Determine the constant of proportionality using any pair of values, e.g., (10, 500) gives constant = 500/10 = 50.\nStep 2: Write the equation as y = 50x, where x represents litres and y represents cost.\nStep 3: Notice that when x = 0, y = 0, which confirms that the graph will pass through the origin, making it a straight line.\nThus, the relationship is linear because the cost increases at a constant rate as the number of litres increases.",
    "topic": "Equation of a Line from Direct Variation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen021"
  },
  {
    "question_text": "For a bank deposit scenario where senior citizens earn a 10% simple interest per annum, derive the general formula linking the deposit amount (P) and the simple interest (SI). Draw a conceptual graph to explain why the relationship indicates direct variation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The simple interest acquired in one year at 10% is given by the formula SI = (P × 10 × 1) / 100 = 0.1P. This indicates a direct variation where SI is directly proportional to the deposit P with a constant of 0.1. Graphically, this relation is represented by the line y = 0.1x (with y as SI and x as P) passing through the origin, confirming that if P = 0 then SI = 0.",
    "explanation": "Step 1: Use the formula for simple interest: SI = (P × Rate × Time) / 100.\nStep 2: Given Rate = 10% and Time = 1 year, substitute to get SI = (P × 10) / 100 = 0.1P.\nStep 3: The equation SI = 0.1P is of the form y = kx, implying a linear relation where k (the constant of proportionality) is 0.1.\nStep 4: The graph of this equation will be a straight line, beginning at (0, 0) and increasing at a constant rate of 0.1 units of SI per ₹1 of deposit.\nThus, the deposit and interest are in direct variation.",
    "topic": "Simple Interest and Direct Variation",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen022"
  },
  {
    "question_text": "Ajit rides his scooter at a constant speed of 30 km/hr. Analyze and explain how the distance covered is a linear function of time. Include a graphical representation in your explanation and state any assumptions made.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Since Ajit rides at a constant speed, the distance covered (d) in any time (t) can be expressed as d = 30t. This linear equation shows that distance increases directly with time. The graph of this equation is a straight line passing through the origin with a slope of 30. The assumption here is that Ajit's speed remains constant throughout the ride.",
    "explanation": "Step 1: With constant speed, the formula for distance is d = speed × t, so d = 30t.\nStep 2: This equation is linear (of the form y = mx) where m (the slope) is 30.\nStep 3: Graphically, plotting t on the horizontal axis and d on the vertical axis gives a straight line starting at (0, 0) and rising with a constant slope of 30.\nStep 4: The assumption is that no external factors (like traffic or stops) affect the ride, maintaining a constant speed throughout.",
    "topic": "Distance-Time Relationship",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen023"
  },
  {
    "question_text": "Using the petrol cost table (10 litres = ₹500, 15 litres = ₹750, 20 litres = ₹1000, 25 litres = ₹1250), calculate the amount payable for 12 litres of petrol.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Cost = 12 litres × (₹500/10 litres) = 12 × ₹50 = ₹600.",
    "explanation": "Step 1: Determine the cost per litre from the table: ₹500 for 10 litres implies each litre costs ₹500/10 = ₹50.\nStep 2: Multiply the number of litres (12) by the cost per litre: 12 × ₹50 = ₹600.\nThus, 12 litres cost ₹600.",
    "topic": "Direct Proportion and Unit Rates",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen024"
  },
  {
    "question_text": "For a deposit of ₹350 in a bank offering 10% simple interest per annum, compute the annual simple interest earned.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Simple Interest = (350 × 10) / 100 = ₹35.",
    "explanation": "Step 1: Use the simple interest formula: SI = (Principal × Rate × Time)/100.\nStep 2: Substitute the values: SI = (350 × 10 × 1)/100 = 3500/100 = ₹35.\nThus, the annual interest for ₹350 is ₹35.",
    "topic": "Simple Interest Calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen025"
  },
  {
    "question_text": "Ajit rides his scooter at a constant speed of 30 km/hr. Calculate the distance he covers in 2 hours and 45 minutes.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "First, convert 45 minutes to hours: 45/60 = 0.75 hours. Total time = 2 + 0.75 = 2.75 hours. Distance = 30 × 2.75 = 82.5 km.",
    "explanation": "Step 1: Convert minutes to hours: 45 minutes = 0.75 hours.\nStep 2: Total time = 2 + 0.75 = 2.75 hours.\nStep 3: Using the formula distance = speed × time, calculate 30 km/hr × 2.75 hrs = 82.5 km.\nThus, Ajit covers 82.5 km in 2 hours and 45 minutes.",
    "topic": "Time-Distance Problem",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen026"
  },
  {
    "question_text": "At a petrol pump, aside from the cost per litre, a fixed service fee of ₹50 is added to the total transaction. If the cost per litre remains at ₹50, write the modified equation for the total cost (C) in terms of the number of litres (L) and then calculate the cost for 20 litres.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The modified equation is C = 50L + 50. For L = 20, C = (50 × 20) + 50 = 1000 + 50 = ₹1050.",
    "explanation": "Step 1: Without a service fee, the cost per litre is ₹50 so cost would be 50L.\nStep 2: With a fixed service fee of ₹50, the equation becomes C = 50L + 50.\nStep 3: Substitute L = 20: C = 50 × 20 + 50 = 1000 + 50 = ₹1050.\nThus, with the service fee, 20 litres cost ₹1050.",
    "topic": "Linear Equations and Modifications",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "03_section_13_2",
    "question_id": "cbse_viii_hemh1dd_c113_gen027"
  },
  {
    "question_text": "Draw the graph for the following table of values showing the cost of apples. Use a suitable scale on the axes.\n\nNumber of apples: 1, 2, 3, 4, 5\nCost (in ₹): 5, 10, 15, 20, 25\n\nPlot the points and join them to form the graph.",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The graph consists of the points (1,5), (2,10), (3,15), (4,20), (5,25) plotted on a coordinate plane with the horizontal axis representing the number of apples and the vertical axis representing the cost in rupees. The points lie on a straight line which indicates a linear relationship with the equation Cost = 5 × (Number of apples).",
    "explanation": "Step 1: Choose a suitable scale for the axes (for example, 1 unit on the horizontal axis for each apple and 5 units on the vertical axis for every ₹5).\nStep 2: Plot the points (1,5), (2,10), (3,15), (4,20), and (5,25).\nStep 3: Join these points with a straight line. \nSince the relation is direct, the resulting graph is linear, showing that the cost is directly proportional to the number of apples.",
    "topic": "Graphing Linear Relationships, Direct Proportion",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex008"
  },
  {
    "question_text": "Draw the graph for the following table of values showing the distance travelled by a car. Use a suitable scale on the axes.\n\nTime (in hours): 6 a.m., 7 a.m., 8 a.m., 9 a.m.\nDistance (in km): 40, 80, 120, 160\n\nAfter drawing the graph, answer the following:\n(i) How much distance did the car cover during the period 7.30 a.m. to 8 a.m.?\n(ii) What was the time when the car had covered a distance of 100 km since its start?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) The car travels at a constant rate. From 7 a.m. to 8 a.m., the distance increases from 80 km to 120 km. Hence, in one hour the car covers 40 km, so in 30 minutes (half an hour) it will cover 20 km.\n(ii) The relationship between time and distance is linear. The graph shows that in one hour the car covers 40 km. To find the time when the distance reaches 100 km, note that 100 km lies midway between 80 km (at 7 a.m.) and 120 km (at 8 a.m.), therefore the car reaches 100 km at 7:30 a.m.",
    "explanation": "Step 1: Plot the points corresponding to the given times and distances on a graph (with time on the horizontal axis and distance on the vertical axis).\nStep 2: Draw a straight line through the points since the relationship is linear.\nStep 3: (i) The graph shows that in one hour the car travels 40 km. Thus, in 30 minutes it travels half of 40 km, which is 20 km.\nStep 4: (ii) To find the time corresponding to 100 km, observe that 100 km lies halfway between 80 km (7 a.m.) and 120 km (8 a.m.), so the corresponding time is 7:30 a.m.",
    "topic": "Graphing Linear Functions, Constant Speed, Direct Proportionality",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex009"
  },
  {
    "question_text": "Draw the graph for the following table of values showing the simple interest on deposits for one year. Use a suitable scale on the axes.\n\nDeposit (in ₹): 1000, 2000, 3000, 4000, 5000\nSimple Interest (in ₹): 80, 160, 240, 320, 400\n\nAfter plotting the graph, answer the following:\n(i) Does the graph pass through the origin?\n(ii) Use the graph to find the interest on ₹2500 for a year.\n(iii) To get an interest of ₹280 per year, how much money should be deposited?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Since the simple interest is directly proportional to the deposit, the line representing the relationship is linear and will pass through the origin (0,0) if the scale is extended, even though the table does not list 0.\n(ii) For a deposit of ₹2500, the interest is calculated using the rate, which is 80 per 1000 rupees. Thus, SI = (80/1000) × 2500 = ₹200.\n(iii) To obtain a simple interest of ₹280, using the rate (80 per 1000), the required deposit is found by (280/80) × 1000 = ₹3500.",
    "explanation": "Step 1: Plot the points (1000,80), (2000,160), (3000,240), (4000,320), and (5000,400) using appropriate scales (e.g., horizontal: 1 unit = ₹1000, vertical: 1 unit = ₹80).\nStep 2: Join the points to form a straight line.\nStep 3: (i) Because the interest is directly proportional to the deposit, the line would start at the origin (0,0) even though the table begins at 1000.\nStep 4: (ii) Locate ₹2500 on the horizontal axis; using the proportional relationship, the corresponding interest is found to be ₹200.\nStep 5: (iii) To find the deposit required to earn ₹280 interest, set up the proportion: (Deposit/1000) = (Interest/80). Solving gives Deposit = (280/80) × 1000 = ₹3500.",
    "topic": "Direct Proportionality, Graphical Representation, Simple Interest",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex010"
  },
  {
    "question_text": "Draw a graph for each of the following cases:\n\n(i) For a square, the relationship between the side (in cm) and its perimeter (in cm) is given by:\nSide (in cm): 2, 3, 3.5, 5, 6\nPerimeter (in cm): 8, 12, 14, 20, 24\nIs the graph linear?\n\n(ii) For a square, the relationship between the side (in cm) and its area (in cm²) is given by:\nSide (in cm): 2, 3, 4, 5, 6\nArea (in cm²): 4, 9, 16, 25, 36\nIs the graph linear?",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(i) The graph of side versus perimeter is linear because the perimeter P of a square is given by P = 4 × (side), and the data confirms this linear relationship. \n\n(ii) The graph of side versus area is not linear because the area A of a square is given by A = (side)², which is a quadratic relationship, hence the plotted points lie on a parabolic curve.",
    "explanation": "For part (i): \nStep 1: Plot the points (2,8), (3,12), (3.5,14), (5,20), and (6,24) on a graph with side length on the horizontal axis and perimeter on the vertical axis.\nStep 2: Join the points to form a straight line. This confirms that the relationship is linear as it follows the equation Perimeter = 4 × side.\n\nFor part (ii): \nStep 1: Plot the points (2,4), (3,9), (4,16), (5,25), and (6,36), with side length on the horizontal axis and area on the vertical axis.\nStep 2: Connect the points. The resulting curve is not a straight line but a parabola, indicating that the area increases as the square of the side.\nThus, the first graph is linear and the second is not.",
    "topic": "Graphing, Linear vs Non-linear Relationships, Quadratic Functions",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "hemh113",
    "question_id": "cbse_viii_hemh1dd_c113_ex011"
  },
  {
    "question_text": "In a typical time-temperature graph, what is shown on the vertical (y) axis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Time",
      "Temperature",
      "Distance",
      "Speed"
    ],
    "correct_answer": "Temperature",
    "explanation": "In a time-temperature graph, the y-axis represents the temperature values recorded at different times, while the x-axis shows the time instances. This allows one to see how temperature changes over time.",
    "topic": "Graph Reading - Axes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen001"
  },
  {
    "question_text": "In the line graph that compares the total runs scored by batsmen A and B over 10 matches, what does the horizontal (x) axis represent?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Runs scored in each match",
      "Matches played during the year",
      "Time intervals of the matches",
      "Player performance levels"
    ],
    "correct_answer": "Matches played during the year",
    "explanation": "The horizontal axis in the graph indicates each of the 10 matches played during the year, while the vertical axis shows the runs scored in the respective matches.",
    "topic": "Graph Interpretation - Axes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen002"
  },
  {
    "question_text": "Looking at a car travel line graph, if there is a horizontal line segment over a time period, what does this indicate about the car's movement during that interval?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The car was moving at a constant, high speed",
      "The car was stationary (no movement)",
      "The car was accelerating",
      "The car was decelerating"
    ],
    "correct_answer": "The car was stationary (no movement)",
    "explanation": "A horizontal line segment on a distance-time graph implies that the distance covered remains unchanged over that time period, indicating that the vehicle was not moving (i.e., it was stationary).",
    "topic": "Graph Interpretation - Movement",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen003"
  },
  {
    "question_text": "Define a line graph and describe its typical components.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A line graph is a pictorial representation of data where individual data points are plotted on a coordinate system and connected by line segments. Its typical components include the x-axis (horizontal axis), which usually represents independent variables (such as time), and the y-axis (vertical axis), which represents dependent variables (such as temperature or distance). Additional components include labeled data points, gridlines for precise reading, and sometimes a legend to differentiate between multiple data sets.",
    "explanation": "A line graph helps in visualizing how a particular variable changes over a period or with another variable. By connecting data points with line segments, trends, patterns, or fluctuations become more evident, making comparisons and analyses easier.",
    "topic": "Graph Construction and Components",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen004"
  },
  {
    "question_text": "Explain why a graphical representation of data is often preferred over a tabular form when depicting trends.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Graphs provide a visual overview of information which makes it easier to quickly identify trends, patterns, and comparisons. Unlike tables, graphs can illustrate changes over time, highlight peaks and troughs, and make complex data more accessible.",
    "explanation": "While tables list numerical data in rows and columns, they can be harder to interpret when looking for trends. Graphs leverage visual elements such as colors, shapes, and lines to immediately draw attention to variations and relationships in the data. This visual appeal and clarity enable more effective and rapid understanding.",
    "topic": "Data Representation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen005"
  },
  {
    "question_text": "In the time-temperature graph where temperature was recorded at 6 a.m., 10 a.m., 2 p.m., and 6 p.m., explain how you can infer that the temperature at 8 a.m. must have been more than 37°C, even though it was not directly recorded.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Since the temperature recorded at 6 a.m. was 37°C and it increased to 40°C at 10 a.m., the graph (or trend line) connecting these two points must pass through a value greater than 37°C at any time between these two measurements, including 8 a.m. This indicates that the temperature at 8 a.m. was higher than 37°C.",
    "explanation": "Graphs show trends by connecting data points linearly (or by curve fitting), implying a continuous change in the measured variable. Therefore, if there is a rise in temperature from 37°C to 40°C over a period, any intermediate time such as 8 a.m. would reflect a temperature between these values, and since the trend is upward, it must be above 37°C.",
    "topic": "Graph Analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen006"
  },
  {
    "question_text": "Based on the line graph of batsmen A and B's performance over 10 matches, analyze their consistency and performance trends. Consider their peaks, valleys, and any match where their scores were equal.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The analysis shows that batsman A exhibited high variability with significant peaks (e.g., high scoring matches) and deep valleys (very low scores, including zeros), indicating inconsistency in performance. In contrast, batsman B’s performance remained more uniform, as his scores never fell below a certain threshold. The intersection in the fourth match, where both scored 60 runs, suggests a moment of similar performance; however, the overall trend indicates that B was steadier, making him a more reliable performer despite a slightly lower maximum score.",
    "explanation": "Analyze the graph by observing that batsman A had dramatic fluctuations – high peaks and low troughs – which imply inconsistency despite occasional high scores. Batsman B, while having a lower maximum, maintained scores within a tighter range without significant dips, making his performance more predictable and consistent. The point of intersection (4th match) where both scored equally supports the comparative analysis.",
    "topic": "Graph Analysis - Trend Comparison",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen007"
  },
  {
    "question_text": "Examine the line graph that illustrates a car's journey from City P to City Q. Provide a comprehensive analysis of the car's speed variability throughout the journey, using the distances covered in consecutive hours and any periods of stoppage as evidence.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The graph shows varying slopes during different time intervals. A steeper slope indicates a higher speed, while a gentler slope indicates slower travel. For example, if between 8 a.m. and 9 a.m. the car travels 50 km and then 100 km between 9 a.m. and 10 a.m., the car's speed increased in the second hour. A horizontal segment (where the distance doesn't change) indicates that the car stopped; for example, if there is no increase in distance from 11 a.m. to 12 p.m., this implies the car was stationary. By calculating the differences in distance over time, one can determine the periods of acceleration, constant speed, and stoppages, hence analyzing the overall speed variability during the journey.",
    "explanation": "The answer involves a step-by-step comparison of the distance traveled in each time interval. A change in the slope of the graph indicates a change in speed. A constant slope shows uniform speed, while a steeper slope means acceleration. A flat (horizontal) segment confirms that the car did not move during that period. This analysis helps in understanding how the speed varied and when the car was stationary.",
    "topic": "Graph Analysis - Speed Variability",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen008"
  },
  {
    "question_text": "A time-temperature graph shows the following data: 7 a.m. – 36°C, 11 a.m. – 39°C, 3 p.m. – 38°C, and 7 p.m. – 34°C. Calculate (a) the temperature change between 7 a.m. and 11 a.m., and (b) the temperature change between 3 p.m. and 7 p.m.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(a) Increase of 3°C (39°C – 36°C = 3°C); (b) Decrease of 4°C (38°C – 34°C = 4°C)",
    "explanation": "Step 1: For 7 a.m. to 11 a.m., subtract the temperature at 7 a.m. (36°C) from the temperature at 11 a.m. (39°C), which gives 3°C. Step 2: For 3 p.m. to 7 p.m., subtract 34°C from 38°C, yielding 4°C. The positive value in the first calculation indicates an increase, while the positive difference in the second step shows a decrease when interpreted appropriately.",
    "topic": "Numerical Analysis - Temperature Change",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen009"
  },
  {
    "question_text": "A car travels from City P to City Q, which are 400 km apart. The distance from City P is recorded as follows: 8 a.m. – 0 km; 9 a.m. – 60 km; 10 a.m. – 140 km; 11 a.m. – 180 km; 12 p.m. – 180 km; 1 p.m. – 250 km; 2 p.m. – 400 km. Determine the distance covered during each consecutive hour and identify any period when the car stopped.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "From 8 to 9 a.m.: 60 km; 9 to 10 a.m.: 80 km (140 - 60); 10 to 11 a.m.: 40 km (180 - 140); 11 a.m. to 12 p.m.: 0 km (180 - 180); 12 p.m. to 1 p.m.: 70 km (250 - 180); 1 p.m. to 2 p.m.: 150 km (400 - 250). The car was stopped between 11 a.m. and 12 p.m. as there was no change in distance.",
    "explanation": "Subtract the distance at the beginning of an hour from the distance at the end of that hour to find the distance traveled in that hour. Noticing that the distance remains the same (180 km) from 11 a.m. to 12 p.m. indicates that the car did not move during that time.",
    "topic": "Numerical Analysis - Distance-Time Graph",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen010"
  },
  {
    "question_text": "For a player whose performance over 12 matches can be modeled as follows: his score increases steadily by 5 runs per match until the 6th match, where he scores 50 runs; thereafter, his score decreases by 10 runs per match. Determine his score in the 10th match.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Let the score in the 1st match be x. By the 6th match, x + 5×(6–1) = x + 25 should equal 50. Thus, x = 25. After the 6th match, the score decreases by 10 runs per match. So, scores in matches 7 to 10 are: 7th: 40, 8th: 30, 9th: 20, 10th: 10. Therefore, the score in the 10th match is 10 runs.",
    "explanation": "Step 1: Since the score increases by 5 each match, the score in the 6th match is given by x + 5×5 = x + 25, which is 50. This gives x = 25. Step 2: After the 6th match, subtract 10 runs for each subsequent match. Calculating consecutively leads to the score of 10 in the 10th match.",
    "topic": "Numerical Analysis - Sequences and Graph Modeling",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen011"
  },
  {
    "question_text": "Consider a graph representing temperatures recorded every 3 hours in a day with the values: 6 a.m. – 32°F, 9 a.m. – 35°F, 12 p.m. – 40°F, 3 p.m. – 42°F, 6 p.m. – 38°F, 9 p.m. – 36°F. Identify the time when the maximum temperature occurred and calculate the time difference (in hours) between the occurrence of the maximum and the minimum temperature.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The maximum temperature of 42°F occurred at 3 p.m., and the minimum temperature of 32°F occurred at 6 a.m. The time difference between 6 a.m. and 3 p.m. is 9 hours.",
    "explanation": "By inspecting the recorded temperatures, the highest temperature is 42°F at 3 p.m. and the lowest is 32°F at 6 a.m. Subtracting the times (3 p.m. is 15:00 hours and 6 a.m. is 6:00 hours) gives a difference of 9 hours.",
    "topic": "Numerical Analysis - Temperature Graphs",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen012"
  }
]