[
  {
    "question_text": "In a typical time-temperature graph, what is shown on the vertical (y) axis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Time",
      "Temperature",
      "Distance",
      "Speed"
    ],
    "correct_answer": "Temperature",
    "explanation": "In a time-temperature graph, the y-axis represents the temperature values recorded at different times, while the x-axis shows the time instances. This allows one to see how temperature changes over time.",
    "topic": "Graph Reading - Axes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen001"
  },
  {
    "question_text": "In the line graph that compares the total runs scored by batsmen A and B over 10 matches, what does the horizontal (x) axis represent?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Runs scored in each match",
      "Matches played during the year",
      "Time intervals of the matches",
      "Player performance levels"
    ],
    "correct_answer": "Matches played during the year",
    "explanation": "The horizontal axis in the graph indicates each of the 10 matches played during the year, while the vertical axis shows the runs scored in the respective matches.",
    "topic": "Graph Interpretation - Axes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen002"
  },
  {
    "question_text": "Looking at a car travel line graph, if there is a horizontal line segment over a time period, what does this indicate about the car's movement during that interval?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The car was moving at a constant, high speed",
      "The car was stationary (no movement)",
      "The car was accelerating",
      "The car was decelerating"
    ],
    "correct_answer": "The car was stationary (no movement)",
    "explanation": "A horizontal line segment on a distance-time graph implies that the distance covered remains unchanged over that time period, indicating that the vehicle was not moving (i.e., it was stationary).",
    "topic": "Graph Interpretation - Movement",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen003"
  },
  {
    "question_text": "Define a line graph and describe its typical components.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A line graph is a pictorial representation of data where individual data points are plotted on a coordinate system and connected by line segments. Its typical components include the x-axis (horizontal axis), which usually represents independent variables (such as time), and the y-axis (vertical axis), which represents dependent variables (such as temperature or distance). Additional components include labeled data points, gridlines for precise reading, and sometimes a legend to differentiate between multiple data sets.",
    "explanation": "A line graph helps in visualizing how a particular variable changes over a period or with another variable. By connecting data points with line segments, trends, patterns, or fluctuations become more evident, making comparisons and analyses easier.",
    "topic": "Graph Construction and Components",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen004"
  },
  {
    "question_text": "Explain why a graphical representation of data is often preferred over a tabular form when depicting trends.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Graphs provide a visual overview of information which makes it easier to quickly identify trends, patterns, and comparisons. Unlike tables, graphs can illustrate changes over time, highlight peaks and troughs, and make complex data more accessible.",
    "explanation": "While tables list numerical data in rows and columns, they can be harder to interpret when looking for trends. Graphs leverage visual elements such as colors, shapes, and lines to immediately draw attention to variations and relationships in the data. This visual appeal and clarity enable more effective and rapid understanding.",
    "topic": "Data Representation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen005"
  },
  {
    "question_text": "In the time-temperature graph where temperature was recorded at 6 a.m., 10 a.m., 2 p.m., and 6 p.m., explain how you can infer that the temperature at 8 a.m. must have been more than 37°C, even though it was not directly recorded.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Since the temperature recorded at 6 a.m. was 37°C and it increased to 40°C at 10 a.m., the graph (or trend line) connecting these two points must pass through a value greater than 37°C at any time between these two measurements, including 8 a.m. This indicates that the temperature at 8 a.m. was higher than 37°C.",
    "explanation": "Graphs show trends by connecting data points linearly (or by curve fitting), implying a continuous change in the measured variable. Therefore, if there is a rise in temperature from 37°C to 40°C over a period, any intermediate time such as 8 a.m. would reflect a temperature between these values, and since the trend is upward, it must be above 37°C.",
    "topic": "Graph Analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen006"
  },
  {
    "question_text": "Based on the line graph of batsmen A and B's performance over 10 matches, analyze their consistency and performance trends. Consider their peaks, valleys, and any match where their scores were equal.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The analysis shows that batsman A exhibited high variability with significant peaks (e.g., high scoring matches) and deep valleys (very low scores, including zeros), indicating inconsistency in performance. In contrast, batsman B’s performance remained more uniform, as his scores never fell below a certain threshold. The intersection in the fourth match, where both scored 60 runs, suggests a moment of similar performance; however, the overall trend indicates that B was steadier, making him a more reliable performer despite a slightly lower maximum score.",
    "explanation": "Analyze the graph by observing that batsman A had dramatic fluctuations – high peaks and low troughs – which imply inconsistency despite occasional high scores. Batsman B, while having a lower maximum, maintained scores within a tighter range without significant dips, making his performance more predictable and consistent. The point of intersection (4th match) where both scored equally supports the comparative analysis.",
    "topic": "Graph Analysis - Trend Comparison",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen007"
  },
  {
    "question_text": "Examine the line graph that illustrates a car's journey from City P to City Q. Provide a comprehensive analysis of the car's speed variability throughout the journey, using the distances covered in consecutive hours and any periods of stoppage as evidence.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The graph shows varying slopes during different time intervals. A steeper slope indicates a higher speed, while a gentler slope indicates slower travel. For example, if between 8 a.m. and 9 a.m. the car travels 50 km and then 100 km between 9 a.m. and 10 a.m., the car's speed increased in the second hour. A horizontal segment (where the distance doesn't change) indicates that the car stopped; for example, if there is no increase in distance from 11 a.m. to 12 p.m., this implies the car was stationary. By calculating the differences in distance over time, one can determine the periods of acceleration, constant speed, and stoppages, hence analyzing the overall speed variability during the journey.",
    "explanation": "The answer involves a step-by-step comparison of the distance traveled in each time interval. A change in the slope of the graph indicates a change in speed. A constant slope shows uniform speed, while a steeper slope means acceleration. A flat (horizontal) segment confirms that the car did not move during that period. This analysis helps in understanding how the speed varied and when the car was stationary.",
    "topic": "Graph Analysis - Speed Variability",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen008"
  },
  {
    "question_text": "A time-temperature graph shows the following data: 7 a.m. – 36°C, 11 a.m. – 39°C, 3 p.m. – 38°C, and 7 p.m. – 34°C. Calculate (a) the temperature change between 7 a.m. and 11 a.m., and (b) the temperature change between 3 p.m. and 7 p.m.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(a) Increase of 3°C (39°C – 36°C = 3°C); (b) Decrease of 4°C (38°C – 34°C = 4°C)",
    "explanation": "Step 1: For 7 a.m. to 11 a.m., subtract the temperature at 7 a.m. (36°C) from the temperature at 11 a.m. (39°C), which gives 3°C. Step 2: For 3 p.m. to 7 p.m., subtract 34°C from 38°C, yielding 4°C. The positive value in the first calculation indicates an increase, while the positive difference in the second step shows a decrease when interpreted appropriately.",
    "topic": "Numerical Analysis - Temperature Change",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen009"
  },
  {
    "question_text": "A car travels from City P to City Q, which are 400 km apart. The distance from City P is recorded as follows: 8 a.m. – 0 km; 9 a.m. – 60 km; 10 a.m. – 140 km; 11 a.m. – 180 km; 12 p.m. – 180 km; 1 p.m. – 250 km; 2 p.m. – 400 km. Determine the distance covered during each consecutive hour and identify any period when the car stopped.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "From 8 to 9 a.m.: 60 km; 9 to 10 a.m.: 80 km (140 - 60); 10 to 11 a.m.: 40 km (180 - 140); 11 a.m. to 12 p.m.: 0 km (180 - 180); 12 p.m. to 1 p.m.: 70 km (250 - 180); 1 p.m. to 2 p.m.: 150 km (400 - 250). The car was stopped between 11 a.m. and 12 p.m. as there was no change in distance.",
    "explanation": "Subtract the distance at the beginning of an hour from the distance at the end of that hour to find the distance traveled in that hour. Noticing that the distance remains the same (180 km) from 11 a.m. to 12 p.m. indicates that the car did not move during that time.",
    "topic": "Numerical Analysis - Distance-Time Graph",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen010"
  },
  {
    "question_text": "For a player whose performance over 12 matches can be modeled as follows: his score increases steadily by 5 runs per match until the 6th match, where he scores 50 runs; thereafter, his score decreases by 10 runs per match. Determine his score in the 10th match.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Let the score in the 1st match be x. By the 6th match, x + 5×(6–1) = x + 25 should equal 50. Thus, x = 25. After the 6th match, the score decreases by 10 runs per match. So, scores in matches 7 to 10 are: 7th: 40, 8th: 30, 9th: 20, 10th: 10. Therefore, the score in the 10th match is 10 runs.",
    "explanation": "Step 1: Since the score increases by 5 each match, the score in the 6th match is given by x + 5×5 = x + 25, which is 50. This gives x = 25. Step 2: After the 6th match, subtract 10 runs for each subsequent match. Calculating consecutively leads to the score of 10 in the 10th match.",
    "topic": "Numerical Analysis - Sequences and Graph Modeling",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen011"
  },
  {
    "question_text": "Consider a graph representing temperatures recorded every 3 hours in a day with the values: 6 a.m. – 32°F, 9 a.m. – 35°F, 12 p.m. – 40°F, 3 p.m. – 42°F, 6 p.m. – 38°F, 9 p.m. – 36°F. Identify the time when the maximum temperature occurred and calculate the time difference (in hours) between the occurrence of the maximum and the minimum temperature.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The maximum temperature of 42°F occurred at 3 p.m., and the minimum temperature of 32°F occurred at 6 a.m. The time difference between 6 a.m. and 3 p.m. is 9 hours.",
    "explanation": "By inspecting the recorded temperatures, the highest temperature is 42°F at 3 p.m. and the lowest is 32°F at 6 a.m. Subtracting the times (3 p.m. is 15:00 hours and 6 a.m. is 6:00 hours) gives a difference of 9 hours.",
    "topic": "Numerical Analysis - Temperature Graphs",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh113",
    "section_id": "01_section_13_1",
    "question_id": "cbse_viii_hemh1dd_c113_gen012"
  }
]