[
  {
    "question_text": "Find the square root of each of the following numbers by Division method: 2304, 4489, 3481, 529, 3249, 1369, 5776, 7921, 576, 1024, 3136, 900.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "√2304 = 48, √4489 = 67, √3481 = 59, √529 = 23, √3249 = 57, √1369 = 37, √5776 = 76, √7921 = 89, √576 = 24, √1024 = 32, √3136 = 56, √900 = 30.",
    "explanation": "For each number, the division method (or longhand square root extraction) is used. For example, for 2304, group the digits in pairs starting from the right. Identify the greatest digit whose square is less than or equal to the first group, subtract its square, bring down the next pair, double the current quotient, and determine the next quotient digit that brings the product closest to the new dividend. Repeating the process gives the square root. The results for the numbers are determined either by this method or by recognizing standard perfect squares.",
    "topic": "Square Roots by Division Method",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex030"
  },
  {
    "question_text": "Find the number of digits in the square root of each of the following numbers (without any calculation): 64, 144, 4489, 27225, 390625.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For 64, √64 is 8 (1 digit); for 144, √144 is 12 (2 digits); for 4489, √4489 is 67 (2 digits); for 27225, √27225 is 165 (3 digits); for 390625, √390625 is 625 (3 digits).",
    "explanation": "To determine the number of digits in the square root without an explicit calculation, we note that pairing the digits from the right in the original number corresponds to each digit of the square root. A two-digit number has one pair, a three or four-digit number has two pairs, and so on. By knowing the range of squares (e.g., 8^2 = 64; 12^2 = 144; 67^2 = 4489; etc.), we confirm the number of digits in each square root.",
    "topic": "Properties of Perfect Squares",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex031"
  },
  {
    "question_text": "Find the square root of the following decimal numbers: 2.56, 7.29, 51.84, 42.25, 31.36.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "√2.56 = 1.6, √7.29 = 2.7, √51.84 = 7.2, √42.25 = 6.5, √31.36 = 5.6.",
    "explanation": "For each decimal number, the square root is determined using the method of pairing digits on either side of the decimal point. For example, 2.56 is divided into groups of ‘2’ and ‘56’. Recognizing that 1.6² = 2.56 (and similarly for the rest) gives the square roots directly.",
    "topic": "Square Roots of Decimals",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex032"
  },
  {
    "question_text": "Find the least number which must be subtracted from each of the following numbers so as to get a perfect square. Also, find the square root of the perfect square so obtained: 402, 1989, 3250, 825, 4000.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For 402: subtract 2 to get 400, whose square root is 20. For 1989: subtract 53 to get 1936, whose square root is 44. For 3250: subtract 1 to get 3249, whose square root is 57. For 825: subtract 41 to get 784, whose square root is 28. For 4000: subtract 31 to get 3969, whose square root is 63.",
    "explanation": "For each number, determine the largest perfect square less than the given number. Subtract the perfect square from the given number to get the number to be subtracted. For instance, in 402, 20² = 400 is the greatest perfect square less than 402; therefore, 402 − 400 = 2 must be subtracted. The square root is then easily determined.",
    "topic": "Perfect Squares and Square Roots",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex033"
  },
  {
    "question_text": "Find the least number which must be added to each of the following numbers so as to get a perfect square. Also, find the square root of the perfect square so obtained: 525, 1750, 252, 1825, 6412.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For 525: add 4 to get 529, whose square root is 23. For 1750: add 14 to get 1764, whose square root is 42. For 252: add 4 to get 256, whose square root is 16. For 1825: add 24 to get 1849, whose square root is 43. For 6412: add 149 to get 6561, whose square root is 81.",
    "explanation": "For each provided number, first identify the smallest perfect square greater than the number. Then, calculate the difference between this perfect square and the given number to determine the number to be added. For example, for 525, since 23² = 529 and 23² is the next perfect square after 525, the number to add is 529 − 525 = 4.",
    "topic": "Perfect Squares and Square Roots",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex034"
  },
  {
    "question_text": "Find the length of the side of a square whose area is 441 m².",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The side of the square is √441 = 21 m.",
    "explanation": "The area of a square is given by side². Setting side² = 441 and taking the square root of both sides gives side = √441 = 21 m.",
    "topic": "Geometry – Area and Square Roots",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex035"
  },
  {
    "question_text": "In a right triangle ABC with ∠B = 90°: (a) If AB = 6 cm and BC = 8 cm, find AC. (b) If AC = 13 cm and BC = 5 cm, find AB.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "For (a): Using the Pythagorean theorem, AC = √(6² + 8²) = √(36 + 64) = √100 = 10 cm. For (b): Here, AC is the hypotenuse. Therefore, AB = √(AC² - BC²) = √(13² - 5²) = √(169 - 25) = √144 = 12 cm.",
    "explanation": "In any right triangle, the Pythagorean theorem applies (a² + b² = c²) where c is the hypotenuse. For part (a), sides AB and BC are the legs; hence AC is obtained by taking the square root of (6² + 8²). For part (b), with AC as the hypotenuse and one leg BC known, AB is found by rearranging the theorem to AB = √(AC² − BC²).",
    "topic": "Pythagorean Theorem",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex036"
  },
  {
    "question_text": "A gardener has 1000 plants and wants to arrange them in equal number of rows and columns. Find the minimum number of plants that must be added to achieve this arrangement.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The next perfect square after 1000 is 32² = 1024. Therefore, the number of plants to be added is 1024 − 1000 = 24.",
    "explanation": "To arrange the plants in a square formation, the total number must be a perfect square. Since 1000 is not a perfect square, we look for the smallest perfect square greater than 1000. As 31² = 961 is less than 1000 and 32² = 1024 is greater, the gardener needs 1024 − 1000 = 24 additional plants.",
    "topic": "Perfect Squares",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex037"
  },
  {
    "question_text": "There are 500 children in a school. For a P.T. drill, they have to stand in such a manner that the number of rows is equal to the number of columns. How many children would be left out under this arrangement?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The largest perfect square not exceeding 500 is 22² = 484. Therefore, the number of children left out is 500 − 484 = 16.",
    "explanation": "For a square arrangement, the total number of children used must be a perfect square. Since 22² = 484 is the largest perfect square less than or equal to 500, 500 − 484 = 16 children cannot be accommodated in the square arrangement and are left out.",
    "topic": "Perfect Squares and Arrangements",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "hemh105",
    "question_id": "cbse_viii_hemh1dd_c105_ex038"
  }
]