[
  {
    "question_text": "In the pictograph representing car production, one full car symbol stands for 100 cars and one half car symbol stands for 50 cars. If the pictograph for July shows 2 full car symbols and 1 half car symbol, what is the total number of cars produced in July?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "200",
      "250",
      "300",
      "350"
    ],
    "correct_answer": "250",
    "explanation": "Each full car symbol represents 100 cars. Thus, 2 full symbols equal 2 × 100 = 200 cars. One half symbol represents 50 cars. So, total = 200 + 50 = 250 cars.",
    "topic": "Pictograph interpretation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen001"
  },
  {
    "question_text": "A bar graph shows the number of students in Class VIII for the academic years 2003-04 to 2007-08 with the following heights: 100, 200, 250, 300, and 350 respectively. In which academic year does the graph indicate the maximum number of students?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "2003-04",
      "2004-05",
      "2005-06",
      "2007-08"
    ],
    "correct_answer": "2007-08",
    "explanation": "The bar corresponding to 2007-08 has the maximum height indicating 350 students, which is the highest among all the values.",
    "topic": "Bar graph interpretation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen002"
  },
  {
    "question_text": "In a double bar graph comparing marks obtained in different subjects over two academic years (2005-06 and 2006-07), one subject shows a significant improvement in marks from one year to the next. Which subject is most likely to have shown this improvement if the data indicates Maths marks increased the most?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Maths",
      "Science",
      "English",
      "Hindi"
    ],
    "correct_answer": "Maths",
    "explanation": "The double bar graph clarifies that among the subjects compared, Maths had the largest increase in marks, hence implying the maximum improvement.",
    "topic": "Double bar graph comparison",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen003"
  },
  {
    "question_text": "Define data in the context of a classroom scenario and explain its importance in statistical representation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Data refers to the recorded values or measurements related to a particular situation. In a classroom scenario, data could be the marks scored by students in a test or their heights. Its importance lies in organizing, analyzing, and interpreting these observations to make informed decisions like calculating averages or assessing performance.",
    "explanation": "Data is the collection of numerical or categorical measurements that represent aspects of a situation. In educational settings, accurate and effectively represented data help in tracking student performance, identifying trends, and planning further instructional strategies.",
    "topic": "Introduction to Data",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen004"
  },
  {
    "question_text": "Explain the difference between a pictograph and a bar graph in data representation.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A pictograph represents data using symbols or pictures where each symbol corresponds to a certain number of units, while a bar graph represents data using rectangular bars whose lengths or heights are proportional to the values they represent.",
    "explanation": "The pictograph uses images to represent data values which makes it visually appealing and easier for basic comparisons. A bar graph, on the other hand, uses uniform bars that clearly present quantitative differences; the height of each bar directly corresponds to its numerical value, making it better for precise data comparison.",
    "topic": "Graphical representation of data",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen005"
  },
  {
    "question_text": "Discuss how the order or position of the bars in a bar graph affects (or does not affect) the information being conveyed. Provide reasons for your answer.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The position or order of the bars does not affect the information being conveyed because the key information is given by the height of each bar which represents the numerical value. Rearranging the bars might change the visual order, but the data itself remains unchanged.",
    "explanation": "In a bar graph, the numerical values are represented by the heights or lengths of the bars. Even if the bars are rearranged, the comparative sizes, which are the true carriers of information, remain the same. However, logical ordering (like chronological) can help better understand trends.",
    "topic": "Bar graph interpretation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen006"
  },
  {
    "question_text": "Examine a scenario: A teacher collects the heights of all students in her class and represents them using a bar graph. Detail the step-by-step process documenting how the teacher should collect, organize, and graphically represent this data.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Step 1: Collect the data by measuring the height of every student accurately. Step 2: Organize the data in a tabular form, possibly in increasing order or grouped by intervals. Step 3: Choose the appropriate type of graph (here, a bar graph) to represent the data. Step 4: Draw the X-axis to represent height intervals and Y-axis to represent the frequency (number of students) in each interval. Step 5: Plot and draw bars corresponding to each interval based on the frequency. Step 6: Label the graph appropriately and provide a title.",
    "explanation": "The teacher should first gather all individual height measurements. Then, by organizing these measurements into intervals or groups, it becomes easier to see the distribution of heights. Next, a bar graph is constructed where the x-axis represents height intervals and the y-axis the frequency. Drawing accurate bars helps in providing a clear interpretation of the data. This process includes recording, categorizing, graphical representation, and interpretation.",
    "topic": "Data collection and graphical representation",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen007"
  },
  {
    "question_text": "Using a double bar graph, discuss how one can compare marks obtained by a student in different subjects over two different academic years. Illustrate your answer with an example that includes at least three subjects.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In a double bar graph, two bars for each subject are plotted side by side to represent the marks for each academic year. For example, if a student scored in Maths, Science, and English over two years, the graph can show each subject on the x-axis. Two bars for Maths would represent the two years, and similarly for Science and English. By comparing the heights of the bars for each subject, one can easily observe in which subject there was an improvement, decline, or no change in the performance.",
    "explanation": "The double bar graph is designed to compare two sets of data simultaneously. In our example, plotting the subjects on the x-axis and the marks on the y-axis, two bars (each for a different academic year) are drawn for each subject. The difference in the height of each bar juxtaposed side by side allows for an immediate visual comparison of performance trends. Such a graph highlights improvements if the bar for the later year is taller and declines if it is shorter.",
    "topic": "Double bar graph analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen008"
  },
  {
    "question_text": "Construct a bar graph to represent the following data: Number of watches sold per month – July: 1000, August: 1500, September: 1500, October: 2000, November: 2500, December: 1500. Describe the steps required to create the graph.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Step 1: Draw two perpendicular axes. Label the horizontal axis with the months (July to December) and the vertical axis with a suitable range covering from 0 to at least 2500. Step 2: Mark the appropriate scales on the vertical axis (e.g., in steps of 500). Step 3: For each month, draw a bar whose height corresponds to the number of watches sold (e.g., for July, a bar reaching up to 1000; for November, up to 2500). Step 4: Title the graph and label axes appropriately.",
    "explanation": "Begin by drawing the x-axis (months) and y-axis (number of watches sold). Choose an appropriate scale for the vertical axis so that all values can be plotted accurately. Draw a bar for each month based on its sales figure. Finally, add a title and label both axes, ensuring the graph is clear and easy to understand.",
    "topic": "Bar graph construction",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen009"
  },
  {
    "question_text": "You are given the following data: Number of children who prefer walking and cycling at three schools – School A: Walking-40, Cycling-45; School B: Walking-55, Cycling-25; School C: Walking-15, Cycling-35. Construct a double bar graph to represent this data. Explain how the double bar graph helps in comparing the two modes of transport across schools.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Step 1: Draw the x-axis with three categories representing School A, School B, and School C. Step 2: Draw the y-axis with a scale that covers the maximum number from the data (e.g., up to 60). Step 3: For each school, draw two bars side by side: one for walking, one for cycling. For School A, draw bars of heights 40 (walking) and 45 (cycling); for School B, 55 and 25; for School C, 15 and 35. Step 4: Use different colors or patterns to distinguish between walking and cycling. Step 5: Add a legend, title, and axis labels. This graph visually compares the preferences of children in each school.",
    "explanation": "The double bar graph allows you to plot two data sets (walking and cycling) next to one another for each school. This side-by-side comparison makes it easy to see which mode of transport is preferred in each school and how the preferences differ from school to school. The visual clarity helps in quickly drawing comparisons.",
    "topic": "Double bar graph construction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen010"
  },
  {
    "question_text": "Given a pictograph where one full car symbol represents 100 cars and a half car symbol denotes 50 cars, if you are required to represent 400 cars entirely using full and half symbols, what is the minimum number of symbols required and how would you arrange them?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "To represent 400 cars, one can use 3 full symbols and 2 half symbols. Calculation: 3 full symbols = 3×100 = 300 cars, and 2 half symbols = 2×50 = 100 cars. Total = 300 + 100 = 400 cars. Thus, minimum symbols required = 3 + 2 = 5 symbols.",
    "explanation": "Start with the maximum full symbols without exceeding 400. Three full symbols give 300. The remaining 100 is exactly provided by 2 half symbols (since each is equivalent to 50). Therefore, using 3 full symbols and 2 half symbols accurately represents 400 cars using 5 symbols in total.",
    "topic": "Pictograph interpretation and calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen011"
  },
  {
    "question_text": "Examine the following data for cricket teams: South Africa (75% to 78%), Australia (61% to 40%), Sri Lanka (54% to 38%), New Zealand (47% to 50%), England (46% to 50%), Pakistan (45% to 44%), West Indies (44% to 30%), India (43% to 56%). Construct a double bar graph to represent the percentages for two different series (‘Champions Trophy to World Cup-06’ and ‘Last 10 ODI in 07’). Explain how you determine which team showed the most improvement and which showed a decline.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Step 1: Label the x-axis with the names of the teams and the y-axis with percentage values (ensure the scale covers at least 0% to 100%). Step 2: For each team, draw two adjacent bars: one for the first series and one for the second series using different colors/patterns. Step 3: Once the graph is drawn, compare the heights of the paired bars for each team. For instance, India’s bar increases from 43% to 56%, indicating improvement, while Australia’s bar drops from 61% to 40%, indicating a decline.",
    "explanation": "A double bar graph allows side-by-side visual comparison of the two series for each team. Look for increases by comparing the height difference of the two bars for a team. The greatest positive difference indicates the most improvement (for example, India), while the largest negative difference indicates a decline (for example, Australia). The graph thus helps in quickly identifying performance trends.",
    "topic": "Double bar graph analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "hemh104",
    "section_id": "01_section_4_1",
    "question_id": "cbse_viii_hemh1dd_c104_gen012"
  }
]