[
  {
    "question_text": "Which type of wave does not require a medium for its propagation?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Mechanical waves",
      "Sound waves",
      "Electromagnetic waves",
      "Matter waves"
    ],
    "correct_answer": "Electromagnetic waves",
    "explanation": "Electromagnetic waves, unlike mechanical waves, do not rely on a material medium and can travel through a vacuum.",
    "topic": "Types of waves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen001"
  },
  {
    "question_text": "In sound wave propagation, change in which quantity is analogous to the extension or compression of a spring?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Temperature",
      "Density",
      "Amplitude",
      "Velocity"
    ],
    "correct_answer": "Density",
    "explanation": "In sound wave propagation, regions of compression and rarefaction correspond to changes in the density of the medium, similar to the extension or compression seen in springs.",
    "topic": "Sound waves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen002"
  },
  {
    "question_text": "Which historical figure among the following was known for early scientific analysis of wave motion?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Galileo Galilei",
      "Christiaan Huygens",
      "Albert Einstein",
      "James Clerk Maxwell"
    ],
    "correct_answer": "Christiaan Huygens",
    "explanation": "Christiaan Huygens, along with others such as Robert Hooke and Isaac Newton, was a pioneer in the scientific analysis of wave motion.",
    "topic": "History of wave study",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen003"
  },
  {
    "question_text": "Which statement best illustrates the concept that a wave transports energy without the bulk movement of matter?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Water in a stream flows downstream carrying energy with it",
      "Cork pieces on a disturbed pond move only up and down despite circular wave propagation",
      "Wind carries dust particles over long distances",
      "Sound waves cause air to permanently shift from one region to another"
    ],
    "correct_answer": "Cork pieces on a disturbed pond move only up and down despite circular wave propagation",
    "explanation": "The observation that cork pieces merely oscillate up and down while the wave disturbance moves outward demonstrates that energy is transported, not the matter itself.",
    "topic": "Wave propagation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen004"
  },
  {
    "question_text": "What is the moving pattern created by disturbances that propagates energy in the medium called?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A flow",
      "A current",
      "A wave",
      "A disturbance"
    ],
    "correct_answer": "A wave",
    "explanation": "A wave is defined as a moving pattern or disturbance that propagates energy from one point to another without a bulk transfer of matter.",
    "topic": "Introduction to waves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen005"
  },
  {
    "question_text": "Define a mechanical wave and give one example from everyday life.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A mechanical wave is a disturbance that propagates through a material medium by oscillating its particles, such as sound waves in air or waves on a string.",
    "explanation": "Mechanical waves require a material medium for propagation. Examples include waves on a string, water waves, or sound waves in air.",
    "topic": "Types of waves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen006"
  },
  {
    "question_text": "Explain the mechanism of wave propagation in a system of connected springs when one end is disturbed.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When one spring is disturbed, it oscillates and transfers part of its energy to the next spring through the elastic force binding them. This process continues sequentially, creating a travelling wave that propagates the disturbance along the chain.",
    "explanation": "The principle of superposition and elastic forces in the springs ensure that the localized disturbance leads to small oscillations in neighboring springs, resulting in a propagating wave without the entire chain moving in the direction of the impulse.",
    "topic": "Wave propagation in springs",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen007"
  },
  {
    "question_text": "Why do sound waves require a medium to propagate? Illustrate using the concept of restoring forces.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sound waves require a medium because they consist of compressions and rarefactions of the medium's particles. The restoring force created by the change in density allows the disturbance to propagate.",
    "explanation": "Without a medium, there are no particles to oscillate or create restoring forces. In air, compressed regions push against their neighbors, creating alternating zones of high and low pressure, thereby transmitting the sound.",
    "topic": "Sound waves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen008"
  },
  {
    "question_text": "Describe how the propagation of ripples in a pond, when a pebble is dropped, exemplifies the concept of wave motion.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "When a pebble is dropped, it causes a localized disturbance that generates ripples. These ripples represent a propagating wave pattern where energy is transferred outward without a net mass movement.",
    "explanation": "The pebbles cause an instantaneous disturbance leading to circular wave patterns. The water particles oscillate around their equilibrium positions as the wave propagates, clearly illustrating wave dynamics.",
    "topic": "Introduction to waves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen009"
  },
  {
    "question_text": "Discuss in detail the process of wave propagation in a system of coupled springs and relate it to the propagation of sound in air.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "When one spring in a series is displaced from equilibrium, it exerts a force on its neighboring spring due to the elastic linking between them, initiating a small oscillation. This oscillation then propagates along the chain, similar to how compression and rarefaction propagate in air when a sound wave is generated. In air, when a region is compressed, the increased density creates a restoring force that pushes the particles outward, leading to adjacent regions experiencing expansion (rarefaction). This continuous process results in the movement of a pressure wave that carries energy without the net movement of air.",
    "explanation": "The process relies on the elasticity of the medium. In both systems, energy is transmitted via local interactions—spring forces in the case of a coupled spring system, and pressure forces in the case of air. This example illustrates the similar underlying physics of harmonic motion and wave propagation in different media.",
    "topic": "Wave propagation in elastic media",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen010"
  },
  {
    "question_text": "Compare and contrast mechanical, electromagnetic, and matter waves in terms of their need for a medium and their roles in modern technology.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Mechanical waves require a medium for propagation, such as air for sound or water for ocean waves. Electromagnetic waves do not require a medium and can travel through a vacuum; they are essential for communication technologies, including radios, microwaves, and optical fibers. Matter waves, which arise from quantum mechanics, describe the wave-like behavior of particles such as electrons and are crucial in technologies like electron microscopes. While mechanical and electromagnetic waves follow classical laws of oscillations and energy transfer, matter waves involve probability amplitudes and are described by quantum theory.",
    "explanation": "This comparison highlights the differences in propagation mechanisms: mechanical waves depend on material interactions, electromagnetic waves are independent of a medium, and matter waves represent a dual particle-wave nature inherent in quantum systems. Their applications are equally diverse, reflecting the breadth of wave phenomena in both classical and modern physics.",
    "topic": "Types of waves and applications",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen011"
  },
  {
    "question_text": "In a string fixed at one end, particles oscillate perpendicular to the direction of the wave. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In a transverse wave, such as that on a string, the particles oscillate perpendicular to the direction of wave propagation. However, the fixed end does not affect the fundamental oscillation direction; the statement is misleading if it implies that particles at a fixed point oscillate in the same manner.",
    "topic": "Transverse waves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen012"
  },
  {
    "question_text": "All waves, regardless of type, require a material medium for their propagation. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Electromagnetic waves, such as light, do not require a material medium and can propagate through a vacuum. This distinguishes them from mechanical waves that depend on the medium's properties for propagation.",
    "topic": "Types of waves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen013"
  },
  {
    "question_text": "A mechanical wave travels along a medium at a speed of 10 m/s. If it takes 5 seconds for a disturbance to travel from one end to the other, what is the length of the medium?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "50 m",
    "explanation": "Use the formula: distance = speed x time. Therefore, distance = 10 m/s x 5 s = 50 m. The medium is 50 m long.",
    "topic": "Speed of travelling waves",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen014"
  },
  {
    "question_text": "Light travels in vacuum at a speed of 299,792,458 m/s. Calculate the time it takes for light to travel a distance of 3 x 10^8 m.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 1 second",
    "explanation": "Using time = distance / speed, time = (3 x 10^8 m) / (299,792,458 m/s) which comes out to be approximately 1 second.",
    "topic": "Electromagnetic waves",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen015"
  },
  {
    "question_text": "Sound travels in air at approximately 343 m/s. Estimate the time required for sound to cover a distance of 686 m.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "2 seconds",
    "explanation": "Time = distance / speed = 686 m / 343 m/s = 2 seconds. Thus, sound takes 2 seconds to travel 686 m.",
    "topic": "Sound waves",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen016"
  },
  {
    "question_text": "A series of oscillating springs produces a wave pulse and each spring oscillates with a period of 2 seconds. What is the frequency of this oscillation?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "0.5 Hz",
    "explanation": "Frequency is the reciprocal of the period: frequency = 1 / period. Therefore, frequency = 1 / 2 s = 0.5 Hz.",
    "topic": "Harmonic oscillations and waves",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph207",
    "section_id": "01_section_14_1",
    "question_id": "cbse_xi_keph2dd_c207_gen017"
  }
]