[
  {
    "question_text": "A geyser heats water flowing at the rate of 3.0 litres per minute from 27 °C to 77 °C. If the geyser operates on a gas burner, what is the rate of consumption of the fuel if its heat of combustion is 4.0 x 10^4 J/g?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 15.7 g per minute",
    "explanation": "First, determine the mass of water heated per minute. Since 1 litre of water weighs approximately 1 kg, 3.0 litres correspond to 3.0 kg of water. The temperature rise is 77 °C - 27 °C = 50 °C. Using the specific heat capacity of water 4186 J/(kg·K), the energy required per minute is: Q = mass × specific heat × ΔT = 3.0 kg × 4186 J/(kg·K) × 50 K ≈ 627900 J. Given the fuel provides 4.0 x 10^4 J per gram, the fuel consumption is 627900 J / (4.0 x 10^4 J/g) ≈ 15.7 g per minute.",
    "topic": "Heat, Internal Energy and Work",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph204",
    "question_id": "cbse_xi_keph2dd_c204_ex001"
  },
  {
    "question_text": "What amount of heat must be supplied to 2.0 x 10^-2 kg of nitrogen at room temperature to raise its temperature by 45 °C at constant pressure? (Molecular mass of N2 = 28; R = 8.3 J mol^-1 K^-1.)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 935 J",
    "explanation": "First, convert the mass of nitrogen (0.02 kg) to moles using its molar mass: n = 0.02 kg / 0.028 kg/mol ≈ 0.714 mol. For diatomic gases at constant pressure, the molar heat capacity Cp is approximately (7/2)R ≈ (7/2) x 8.3 J/(mol·K) ≈ 29.05 J/(mol·K). The heat required is Q = n × Cp × ΔT = 0.714 mol x 29.05 J/(mol·K) x 45 K ≈ 935 J.",
    "topic": "Specific Heat Capacity",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph204",
    "question_id": "cbse_xi_keph2dd_c204_ex002"
  },
  {
    "question_text": "Explain why: (a) Two bodies at different temperatures T1 and T2, if brought in thermal contact, do not necessarily settle to the mean temperature (T1 + T2)/2. (b) The coolant in a chemical or a nuclear plant should have a high specific heat. (c) Air pressure in a car tyre increases during driving. (d) The climate of a harbour town is more temperate than that of a town in a desert at the same latitude.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) Because the final equilibrium temperature depends on the masses and specific heat capacities of the bodies, not merely on the arithmetic mean. b) A high specific heat allows the coolant to absorb large amounts of heat with only a small temperature rise, protecting the system from overheating. c) During driving, the tyre heats up due to friction and compression, raising the gas temperature and therefore its pressure (per the ideal gas law). d) The presence of a large water body in a harbour town moderates temperature extremes due to water’s high specific heat capacity, resulting in a more temperate climate.",
    "explanation": "a) When two bodies interact thermally, the energy exchanged is determined by both masses and their specific heats, so the equilibrium temperature is a weighted average rather than the simple arithmetic mean. b) Coolants with high specific heat capacity can absorb more energy without a large increase in temperature, making them effective in controlling system temperatures. c) According to the ideal gas law (PV = nRT), an increase in temperature (with V nearly constant) results in an increase in pressure. d) Water heats up and cools down more slowly than air or land because of its high specific heat, thereby reducing daily temperature fluctuations and moderating the local climate.",
    "topic": "Thermal Equilibrium and Specific Heat",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "keph204",
    "question_id": "cbse_xi_keph2dd_c204_ex003"
  },
  {
    "question_text": "A cylinder with a movable piston contains 3 moles of hydrogen at standard temperature and pressure. The walls of the cylinder are made of a heat insulator, and the piston is insulated by having a pile of sand on it. By what factor does the pressure of the gas increase if the gas is compressed to half its original volume?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 2.64 times",
    "explanation": "Because the cylinder is insulated, the compression is adiabatic. For an adiabatic process, the relation PV^γ = constant holds. Hydrogen, being diatomic at room temperature, has γ ≈ 1.4. If the volume is halved, the new pressure is P_new = P_initial × (V_initial / V_new)^γ = P_initial × (2)^1.4, which is approximately 2.64 times the original pressure.",
    "topic": "Adiabatic Process",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph204",
    "question_id": "cbse_xi_keph2dd_c204_ex004"
  },
  {
    "question_text": "In changing the state of a gas adiabatically from an equilibrium state A to another equilibrium state B, an amount of work equal to 22.3 J is done on the system. If the gas is taken from state A to B via a process in which the net heat absorbed by the system is 9.35 cal, how much is the net work done by the system in the latter case? (Take 1 cal = 4.19 J)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 16.9 J",
    "explanation": "For the adiabatic process, no heat is exchanged so the change in internal energy ΔU is equal to the work done on the system, which is +22.3 J (note that work done on the system is positive for increasing internal energy). In the alternative process, the system absorbs 9.35 cal which is 9.35 × 4.19 J ≈ 39.17 J. Since the change in internal energy is a state function and remains the same (22.3 J), applying the first law (ΔU = Q - W) we have 22.3 J = 39.17 J - W, so the net work done by the system is W = 39.17 J - 22.3 J ≈ 16.87 J.",
    "topic": "First Law of Thermodynamics",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph204",
    "question_id": "cbse_xi_keph2dd_c204_ex005"
  },
  {
    "question_text": "Two cylinders A and B of equal capacity are connected to each other via a stopcock. Cylinder A contains a gas at standard temperature and pressure and cylinder B is completely evacuated. The entire system is thermally insulated. When the stopcock is suddenly opened, answer the following: (a) What is the final pressure of the gas in A and B? (b) What is the change in internal energy of the gas? (c) What is the change in the temperature of the gas? (d) Do the intermediate states of the system (before settling to the final equilibrium state) lie on its P-V-T surface?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "a) The final pressure is half the initial pressure, b) There is no change in internal energy, c) There is no change in temperature, d) No, the intermediate states are non-equilibrium and do not lie on the equilibrium P-V-T surface.",
    "explanation": "When the stopcock is opened, the gas expands freely into the combined volume of the two cylinders. Since the total volume doubles while the amount of gas remains the same, the final pressure becomes half of the initial pressure (by Boyle's law under constant temperature conditions). In a free expansion of an ideal gas, no work is done and no heat is exchanged (the process is adiabatic), so the internal energy and thus the temperature remain constant. However, the process is irreversible; the gas does not pass through a series of equilibrium states, so the intermediate states do not lie on the equilibrium P-V-T surface.",
    "topic": "Thermodynamic State Variables and Free Expansion",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph204",
    "question_id": "cbse_xi_keph2dd_c204_ex006"
  },
  {
    "question_text": "An electric heater supplies heat to a system at a rate of 100 W, and the system performs work at a rate of 75 J/s. At what rate is the internal energy of the system increasing?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "25 J/s",
    "explanation": "According to the first law of thermodynamics, the rate of change of internal energy is given by dU/dt = dQ/dt - dW/dt. Here, dQ/dt = 100 J/s and dW/dt = 75 J/s. Therefore, dU/dt = 100 J/s - 75 J/s = 25 J/s.",
    "topic": "First Law of Thermodynamics",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph204",
    "question_id": "cbse_xi_keph2dd_c204_ex007"
  },
  {
    "question_text": "A thermodynamic system is taken from an original state to an intermediate state by a linear process (as shown in the figure) and then from state E to F by an isobaric process. Given that in the process from E to F the pressure is 300 N/m², the volume changes from 5 m³ to 2 m³, and that the linear process from D to E connects the point D (at 2 m³ and 600 N/m²) to point E (at 5 m³ and 300 N/m²), calculate the total work done by the gas from D to E to F.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 450 J",
    "explanation": "For the process from D to E, the work done is the area under the linear curve, which can be approximated as the average pressure times the change in volume. Here, average pressure = (600 N/m² + 300 N/m²)/2 = 450 N/m² and the volume change is 5 m³ - 2 m³ = 3 m³. Thus, work from D to E is 450 N/m² x 3 m³ = 1350 J. For the isobaric process from E to F, work is given by W = P x ΔV = 300 N/m² x (2 m³ - 5 m³) = -900 J (the negative sign indicates work done on the system during compression). The total work done by the gas is 1350 J + (-900 J) = 450 J.",
    "topic": "Thermodynamic Processes and Work on a P-V Diagram",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph204",
    "question_id": "cbse_xi_keph2dd_c204_ex008"
  }
]