[
  {
    "question_text": "What is the direction of the force on a current-carrying conductor placed in a magnetic field when the current flows from left to right and the magnetic field is directed into the page? Use Fleming's left-hand rule to determine the direction.",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Upwards",
      "Downwards",
      "To the left",
      "To the right"
    ],
    "correct_answer": "Upwards",
    "explanation": "Using Fleming's left-hand rule:\n1. Point the forefinger in the direction of the magnetic field (into the page).\n2. Point the second finger in the direction of the current (left to right).\n3. The thumb points in the direction of the force, which is upwards.\nIncorrect options:\n- Downwards: Opposite to the actual force direction.\n- To the left/To the right: Incorrect orientations based on the rule.",
    "topic": "Fleming's Left-Hand Rule",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Explain why reversing the direction of the current in a conductor placed within a magnetic field results in the reversal of the direction of the force acting on the conductor.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Reversing the current direction changes the direction of the magnetic force according to the right-hand rule (or Fleming's left-hand rule). Since the force is proportional to the current (F ∝ I), reversing I reverses F.",
    "explanation": "The magnetic force on a current-carrying conductor is given by F = I L × B. Reversing the current I changes the direction of L, thus reversing the direction of F.",
    "topic": "Magnetic Force on a Conductor",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Derive the expression for the magnetic force experienced by a straight conductor of length L carrying a current I in a uniform magnetic field B, and state the conditions for the maximum force.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The magnetic force on a straight conductor is given by F = I L × B. In magnitude, F = I L B sin θ, where θ is the angle between L and B. The force is maximum when sin θ = 1, i.e., when θ = 90°, meaning the current is perpendicular to the magnetic field.",
    "explanation": "Starting from the Lorentz force law for a current-carrying conductor, F = I L × B. The magnitude is F = I L B sin θ. To maximize F, sin θ must be maximum, which occurs at θ = 90°. Therefore, the force is largest when the current flows perpendicular to the magnetic field.",
    "topic": "Magnetic Force on a Conductor",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "An electron moves with a velocity 𝑣 perpendicular to a uniform magnetic field 𝑏. Using the right-hand rule, determine the direction of the force experienced by the electron.",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Perpendicular to both 𝑣 and 𝑏 in the direction given by Fleming's left-hand rule.",
      "Perpendicular to both 𝑣 and 𝑏 in the direction opposite to Fleming's left-hand rule.",
      "In the same direction as 𝑣.",
      "Opposite to the direction of 𝑣."
    ],
    "correct_answer": "Perpendicular to both 𝑣 and 𝑏 in the direction opposite to Fleming's left-hand rule.",
    "explanation": "Fleming's left-hand rule applies to conventional current, which is opposite to electron flow. Therefore, the force on an electron is opposite to the direction predicted by the left-hand rule. Using the right-hand rule for electrons, the force is perpendicular to both 𝑣 and 𝑏 but in the opposite direction.\nIncorrect options:\n- Option 1: Correct direction applies to conventional current, not electrons.\n- Option 3 and 4: Force is perpendicular, not parallel or antiparallel.",
    "topic": "Magnetic Force on Moving Charges",
    "bloom_level": "Apply"
  },
  {
    "question_text": "A current of 3 A flows through a conductor of length 0.5 m placed in a magnetic field of 2 T. If the angle between the conductor and the magnetic field is 30° , calculate the magnitude of the force acting on the conductor.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The magnitude of the force is F = I L B sin θ = 3 × 0.5 × 2 × sin 30° = 3 × 0.5 × 2 × 0.5 = 1.5 N.",
    "explanation": "Using the formula F = I L B sin θ:\n\nF = 3 A × 0.5 m × 2 T × sin 30°\n\nsin 30° = 0.5\n\nF = 3 × 0.5 × 2 × 0.5 = 1.5 N.",
    "topic": "Magnetic Force Calculation",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Which of the following devices does NOT utilize the force on a current-carrying conductor in a magnetic field?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Electric Motor",
      "Electric Generator",
      "Loudspeaker",
      "Solar Panel"
    ],
    "correct_answer": "Solar Panel",
    "explanation": "Solar panels convert light energy into electrical energy and do not rely on magnetic forces on current-carrying conductors. \n- Electric motors: Use magnetic forces to produce motion.\n- Electric generators: Convert mechanical energy into electrical energy using magnetic forces.\n- Loudspeakers: Use magnetic forces to move the diaphragm.",
    "topic": "Applications of Magnetic Forces",
    "bloom_level": "Remember"
  },
  {
    "question_text": "Describe the relationship between the direction of the magnetic field, the direction of current, and the direction of the resulting force on a conductor as per Fleming's left-hand rule.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "According to Fleming's left-hand rule, if the forefinger points in the direction of the magnetic field and the second finger points in the direction of current, then the thumb points in the direction of the resulting force on the conductor.",
    "explanation": "Fleming's left-hand rule provides a spatial relationship between the magnetic field (forefinger), current (second finger), and force (thumb), ensuring all three are perpendicular to each other.",
    "topic": "Fleming's Left-Hand Rule",
    "bloom_level": "Remember"
  },
  {
    "question_text": "In Activity 12.7, why does reversing the direction of the magnetic field by interchanging the poles of the magnet reverse the direction of the force on the current-carrying rod?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Reversing the magnetic field direction changes the direction of the magnetic field vector B. Since the force F = I L × B depends on the direction of B, reversing B reverses F.",
    "explanation": "The magnetic force is dependent on the cross product of current direction and magnetic field. Changing B to -B reverses the direction of F as per the right-hand rule.",
    "topic": "Magnetic Force Dependence",
    "bloom_level": "Understand"
  },
  {
    "question_text": "A conductor of length L carrying a current I is placed in a magnetic field B such that it makes an angle θ with the field. If the current is doubled and the angle is halved, how does the force on the conductor change?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The original force is F = I L B sin θ. The new force is F' = 2I L B sin (θ/2). Therefore, the force is doubled and multiplied by sin (θ/2).",
    "explanation": "Original force: F = I L B sin θ.\n\nNew current: 2I.\n\nNew angle: θ/2.\n\nNew force: F' = 2I L B sin (θ/2).\n\nThus, the force is doubled and scaled by sin (θ/2).",
    "topic": "Magnetic Force Variation",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "Why is the displacement of the conductor largest when the current is at right angles to the magnetic field? Provide a mathematical explanation.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Because the force F = I L B sin θ is maximum when sin θ = 1, which occurs when θ = 90° meaning the current is perpendicular to the magnetic field.",
    "explanation": "The sine function reaches its maximum value of 1 when the angle between the current and magnetic field is 90°. Therefore, F = I L B sin 90° = I L B is the largest possible force.",
    "topic": "Magnetic Force Maximization",
    "bloom_level": "Understand"
  },
  {
    "question_text": "An electron moving with velocity ⃗v perpendicular to a magnetic field ⃗B experiences a force ⃗F. If the speed of the electron is doubled while keeping ⃗B constant, what happens to the magnitude of the force ⃗F?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The force F is directly proportional to the velocity v. Therefore, doubling the speed doubles the force: F' = 2F.",
    "explanation": "The magnetic force on a moving charge is given by ⃗F = q ⃗v × ⃗B. If v is doubled, F becomes 2F since F ∝ v.",
    "topic": "Magnetic Force on Moving Charges",
    "bloom_level": "Apply"
  }
]