[
  {
    "question_text": "Which of the following correctly describes the magnetic field near a long straight wire?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "a. The field consists of straight lines perpendicular to the wire.",
      "b. The field consists of straight lines parallel to the wire.",
      "c. The field consists of radial lines originating from the wire.",
      "d. The field consists of concentric circles centred on the wire."
    ],
    "correct_answer": "d. The field consists of concentric circles centred on the wire.",
    "explanation": "According to the magnetic field pattern around a long straight current-carrying conductor, the field lines form concentric circles around the wire. This is supported by both theoretical analysis and experimental observations, such as Activity 12.5 where iron filings align in concentric circles around the wire. \\n\\n- Option a is incorrect because the field lines are not perpendicular but circular around the wire. \\n- Option b is incorrect as the lines are not parallel but form loops around the wire. \\n- Option c is incorrect because the lines are not radial but circular.",
    "topic": "Magnetic Field due to a Current-Carrying Conductor",
    "bloom_level": "Remember"
  },
  {
    "question_text": "At the time of short circuit, the current in the circuit",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "a. reduces substantially.",
      "b. does not change.",
      "c. increases heavily.",
      "d. vary continuously."
    ],
    "correct_answer": "c. increases heavily.",
    "explanation": "A short circuit creates a path with very low or negligible resistance in the circuit. According to Ohm's Law, I = V / R. When resistance R decreases significantly, the current I increases substantially, leading to a heavy increase in current.\n\n- Option a is incorrect because the current does not reduce; it increases. \n- Option b is incorrect as the current does change, specifically it increases. \n- Option d is incorrect because the current does not vary continuously but spikes.",
    "topic": "Electric Circuits",
    "bloom_level": "Understand"
  },
  {
    "question_text": "State whether the following statements are true or false.\\n\\na. The field at the centre of a long circular coil carrying current will be parallel straight lines.\\n\\nb. A wire with a green insulation is usually the live wire of an electric supply.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": {
      "a": "True",
      "b": "False"
    },
    "explanation": "a. **True.** Inside a long circular coil (solenoid), the magnetic field lines are parallel and straight, indicating a uniform magnetic field. This is discussed in Section 12.2.4 on the magnetic field due to a solenoid.\\n\\nb. **False.** Typically, the green insulated wire is the earth wire, not the live wire. The live wire usually has red insulation.",
    "topic": "Magnetic Field and Field Lines; Domestic Electric Circuits",
    "bloom_level": "Understand"
  },
  {
    "question_text": "List two methods of producing magnetic fields.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "1. Passing an electric current through a straight conductor.\\n2. Using a permanent magnet.",
    "explanation": "Magnetic fields can be produced by:\\n1. **Electric Current:** As demonstrated in Activity 12.1 and Section 12.2, passing an electric current through a conductor generates a magnetic field around it.\\n2. **Permanent Magnets:** These materials have intrinsic magnetic fields due to the alignment of their magnetic domains.",
    "topic": "Magnetic Effects of Electric Current",
    "bloom_level": "Remember"
  },
  {
    "question_text": "When is the force experienced by a current–carrying conductor placed in a magnetic field largest?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The force is largest when the current is perpendicular to the magnetic field.",
    "explanation": "According to the formula for the magnetic force on a current-carrying conductor, F = I L B sin(θ), where I is the current, L is the length of the conductor, B is the magnetic field strength, and θ is the angle between the current and the magnetic field. The force is maximized when sin(θ) = 1, i.e., when the current is perpendicular to the magnetic field.",
    "topic": "Force on a Current-Carrying Conductor in a Magnetic Field",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Imagine that you are sitting in a chamber with your back to one wall. An electron beam, moving horizontally from the back wall towards the front wall, is deflected by a strong magnetic field to your right side. What is the direction of the magnetic field?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The magnetic field is directed into the page.",
    "explanation": "To determine the direction of the magnetic field, we can use Fleming’s left-hand rule. However, since electrons are negatively charged, the direction of force is opposite to that predicted by the conventional current direction.\\n\\nGiven:\\n- Electron beam is moving horizontally towards the front wall (left to right).\\n- Deflection is to the right side of the observer.\\n\\nApplying Fleming’s left-hand rule:\\n- Forefinger (B) points into the page.\\n- Second finger (I) points opposite to electron movement (right to left).\\n- Thumb (F) points upwards, but actual deflection is to the right, indicating B is into the page.",
    "topic": "Force on a Current-Carrying Conductor in a Magnetic Field",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "State the rule to determine the direction of a:\\ni. magnetic field produced around a straight conductor-carrying current,\\nii. force experienced by a current-carrying straight conductor placed in a magnetic field which is perpendicular to it, and\\niii. current induced in a coil due to its rotation in a magnetic field.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "i. Use the right-hand thumb rule: Point your right thumb in the direction of the conventional current, and your fingers curl in the direction of the magnetic field lines.\\nii. Apply Fleming’s left-hand rule: Align your forefinger with the magnetic field, your second finger with the current, and the thumb will indicate the direction of the force.\\niii. Use Fleming’s right-hand rule (for generators): Align your forefinger with the magnetic field, your thumb with the motion, and the second finger will indicate the direction of the induced current.",
    "explanation": "i. **Right-Hand Thumb Rule:** For a straight conductor, if you grip the conductor with your right hand such that the thumb points in the direction of the current, your fingers will curl around the conductor in the direction of the magnetic field lines.\\n\\nii. **Fleming’s Left-Hand Rule:** Used for motors, where the forefinger represents the magnetic field (B), the second finger represents the current (I), and the thumb represents the force (F).\\n\\niii. **Fleming’s Right-Hand Rule:** Used for generators, where the forefinger represents the magnetic field (B), the thumb represents the motion of the conductor, and the second finger represents the induced current (I).",
    "topic": "Magnetic Field and Field Lines; Force on a Current-Carrying Conductor in a Magnetic Field",
    "bloom_level": "Apply"
  },
  {
    "question_text": "When does an electric short circuit occur?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An electric short circuit occurs when the live wire and the neutral wire come into direct contact, bypassing the intended load, resulting in a sudden surge of current.",
    "explanation": "A short circuit happens when there is an unintended low-resistance connection between the live (positive) and neutral (negative) wires. This allows a large current to flow directly through this path, which can lead to overheating, damage to appliances, or even fires. This is discussed in Section 12.4 on Domestic Electric Circuits.",
    "topic": "Electric Circuits",
    "bloom_level": "Understand"
  },
  {
    "question_text": "What is the function of an earth wire? Why is it necessary to earth metallic appliances?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The earth wire provides a low-resistance path to the ground, ensuring that in case of a fault, any leakage current is safely conducted to the earth. This protects users from electric shocks by keeping the metallic parts of appliances at earth potential.",
    "explanation": "The earth wire acts as a safety measure by grounding the metallic parts of electrical appliances. If there is a fault, such as a breakdown of insulation causing the live wire to contact the metal body, the earth wire provides a path for the excessive current to flow directly into the ground. This prevents the metal parts from reaching a potential that could cause electric shocks to users. This is explained in Section 12.4 on Domestic Electric Circuits.",
    "topic": "Domestic Electric Circuits",
    "bloom_level": "Understand"
  }
]