[
  {
    "question_text": "What is the SI unit of acceleration?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Meter per second (m/s)",
      "Meter per second squared (m/s²)",
      "Newton (N)",
      "Joule (J)"
    ],
    "correct_answer": "Meter per second squared (m/s²)",
    "explanation": "Acceleration is defined as the rate of change of velocity with time, and its SI unit is meter per second squared (m/s²).",
    "topic": "Acceleration definition",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen072"
  },
  {
    "question_text": "On a position-time graph, which of the following curves represents motion with constant positive acceleration?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A straight line",
      "A curve that bends downward (concave down)",
      "A curve that bends upward (concave up)",
      "A horizontal line"
    ],
    "correct_answer": "A curve that bends upward (concave up)",
    "explanation": "For constant positive acceleration, the position-time graph curves upward (concave up) because the object’s speed is increasing over time.",
    "topic": "Graphs of acceleration",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen073"
  },
  {
    "question_text": "How is instantaneous acceleration defined?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The change in velocity over a finite time interval",
      "The slope of the tangent to the velocity-time curve at a point",
      "The total displacement divided by time",
      "The average velocity during motion"
    ],
    "correct_answer": "The slope of the tangent to the velocity-time curve at a point",
    "explanation": "Instantaneous acceleration is defined as the derivative of velocity with respect to time, which is the slope of the tangent line to the velocity-time curve at any given instant.",
    "topic": "Instantaneous acceleration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen074"
  },
  {
    "question_text": "A velocity-time graph shows an object initially moving in the positive direction, then decelerating until it stops and eventually moving in the reverse direction. What does this change in the graph most clearly indicate?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "The object experiences uniform motion throughout.",
      "The object’s acceleration remains constant throughout.",
      "The object undergoes a change in the direction of motion due to negative acceleration.",
      "The object has a constant speed but changes direction."
    ],
    "correct_answer": "The object undergoes a change in the direction of motion due to negative acceleration.",
    "explanation": "A v-t graph that shows a decrease through zero velocity followed by negative values indicates that the object decelerates, stops, and then accelerates in the opposite direction (negative acceleration).",
    "topic": "Velocity-time graph analysis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen075"
  },
  {
    "question_text": "What does the area under a velocity-time graph represent?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Acceleration",
      "Velocity",
      "Displacement",
      "Time interval"
    ],
    "correct_answer": "Displacement",
    "explanation": "The area under a velocity-time graph gives the displacement of the object over the time interval considered, as it represents the integral (or sum) of velocity over time.",
    "topic": "Velocity-time graph interpretation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen076"
  },
  {
    "question_text": "Define average acceleration and explain its significance in describing motion.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Average acceleration is defined as the change in velocity divided by the elapsed time (Δv/Δt) and it represents the overall rate at which an object's velocity changes over a given time period.",
    "explanation": "Average acceleration gives a measure of how quickly an object's velocity changes over a time interval. It is calculated by taking the difference in velocity between two instants and dividing by the time interval separating them. This provides insight into the object's overall motion during that period.",
    "topic": "Average Acceleration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen077"
  },
  {
    "question_text": "In Galileo's studies, why was the rate of change of velocity with time chosen over that with distance as the measure for acceleration?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Galileo observed that for freely falling objects, the rate of change of velocity with time is constant, while the rate of change with distance decreases as the fall increases.",
    "explanation": "Galileo's experiments showed that when objects fall freely or on an incline, the acceleration (i.e., the change of velocity with time) remains constant for all objects. However, when considered as a function of distance, the rate of change of velocity decreases with increasing distance, making time a more natural and consistent variable for describing acceleration.",
    "topic": "Galileo's experiments and acceleration",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen078"
  },
  {
    "question_text": "Explain why the instantaneous acceleration at any point on a velocity-time graph is given by the slope of the tangent at that point.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Because instantaneous acceleration is the derivative of velocity with respect to time, which is represented geometrically by the slope of the tangent to the velocity-time curve at that point.",
    "explanation": "The definition of instantaneous acceleration involves taking the limit of Δv/Δt as Δt approaches zero. This limit is mathematically represented as the derivative of velocity with respect to time. In a graph, the derivative at a point is the slope of the tangent line, hence the instantaneous acceleration is the tangent's slope at that point.",
    "topic": "Instantaneous Acceleration",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen079"
  },
  {
    "question_text": "Discuss how changing the direction of velocity (even if the speed remains constant) affects the acceleration of an object. Provide examples in your explanation.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Changing the direction of velocity means that the velocity vector, which is a quantity with both magnitude and direction, is changing even if the speed is constant. This change in direction constitutes an acceleration, often referred to as centripetal or normal acceleration in cases of circular motion. For example, in uniform circular motion, although the speed remains constant, the continuous change in direction results in a centripetal acceleration directed towards the center of the circle.",
    "explanation": "Acceleration is defined as the rate of change of velocity. Since velocity encompasses both magnitude and direction, any change in direction leads to a change in velocity. Even when speed remains constant, a change in the vector direction results in acceleration. In circular motion, for instance, the object experiences acceleration directed inward, known as centripetal acceleration. This concept is fundamental in explaining motions such as planetary orbits and objects moving along curved paths.",
    "topic": "Acceleration due to change in direction",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen080"
  },
  {
    "question_text": "Explain in detail how the area under a velocity-time graph is used to calculate the displacement of an object. Include a discussion of its dimensional consistency.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The area under the velocity-time graph represents the integral of velocity with respect to time, which yields displacement. This area is calculated by summing the regions (such as rectangles, triangles, or trapezoids) under the curve. The units of velocity (meters per second) multiplied by time (seconds) result in meters, ensuring dimensional consistency with displacement.",
    "explanation": "In a velocity-time graph, each small segment of time contributes a small change in displacement equal to velocity multiplied by the time interval. When summed up, this yields the total displacement. For constant velocity this is simply the area of a rectangle; for uniformly accelerated motion, the area under the graph forms a trapezoid, which can be decomposed into a rectangle and a triangle. Multiplying velocity (m/s) by time (s) gives a displacement in meters, satisfying the dimensional analysis requirement for distance.",
    "topic": "v-t Graph and Displacement",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen081"
  },
  {
    "question_text": "Velocity can change only if an object's speed changes, not if its direction changes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Since velocity is a vector quantity that includes both speed and direction, a change in direction while maintaining the same speed still constitutes a change in velocity, and hence an acceleration.",
    "topic": "Velocity and Acceleration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen082"
  },
  {
    "question_text": "In a motion with constant acceleration, the velocity-time graph is a straight line with a constant slope.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "For constant acceleration, the velocity increases (or decreases) linearly with time. The slope of this line (which is constant) represents the acceleration.",
    "topic": "Graphs in Constant Acceleration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen083"
  },
  {
    "question_text": "An object starts from rest and accelerates with a constant acceleration of 2 m/s². What is its velocity after 8 seconds, and what is the total displacement in that time period?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Velocity = 16 m/s; Displacement = 64 m",
    "explanation": "For constant acceleration, the final velocity is given by the equation v = u + a*t. Here u = 0, a = 2 m/s², and t = 8 s, hence v = 0 + 2*8 = 16 m/s. The displacement is calculated using s = u*t + 0.5*a*t², which gives s = 0 + 0.5*2*64 = 64 m.",
    "topic": "Constant Acceleration Equations",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen084"
  },
  {
    "question_text": "An object moving with an initial speed of 20 m/s decelerates uniformly at -5 m/s². Calculate the time required for the object to come to a complete stop and the displacement during deceleration.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Time to stop = 4 s; Displacement = 40 m",
    "explanation": "To find the time to come to a stop, use the equation v = u + a*t, where final velocity v = 0, u = 20 m/s, and a = -5 m/s². Solving 0 = 20 - 5*t gives t = 4 s. The displacement is found using s = u*t + 0.5*a*t² = 20*4 + 0.5*(-5)*16 = 80 - 40 = 40 m.",
    "topic": "Deceleration and Stopping Distance",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen085"
  },
  {
    "question_text": "An object initially moves at 10 m/s and accelerates at 3 m/s² for 4 seconds. Immediately after, it decelerates at -3 m/s² for the next 4 seconds. Determine the displacement of the object over the entire 8-second period.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Total Displacement = 128 m",
    "explanation": "During the first 4 seconds, the displacement is s1 = u*t + 0.5*a*t² = 10*4 + 0.5*3*16 = 40 + 24 = 64 m. The final velocity after the first phase is v = 10 + 3*4 = 22 m/s. During the next 4 seconds, the displacement is s2 = v*t + 0.5*a*t² = 22*4 + 0.5*(-3)*16 = 88 - 24 = 64 m. Therefore, the total displacement is s1 + s2 = 64 m + 64 m = 128 m.",
    "topic": "Piecewise Constant Acceleration",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen086"
  },
  {
    "question_text": "A velocity-time graph of an object moving with constant acceleration forms a trapezoid with initial velocity 5 m/s, final velocity 15 m/s, over a time interval of 6 seconds. Calculate the displacement of the object over this interval.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Displacement = 60 m",
    "explanation": "For a velocity-time graph that is linear, the area under the graph, in this case a trapezoid, represents displacement. The area A of a trapezoid is given by A = (b1 + b2)/2 * h, where b1 = 5 m/s, b2 = 15 m/s, and h = 6 s. Therefore, A = (5 + 15)/2 * 6 = 20/2 * 6 = 10 * 6 = 60 m.",
    "topic": "v-t Graph and Displacement",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph102",
    "section_id": "03_section_2_3",
    "question_id": "cbse_xi_keph1dd_c102_gen087"
  }
]