[
  {
    "question_text": "Which of the following equations correctly represents the center of mass (R) for a system of n particles?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. R = (r1 + r2 + ... + rn) / n",
      "B. M R = m1 r1 + m2 r2 + ... + mn rn",
      "C. R = m1 r1 + m2 r2 + ... + mn rn",
      "D. M = m1 + m2 + ... + mn"
    ],
    "correct_answer": "B. M R = m1 r1 + m2 r2 + ... + mn rn",
    "explanation": "This equation is the standard definition of the center of mass as given in the section, where M is the total mass of the system.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen069"
  },
  {
    "question_text": "Differentiating the center of mass equation with respect to time leads to an equation involving which of the following quantities?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Displacement",
      "B. Velocity",
      "C. Acceleration",
      "D. Momentum"
    ],
    "correct_answer": "B. Velocity",
    "explanation": "Differentiating the equation for the center of mass with respect to time gives the velocity of the center of mass, as shown with V = dR/dt in the textbook.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen070"
  },
  {
    "question_text": "Which of the following statements best summarizes the significance of Equation (6.11) in the text?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It shows that the center of mass always remains stationary.",
      "B. It indicates that internal forces are solely responsible for the motion of the center of mass.",
      "C. It demonstrates that the center of mass moves as if all the mass and all external forces were concentrated at that point.",
      "D. It shows that the velocity of each particle must be equal to the velocity of the center of mass."
    ],
    "correct_answer": "C. It demonstrates that the center of mass moves as if all the mass and all external forces were concentrated at that point.",
    "explanation": "Equation (6.11) states that the center of mass of a system moves as if the entire mass were concentrated at that point with the total external force acting on it.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen071"
  },
  {
    "question_text": "When applying Newton's second law to a system of particles, why do the internal forces cancel out?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Because they are zero by definition.",
      "B. Because they occur in equal and opposite pairs according to Newton's third law.",
      "C. Because external forces are dominant.",
      "D. Because the sum of internal forces depends on the moment of inertia."
    ],
    "correct_answer": "B. Because they occur in equal and opposite pairs according to Newton's third law.",
    "explanation": "Newton's third law states that forces between particles occur in equal and opposite pairs, thus canceling each other out when summing over all internal forces.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen072"
  },
  {
    "question_text": "According to the text, what assumption is made about the masses m1, m2, ... mn when differentiating the center of mass equation?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. They are functions of time.",
      "B. They are subject to external forces only.",
      "C. They remain constant in time.",
      "D. They vary with velocity."
    ],
    "correct_answer": "C. They remain constant in time.",
    "explanation": "The text explicitly notes that the masses are treated as constant with respect to time when differentiating the center of mass equation.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen073"
  },
  {
    "question_text": "Explain in your own words how Equation (6.11) simplifies the analysis of a system of particles, regardless of any internal movements.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Equation (6.11) simplifies analysis by showing that the motion of the center of mass depends only on the external forces acting on the system and not on any internal motions or forces.",
    "explanation": "Since internal forces cancel in pairs (by Newton's third law), only external forces affect the acceleration of the center of mass. This means that regardless of the complexity of the internal motions, the entire system can be treated as a single particle located at its center of mass.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen074"
  },
  {
    "question_text": "Describe a scenario in which a rigid body might benefit from treating it as a system of particles to analyze its motion. Include the role of translational and rotational components in your explanation.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A rigid body undergoing both translation and rotation can be analyzed by separating the motion of its center of mass and its rotation about the center of mass. This approach simplifies problem-solving and helps in understanding how external forces influence overall motion without being disturbed by the internal rotational dynamics.",
    "explanation": "By treating the rigid body as a system of particles, the translational motion (movement of the center of mass) is decoupled from rotational motion. Newton's laws can then be applied to the center of mass motion (using Equation 6.11 for translation) while rotational dynamics are dealt with by considering torques about the center of mass.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen075"
  },
  {
    "question_text": "Summarize the physical significance of the center of mass continuing along its original trajectory even after a projectile explodes into fragments, as illustrated by Figure 6.12.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The center of mass continues along its original parabolic path because the explosion involves only internal forces, which do not affect the motion of the center of mass. The external force of gravity remains unchanged and continues to act on the system as a whole.",
    "explanation": "Since internal forces cancel out, they do not affect the acceleration of the center of mass. Thus, even when the projectile explodes, the center of mass, according to Equation (6.11), moves under the influence of the same external force (gravity) and follows the original trajectory.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen076"
  },
  {
    "question_text": "Discuss how Newton's second law applies to the center of mass of a system of particles. In your answer, mention the roles of external and internal forces.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Newton's second law applied to the center of mass of a system of particles states that the total mass of the system times the acceleration of the center of mass equals the sum of the external forces acting on the system. Internal forces do not contribute to this equation because they cancel each other out due to Newton's third law. By focusing only on external forces, one can analyze the motion of the center of mass independently from the complex internal interactions.",
    "explanation": "The derivation begins with the definition of the center of mass (M R = m1 r1 + m2 r2 + ... + mn rn) and differentiates it with respect to time to connect the velocity of the center of mass with the velocities of the individual particles (M V = m1 v1 + m2 v2 + ... + mn vn). A further differentiation gives the acceleration relation (M A = m1 a1 + m2 a2 + ... + mn an). By applying Newton's second law (F = m a) to each particle and summing, we form the equation M A = F1 + F2 + ... + Fn. Noting that the internal forces cancel out, we conclude that M A = F_ext. This result implies that the center of mass behaves as if the entire mass were concentrated at that point, with all external forces acting on it.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen077"
  },
  {
    "question_text": "Apply the concept of the center of mass to explain how the motion of an object is analyzed when external forces are applied, even if the object is undergoing internal motion or rotation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The motion of the object’s center of mass is determined solely by the net external forces acting on the system. By treating the entire mass of the object as if it were concentrated at the center of mass, one can apply Newton’s second law (F_ext = M A) without needing to account for the internal forces or rotational components. Internal motions and rotations contribute to the object's kinetic energy and angular momentum, but they do not affect the translational acceleration of the center of mass. This decoupling allows a clear and simplified analysis of translational motion irrespective of internal complexities.",
    "explanation": "This approach is particularly useful because it allows the analysis of the object's overall motion in a gravitational or other external field without getting entangled in the details of internal force distributions. The equation M A = F_ext provides a straightforward way to calculate the acceleration of the center of mass, while any rotational motion is handled separately through torque and moment of inertia considerations.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen078"
  },
  {
    "question_text": "The center of mass of a projectile always follows a parabolic path under gravity, even after an explosion. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Because internal forces (such as those during an explosion) cancel out, the center of mass is solely influenced by external forces like gravity, which results in a parabolic trajectory.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen079"
  },
  {
    "question_text": "Internal forces within a system contribute to the net external force acting on the center of mass. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Internal forces occur in equal and opposite pairs and therefore cancel out; only external forces contribute to the net external force on the center of mass.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen080"
  },
  {
    "question_text": "A system of particles has a total mass of 10 kg and its center of mass is accelerating at 2 m/s². Calculate the total external force acting on the system.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "20 N",
    "explanation": "Using Newton's second law for the center of mass (F_ext = M A), substitute M = 10 kg and A = 2 m/s² to get F_ext = 10 * 2 = 20 N.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen081"
  },
  {
    "question_text": "If a projectile explodes in mid-air and breaks into several fragments, with the total mass remaining 5 kg and the center of mass velocity just before explosion being 8 m/s, what is the momentum of the system after the explosion?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "40 kg·m/s",
    "explanation": "Momentum is conserved. The momentum before explosion is p = M V = 5 kg * 8 m/s = 40 kg·m/s. After the explosion, regardless of internal redistributions, the total momentum remains 40 kg·m/s.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen082"
  },
  {
    "question_text": "A moving system of particles has a total mass of 12 kg. At a given moment, its center of mass is accelerating at 3 m/s² while an external force of 36 N is acting on it. Verify if the system obeys Equation (6.11) and state your conclusion.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Yes, the system obeys Equation (6.11)",
    "explanation": "According to F_ext = M A, if M = 12 kg and A = 3 m/s², then F_ext should equal 12 * 3 = 36 N. Since the given external force is 36 N, the system obeys Equation (6.11).",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen083"
  },
  {
    "question_text": "A rigid body with a mass of 15 kg is subjected to a net external force of 45 N. If an explosion inside the body causes internal rearrangements but no mass is lost, what will be the acceleration of the center of mass after the explosion?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "3 m/s²",
    "explanation": "Since internal forces do not affect the acceleration of the center of mass, use F_ext = M A. Therefore, A = F_ext / M = 45 N / 15 kg = 3 m/s².",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen084"
  },
  {
    "question_text": "Consider a system of particles with total mass 20 kg having its center of mass initially traveling with a velocity of 10 m/s. If a time-dependent external force causes a constant acceleration of 0.5 m/s², calculate the new velocity of the center of mass after 4 seconds.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "12 m/s",
    "explanation": "Using the equation V_final = V_initial + A × t, where V_initial = 10 m/s, A = 0.5 m/s², and t = 4 s, the new velocity is V_final = 10 + (0.5 × 4) = 12 m/s.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen085"
  },
  {
    "question_text": "A projectile with a mass of 8 kg splits into two fragments after an internal explosion. If the center of mass was moving at 15 m/s prior to explosion and no external forces act other than gravity, what can be said about the velocity of the center of mass immediately after the explosion?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "It remains 15 m/s",
    "explanation": "Because the explosion involves only internal forces and momentum is conserved, the velocity of the center of mass remains unchanged. Thus, it remains 15 m/s immediately after the explosion, assuming negligible effects of gravity on the instantaneous velocity.",
    "topic": "Motion of Centre of Mass",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph106",
    "section_id": "03_section_6_3",
    "question_id": "cbse_xi_keph1dd_c106_gen086"
  }
]