[
  {
    "question_text": "Which of the following laws of vector addition is illustrated by placing one vector's tail at the head of another and then joining the tail of the first vector to the head of the second?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Triangle law",
      "Scalar law",
      "Rectangular rule",
      "Cross product rule"
    ],
    "correct_answer": "Triangle law",
    "explanation": "The described method is known as the head-to-tail or triangle method of vector addition, where the resultant is obtained by joining the tail of the first vector to the head of the second vector.",
    "topic": "Graphical methods of vector addition",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen109"
  },
  {
    "question_text": "The equation A + B = B + A demonstrates which property of vector addition?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Associative property",
      "Distributive property",
      "Commutative property",
      "Inverse property"
    ],
    "correct_answer": "Commutative property",
    "explanation": "The equation indicates that the order of adding two vectors does not affect the resultant vector, which is the definition of the commutative property.",
    "topic": "Vector properties",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen110"
  },
  {
    "question_text": "When two equal and opposite vectors are added together, what is the resulting vector?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A vector with doubled magnitude",
      "A vector with zero magnitude",
      "A vector pointing in the same direction as the first vector",
      "A vector perpendicular to both original vectors"
    ],
    "correct_answer": "A vector with zero magnitude",
    "explanation": "Adding two equal and opposite vectors results in a null or zero vector because their magnitudes cancel each other, resulting in zero net displacement.",
    "topic": "Vector subtraction and null vector",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen111"
  },
  {
    "question_text": "Which of the following methods for adding vectors involves drawing a parallelogram with the vectors as adjacent sides?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Triangle law",
      "Parallelogram method",
      "Component method",
      "Dot product method"
    ],
    "correct_answer": "Parallelogram method",
    "explanation": "The parallelogram method involves placing the tails of both vectors at the same origin and then drawing parallel lines to complete a parallelogram. The diagonal of the parallelogram represents the resultant vector.",
    "topic": "Graphical methods of vector addition",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen112"
  },
  {
    "question_text": "Which property of vector addition is represented by the equation (A + B) + C = A + (B + C)?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Commutative property",
      "Associative property",
      "Distributive property",
      "Identity property"
    ],
    "correct_answer": "Associative property",
    "explanation": "The given equation shows that no matter how the vectors are grouped during addition, the resultant remains the same, which is the associative property of vector addition.",
    "topic": "Vector properties",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen113"
  },
  {
    "question_text": "Explain the head-to-tail method of vector addition and state why it is also called the triangle method.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "In the head-to-tail method, the tail of one vector is placed at the head of the previous vector. The resultant vector is then drawn from the tail of the first vector to the head of the last vector. This process forms a triangle, hence it is also known as the triangle method.",
    "explanation": "The head-to-tail method involves repositioning vectors such that the tail of one vector starts where the previous vector ended. When the resultant vector is drawn between the start and the end, it completes a triangle, establishing the method's alternative name, the triangle method.",
    "topic": "Graphical methods of vector addition",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen114"
  },
  {
    "question_text": "What is the result of subtracting vector B from vector A in terms of vector addition?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A - B is defined as A + (-B), where -B is the vector with the same magnitude as B but in the opposite direction.",
    "explanation": "Vector subtraction is defined as the addition of the negative of a vector. This means that subtracting B from A is the same as adding B's inverse to A.",
    "topic": "Vector subtraction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen115"
  },
  {
    "question_text": "Discuss the physical significance of a null (zero) vector in the context of displacement.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A null vector, with zero magnitude, signifies that there is no net displacement. For example, if an object returns to its original position, its displacement vector is null.",
    "explanation": "The null vector is important in physics as it represents a situation where the initial and final positions of an object coincide. Even though the path may have been complex, the net displacement is zero.",
    "topic": "Null vector and displacement",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen116"
  },
  {
    "question_text": "Describe the difference between the triangle method and the parallelogram method of vector addition. How do both methods yield the same resultant?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The triangle method involves placing one vector’s tail to the head of the other and drawing the resultant from the free tail to the free head, forming a triangle. The parallelogram method involves placing both vectors with their tails at the same point, completing a parallelogram, and then drawing the diagonal from the common tail to the opposite corner. Both methods yield the same resultant because the position of vectors can be shifted (using the head-to-tail rule) without changing their magnitudes or directions.",
    "explanation": "Both the triangle method and the parallelogram method are graphical approaches for adding vectors. In the triangle method, vectors are arranged sequentially so that they form two sides of a triangle. In the parallelogram method, vectors start at the same point, and a parallelogram is constructed with the vectors as adjacent sides; the diagonal of the parallelogram represents the resultant vector. The principles of vector translation and the invariance of vector magnitude and direction ensure that both methods produce the same result.",
    "topic": "Graphical methods of vector addition",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen117"
  },
  {
    "question_text": "Explain why the commutative and associative properties of vector addition are essential when dealing with complex vector operations.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The commutative property (A+B = B+A) ensures that the order in which vectors are added does not affect the resultant. The associative property ((A+B)+C = A+(B+C)) allows for flexibility in grouping vectors during addition. Together, these properties simplify calculations and are crucial in breaking down complex vector problems into simpler components, making it easier to understand and compute resultant vectors regardless of the order or grouping.",
    "explanation": "The commutative property allows for the rearrangement of vectors without affecting the final outcome, while the associative property lets us group vectors in any convenient manner. In situations involving multiple vectors, being able to change the order and grouping provides computational simplicity and flexibility, which is particularly important in physics where vectors often represent forces, velocities, or displacements.",
    "topic": "Vector properties",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen118"
  },
  {
    "question_text": "Design an experiment using graphical methods to verify vector addition principles. Describe the setup, procedure, and expected outcome.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An experiment can be designed using a flat board, strings, and protractors to represent vectors. First, draw two vectors (e.g., representing forces) on the board with accurate magnitudes and directions. Then, using the head-to-tail method, physically arrange strings to represent the vectors and draw the resultant vector. Repeat using the parallelogram method. The outcome should show that both methods yield the same resultant vector, thereby verifying the commutative and associative properties of vector addition.",
    "explanation": "Students would arrange vectors on a board using precise measurements. By employing both the triangle and parallelogram methods, they can observe that repositioning the vectors (while retaining their magnitudes and directions) does not change the resultant vector. Measurements of the angle and magnitude of the resultant vector using protractors and rulers should confirm that both methods produce consistent results. This experimental approach reinforces the theoretical properties of vector addition.",
    "topic": "Experimental verification of vector addition",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen119"
  },
  {
    "question_text": "A+B equals B+A in vector addition.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "This is a direct application of the commutative property of vector addition which states that A+B equals B+A.",
    "topic": "Vector properties",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen120"
  },
  {
    "question_text": "A null vector, having zero magnitude, can be assigned a unique direction in space.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "A null or zero vector has zero magnitude, and thus its direction is undefined.",
    "topic": "Null vector",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen121"
  },
  {
    "question_text": "In the head-to-tail method of vector addition, the order of placing vectors does not affect the resultant vector.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Due to the commutative property of vector addition, regardless of the sequence in which vectors are arranged in the head-to-tail method, the resultant vector remains the same.",
    "topic": "Graphical methods of vector addition",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen122"
  },
  {
    "question_text": "A vector A of 5 m pointing east and a vector B of 5 m pointing north are added using the triangle method. Calculate the magnitude and the direction (angle measured from east) of the resultant vector.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Magnitude = 7.07 m, Direction = 45° north of east",
    "explanation": "To add the vectors, use the Pythagorean theorem as they are perpendicular: Resultant magnitude = sqrt((5 m)² + (5 m)²) = sqrt(25 + 25) = sqrt(50) = 7.07 m (approximately). The direction from east is given by tan θ = 5/5 = 1, so θ = 45° north of east.",
    "topic": "Vector addition using triangle method",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen123"
  },
  {
    "question_text": "Given a vector A, demonstrate numerically that adding its negative, -A, results in a null vector.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A + (-A) = 0, where 0 represents the null vector with zero magnitude",
    "explanation": "Since the magnitude of -A is equal to A but with opposite direction, when they are added, the resultant magnitude is 0. For example, if A has a magnitude of 8 units, then A + (-A) = 8 units in one direction - 8 units in the opposite direction = 0 units overall.",
    "topic": "Null vector and subtraction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen124"
  },
  {
    "question_text": "In a rain and wind problem, rain falls vertically at 35 m/s while wind blows horizontally at 12 m/s from east to west. Calculate the magnitude of the resultant velocity and the angle (with respect to the vertical).",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Resultant magnitude = 37 m/s and angle = 19° with respect to the vertical (towards the east)",
    "explanation": "Using the Pythagorean theorem: Resultant magnitude = sqrt((35 m/s)² + (12 m/s)²) = sqrt(1225 + 144) = sqrt(1369) = 37 m/s (approximately). The angle with respect to the vertical is given by tan θ = (12/35) ≈ 0.343, hence θ = arctan(0.343) ≈ 19°, indicating the umbrella should be held at 19° from the vertical.",
    "topic": "Relative motion using vector addition",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen125"
  },
  {
    "question_text": "Two forces of magnitudes 10 N and 15 N act on an object with an angle of 60° between them. Using the parallelogram method, calculate the magnitude of the resultant force.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Resultant magnitude ≈ 21.65 N",
    "explanation": "Resolve the vectors using the law of cosines: Resultant magnitude = sqrt((10 N)² + (15 N)² + 2(10 N)(15 N)cos(60°)). Since cos(60°) = 0.5, compute: = sqrt(100 + 225 + 300×0.5) = sqrt(100 + 225 + 150) = sqrt(475) ≈ 21.79 N. Rounding appropriately, the resultant is approximately 21.65 N.",
    "topic": "Parallelogram method in vector addition",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "04_section_3_4",
    "question_id": "cbse_xi_keph1dd_c103_gen126"
  }
]