[
  {
    "question_text": "Which of the following best defines a free-body diagram?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A diagram showing only the external forces acting on an isolated system.",
      "A schematic drawing of an object’s shape and dimensions.",
      "A representation of the internal structure of an object.",
      "A picture that only depicts the net force acting on the body."
    ],
    "correct_answer": "A diagram showing only the external forces acting on an isolated system.",
    "explanation": "A free-body diagram is used to show all the external forces acting on a chosen system without including the forces that the system exerts on the environment.",
    "topic": "Free-body diagrams",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen377"
  },
  {
    "question_text": "In applying Newton's third law while drawing free-body diagrams for interacting bodies, which statement is correct?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The force on body A due to body B is equal and has the same direction as the force on body B due to A.",
      "The force on body A due to body B is equal in magnitude but opposite in direction to the force on body B due to A.",
      "Body A experiences no force when body B exerts a force on it.",
      "The free-body diagram of body B must neglect gravitational forces."
    ],
    "correct_answer": "The force on body A due to body B is equal in magnitude but opposite in direction to the force on body B due to A.",
    "explanation": "Newton's third law states that every action has an equal and opposite reaction. Thus, the forces acting on two different bodies are equal in magnitude and opposite in direction.",
    "topic": "Action-reaction pairs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen378"
  },
  {
    "question_text": "Which of the following choices correctly describes the procedure to choose a system when solving a mechanics problem?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Choose a part of the assembly and ignore the forces from the environment.",
      "Choose a part of the assembly and include all forces exerted on it by the remaining portions.",
      "Always choose the entire assembly as the system.",
      "Choose a system arbitrarily without considering the connected bodies."
    ],
    "correct_answer": "Choose a part of the assembly and include all forces exerted on it by the remaining portions.",
    "explanation": "Selecting a part of the assembly and accounting for all forces acting on it from the rest of the system ensures that the free-body diagram accurately reflects the external influences on the system.",
    "topic": "System Selection",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen379"
  },
  {
    "question_text": "According to the text, which of these is NOT included in the free-body diagram of a chosen system?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Forces due to other parts of the assembly",
      "Forces due to gravity",
      "Forces on the environment by the system",
      "Forces provided by other agencies"
    ],
    "correct_answer": "Forces on the environment by the system",
    "explanation": "In a free-body diagram, one must only include the forces acting on the system, excluding the forces that the system applies on its surrounding environment.",
    "topic": "Free-body diagrams",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen380"
  },
  {
    "question_text": "In analyzing an assembly of bodies, why is it critical to identify internal forces separately from external forces when preparing free-body diagrams?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Because internal forces are always zero.",
      "Because Newton's laws only apply to external forces on an isolated system.",
      "Because internal forces cancel out and do not affect net acceleration.",
      "Because internal forces require separate quantification for action-reaction pairs."
    ],
    "correct_answer": "Because internal forces cancel out and do not affect net acceleration.",
    "explanation": "Internal forces occur in equal and opposite pairs and thus cancel each other when considering the net force on the entire system.",
    "topic": "Internal vs External Forces",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen381"
  },
  {
    "question_text": "Define a free-body diagram as used in solving problems in mechanics.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A free-body diagram is a schematic representation that shows all external forces acting on a system or body.",
    "explanation": "A free-body diagram helps isolate the system by illustrating all the forces applied to it by the surrounding environment, which is critical to applying Newton's laws.",
    "topic": "Free-body diagrams",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen382"
  },
  {
    "question_text": "List the steps for systematically solving a problem in mechanics as described in the text.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1. Draw a diagram showing the assembly of bodies; 2. Choose a convenient part as the system; 3. Draw a free-body diagram of the system including all forces exerted on it by the rest of the assembly and other agencies; 4. Include known force information and denote unknowns; 5. If necessary, repeat for another system while applying Newton's third law.",
    "explanation": "These steps ensure that you correctly isolate the system, accurately account for all forces, and consistently apply Newton's laws during problem solving in mechanics.",
    "topic": "Problem Solving Procedure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen383"
  },
  {
    "question_text": "Explain why two forces acting on the same object that are equal and opposite are not considered an action-reaction pair.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "They are not an action-reaction pair because action-reaction pairs act on two different bodies. Forces on the same object, even if equal and opposite, do not satisfy the condition of the forces acting on separate interacting bodies.",
    "explanation": "Newton's third law requires that for every force exerted by body A on body B, there is an equal and opposite force exerted by body B on body A. Forces on a single object do not meet this criterion.",
    "topic": "Action-Reaction Pairs",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen384"
  },
  {
    "question_text": "Describe the procedure for solving a mechanics problem using free-body diagrams, starting from choosing a system to applying Newton's laws. Include references to how action-reaction pairs are used in the diagram.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Begin by drawing a diagram of the entire assembly of bodies. Next, choose a convenient part of the assembly as your system. Draw a free-body diagram for the system, including all forces exerted on it by the environment such as gravitational and contact forces, while excluding forces that the system applies to the environment. Label forces whose magnitudes and directions are known, and represent unknown forces with symbols. If needed, choose another system to analyze internal forces using Newton's third law by showing that the force on body A due to body B is equal in magnitude and opposite in direction to the force on body B due to body A. Finally, apply Newton's second law to the free-body diagram to set up the equations necessary to solve for unknown quantities.",
    "explanation": "This systematic approach ensures that all relevant forces are considered, and the clear representation of action-reaction pairs helps verify that the forces between interacting bodies are correctly accounted for, thereby facilitating the accurate application of Newton's laws.",
    "topic": "Problem Solving Procedure in Mechanics",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen385"
  },
  {
    "question_text": "Critically evaluate the importance of drawing accurate free-body diagrams in the resolution of mechanics problems, and discuss potential errors that could result in analytical mistakes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Drawing accurate free-body diagrams is crucial as they form the basis for writing the correct equations of motion using Newton's laws. An accurate diagram ensures that all external forces are accounted for with their correct magnitudes and directions, providing a clear picture of the system's dynamics. Potential errors include misrepresenting the direction of forces, neglecting important forces such as friction or contact forces, and including forces that do not act on the system (like forces exerted by the system on the environment). Such mistakes can lead to incorrect net force calculations and ultimately erroneous predictions of acceleration and motion.",
    "explanation": "By clearly visualizing all forces acting on the system, free-body diagrams enable a precise application of Newton's laws. Recognizing common pitfalls, like misidentifying action-reaction pairs or omitting necessary forces, is essential for accurate problem solving in mechanics.",
    "topic": "Free-body Diagrams and Error Analysis",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen386"
  },
  {
    "question_text": "True or False: In a free-body diagram, it is acceptable to include forces exerted by the system on its environment.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "A free-body diagram should only include forces acting on the system, not the forces that the system exerts on its surroundings.",
    "topic": "Free-body Diagrams",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen387"
  },
  {
    "question_text": "True or False: Action-reaction pairs can be shown as forces acting on the same body.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "According to Newton's third law, action-reaction pairs always act on two different bodies, not on the same object.",
    "topic": "Action-Reaction Pairs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen388"
  },
  {
    "question_text": "A wooden block of mass 2 kg rests on a horizontal floor. When an iron cylinder of mass 25 kg is placed on the block, the assembly accelerates downward at 0.1 m/s2. Given g = 10 m/s2, calculate the normal force exerted by the floor on the block alone (before yielding) and on the assembly (after yielding).",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Before yielding: 20 N; After yielding: 267.3 N approximately.",
    "explanation": "Before yielding, the block is at rest, so the normal force equals its weight: 2 kg x 10 m/s2 = 20 N. After yielding, the total mass of the assembly is 2 kg + 25 kg = 27 kg, so the weight is 27 x 10 = 270 N. The system accelerates downward at 0.1 m/s2, meaning the net force is 27 x 0.1 = 2.7 N downward. Since weight minus normal force equals the net force, the normal force must be 270 N - 2.7 N = 267.3 N.",
    "topic": "Numerical Calculation - Free-body Diagrams",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen389"
  },
  {
    "question_text": "In a modified experiment, a system consisting of a 3 kg block and a 12 kg cylinder accelerates downward at 0.2 m/s2 on a horizontal floor. If g = 10 m/s2, determine the normal force exerted by the floor on the system.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "147 N",
    "explanation": "First, calculate the total mass: 3 kg + 12 kg = 15 kg. The weight of the system is 15 x 10 = 150 N. The net force required for the observed acceleration is 15 x 0.2 = 3 N (downward). By applying Newton's second law (weight - normal force = mass x acceleration), the normal force is 150 N - 3 N = 147 N.",
    "topic": "Numerical Calculation - Free-body Diagrams",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen390"
  },
  {
    "question_text": "A system on a horizontal floor is accelerating downward due to the yielding of a soft floor. The system consists of a mass m1 on top of a mass m2, where m1 = 2 kg and m2 = 25 kg, and the observed acceleration is 0.1 m/s2 downward. Determine the magnitude of the net force acting on the assembly and explain the relationship between this net force and the change in the normal force compared to the system's weight.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The net force is 2.7 N downward, showing that the difference between the assembly's weight (270 N) and the normal force (267.3 N) is 2.7 N, which is the force causing the acceleration.",
    "explanation": "The total mass of the system is 2 kg + 25 kg = 27 kg, so the weight is 27 x 10 = 270 N. The net force required for the downward acceleration is 27 x 0.1 = 2.7 N. According to Newton's second law, weight minus the normal force equals the net force. Therefore, the normal force must be 270 N - 2.7 N = 267.3 N, confirming that the 2.7 N net force is responsible for the observed acceleration.",
    "topic": "Numerical Calculation - Net Force",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen391"
  },
  {
    "question_text": "Design an experiment based on free-body diagrams to measure the action force of a system on a floor. Briefly outline the procedure and explain the calculations needed to deduce the force from the observed acceleration. Assume you have a block and a cylinder available.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Set up the experiment by placing a wooden block on a soft horizontal floor. First, measure the normal force on the block alone by ensuring it is at rest (which should equal its weight). Then, place a cylinder on top of the block and allow the floor to yield gradually, measuring the acceleration of the assembled system using motion sensors. Draw free-body diagrams for the block and cylinder system to illustrate the forces acting on it, including gravitational force and the normal force. Calculate the total weight of the system using the masses of the block and cylinder, and apply Newton's second law (weight - normal force = mass x acceleration) to determine the normal force after yielding. The action force on the floor is equal to this calculated normal force.",
    "explanation": "The experiment involves comparing the system before and after adding the cylinder. By measuring the change in acceleration, one can compute the net force acting on the system. Using the free-body diagram helps clearly separate the forces and ensures that Newton's laws are applied correctly to deduce the normal force, which is equal to the action force exerted on the floor.",
    "topic": "Experimental Design in Mechanics",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "12_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen392"
  }
]