[
  {
    "question_text": "Which of the following best describes a scalar quantity?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A quantity with both magnitude and direction",
      "A quantity with magnitude only",
      "A quantity that can be added using the triangle law",
      "A quantity that requires a coordinate system for its definition"
    ],
    "correct_answer": "A quantity with magnitude only",
    "explanation": "A scalar quantity is completely described by its magnitude and unit, without any associated direction. Examples include mass, temperature, time, and distance between two points.",
    "topic": "Scalars and Vectors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen035"
  },
  {
    "question_text": "Two vectors are said to be equal if they have which of the following characteristics?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The same magnitude only",
      "The same direction only",
      "Both the same magnitude and the same direction",
      "The same units regardless of magnitude"
    ],
    "correct_answer": "Both the same magnitude and the same direction",
    "explanation": "Vectors are equal only if both their magnitudes and their directions are identical. Shifting a vector parallel to itself does not affect its equality as long as these properties are preserved.",
    "topic": "Equality of Vectors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen036"
  },
  {
    "question_text": "How is a vector typically represented in handwritten notes?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "By underlining the letter representing it",
      "By writing the letter in bold face",
      "By placing an arrow over the letter",
      "By writing the letter in italics"
    ],
    "correct_answer": "By placing an arrow over the letter",
    "explanation": "While textbooks may show vectors in bold, when writing by hand, an arrow is drawn over the letter to indicate that it is a vector.",
    "topic": "Representation of Vectors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen037"
  },
  {
    "question_text": "Which of the following is NOT considered a scalar quantity?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Distance",
      "Mass",
      "Temperature",
      "Displacement"
    ],
    "correct_answer": "Displacement",
    "explanation": "Displacement is a vector quantity because it has both magnitude and direction, unlike distance, mass, or temperature, which are scalars.",
    "topic": "Scalars and Vectors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen038"
  },
  {
    "question_text": "Given that the displacement vector is defined as the straight line joining initial and final positions, which of the following statements is true?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "The displacement vector always equals the path length traveled",
      "The magnitude of the displacement is always greater than the path length",
      "The magnitude of the displacement is less than or equal to the path length",
      "The displacement vector is independent of the initial and final positions"
    ],
    "correct_answer": "The magnitude of the displacement is less than or equal to the path length",
    "explanation": "The displacement vector represents the straight line between two points and its magnitude will be less than or equal to the actual path length taken, since the actual path may include curves.",
    "topic": "Position and Displacement Vectors",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen039"
  },
  {
    "question_text": "Define a scalar quantity and provide two examples mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A scalar quantity is one that has magnitude only, without any associated direction. Examples include the mass of an object and the temperature of a body.",
    "explanation": "Scalars are quantities that are completely specified by a numerical value and its unit. The text provides examples such as temperature, mass, distance, and time.",
    "topic": "Scalars",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen040"
  },
  {
    "question_text": "Describe how vectors are represented in textbooks and when written by hand.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "In textbooks, vectors are usually represented in bold face type. However, when written by hand, vectors are commonly denoted by placing an arrow over the letter representing the vector.",
    "explanation": "The textbook explains that although bold face types are used for vectors in print, the common practice in handwritten notes is to place an arrow over the letter to indicate it is a vector.",
    "topic": "Representation of Vectors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen041"
  },
  {
    "question_text": "Explain the concept of a displacement vector and contrast it with the total path length traveled by an object.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A displacement vector is the straight line connecting the initial and final positions of an object, reflecting only the net change in position. In contrast, the total path length is the actual distance traveled along the path, which may be curved or irregular and is always greater than or equal to the magnitude of the displacement.",
    "explanation": "The displacement vector gives the shortest distance between two points, whereas the path length accounts for every twist and turn along the journey, making it either equal to or longer than the displacement.",
    "topic": "Position and Displacement Vectors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen042"
  },
  {
    "question_text": "What does it mean for two vectors to be equal? List the conditions that must be met.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Two vectors are equal if and only if they have the same magnitude and the same direction. This means that if one vector is shifted parallel to itself such that its tail coincides with the other, then their tips will also coincide.",
    "explanation": "Equality of vectors is determined solely by their magnitude and direction. Their position in space does not matter, as long as these two properties are identical.",
    "topic": "Equality of Vectors",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen043"
  },
  {
    "question_text": "Discuss the differences between scalar and vector quantities. Include definitions, examples, and the basic rules of operations for each.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Scalar quantities possess magnitude only and are fully described by a numerical value along with its unit, such as mass, temperature, or distance. Operations with scalars follow the rules of ordinary algebra (addition, subtraction, multiplication, division). In contrast, vector quantities have both magnitude and direction. Common vectors include displacement, velocity, and force, and they are added using the triangle or parallelogram laws. Examples from the text include the temperature of a body (scalar) and displacement (vector).",
    "explanation": "A clear understanding of the fundamental differences between scalars and vectors is essential in physics. Scalars need only numbers and units, whereas vectors require magnitude and directional information. The addition of scalars involves simple arithmetic, while vector addition employs geometric rules like the triangle law or parallelogram law to account for direction.",
    "topic": "Scalars and Vectors",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen044"
  },
  {
    "question_text": "Explain the role of the position vector in describing motion in a plane, and how the displacement vector is derived from position vectors.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The position vector of an object is used to describe its location relative to a chosen origin in a coordinate system. It is directed from the origin to the object’s position, and its magnitude represents the distance from the origin. When an object moves, its initial and final positions can be represented by two position vectors. The displacement vector is then obtained by drawing a straight line from the initial to the final position. This vector reflects the net change in position independent of the actual path taken.",
    "explanation": "By choosing an origin, every location in the plane can be uniquely determined using a position vector. The concept of displacement as the difference between two position vectors allows a simplification of motion analysis, focusing on the overall change in location rather than the specific trajectory.",
    "topic": "Position and Displacement Vectors",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen045"
  },
  {
    "question_text": "Analyze how the concept of free vectors versus localized vectors influences the treatment of forces in a physical system. Provide examples and explain their importance.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Free vectors are those whose effect does not depend on their location; they can be shifted parallel to themselves without changing their physical meaning. In contrast, localized vectors have a specific point of application. When analyzing forces, free vectors simplify calculations by allowing forces to be moved to a common point for vector addition, while localized vectors are critical in determining moments and torques. For example, while the weight of an object is often treated as a free vector for equilibrium analysis, its point of application matters when calculating the torque about a pivot.",
    "explanation": "Understanding the distinction between free and localized vectors is essential, especially in mechanics. Free vectors allow for simplified vector addition because their point of application is irrelevant when calculating net force. However, in scenarios involving rotational effects, such as torques, the exact line of action (localized aspect) of the vector becomes crucial.",
    "topic": "Representation of Vectors",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen046"
  },
  {
    "question_text": "True or False: A scalar quantity is completely specified by a numerical value and its corresponding unit.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Scalars have no direction and are described completely by their magnitude and unit, which makes the statement true.",
    "topic": "Scalars",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen047"
  },
  {
    "question_text": "True or False: Shifting a vector parallel to itself alters its magnitude.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Shifting a vector parallel to itself does not change its magnitude or direction. It remains the same vector, which makes the statement false.",
    "topic": "Equality of Vectors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen048"
  },
  {
    "question_text": "True or False: For two vectors to be considered equal, their tails and tips must coincide when one is shifted parallel to the other.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "For two vectors to be equal, after shifting one parallel to the other, the corresponding tails and tips must coincide, indicating they have the same magnitude and direction.",
    "topic": "Equality of Vectors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen049"
  },
  {
    "question_text": "A rectangle has a length of 1.0 m and a breadth of 0.5 m. Calculate its perimeter.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "3.0 m",
    "explanation": "The perimeter is calculated by adding all the sides of the rectangle: 1.0 m + 0.5 m + 1.0 m + 0.5 m = 3.0 m. Thus, the perimeter is 3.0 meters.",
    "topic": "Scalars",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen050"
  },
  {
    "question_text": "On a particular day, the maximum temperature was 35.6 °C and the minimum temperature was 24.2 °C. Find the difference in temperature.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "11.4 °C",
    "explanation": "The difference in temperature is calculated by subtracting the minimum from the maximum: 35.6 °C - 24.2 °C = 11.4 °C.",
    "topic": "Scalars",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen051"
  },
  {
    "question_text": "An aluminium cube has a side length of 10 cm and a mass of 2.7 kg. Calculate its volume in cubic meters and its density in kg/m³.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Volume = 0.001 m³, Density = 2700 kg/m³",
    "explanation": "First, convert the side length: 10 cm = 0.1 m. The volume is then 0.1 m x 0.1 m x 0.1 m = 0.001 m³. Density is mass divided by volume, so 2.7 kg ÷ 0.001 m³ = 2700 kg/m³.",
    "topic": "Position and Displacement Vectors",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen052"
  },
  {
    "question_text": "If an object travels along a curved path measuring 7.0 m but its displacement is only 5.0 m, calculate the difference between the path length and the magnitude of the displacement.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "2.0 m",
    "explanation": "The difference is found by subtracting the displacement from the path length: 7.0 m - 5.0 m = 2.0 m. This shows that the displacement (straight-line distance) is less than the total path length traveled.",
    "topic": "Position and Displacement Vectors",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen053"
  },
  {
    "question_text": "Two vectors A and B have magnitudes of 4.0 and 3.0 respectively and form a 90° angle. Using the parallelogram law, calculate the magnitude of their resultant vector.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "5.0",
    "explanation": "For vectors forming a right angle, the resultant magnitude is found using the Pythagorean theorem: Resultant = square root of (4.0² + 3.0²) = square root of (16 + 9) = square root of 25 = 5.0. Hence, the resultant vector has a magnitude of 5.0 units.",
    "topic": "Scalars and Vectors",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph103",
    "section_id": "02_section_3_2",
    "question_id": "cbse_xi_keph1dd_c103_gen054"
  }
]