[
  {
    "question_text": "In which of the following examples of motion can the body be considered approximately a point object: (a) a railway carriage moving without jerks between two stations; (b) a monkey sitting on top of a man cycling smoothly on a circular track; (c) a spinning cricket ball that turns sharply on hitting the ground; (d) a tumbling beaker that has slipped off the edge of a table.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "a) Railway carriage",
      "b) Monkey on cycling man",
      "c) Spinning cricket ball",
      "d) Tumbling beaker"
    ],
    "correct_answer": "a and b",
    "explanation": "Objects can be treated as point objects when their linear dimensions are negligible compared to the overall distance they travel during the motion. In the case of a railway carriage moving smoothly and a monkey seated on a cycling man (both moving on nearly straight paths with displacement far exceeding their sizes), the point particle approximation is valid. By contrast, a spinning cricket ball and a tumbling beaker involve significant rotational or tumbling motions where the extended nature cannot be neglected.",
    "topic": "Point object approximation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex001"
  },
  {
    "question_text": "The position-time (x-t) graphs for two children A and B returning from their school O to their homes P and Q respectively are shown in Fig. 2.9. Choose the correct entries in the brackets below:\n(a) (A/B) lives closer to the school than (B/A)\n(b) (A/B) starts from the school earlier than (B/A)\n(c) (A/B) walks faster than (B/A)\n(d) A and B reach home at the (same/different) time\n(e) (A/B) overtakes (B/A) on the road (once/twice).",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Option 1: A lives closer, A starts earlier, B walks faster, they reach home at the same time, B overtakes A once",
      "Option 2: B lives closer, B starts earlier, B walks faster, they reach home at the same time, B overtakes A once",
      "Option 3: A lives closer, B starts earlier, B walks faster, they reach home at different times, B overtakes A twice",
      "Option 4: B lives closer, A starts earlier, A walks faster, they reach home at different times, A overtakes B once"
    ],
    "correct_answer": "Option 1: A lives closer, A starts earlier, B walks faster, they reach home at the same time, B overtakes A once",
    "explanation": "Based on the given description of the figure, child A (blue line) starts at the origin (implying the school is at A’s starting point) and has a smaller overall displacement to home, meaning A’s home is closer to school. Child B starts at a point already farther along the x-axis and has a steeper (greater slope) line indicating a higher walking speed. Their paths intersect only once, which signifies that B overtakes A once, and they reach home simultaneously.",
    "topic": "Interpreting position-time graphs",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex002"
  },
  {
    "question_text": "A woman starts from her home at 9:00 am, walks with a speed of 5 km/h on a straight road up to her office 2.5 km away, stays at the office until 5:00 pm, and returns home by an auto with a speed of 25 km/h. Choose suitable scales and plot the x-t graph of her motion.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The graph should show an initial linear segment with a gentle slope from 9:00 am to 9:30 am (covering 2.5 km at 5 km/h), a horizontal segment from 9:30 am to 5:00 pm (standing still at the office), and a steep linear segment from 5:00 pm onward representing the return journey at 25 km/h until she reaches home.",
    "explanation": "The first segment represents uniform motion at 5 km/h over 2.5 km, taking 30 minutes. The second segment is a flat (constant position) interval during office hours. The third segment is a quicker return journey at 25 km/h. The proper choice of scales on the time axis (e.g., hours) and position axis (km) will clearly illustrate these three distinct periods of motion.",
    "topic": "Graphical representation of motion",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex003"
  },
  {
    "question_text": "A drunkard walking in a narrow lane takes 5 steps forward and 3 steps backward, followed by 5 steps forward and 3 steps backward, and so on. Each step is 1 m long and takes 1 s. Plot the x-t graph of his motion. Determine graphically and by calculation how long the drunkard takes to fall in a pit 13 m away from the start.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The net displacement per cycle (5 steps forward minus 3 steps backward) is 2 m and takes 8 s. To cover 13 m, he must complete 6 full cycles (12 m) in 48 s, then an additional 1 m in 1 s, totaling 49 s.",
    "explanation": "Each cycle yields a net forward movement of 2 m in 8 s. After 6 cycles he has traveled 12 m in 48 s. The remaining 1 m takes 1 s. The x-t graph will show a step-like, sawtooth pattern and the fall occurs when the position reaches 13 m, i.e., after 49 seconds.",
    "topic": "Graphical analysis of repetitive motion",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex004"
  },
  {
    "question_text": "A car moving along a straight highway with a speed of 126 km/h is brought to a stop within a distance of 200 m. What is the retardation of the car (assumed uniform), and how long does it take for the car to stop?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Retardation is approximately 3.06 m/s² (deceleration is -3.06 m/s²) and the time to stop is about 11.43 s.",
    "explanation": "First, convert 126 km/h to about 35 m/s. Using the kinematic equation v² = v0² + 2ax with final velocity 0 gives a = - (35²)/(2 × 200) ≃ -1225/400 ≃ -3.06 m/s². The time is then calculated as t = v0/|a| ≃ 35/3.06 ≃ 11.43 s.",
    "topic": "Uniformly accelerated motion",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex005"
  },
  {
    "question_text": "A player throws a ball upwards with an initial speed of 29.4 m/s. (a) What is the direction of acceleration during the upward motion of the ball? (b) What are the velocity and acceleration of the ball at the highest point of its motion? (c) With x = 0 m and t = 0 s taken to be the location and time of the ball at its highest point, and the vertically downward direction taken as the positive x-axis, give the signs of position, velocity, and acceleration of the ball during its upward and downward motion. (d) To what height does the ball rise and after how long does the ball return to the player's hands? (Take g = 9.8 m/s² and neglect air resistance.)",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) The acceleration is downward. (b) At the highest point, the velocity is 0 m/s and the acceleration remains 9.8 m/s² downward. (c) With the chosen coordinate system (downward positive), during the upward motion the ball has a negative displacement and velocity while the acceleration is positive; during the downward motion, all three (position relative to the highest point, velocity, and acceleration) are positive. (d) The ball rises an additional 44.1 m above the highest point and the total time of flight is 6 s.",
    "explanation": "Gravity always acts downward with an acceleration of 9.8 m/s². At the top, the instantaneous velocity is zero while the acceleration remains constant. When using a coordinate system with the upward direction as negative, the ball’s displacement and velocity are negative when moving upward and become positive when descending. The maximum additional height is given by (29.4²)/(2×9.8) ≃ 44.1 m and the time to rise is 29.4/9.8 = 3 s; thus, total flight time is 2 × 3 s = 6 s.",
    "topic": "Projectile motion",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex006"
  },
  {
    "question_text": "Read each statement below carefully and state with reasons and examples if it is true or false:\n(a) A particle in one-dimensional motion with zero speed at an instant may have non-zero acceleration at that instant.\n(b) A particle with zero speed may have non-zero velocity.\n(c) A particle with constant speed must have zero acceleration.\n(d) A particle with a positive value of acceleration must be speeding up.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": [
      "True",
      "False"
    ],
    "correct_answer": "(a) True; (b) False; (c) True (in one-dimensional motion); (d) False",
    "explanation": "(a) Even if a particle momentarily stops (speed = 0), the acceleration (rate of change of velocity) can be non-zero. (b) Zero speed means the instantaneous velocity is zero, so it cannot simultaneously have a non-zero velocity. (c) In one-dimensional motion with constant speed (and motion in a fixed direction), the velocity is constant so the acceleration is zero. (d) Positive acceleration does not necessarily mean the particle is speeding up; if the velocity is negative, a positive acceleration actually reduces the speed.",
    "topic": "Basic concepts in kinematics",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex007"
  },
  {
    "question_text": "A ball is dropped from a height of 90 m on a floor. At each collision with the floor, the ball loses one tenth of its speed. Plot the speed-time graph of its motion between t = 0 and t = 12 s.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The speed-time graph will show segments corresponding to free-fall under gravity (with speed increasing as per v = 9.8t m/s until impact), followed by instantaneous drops in speed at each bounce (retaining 90% of the impact speed), then another free-fall segment. The overall graph will be piecewise with discontinuities at each bounce, repeated over the 12 s interval.",
    "explanation": "When dropped, the ball accelerates under gravity until it hits the floor. At impact, the speed reduces to 90% of its value because it loses one tenth of its speed. Subsequent bounces follow the same pattern, with free-fall motion between collisions. The graph will therefore consist of rising curves (following the square root time dependence from v^2 = 2gh) interspersed with sudden drops.",
    "topic": "Free fall with energy loss",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex008"
  },
  {
    "question_text": "Explain clearly, with examples, the distinction between: (a) the magnitude of displacement (sometimes called distance) over an interval of time and the total length of path covered by a particle over the same interval; (b) the magnitude of average velocity over an interval of time and the average speed over the same interval. Show in each case that the total path length or average speed is greater than or equal to the magnitude of displacement or average velocity, and state when equality holds. (Consider one-dimensional motion only.)",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Displacement is the straight-line difference between the initial and final positions (a vector), while the total path length is the sum of all distances travelled regardless of direction. Consequently, the magnitude of average velocity (displacement/time) is less than or equal to the average speed (total distance/time), with equality only when the motion is in one direction without any reversal.",
    "explanation": "For example, if a particle moves 5 m forward and then 3 m backward, the displacement is 2 m but the path length is 8 m. Similarly, the average speed (8 m divided by the total time) is always greater than or equal to the magnitude of the average velocity (2 m divided by the total time). The equality holds only when the particle moves without changing direction.",
    "topic": "Distance vs displacement and speed vs velocity",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex009"
  },
  {
    "question_text": "A man walks on a straight road from his home to a market 2.5 km away with a speed of 5 km/h. Finding the market closed, he instantly turns and walks back home with a speed of 7.5 km/h. What are (a) the magnitude of his average velocity and (b) his average speed over the time intervals: (i) 0 to 30 min, (ii) 0 to 50 min, (iii) 0 to 40 min?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(i) In 30 min (0.5 h), he covers 2.5 km to the market, so average velocity = 2.5/0.5 = 5 km/h and average speed is also 5 km/h. (ii) In 50 min (0.833 h), he has walked to the market in 0.5 h and returned 0.333 h at 7.5 km/h (covering 2.5 km), so his net displacement is zero and average velocity is 0 km/h, while average speed is (2.5 + 2.5)/0.833 ≈ 6 km/h. (iii) In 40 min (0.667 h), after reaching the market, he has been on his return for 10 min (0.167 h) covering 1.25 km; thus, displacement = 2.5 - 1.25 = 1.25 km, so average velocity = 1.25/0.667 ≈ 1.87 km/h, and average speed = (2.5 + 1.25)/0.667 ≈ 5.63 km/h.",
    "explanation": "The key is to distinguish between displacement (net change in position) and the total distance traveled. When the man returns, part of his motion cancels out in terms of displacement but still adds to the total distance. Therefore, his average speed (total distance/time) is higher than the magnitude of his average velocity (displacement/time) when he does not return to his starting point.",
    "topic": "Average speed vs average velocity",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex010"
  },
  {
    "question_text": "In Exercises 2.9 and 2.10, we saw the distinction between average speed and the magnitude of average velocity. Explain why no such distinction is necessary when considering instantaneous speed and the magnitude of instantaneous velocity.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Because instantaneous speed is defined as the absolute value of the instantaneous velocity, they are inherently the same.",
    "explanation": "At any given instant, the speed of a particle is the magnitude of its velocity. Unlike averages calculated over an interval (where direction reversals can lead to a lower net displacement), the instantaneous measure always considers the absolute value, so there is no difference.",
    "topic": "Instantaneous speed and velocity",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex011"
  },
  {
    "question_text": "Look at the graphs (a) to (d) (Fig. 2.10) carefully and state, with reasons, which of these cannot possibly represent one-dimensional motion of a particle.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The graph that shows non-monotonic position changes or discontinuities that are inconsistent with continuous one-dimensional motion cannot represent one-dimensional motion.",
    "explanation": "One-dimensional motion must show a continuous and single-valued function for position with respect to time. Any graph that exhibits features such as loops or multiple values for a given time cannot represent motion along a single straight line.",
    "topic": "Graph interpretation in kinematics",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex012"
  },
  {
    "question_text": "Figure 2.11 shows the x-t plot of one-dimensional motion of a particle. Is it correct to say from the graph that the particle moves in a straight line for t < 0 and on a parabolic path for t > 0? If not, suggest a suitable physical context for this graph.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It is not correct to conclude that the particle follows a parabolic path in a spatial sense because an x-t graph represents position as a function of time for one-dimensional motion. The graph likely indicates motion with uniform acceleration. A suitable interpretation is that the particle is moving along a straight line but with accelerated motion, resulting in a curved (parabolic) x-t curve.",
    "explanation": "In one-dimensional kinematics, the path is always a straight line in space. A parabolic x-t graph merely reflects the mathematical relationship of displacement under constant acceleration. Thus, the graph is not showing a two-dimensional parabola, but the characteristic curve of uniformly accelerated motion along a straight line.",
    "topic": "Interpreting x-t graphs",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex013"
  },
  {
    "question_text": "A police van moving on a highway with a speed of 30 km/h fires a bullet at a thief's car speeding away in the same direction with a speed of 192 km/h. If the muzzle speed of the bullet is 150 m/s, with what speed does the bullet hit the thief's car? (Obtain the speed relevant for damaging the thief's car.)",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 105 m/s.",
    "explanation": "First, convert the police van's speed (30 km/h) to about 8.33 m/s and the thief’s car speed (192 km/h) to about 53.33 m/s. If the bullet is fired from the van at 150 m/s relative to the van, its speed relative to the ground is approximately 150 + 8.33 = 158.33 m/s. The relative speed of the bullet with respect to the thief's car is 158.33 m/s - 53.33 m/s ≃ 105 m/s, which is the effective speed for damage.",
    "topic": "Relative motion",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex014"
  },
  {
    "question_text": "Figure 2.13 gives the x-t plot of a particle executing one-dimensional simple harmonic motion. Give the signs of the position, velocity, and acceleration variables of the particle at t = 0.3 s, 1.2 s, and -1.2 s.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A typical answer is: at t = 0.3 s, assume the particle is above equilibrium so position is positive, velocity is positive (if moving away from equilibrium), and acceleration is negative (directed toward equilibrium); at t = 1.2 s, the particle is below equilibrium so position is negative, velocity is negative, and acceleration is positive; at t = -1.2 s, the particle’s position is the same as at t = 1.2 s (negative) due to symmetry, but the velocity is positive and acceleration is positive.",
    "explanation": "In simple harmonic motion, acceleration is always opposite in sign to the displacement (a = -ω²x). The signs of velocity depend on whether the particle is moving toward or away from the equilibrium position. By symmetry, the values at t = 1.2 s and t = -1.2 s are related, with velocities being of opposite sign if the displacement is the same.",
    "topic": "Simple harmonic motion",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex015"
  },
  {
    "question_text": "Figure 2.14 gives the x-t plot of a particle in one-dimensional motion. Three equal intervals of time are shown. In which interval is the average speed greatest, and in which is it the least? Also, give the sign of the average velocity for each interval.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The interval with the steepest slope (largest |Δx/Δt|) corresponds to the greatest average speed; the interval with the shallowest slope corresponds to the least average speed. The sign of the average velocity in each interval is determined by the sign (positive or negative) of the slope in that interval.",
    "explanation": "Average speed is the absolute value of the slope of the x-t graph, while average velocity includes the sign. By comparing the slopes of the segments shown, one can identify which segment has the highest rate of change in position (greatest speed) and note the direction of motion from the sign of the slope.",
    "topic": "Graphical analysis of motion",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex016"
  },
  {
    "question_text": "Figure 2.15 gives a speed-time graph of a particle in motion along a constant direction. Three equal intervals of time are shown. In which interval is the average acceleration greatest in magnitude? In which interval is the average speed greatest? Choosing the positive direction as the constant direction of motion, give the signs of velocity and acceleration in the three intervals. Also, determine the accelerations at points A, B, C, and D.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The interval with the steepest change in speed has the greatest magnitude of average acceleration, and the interval with the highest speed values has the greatest average speed. Since the motion is along a constant positive direction, the velocities are positive overall. The sign of the acceleration in each interval depends on whether the speed is increasing (positive acceleration) or decreasing (negative acceleration). At points A, B, C, and D, the instantaneous accelerations are equal to the slopes of the speed-time graph at those points.",
    "explanation": "By calculating the slopes (Δspeed/Δtime) over each interval in the speed-time graph, one can determine the average accelerations. The interval with the maximum slope (steepest rise or fall) corresponds to the greatest average acceleration magnitude. The average speed in each interval is given by the average of the speed values, and the sign of velocity is positive as the particle moves in one constant direction. For points A, B, C, and D, compute the instantaneous rate of change to obtain the accelerations.",
    "topic": "Analysis of speed-time graphs",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "keph102",
    "question_id": "cbse_xi_keph1dd_c102_ex017"
  }
]