[
  {
    "question_text": "Which of the following best describes a free-body diagram as used in mechanics problems?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A diagram that shows all forces acting on the chosen system from the external environment",
      "A diagram that includes both internal and external forces acting on the entire assembly",
      "A diagram that represents the motion of the system without any forces",
      "A diagram that only shows gravitational forces acting on a system"
    ],
    "correct_answer": "A diagram that shows all forces acting on the chosen system from the external environment",
    "explanation": "A free-body diagram is drawn for the chosen system to depict all forces exerted on it by other parts of the assembly and external agencies. It purposely excludes forces that the system exerts on the environment.",
    "topic": "Solving Problems in Mechanics",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen362"
  },
  {
    "question_text": "According to Newton's third law, if object A exerts a force F on object B, what must be true about the force exerted by object B on object A?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It is greater in magnitude than F",
      "It is identical in magnitude and opposite in direction to F",
      "It is equal in direction but opposite in magnitude to F",
      "It is zero if the objects are in equilibrium"
    ],
    "correct_answer": "It is identical in magnitude and opposite in direction to F",
    "explanation": "Newton's third law states that for every action force there is an equal and opposite reaction force. Therefore, the force on object A by object B is equal in magnitude to the force F, but in the opposite direction.",
    "topic": "Newton's Third Law and Action-Reaction Pairs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen363"
  },
  {
    "question_text": "When constructing a free-body diagram for a chosen system, which of the following forces should NOT be included?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Forces exerted on the system by other objects",
      "Gravitational forces acting on the system",
      "Forces exerted by the system on its environment",
      "Normal forces acting on the system"
    ],
    "correct_answer": "Forces exerted by the system on its environment",
    "explanation": "In a free-body diagram, you only include forces acting on the system, not the forces that the system exerts on its surroundings. This distinction is crucial for correctly applying Newton's laws.",
    "topic": "Free-Body Diagram Construction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen364"
  },
  {
    "question_text": "In Example 4.12(a), a wooden block of mass 2 kg is at rest on a floor. What is the action of the block on the floor?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "20 N upward",
      "20 N downward",
      "0 N, since the block is at rest",
      "2 N downward"
    ],
    "correct_answer": "20 N downward",
    "explanation": "The block experiences a gravitational force of 2 kg × 10 m/s² = 20 N downward. Since the block is at rest, the normal force from the floor equals 20 N upward, and by Newton's third law, the action (force of the block on the floor) is 20 N downward.",
    "topic": "Action-Reaction Pairs in Static Equilibrium",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen365"
  },
  {
    "question_text": "List the systematic steps recommended for solving problems in mechanics as described in the section.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Draw a diagram of the assembly, choose a convenient part as the system, draw a free-body diagram including all forces on the system from the environment, include known magnitudes and directions (treat others as unknown), and if necessary, choose another system applying Newton's third law.",
    "explanation": "The section outlines a five-step procedure: (i) Draw a schematic diagram of the assembly; (ii) choose a system; (iii) draw the free-body diagram showing forces on the system from external sources; (iv) include given force details and assign unknowns; and (v) repeat as needed while using Newton's third law to relate forces between systems.",
    "topic": "Systematic Problem-Solving in Mechanics",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen366"
  },
  {
    "question_text": "Explain why internal forces are not shown in a free-body diagram of a system.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Internal forces cancel out due to Newton's third law and do not affect the net force on the chosen system.",
    "explanation": "When considering a multi-body assembly, forces between parts of the system (internal forces) act in equal and opposite pairs. These do not contribute to the net force or acceleration of the system as a whole, which is why they are omitted from free-body diagrams.",
    "topic": "Free-Body Diagram Principles",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen367"
  },
  {
    "question_text": "What is the role of Newton's third law when changing the system of interest in mechanics problems?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It ensures that the force shown on one system is balanced by an equal and opposite force on the other, thereby providing correct action-reaction pairs.",
    "explanation": "When you change the system of interest, you must account for forces originally considered internal. Newton's third law helps by requiring that if you include a force on one part of the system, its counterpart acting on the other part is equal in magnitude and opposite in direction, maintaining consistency in analyzing forces.",
    "topic": "Newton's Third Law and System Selection",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen368"
  },
  {
    "question_text": "Discuss the importance of drawing free-body diagrams when solving complex mechanics problems. Use the example of the wooden block and iron cylinder as context.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Free-body diagrams simplify complex arrangements by isolating a system and clearly representing all external forces acting on it. In the wooden block and iron cylinder scenario, the diagram helps in identifying gravitational forces, normal reaction forces, and internal forces which are cancelled by Newton's third law. This methodical approach leads to properly setting up equations of motion to determine unknown quantities like the normal force and acceleration.",
    "explanation": "Drawing free-body diagrams is a fundamental step in problem-solving because it forces the problem-solver to isolate the system and focus on the relevant forces affecting its motion. In the provided example, representing the block alone and then the block-plus-cylinder system helps differentiate between forces acting on each configuration. It further emphasizes that internal forces (between the block and cylinder) are not included in the net force calculation, reducing errors and ensuring consistency with Newton's laws. Such clarity is particularly useful in multi-body interactions where forces might otherwise be double-counted or misinterpreted.",
    "topic": "Free-Body Diagrams in Complex Systems",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen369"
  },
  {
    "question_text": "Analyze the role of Newton's third law in establishing action-reaction pairs in the context of a block and cylinder system. Discuss any common misconceptions about these pairs that might arise in problem solving.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Newton's third law establishes that every force exerted by one body on another is met with an equal and opposite force, forming action-reaction pairs. In the block and cylinder example, not only do the forces between the floor and the block/system form such pairs, but also the forces between the cylinder and the block do. A common misconception is that forces acting on the same object, although equal and opposite in a state of equilibrium, form an action-reaction pair. In reality, action-reaction pairs always act on two distinct bodies.",
    "explanation": "Newton's third law is pivotal because it ensures that forces are balanced between interacting bodies. For example, the gravitational force on the system and the corresponding reaction force on the earth, and the normal force from the floor and its reaction on the system, exemplify action-reaction pairs. A frequent error occurs when students mistakenly consider the gravitational force and the normal force on the same object as an action-reaction pair, when in fact they are two separate forces acting on one body. Understanding the separation between internal forces (which cancel out) and external forces is crucial for correctly applying Newton's laws to multi-body problems.",
    "topic": "Newton's Third Law and Action-Reaction",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen370"
  },
  {
    "question_text": "True or False: In a free-body diagram, forces exerted by the environment on the system include the forces that the system exerts on the environment.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The free-body diagram for a system only shows forces acting on the system from the environment and does not include the forces the system applies to the environment.",
    "topic": "Free-Body Diagram Construction",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen371"
  },
  {
    "question_text": "True or False: The normal force is always equal in magnitude to the gravitational force acting on an object, regardless of the system’s acceleration.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While the normal force equals the gravitational force when an object is at rest, this is not true if the system is accelerating. In dynamic situations, the net force (and therefore the difference between gravitational force and normal force) must equal mass times acceleration.",
    "topic": "Normal Force in Static and Dynamic Situations",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen372"
  },
  {
    "question_text": "A wooden block of mass 2 kg is at rest on a level floor. Determine the normal force exerted by the floor on the block and the magnitude of the force the block exerts on the floor.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The normal force is 20 N upward and the block exerts a force of 20 N downward on the floor.",
    "explanation": "Since the block is at rest, it is in equilibrium. The gravitational force is mass × gravitational acceleration = 2 kg × 10 m/s² = 20 N downward. For equilibrium, the normal force must be 20 N upward. By Newton’s third law, the block exerts a force of 20 N downward on the floor.",
    "topic": "Static Equilibrium and Free-Body Diagrams",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen373"
  },
  {
    "question_text": "A 25 kg iron cylinder is placed on top of a 2 kg wooden block. When the floor yields, the combined system accelerates downward at 0.1 m/s². Calculate the normal force exerted by the floor on the system and the corresponding action of the system on the floor.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The normal force is approximately 267.3 N upward, and by Newton's third law the system exerts a force of about 267.3 N downward on the floor.",
    "explanation": "First, calculate the total weight: (2 kg + 25 kg) × 10 m/s² = 27 × 10 = 270 N downward. Since the system accelerates downward at 0.1 m/s², use Newton's second law: Net force = total weight - normal force = mass × acceleration. Thus, 270 N - R' = 27 kg × 0.1 m/s² = 2.7 N, so R' = 270 - 2.7 = 267.3 N. By Newton's third law, the force exerted by the system on the floor is 267.3 N downward.",
    "topic": "Dynamic Systems and Newton's Second Law",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen374"
  },
  {
    "question_text": "A system is subjected to an additional external 50 N force while other forces remain unchanged. Describe the steps you would take, using a free-body diagram, to determine the system's net acceleration.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Draw a free-body diagram showing all forces including the gravitational force, the normal force, and the additional 50 N external force. Then, apply Newton's second law by summing the forces in the vertical direction to determine the net force and solve for the acceleration using a = net force divided by the system's mass.",
    "explanation": "Step 1: Sketch the free-body diagram including all forces acting on the system (gravitational force, normal force, and the 50 N force). Step 2: Write the net force equation in the vertical direction, taking into account the direction of each force. Step 3: Use Newton's second law (net force = mass × acceleration) to solve for the acceleration. The analysis must correctly account for the direction of the 50 N force relative to gravitational force.",
    "topic": "Net Force and System Acceleration",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen375"
  },
  {
    "question_text": "In a free-body diagram of a system, the gravitational force is 270 N downward and the reaction force from the floor is 267.3 N upward. Calculate the net force acting on the system and the resulting acceleration. Assume the total mass of the system is 27 kg.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The net force is 2.7 N downward, resulting in an acceleration of 0.1 m/s² downward.",
    "explanation": "Net force = gravitational force - normal force = 270 N - 267.3 N = 2.7 N downward. Using Newton's second law, acceleration a = net force / mass = 2.7 N / 27 kg = 0.1 m/s² downward. This confirms the given acceleration and illustrates proper use of free-body diagram data and Newton's laws.",
    "topic": "Dynamic Equilibrium and Newton's Second Law",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "keph104",
    "section_id": "11_section_4_11",
    "question_id": "cbse_xi_keph1dd_c104_gen376"
  }
]