[
  {
    "question_text": "An athlete completes one round of a circular track of diameter 200 m in 40 s. What will be the distance covered and the displacement at the end of 2 minutes 20 s?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Distance covered = 700π m (approximately 2200 m) and displacement = 200 m.",
    "explanation": "The radius r = 200/2 = 100 m, so the circumference (distance for one round) is 2πr = 200π m. The total time of 2 min 20 s equals 140 s, meaning the athlete completes 140/40 = 3.5 rounds. Multiplying one round’s distance by 3.5 gives 3.5 × 200π = 700π m. After 3.5 rounds on a circular track, the athlete ends at the point diametrically opposite to the starting point; hence, the displacement is equal to the diameter, 200 m.",
    "topic": "Uniform Circular Motion & Kinematics",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex001"
  },
  {
    "question_text": "Joseph jogs from one end A to the other end B of a straight 300 m road in 2 minutes 30 seconds and then turns around and jogs 100 m back to point C in another 1 minute. What are Joseph’s average speeds and average velocities in jogging (a) from A to B and (b) from A to C?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) From A to B: Average speed = 300 m / 150 s = 2 m/s, and average velocity = 2 m/s (since displacement = 300 m). (b) From A to C: Total distance = 300 m + 100 m = 400 m, and total time = 150 s + 60 s = 210 s, so average speed ≈ 1.90 m/s; displacement = 300 m – 100 m = 200 m, hence average velocity ≈ 200 m / 210 s ≈ 0.95 m/s.",
    "explanation": "For segment (a), the distance and displacement are both 300 m covered in 150 s (2 minutes 30 s). For segment (b), although the total path length is 400 m, Joseph reverses direction during the jog; his net displacement is the difference between the forward and backward parts (300 m forward minus 100 m backward = 200 m). Average speed is calculated by dividing the total distance by total time, while average velocity is computed by dividing the net displacement by total time.",
    "topic": "Average Speed and Average Velocity",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex002"
  },
  {
    "question_text": "Abdul, while driving to school, computes the average speed for his trip to be 20 km/h. On his return trip along the same route, there is less traffic and the average speed is 30 km/h. What is the average speed for Abdul’s round trip?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The average speed for the round trip is 24 km/h.",
    "explanation": "Let the one-way distance be d. Time for the first part is t₁ = d/20 and for the second part is t₂ = d/30. The total distance is 2d and total time is d/20 + d/30 = (3d+2d)/60 = (5d/60) = d/12. Therefore, the average speed = 2d / (d/12) = 24 km/h.",
    "topic": "Average Speed",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex003"
  },
  {
    "question_text": "A motorboat starting from rest on a lake accelerates in a straight line at a constant rate of 3.0 m/s² for 8.0 s. How far does the boat travel during this time?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The boat travels 96 m.",
    "explanation": "Using the equation s = ut + ½at² with initial velocity u = 0, acceleration a = 3.0 m/s², and time t = 8.0 s, we have s = 0 + ½ × 3.0 m/s² × (8.0 s)² = 0.5 × 3.0 × 64 = 96 m.",
    "topic": "Equations of Motion",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex004"
  },
  {
    "question_text": "A driver of a car travelling at 52 km/h applies the brakes and decelerates uniformly to a stop in 5 s. Another driver in a different car, travelling at 3 km/h, applies the brakes slowly and stops in 10 s. Plot the speed versus time graphs for the two cars on the same graph paper. Which of the two cars traveled farther after the brakes were applied?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Car 1 travels farther; it covers approximately 36 m, while Car 2 covers approximately 4.15 m.",
    "explanation": "First, convert speeds to m/s: 52 km/h ≈ 14.4 m/s and 3 km/h ≈ 0.83 m/s. The speed-time graph for each car is a straight line decreasing to zero. The distance traveled is the area under the speed-time graph (a triangle). For Car 1, area = ½ × 5 s × 14.4 m/s = 36 m; for Car 2, area = ½ × 10 s × 0.83 m/s ≈ 4.15 m. Thus, Car 1, which decelerated more rapidly from a higher speed, covers a greater distance while braking.",
    "topic": "Graphical Representation of Motion & Deceleration",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex005"
  },
  {
    "question_text": "Fig 7.10 shows the distance-time graph of three objects A, B, and C. Study the graph and answer the following: (a) Which of the three is traveling the fastest? (b) Are all three ever at the same point on the road? (c) How far has C traveled when B passes A? (d) How far has B traveled by the time it passes C?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) Object B is traveling the fastest as its graph has the steepest slope. (b) No, the three objects are not all at the same point simultaneously since their lines do not intersect at a single point. (c) To determine how far C has traveled when B passes A, identify the time at which the distance-time lines for A and B intersect, then read off the corresponding distance on C’s graph. (d) Similarly, when B passes C, note the intersection time from B and C’s graphs and determine B’s distance from the origin at that time.",
    "explanation": "Distance-time graphs are used to analyze motion. The slope of a line on such a graph gives the speed. (a) Since B's graph is steepest, it indicates the highest speed. (b) The absence of a common intersection point for all three graphs means they never coincide. (c) and (d) require precise readings from the graph: locate the intersection points of A and B, as well as B and C, then use those times to find the distance values for objects C and B respectively. This exercise tests your ability to interpret and analyze data from graphical representations.",
    "topic": "Distance-Time Graph Analysis",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex006"
  },
  {
    "question_text": "A ball is gently dropped from a height of 20 m. If its velocity increases uniformly at the rate of 10 m/s², with what velocity will it strike the ground and after what time?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The ball will strike the ground with a velocity of 20 m/s, and it will take 2 s to reach the ground.",
    "explanation": "Using the equation v² = u² + 2as with u = 0, a = 10 m/s², and s = 20 m, we get v² = 0 + 2×10×20 = 400, so v = 20 m/s. Also, using v = u + at, we have 20 = 0 + 10t, leading to t = 2 s.",
    "topic": "Equations of Motion",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex007"
  },
  {
    "question_text": "The speed-time graph for a car is shown in Fig 7.11. (a) How far does the car travel in the first 4 seconds? Shade the area that represents this distance on the graph. (b) Which part of the graph represents the uniform motion of the car?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(a) The car travels 12 m in the first 4 seconds (area of a triangle: ½ × 4 s × 6 m/s = 12 m). (b) The horizontal portion of the graph, where the speed remains constant (from approximately 4 s to 6 s), represents uniform motion.",
    "explanation": "For (a), the speed increases linearly from 0 to 6 m/s over 4 seconds, forming a triangle under the graph. The area of this triangle (½ × base × height) is ½ × 4 × 6 = 12 m, which is the distance traveled. For (b), uniform motion is indicated by a constant speed, which appears as a horizontal line segment on the graph.",
    "topic": "Velocity-Time Graphs",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex008"
  },
  {
    "question_text": "State which of the following situations are possible, and give an example for each: (a) an object with constant acceleration but with zero velocity, (b) an object moving with an acceleration but with uniform speed, and (c) an object moving in a certain direction with an acceleration in the perpendicular direction.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) Possible: For example, a ball thrown vertically upward has zero velocity at its highest point while still under the influence of gravity (acceleration = 9.8 m/s² downward). (b) Possible: An object undergoing uniform circular motion moves with constant speed while continuously accelerating due to the change in direction. (c) Possible: In uniform circular motion, the velocity is tangential to the circle while the acceleration (centripetal acceleration) is directed perpendicular to the velocity, towards the center.",
    "explanation": "In (a), even though the instantaneous velocity is zero at the peak of a vertical throw, the gravitational acceleration remains constant. In (b) and (c), uniform circular motion is an example where the speed (magnitude of velocity) is constant even though the velocity vector changes direction because the acceleration is continually changing the direction (but not the magnitude) of the velocity. These examples illustrate fundamental concepts in kinematics and dynamics.",
    "topic": "Acceleration and Motion Types",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex009"
  },
  {
    "question_text": "An artificial satellite is moving in a circular orbit of radius 42250 km. Calculate its speed if it takes 24 hours to revolve around the Earth.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The satellite’s speed is approximately 3074 m/s.",
    "explanation": "The circumference of the orbit is 2πr = 2 × π × 42250 km. The time period is 24 hours. First, calculate the speed in km/h: v = (2π × 42250) / 24 ≈ 11065 km/h. Converting to m/s: 11065 km/h × (1000 m/km) / (3600 s/h) ≈ 3074 m/s.",
    "topic": "Uniform Circular Motion",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iesc107",
    "question_id": "cbse_ix_iesc1dd_c107_ex010"
  }
]