[
  {
    "question_text": "Which statement correctly describes the function of the plasma membrane?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) It provides rigid mechanical support only",
      "B) It acts as a selectively permeable barrier, allowing and restricting substances",
      "C) It synthesizes proteins",
      "D) It stores genetic information"
    ],
    "correct_answer": "B) It acts as a selectively permeable barrier, allowing and restricting substances",
    "explanation": "The plasma membrane is a flexible, selectively permeable barrier which allows the passage of certain molecules in and out of the cell while restricting others.",
    "topic": "Plasma Membrane",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen015"
  },
  {
    "question_text": "In cellular diffusion, substances move from where to where?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) From low concentration to high concentration",
      "B) From high concentration to low concentration",
      "C) From low temperature to high temperature",
      "D) From high pressure to low pressure"
    ],
    "correct_answer": "B) From high concentration to low concentration",
    "explanation": "Diffusion is defined as the spontaneous movement of molecules from an area of high concentration to an area of low concentration.",
    "topic": "Diffusion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen016"
  },
  {
    "question_text": "Water moving through a selectively permeable membrane due to a solute concentration gradient is termed:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Filtration",
      "B) Active Transport",
      "C) Osmosis",
      "D) Endocytosis"
    ],
    "correct_answer": "C) Osmosis",
    "explanation": "Osmosis is defined as the net movement of water molecules across a selectively permeable membrane from an area of lower solute concentration to an area of higher solute concentration.",
    "topic": "Osmosis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen017"
  },
  {
    "question_text": "Which of the following describes the effect of a hypertonic solution on a cell?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) The cell swells as water enters due to high water concentration outside.",
      "B) The cell remains unchanged because water movement is equal in both directions.",
      "C) The cell shrinks as water exits due to high solute concentration outside.",
      "D) The cell bursts because of rapid water intake."
    ],
    "correct_answer": "C) The cell shrinks as water exits due to high solute concentration outside.",
    "explanation": "A hypertonic solution has a lower water concentration and higher solute concentration compared to the cell interior, causing water to leave the cell, which makes the cell shrink.",
    "topic": "Osmosis/Hypotonic-Hypertonic Solutions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen018"
  },
  {
    "question_text": "Define osmosis and describe the direction of water movement in relation to solute concentration.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Osmosis is the net diffusion of water across a selectively permeable membrane from an area of lower solute concentration to an area of higher solute concentration.",
    "explanation": "In osmosis, water molecules move spontaneously toward the area with the higher concentration of dissolved solutes in order to balance the concentrations on both sides of the membrane.",
    "topic": "Osmosis",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen019"
  },
  {
    "question_text": "What is meant by a 'selectively permeable' membrane in the context of a cell?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A selectively permeable membrane allows only certain molecules to cross it while preventing others from passing through.",
    "explanation": "This property of the membrane ensures that essential substances such as nutrients and gases enter the cell while waste products are removed, playing a critical role in cell homeostasis.",
    "topic": "Plasma Membrane",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen020"
  },
  {
    "question_text": "Explain what happens to an animal cell when placed in a hypertonic solution.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When an animal cell is placed in a hypertonic solution, water moves out of the cell, causing it to shrink.",
    "explanation": "This process occurs because the surrounding solution has a higher concentration of solutes than the cell’s interior, drawing water out through osmosis.",
    "topic": "Hypertonic Solutions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen021"
  },
  {
    "question_text": "Discuss the role of diffusion in gas exchange in cells.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Diffusion allows gases such as oxygen and carbon dioxide to move across the cell membrane from areas of high concentration to areas of low concentration.",
    "explanation": "This spontaneous process is critical for cellular respiration and metabolic activities, enabling oxygen to enter the cell where it is needed, and carbon dioxide to exit as waste.",
    "topic": "Diffusion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen022"
  },
  {
    "question_text": "Explain the processes of diffusion and osmosis in cells with examples, and detail their significance in cellular function.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Diffusion is the passive movement of molecules from areas of high concentration to low concentration, and osmosis is the specific diffusion of water. For example, oxygen diffuses into the cell and carbon dioxide diffuses out of it, while water moves into a cell in a hypotonic solution (leading to swelling) and out of a cell in a hypertonic solution (causing shrinkage).",
    "explanation": "These processes are essential for transporting gases and maintaining water balance within cells. In diffusion, no external energy is required since it is based solely on concentration gradients. Osmosis is especially critical in maintaining a balance of water and solutes to ensure proper cell function and homeostasis.",
    "topic": "Diffusion and Osmosis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen023"
  },
  {
    "question_text": "Describe the procedure and outcomes of the 'osmosis with an egg' experiment. Why does the egg swell in pure water and shrink in a concentrated salt solution?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The experiment involves dissolving the eggshell with dilute hydrochloric acid to expose the semipermeable membrane of the egg. When the egg is placed in pure water (a hypotonic solution), water enters the egg by osmosis causing it to swell. Conversely, when placed in a concentrated salt solution (a hypertonic solution), water exits the egg, leading it to shrink.",
    "explanation": "This experiment demonstrates osmotic principles. In hypotonic conditions, the concentration of water outside the egg is higher, resulting in a net influx of water. In hypertonic conditions, the solute concentration outside the egg is higher, which draws water out of the egg. This simple experiment effectively illustrates how cells interact with their environment through osmosis.",
    "topic": "Osmosis and Experimental Procedures",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen024"
  },
  {
    "question_text": "Discuss the various roles of the plasma membrane in cellular activities such as gas exchange, nutrient uptake, and endocytosis. How does its structure support these functions?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The plasma membrane is essential for maintaining cellular integrity and mediating vital activities such as gas exchange, nutrient uptake, and endocytosis. It is composed of a phospholipid bilayer with embedded proteins that provide selective permeability and flexibility. This structure allows the membrane to facilitate the diffusion of gases, transport nutrients into the cell via active and passive mechanisms, and enable endocytosis where the cell engulfs external materials. The fluid nature of the lipid bilayer is crucial in adapting to changes in the environment and in communicating with adjacent cells.",
    "explanation": "The structure of the plasma membrane, with its mixture of lipids and proteins, is fundamental to its function. The lipids provide a flexible, semi-fluid matrix, while the proteins act as channels and receptors for selective transport. These combined features support essential processes such as cellular respiration (via gas exchange), nutrient delivery, and cellular defense and communication via endocytosis.",
    "topic": "Plasma Membrane Structure and Function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen025"
  },
  {
    "question_text": "True or False: In a hypotonic solution, water always moves out of a cell.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In a hypotonic solution, the external water concentration is higher than inside the cell; therefore, water moves into the cell rather than out.",
    "topic": "Osmosis - Hypotonic Solutions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen026"
  },
  {
    "question_text": "True or False: Diffusion requires the input of energy to transport molecules from a region of high concentration to a region of low concentration.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Diffusion is a passive process that does not require energy input, as molecules naturally move from areas of high concentration to low concentration based on the concentration gradient.",
    "topic": "Diffusion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen027"
  },
  {
    "question_text": "True or False: Electron microscopes use beams of electrons to generate images, offering higher magnification and resolution than light microscopes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Electron microscopes utilize electrons instead of light and can achieve much higher magnifications and resolutions, which allow the detailed visualization of cellular ultrastructures such as membranes and organelles.",
    "topic": "Microscopy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen028"
  },
  {
    "question_text": "Make a comparison and write down ways in which plant cells are different from animal cells.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Plant cells have a cell wall made of cellulose, fixed and regular shape, large central vacuole, presence of chloroplasts and dictyosomes, and usually lack centrioles and have rare lysosomes, whereas animal cells lack a cell wall, have an irregular shape, possess small temporary vacuoles (if present), do not contain chloroplasts, have centrioles and commonly contain lysosomes.",
    "explanation": "Plant cells are characterized by additional structures such as the cell wall, chloroplasts, and a large central vacuole that animal cells lack. The cell wall gives plant cells a fixed rectangular shape, while animal cells have an amorphous shape. These differences are aligned with the specialized functions each cell type carries out, such as photosynthesis in plants and diverse functions in animal tissues.",
    "topic": "Comparison of Cell Types",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex001"
  },
  {
    "question_text": "How is a prokaryotic cell different from a eukaryotic cell?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Prokaryotic cells are generally smaller (1–10 µm), lack a true nucleus (their genetic material is in a nucleoid region), have a single circular chromosome, and do not possess membrane-bound organelles, though they do have 70S ribosomes. In contrast, eukaryotic cells are larger (5–100 µm), contain a true nucleus enclosed by a membrane with multiple linear chromosomes, and have various membrane-bound organelles such as mitochondria, endoplasmic reticulum, and Golgi apparatus. Ribosomes in the cytoplasm and rough ER are 80S (but 70S ribosomes are also found in mitochondria and chloroplasts).",
    "explanation": "This differentiation highlights key structural and functional distinctions. The absence of a nucleus and internal organelles in prokaryotes limits compartmentalization, whereas eukaryotic cells use compartmentalization to efficiently perform complex functions. Furthermore, the differences in ribosomal structure and chromosome organization are critical for their respective cellular processes and are a cornerstone of cell biology.",
    "topic": "Cell Types and Organization",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex002"
  },
  {
    "question_text": "What would happen if the plasma membrane ruptures or breaks down?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "If the plasma membrane ruptures, cell contents would leak out, the regulated transport of substances would be lost, and the cell would die.",
    "explanation": "The plasma membrane functions as a selectively permeable barrier that maintains the internal environment of the cell. Its rupture disrupts homeostasis, leading to uncontrolled leakage of ions and molecules, which quickly results in cell death.",
    "topic": "Cell Membrane Function",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex003"
  },
  {
    "question_text": "What would happen to the life of a cell if there was no Golgi apparatus?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Without the Golgi apparatus, the packaging, modification, and transport of proteins and lipids would be severely impaired. This would affect the formation of lysosomes and secretion processes, ultimately disrupting cellular function and likely causing the cell to die.",
    "explanation": "The Golgi apparatus plays a critical role in processing and sorting macromolecules necessary for cellular functions. Its absence disrupts the proper trafficking and maturation of essential proteins and lipids, compromising vital metabolic and secretory pathways.",
    "topic": "Cell Organelles – Golgi Apparatus",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex004"
  },
  {
    "question_text": "Which organelle is known as the powerhouse of the cell? Why?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Mitochondria are known as the powerhouse of the cell because they generate most of the cell's supply of ATP through cellular respiration.",
    "explanation": "Mitochondria contain enzymes and a double membrane system that facilitate the process of oxidative phosphorylation, which is essential for ATP production. This energy production is critical for various cellular activities, making mitochondria vital for cell survival and function.",
    "topic": "Cellular Organelles – Mitochondria",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex005"
  },
  {
    "question_text": "Where do the lipids and proteins constituting the cell membrane get synthesised?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Lipids are synthesised in the Smooth Endoplasmic Reticulum (SER), and proteins are synthesised on ribosomes attached to the Rough Endoplasmic Reticulum (RER).",
    "explanation": "The SER is involved in lipid synthesis and metabolism, while the RER, studded with ribosomes, is the site for protein synthesis. Together, these organelles produce the components needed for the cell membrane, ensuring its structure and functionality.",
    "topic": "Cell Organelles – Endoplasmic Reticulum",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex006"
  },
  {
    "question_text": "How does an Amoeba obtain its food?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An Amoeba obtains its food through endocytosis, specifically by extending pseudopods to surround and engulf food particles, forming food vacuoles in the process.",
    "explanation": "Endocytosis in Amoeba, often referred to as phagocytosis when ingesting larger particles, is a process where the cell membrane engulfs food material. The formed food vacuole then fuses with lysosomes for digestion. This mechanism is essential for nutrient uptake and survival in unicellular organisms.",
    "topic": "Cellular Processes – Endocytosis",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex007"
  },
  {
    "question_text": "What is osmosis?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Osmosis is the movement of water molecules across a selectively permeable membrane from an area of higher water concentration to an area of lower water concentration.",
    "explanation": "Osmosis is a type of passive transport that does not require energy. It is driven by differences in solute concentration on either side of a membrane, resulting in net movement of water until equilibrium is reached. This process is vital for maintaining cell turgidity and fluid balance.",
    "topic": "Cellular Transport – Osmosis",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex008"
  },
  {
    "question_text": "Carry out the following osmosis experiment: Take four peeled potato halves and scoos each one out to make potato cups. One of these potato cups should be made from a boiled potato. Put each potato cup in a trough containing water. Now, (a) Keep cup A empty; (b) Put one teaspoon sugar in cup B; (c) Put one teaspoon salt in cup C; (d) Put one teaspoon sugar in the boiled potato cup D. Keep these for two hours. Then observe the four potato cups and answer the following: (i) Explain why water gathers in the hollowed portion of cups B and C. (ii) Why is potato cup A necessary for this experiment? (iii) Explain why water does not gather in the hollowed-out portions of cups A and D.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(i) Water gathers in cups B and C because the solutions in those cups are hypertonic relative to the potato cells; the high solute concentration causes water to move into the potato cells by osmosis, accumulating in the hollowed portion. (ii) Cup A serves as a control to show that in the absence of an osmotic gradient, there is no significant movement of water into the potato cells. (iii) In cup A, without any added solute, there is no osmotic gradient to drive water accumulation. In cup D, the boiled potato cells have lost the integrity of their selectively permeable membranes, so osmosis cannot occur effectively.",
    "explanation": "This experiment demonstrates osmotic principles. In a hypertonic solution (cups B and C), the external solute concentration is higher than that inside the cell, drawing water into the cells and causing the cavity to fill. The control (cup A) confirms that without a solute gradient, water movement is minimal. In the boiled potato (cup D), the destruction of cell membranes due to heat prevents osmosis, showing that the integrity of the cell membrane is crucial for selective transport.",
    "topic": "Osmosis and Experimental Biology",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex009"
  },
  {
    "question_text": "Which type of cell division is required for growth and repair of the body and which type is involved in the formation of gametes?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Mitosis is responsible for growth and repair of the body, while meiosis is involved in the formation of gametes.",
    "explanation": "Mitosis produces genetically identical daughter cells for body growth and tissue repair, whereas meiosis is a specialized type of cell division that produces haploid gametes for sexual reproduction. This distinction is fundamental in understanding how organisms maintain and reproduce their cellular makeup.",
    "topic": "Cell Division – Mitosis and Meiosis",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ex010"
  },
  {
    "question_text": "Fill in the gaps in the following table illustrating differences between prokaryotic and eukaryotic cells.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1. Size: Prokaryotic cells are generally small (1–10 µm) whereas eukaryotic cells are generally large (5–100 µm).\n2. Nuclear region: Prokaryotic cells have a poorly defined or undefined nuclear region known as the nucleoid, while eukaryotic cells have a well-defined nucleus enclosed by a nuclear membrane.\n3. Chromosomes: Prokaryotic cells contain a single chromosome, whereas eukaryotic cells have multiple chromosomes.\n4. Cell organelles: Prokaryotic cells lack membrane-bound organelles, whereas eukaryotic cells possess membrane-bound organelles.",
    "explanation": "This question requires students to compare the fundamental structural differences between prokaryotic and eukaryotic cells. It tests their understanding of cell size, nuclear organization, chromosome number, and the presence or absence of membrane-bound organelles. Recognizing these differences is central to cellular biology and is often illustrated in diagrams and comparative tables in textbooks.",
    "topic": "Cellular Biology – Prokaryotic vs Eukaryotic Cells",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic005"
  },
  {
    "question_text": "Can you name the two organelles we have studied that contain their own genetic material?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Mitochondria and Plastids (Chloroplasts)",
    "explanation": "Mitochondria and plastids (specifically chloroplasts in plant cells) are unique because they contain their own genetic material (mtDNA and cpDNA, respectively). This feature supports the endosymbiotic theory, which proposes that these organelles once existed as free-living prokaryotes that were engulfed by ancestral eukaryotic cells.",
    "topic": "Cell Organelles & Genetic Material",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic006"
  },
  {
    "question_text": "If the organisation of a cell is destroyed due to some physical or chemical influence, what will happen?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The cell will not be able to perform its basic functions and ultimately it will die.",
    "explanation": "The organization of a cell, including the integrity of its nucleus, organelles, and membrane systems, is essential for its proper functioning. Disruption of this organization impairs processes such as respiration, metabolism, and waste removal. In many cases, physical or chemical damage can cause lysosomes to burst, releasing enzymes that digest cellular components, leading to cell death.",
    "topic": "Cell Structure and Function",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic007"
  },
  {
    "question_text": "Why are lysosomes known as suicide bags?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Because when the cell is damaged, lysosomes may burst, releasing potent digestive enzymes that can digest the cell's own components, leading to self-destruction.",
    "explanation": "Lysosomes contain powerful hydrolytic enzymes that are normally sequestered in a membrane-bound compartment. If the lysosomal membrane is compromised—say, due to cellular injury—these enzymes can leak out and begin digesting cellular components. This destructive process is why lysosomes have earned the nickname 'suicide bags'.",
    "topic": "Cell Organelles: Lysosomes",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic008"
  },
  {
    "question_text": "Where are proteins synthesized inside the cell?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Proteins are synthesized in the ribosomes.",
    "explanation": "Ribosomes are the cellular organelles responsible for protein synthesis. They decode messenger RNA (mRNA) sequences to assemble amino acids into polypeptide chains, forming proteins. Ribosomes can be found floating freely in the cytoplasm or attached to the rough endoplasmic reticulum, highlighting their key role in cell function.",
    "topic": "Protein Synthesis & Ribosomes",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic009"
  },
  {
    "question_text": "Which structure is clearly visible in an onion peel when observed under a compound microscope and gives the cell its rigid shape?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Nucleus",
      "Cell Wall",
      "Chloroplast",
      "Mitochondrion"
    ],
    "correct_answer": "Cell Wall – It provides a fixed boundary and supports the cell shape.",
    "explanation": "In plant cells, the cell wall is the rigid outer layer that maintains the cell’s shape and protects it. This is clearly observable in the onion peel experiment.",
    "topic": "Cell Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen001"
  },
  {
    "question_text": "Who discovered the nucleus in cells, and in what year was this discovery made?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Robert Hooke, 1665",
      "Leeuwenhoek, 1674",
      "Robert Brown, 1831",
      "Virchow, 1855"
    ],
    "correct_answer": "Robert Brown, 1831 – He was the first to identify the presence of the nucleus in the cell.",
    "explanation": "Robert Brown’s observation of the nucleus in 1831 was a critical development in understanding cell structure and contributed significantly to cell theory.",
    "topic": "Cell Discovery",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen002"
  },
  {
    "question_text": "Which of the following best explains how all cells in a living organism are produced?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Spontaneous generation",
      "Cell division",
      "Abiogenesis",
      "Fermentation"
    ],
    "correct_answer": "Cell division – Cells divide to produce new cells, ensuring that all cells originate from pre-existing cells.",
    "explanation": "According to the principle first proposed by Virchow and further supported by modern biology, all cells arise from division of pre-existing cells.",
    "topic": "Cell Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen003"
  },
  {
    "question_text": "What distinguishes unicellular organisms from multicellular organisms?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Unicellular organisms have multiple specialized cells",
      "Unicellular organisms are composed of a single cell",
      "Multicellular organisms are simpler",
      "Multicellular organisms lack a nucleus"
    ],
    "correct_answer": "Unicellular organisms are composed of a single cell – They carry out all life processes within one cell.",
    "explanation": "Unicellular organisms, such as Amoeba or bacteria, consist of a single cell that performs all the necessary functions of life. In contrast, multicellular organisms have specialized cells making up their tissues.",
    "topic": "Organism Classification",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen004"
  },
  {
    "question_text": "Define the term 'cell theory'.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Cell theory is the scientific theory which states that all living organisms are composed of one or more cells, that the cell is the basic unit of life, and that all cells arise from pre-existing cells.",
    "explanation": "Cell theory forms one of the fundamental principles of biology by highlighting the importance of the cell as the basic unit from which life develops.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen005"
  },
  {
    "question_text": "List two organelles that are found in all cells and describe their functions.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Examples include the nucleus, which houses the cell’s genetic material and directs cell activities, and the mitochondrion, which produces energy through cellular respiration.",
    "explanation": "Both the nucleus and mitochondria are present in many eukaryotic cells, where the nucleus serves as the control center, and the mitochondria provide energy necessary for cellular functions.",
    "topic": "Cell Organelles",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen006"
  },
  {
    "question_text": "Explain what a temporary mount is in microscopy and why it is used during viewing of cells.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A temporary mount is a slide preparation where a specimen is placed in a liquid medium (such as water) under a cover slip for temporary examination. It is used to keep the specimen in place, hydrated, and flat for optimal viewing under the microscope.",
    "explanation": "Temporary mounts prevent the specimen from drying out or folding, ensuring that structures remain visible. It provides sufficient time for observation and documentation but is not permanent.",
    "topic": "Microscopy Techniques",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen007"
  },
  {
    "question_text": "What differences might you observe between the cells from a leaf peel and those from a root tip? Provide at least two differences.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Leaf peel cells are typically flatter and may contain chloroplasts for photosynthesis, while root tip cells are more cuboidal or rectangular and are actively dividing, often with a higher density of nuclei indicating growth.",
    "explanation": "These differences are due to specialization: leaf cells are designed to maximize light absorption for photosynthesis, and root tip cells are structured for rapid division and growth to facilitate absorption and anchorage.",
    "topic": "Cell Specialization",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen008"
  },
  {
    "question_text": "Describe the procedure for preparing a temporary mount of an onion peel, highlighting the purpose of each major step.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "First, use forceps to peel off a layer of the onion's epidermis carefully to avoid damage; then, place the peel immediately into a watch glass with water to prevent drying. Next, transfer a small piece of the peel onto a clean glass slide with a drop of water to aid in spreading it flat. Apply a drop of safranin solution to stain the cells for better contrast, and finally place a cover slip carefully to avoid air bubbles. Each step ensures that the specimen is preserved, spread evenly, and stained sufficiently to highlight cell structures for microscopic observation.",
    "explanation": "This procedure is designed to maintain the integrity of the specimen while allowing clear visualization of cells and internal structures. The water prevents desiccation and the stain highlights critical components such as the nucleus and cell wall.",
    "topic": "Microscopy Techniques",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen009"
  },
  {
    "question_text": "Explain the concept of division of labour at the cellular level and compare it with the division of labour in a multicellular organism.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Within a cell, division of labour occurs through the specialization of organelles; for example, the mitochondria produce energy, the nucleus stores genetic material, and the ribosomes synthesize proteins. Similarly, in multicellular organisms, different cells and tissues perform specialized functions—such as muscle cells contracting to enable movement and nerve cells transmitting signals—working cooperatively to keep the organism functioning efficiently. Both levels rely on specialization to optimize functionality.",
    "explanation": "In both individual cells and complex organisms, specialization allows for efficiency and increased complexity. The compartmentalization within cells ensures that vital processes occur simultaneously and in an organized manner, mirroring how different organs work together in a larger system.",
    "topic": "Cell Function & Specialization",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen010"
  },
  {
    "question_text": "Discuss the historical development of cell theory by mentioning the contributions of key scientists and the impact of the electron microscope on our understanding of cell structure.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Cell theory began with Robert Hooke’s observation in 1665, where he first described the cell structure in cork. Later, Leeuwenhoek improved the microscope and discovered free-living cells in pond water. Robert Brown’s discovery of the nucleus in 1831 advanced the understanding of cell organization. Schleiden and Schwann formulated the cell theory in 1838-1839, proposing that all organisms are made up of cells, and Virchow later added that all cells arise from pre-existing cells in 1855. The invention of the electron microscope in the 1940s provided a much higher resolution view of the cell, revealing complex structures and organelles that were previously undetectable, thereby significantly advancing cellular biology.",
    "explanation": "The contributions of these scientists laid the foundation for modern cell biology. Each discovery built on previous findings, and technological advances such as the electron microscope have allowed us to observe cellular details and understand function and organization at a molecular level.",
    "topic": "History of Cell Theory",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen011"
  },
  {
    "question_text": "True or False: All cells in a multicellular organism are identical in structure and function.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False – Cells in multicellular organisms are specialized and differ in structure and function.",
    "explanation": "While all cells share basic components like a cell membrane, cytoplasm, and often a nucleus, they differ substantially in shape, size, and specific organelles depending on their functions.",
    "topic": "Cell Diversity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen012"
  },
  {
    "question_text": "True or False: The cell membrane is exclusive to animal cells and is absent in plant cells.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False – Both animal and plant cells possess a cell membrane; in plant cells, it lies just beneath the cell wall.",
    "explanation": "The cell membrane is a universal feature of all cells. In plant cells, the additional cell wall surrounds the cell membrane, but the membrane itself is present in all eukaryotic cells.",
    "topic": "Cell Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen013"
  },
  {
    "question_text": "True or False: According to Virchow’s addition to cell theory, every cell originates from the spontaneous generation of life rather than from a pre-existing cell.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – Virchow stated that all cells arise from pre-existing cells, not by spontaneous generation.",
    "explanation": "Virchow’s contribution to cell theory emphasized that cell division is essential to the formation of new cells. This concept is fundamental in modern biology and discredits the idea of spontaneous generation.",
    "topic": "Cell Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_ix_iesc1dd_c105_gen014"
  },
  {
    "question_text": "How do substances like CO₂ and water move in and out of the cell? Discuss.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "CO₂ moves across the cell membrane by diffusion, which is the passive movement of molecules from a region of higher concentration to one of lower concentration. In a similar manner, water moves by osmosis—a specific type of diffusion—across a selectively permeable membrane, moving from a region of high water concentration (or low solute concentration) to a region of low water concentration (or high solute concentration).",
    "explanation": "Diffusion is the process whereby molecules like CO₂ naturally move down their concentration gradient without energy expenditure. Osmosis, being a type of diffusion, involves the movement of water through the plasma membrane. This process is controlled by the selective permeability of the membrane, which allows water and certain molecules to pass while restricting others. Understanding these processes is crucial as they are fundamental to gas exchange in cells and the regulation of water content in biological systems.",
    "topic": "Cell Transport – Diffusion and Osmosis",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic003"
  },
  {
    "question_text": "Why is the plasma membrane called a selectively permeable membrane?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The plasma membrane is called a selectively permeable membrane because it permits the entry and exit of only certain substances while preventing others from crossing. This selectivity is due to its lipid bilayer structure interspersed with proteins that regulate transport.",
    "explanation": "The term 'selectively permeable' highlights the property of the plasma membrane that allows specific molecules (such as oxygen, carbon dioxide, water, and nutrients) to pass through, often by passive mechanisms like diffusion or osmosis, or via active transport when energy is needed. This selective regulation enables the cell to maintain homeostasis, controlling internal conditions despite varying external environments. The membrane’s composition, including its lipid bilayer and embedded proteins, is fundamental to its function.",
    "topic": "Cell Structure – Plasma Membrane Function",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic004"
  },
  {
    "question_text": "Who discovered cells, and how?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Robert Hooke discovered cells in 1665 while observing a thin slice of cork through his self-designed microscope. He noted the presence of honeycomb-like compartments which he termed 'cells'.",
    "explanation": "Robert Hooke’s observation of a cork slice under a primitive microscope revealed distinct compartments that resembled small rooms, leading him to call them 'cells'. This discovery was crucial in establishing the cell theory, which states that all living organisms are made up of cells. His work also highlights the importance of experimental procedures and technological advancements in scientific discovery.",
    "topic": "Cell Theory, Microscopy",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic001"
  },
  {
    "question_text": "Why is the cell called the structural and functional unit of life?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The cell is termed the structural unit of life because it forms the basic building block of all living organisms. It is also called the functional unit of life because all vital processes (such as metabolism, respiration, and excretion) occur within cells through the coordinated activity of its specialized organelles.",
    "explanation": "Each cell contains organelles that perform specific functions essential for the maintenance and survival of the organism. This dual role of cells – providing structure and carrying out necessary life functions – is demonstrated by experimental observations under the microscope (e.g., observation of the nucleus and cytoplasm) and links directly to principles in cell biology. This explanation connects the concept of cell structure with its physiological functions, underlining the cell's pivotal role in both single-celled and multicellular organisms.",
    "topic": "Cell Structure and Function, Cell Theory",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc105",
    "question_id": "cbse_ix_iesc1dd_c105_ic002"
  }
]