[
  {
    "question_text": "Which of the following describes balanced forces?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Forces that cancel each other out resulting in no change in motion",
      "B. Forces that always move an object faster",
      "C. Forces that cause objects to accelerate indefinitely",
      "D. Forces that act only in one direction"
    ],
    "correct_answer": "A. Forces that cancel each other out resulting in no change in motion",
    "explanation": "Balanced forces are equal in magnitude and opposite in direction, so they cancel each other out, resulting in no change in an object's state of motion.",
    "topic": "Balanced and Unbalanced Forces",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen001"
  },
  {
    "question_text": "When two children push a box from opposite sides with equal forces, what type of force is being applied?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Unbalanced force",
      "B. Balanced force",
      "C. Frictional force only",
      "D. Gravitational force"
    ],
    "correct_answer": "B. Balanced force",
    "explanation": "If the forces are equal in magnitude and opposite in direction, they balance each other, resulting in no net force on the box.",
    "topic": "Balanced and Unbalanced Forces",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen002"
  },
  {
    "question_text": "If a wooden block on a table is pulled by two forces of unequal magnitude from opposite sides, the block moves toward:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. The direction of the equal force",
      "B. The direction of the larger force only",
      "C. The direction of the smaller force",
      "D. Away from both forces"
    ],
    "correct_answer": "B. The direction of the larger force only",
    "explanation": "When forces are unbalanced, the net force is in the direction of the larger force, causing the block to accelerate that way.",
    "topic": "Balanced and Unbalanced Forces",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen003"
  },
  {
    "question_text": "Which statement correctly explains why a bicycle begins to slow down when you stop pedalling?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Because a balanced force is acting on it",
      "B. Because of unbalanced forces acting in the direction of motion",
      "C. Because frictional forces act opposite to the direction of motion",
      "D. Because objects require constant force to remain in motion"
    ],
    "correct_answer": "C. Because frictional forces act opposite to the direction of motion",
    "explanation": "Friction is a force that opposes motion. When you stop pedalling, friction (along with air resistance) slows the bicycle down.",
    "topic": "Friction, Balanced and Unbalanced Forces",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen004"
  },
  {
    "question_text": "Define 'balanced force' and 'unbalanced force' in your own words.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Balanced forces are forces of equal magnitude and opposite direction that cancel each other, leading to no change in motion. Unbalanced forces occur when forces are unequal, causing a net force that accelerates the object.",
    "explanation": "The definition highlights that balanced forces do not alter an object's state while unbalanced forces cause changes such as starting, stopping, or changing speed and direction.",
    "topic": "Balanced and Unbalanced Forces",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen005"
  },
  {
    "question_text": "What is friction and how does it affect the motion of objects?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Friction is a force that opposes the motion between two surfaces in contact. It can prevent motion, slow moving objects, or even bring a moving object to a stop.",
    "explanation": "Friction arises from the interactions between the surfaces of objects and plays a key role in real-world applications, such as determining whether a pushed box moves or stops.",
    "topic": "Friction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen006"
  },
  {
    "question_text": "Explain why an object moving with a constant speed has balanced forces acting on it, using the example of a bicycle.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An object moving with constant speed has balanced forces because the force propelling it is exactly counteracted by opposing forces (like friction and air resistance). For example, when a bicyclist pedals steadily, the push from the pedals and the frictional forces are equal, resulting in uniform motion.",
    "explanation": "This answer emphasizes that balanced forces yield no net acceleration, keeping the object’s speed constant as described by Newton's first law of motion.",
    "topic": "Newton's First Law & Friction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen007"
  },
  {
    "question_text": "Describe in detail how balanced and unbalanced forces affect an object's motion, including a real-life example not mentioned in the section.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Balanced forces occur when two or more forces acting on an object cancel each other out, resulting in no change in its state of motion. For instance, when a car is parked, gravity pulling it downward and the normal force from the ground pushing upward are balanced. Unbalanced forces, on the other hand, result in a net force which causes acceleration. For example, in the case of a rocket at launch, the powerful thrust force overcomes the gravitational force, causing the rocket to accelerate upward.",
    "explanation": "This explanation covers both balanced and unbalanced forces and links them to everyday examples to illustrate how forces interact to either keep an object stationary or cause changes in motion.",
    "topic": "Balanced and Unbalanced Forces",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen008"
  },
  {
    "question_text": "Explain the role of friction when pushing an object on a rough surface, detailing what happens as the applied force increases.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "When an object is pushed on a rough surface, friction acts in the opposite direction of the push. If the applied force is small, friction balances this force, and the object remains stationary. As the applied force increases but still does not exceed the frictional force, the object remains in place due to balanced forces. Once the applied force surpasses the frictional force, an unbalanced net force acts on the object, causing it to overcome static friction and start moving. The object then accelerates according to the net force, in line with Newton's second law of motion.",
    "explanation": "This answer breaks down the process of overcoming friction on rough surfaces, emphasizing how the magnitude of the applied force relative to friction determines the object's motion.",
    "topic": "Friction and Motion",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen009"
  },
  {
    "question_text": "True or False: An object will continue to move indefinitely once set in motion, even if no additional unbalanced forces are applied.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. The statement is incorrect because, in a real-world scenario, frictional forces and other resistive forces (like air resistance) eventually bring the object to a halt.",
    "explanation": "While Newton's first law states that an object will maintain its state of uniform motion in the absence of a net force, in practice, resistive forces such as friction and air resistance act as unbalanced forces that decelerate the object, eventually stopping it.",
    "topic": "Newton's First Law & Friction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen010"
  },
  {
    "question_text": "True or False: If all the forces acting on an object are balanced, the object will either remain at rest or move with constant velocity. If false, correct the statement.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True. The statement is correct because balanced forces result in no net external force, which means according to Newton's first law, the object will either remain at rest or continue moving with a constant velocity.",
    "explanation": "This is in agreement with Newton's first law of motion which asserts that in the absence of a net force, the motion of an object remains unchanged, whether at rest or moving at uniform velocity.",
    "topic": "Newton's First Law",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_ix_iesc1dd_c108_gen011"
  }
]