[
  {
    "question_text": "Which of the following is NOT an application of ultrasound as described in the section?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Cleaning odd shaped parts",
      "B. Detecting internal flaws in metal blocks",
      "C. Generating electricity from ultrasonic vibrations",
      "D. Imaging internal organs"
    ],
    "correct_answer": "C. Generating electricity from ultrasonic vibrations",
    "explanation": "The section describes the usage of ultrasounds for cleaning, flaw detection, and medical imaging but does not mention generating electricity from ultrasonic vibrations.",
    "topic": "Applications of Ultrasound",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen041"
  },
  {
    "question_text": "Ultrasonic waves are used in echocardiography. What is the primary purpose of this technique?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. To clean medical instruments",
      "B. To form images of the heart",
      "C. To detect flaws in bones",
      "D. To break kidney stones"
    ],
    "correct_answer": "B. To form images of the heart",
    "explanation": "Echocardiography uses ultrasonic waves to reflect from various parts of the heart, forming images that help in diagnosis.",
    "topic": "Medical applications of Ultrasound",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen042"
  },
  {
    "question_text": "How do ultrasonic waves help in detecting internal flaws in a metal block?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. They cause the metal to heat up and reveal cracks.",
      "B. They bend around defects and bypass them.",
      "C. They reflect back when they hit a defect.",
      "D. They pass through without any interaction with flaws."
    ],
    "correct_answer": "C. They reflect back when they hit a defect.",
    "explanation": "Ultrasonic waves are sent through a metal block and when they encounter a crack or defect, part of the wave is reflected back and detected.",
    "topic": "Ultrasound in flaw detection",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen043"
  },
  {
    "question_text": "Ultrasonography is primarily used for which of the following?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Measuring blood pressure",
      "B. Generating ultrasonic cleaning baths",
      "C. Imaging internal organs and diagnosing abnormalities",
      "D. Sensing magnetic fields in tissues"
    ],
    "correct_answer": "C. Imaging internal organs and diagnosing abnormalities",
    "explanation": "Ultrasonography uses reflected ultrasonic waves to create images of internal organs, assisting in detecting abnormalities such as tumors and stones.",
    "topic": "Ultrasonography",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen044"
  },
  {
    "question_text": "Define 'ultrasound'.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Ultrasound refers to sound waves with frequencies higher than the upper audible limit of human hearing.",
    "explanation": "Ultrasound are high frequency sound waves that are used in various applications due to their ability to travel in well-defined paths and interact with different materials.",
    "topic": "Ultrasound definition",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen045"
  },
  {
    "question_text": "Explain how ultrasonic cleaning works to remove contaminants from objects.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Ultrasonic cleaning involves immersing objects in a cleaning solution and exposing them to high-frequency ultrasonic waves, which create microscopic cavitation bubbles that detach dust, grease and dirt from the object’s surface.",
    "explanation": "The high frequency of the ultrasonic waves generates tiny bubbles in the cleaning solution that collapse, effectively loosening contaminants from the surfaces and crevices of the object.",
    "topic": "Ultrasonic cleaning",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen046"
  },
  {
    "question_text": "Discuss the principle behind the use of ultrasound in detecting internal defects in metals and compare it with ordinary sound waves.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Ultrasound uses high-frequency waves that travel along well-defined paths and reflect back when encountering a defect, whereas ordinary sound waves, with their longer wavelengths, can bend around flaws and not accurately indicate defect locations.",
    "explanation": "The reflection of high-frequency ultrasonic waves at defects makes them ideal for detecting even small flaws. In contrast, ordinary sound waves tend to diffract, reducing their effectiveness in flaw detection.",
    "topic": "Ultrasound vs. ordinary sound in flaw detection",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen047"
  },
  {
    "question_text": "Identify and briefly describe two medical applications of ultrasound mentioned in the section.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The two applications are echocardiography and ultrasonography. Echocardiography forms images of the heart by reflecting ultrasound waves from various parts, while ultrasonography creates images of internal organs to detect abnormalities such as tumors and kidney stones.",
    "explanation": "Echocardiography is used for imaging the heart while ultrasonography is employed for examining organs like the liver, gall bladder, and kidneys. Both depend on the reflection of ultrasonic waves to generate diagnostic images.",
    "topic": "Medical applications of Ultrasound",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen048"
  },
  {
    "question_text": "Describe the process by which an ultrasound scanner creates an image of an internal organ, including the role of tissue density changes.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An ultrasound scanner emits high-frequency ultrasonic waves that travel through the body and encounter tissues. At boundaries where there is a change in tissue density, some of the waves are reflected back. These reflected waves are captured by detectors, converted into electrical signals, and processed to build a visual representation of the organ. The image displays variations corresponding to different tissue types and structures.",
    "explanation": "The process begins with wave emission, followed by interaction with body tissues. Reflection occurs at interfaces with different densities. Electrical conversion and processing of the reflected signals then create a diagnostic image. This method allows non-invasive imaging of internal organs, aiding in detecting abnormalities.",
    "topic": "Ultrasound imaging process",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen049"
  },
  {
    "question_text": "Evaluate the advantages and potential limitations of using ultrasonic waves for cleaning objects in industrial applications.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Advantages of ultrasonic cleaning include its ability to reach and clean parts in hard-to-reach areas, the efficiency of removing contaminants such as dust and grease without manual scrubbing, and the high level of precision. Limitations may include the potential for damage to very delicate parts, the need for specialized cleaning solutions, and the cost of ultrasonic equipment.",
    "explanation": "Ultrasonic cleaning offers significant benefits in terms of efficiency and thoroughness due to cavitation. However, one must evaluate its suitability for different materials and components, considering that high-frequency vibrations might not be appropriate for fragile items. The cost and maintenance of ultrasonic devices also play a role in industrial decision-making.",
    "topic": "Industrial applications of Ultrasound",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen050"
  },
  {
    "question_text": "Explain how ultrasound is used to break down kidney stones and outline the mechanism by which this procedure works.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Ultrasound is used to break kidney stones by directing high-frequency waves at the stones, causing them to vibrate and fracture into smaller pieces. These small fragments can then be eliminated naturally through urine. The mechanism relies on the mechanical energy of the ultrasound waves generating stress within the stone material, leading to its disintegration.",
    "explanation": "The procedure utilizes focused ultrasonic energy to induce vibrations. The resultant stress surpasses the structural integrity of the stone, causing it to fragment. This non-invasive method is effective and minimizes injury to surrounding tissues, making it a preferred treatment in some cases.",
    "topic": "Ultrasound in medical treatment",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen051"
  },
  {
    "question_text": "True or False: Ordinary sound waves can effectively be used to detect internal flaws in metal structures.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False - Ordinary sound waves have longer wavelengths that bend around defects instead of reflecting, thereby missing internal flaws.",
    "explanation": "Longer wavelengths in ordinary sound waves enable them to diffract around obstacles, making them less suited for detecting small or internal defects compared to high-frequency ultrasound.",
    "topic": "Flaw detection with Ultrasound",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen052"
  },
  {
    "question_text": "True or False: Ultrasound imaging, including techniques like ultrasonography and echocardiography, uses ionizing radiation to produce images of internal body structures.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False - Ultrasound imaging uses high-frequency sound waves, not ionizing radiation, to produce images.",
    "explanation": "Unlike X-rays or CT scans, ultrasound imaging is non-ionizing and relies on the reflection of ultrasonic waves to construct images of internal body structures, making it safer for repeated use.",
    "topic": "Medical imaging modalities",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc111",
    "section_id": "13_section_11_5",
    "question_id": "cbse_ix_iesc1dd_c111_gen053"
  }
]