[
  {
    "question_text": "Which statement correctly describes the function of the plasma membrane?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) It provides rigid mechanical support only",
      "B) It acts as a selectively permeable barrier, allowing and restricting substances",
      "C) It synthesizes proteins",
      "D) It stores genetic information"
    ],
    "correct_answer": "B) It acts as a selectively permeable barrier, allowing and restricting substances",
    "explanation": "The plasma membrane is a flexible, selectively permeable barrier which allows the passage of certain molecules in and out of the cell while restricting others.",
    "topic": "Plasma Membrane",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen015"
  },
  {
    "question_text": "In cellular diffusion, substances move from where to where?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) From low concentration to high concentration",
      "B) From high concentration to low concentration",
      "C) From low temperature to high temperature",
      "D) From high pressure to low pressure"
    ],
    "correct_answer": "B) From high concentration to low concentration",
    "explanation": "Diffusion is defined as the spontaneous movement of molecules from an area of high concentration to an area of low concentration.",
    "topic": "Diffusion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen016"
  },
  {
    "question_text": "Water moving through a selectively permeable membrane due to a solute concentration gradient is termed:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Filtration",
      "B) Active Transport",
      "C) Osmosis",
      "D) Endocytosis"
    ],
    "correct_answer": "C) Osmosis",
    "explanation": "Osmosis is defined as the net movement of water molecules across a selectively permeable membrane from an area of lower solute concentration to an area of higher solute concentration.",
    "topic": "Osmosis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen017"
  },
  {
    "question_text": "Which of the following describes the effect of a hypertonic solution on a cell?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) The cell swells as water enters due to high water concentration outside.",
      "B) The cell remains unchanged because water movement is equal in both directions.",
      "C) The cell shrinks as water exits due to high solute concentration outside.",
      "D) The cell bursts because of rapid water intake."
    ],
    "correct_answer": "C) The cell shrinks as water exits due to high solute concentration outside.",
    "explanation": "A hypertonic solution has a lower water concentration and higher solute concentration compared to the cell interior, causing water to leave the cell, which makes the cell shrink.",
    "topic": "Osmosis/Hypotonic-Hypertonic Solutions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen018"
  },
  {
    "question_text": "Define osmosis and describe the direction of water movement in relation to solute concentration.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Osmosis is the net diffusion of water across a selectively permeable membrane from an area of lower solute concentration to an area of higher solute concentration.",
    "explanation": "In osmosis, water molecules move spontaneously toward the area with the higher concentration of dissolved solutes in order to balance the concentrations on both sides of the membrane.",
    "topic": "Osmosis",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen019"
  },
  {
    "question_text": "What is meant by a 'selectively permeable' membrane in the context of a cell?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A selectively permeable membrane allows only certain molecules to cross it while preventing others from passing through.",
    "explanation": "This property of the membrane ensures that essential substances such as nutrients and gases enter the cell while waste products are removed, playing a critical role in cell homeostasis.",
    "topic": "Plasma Membrane",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen020"
  },
  {
    "question_text": "Explain what happens to an animal cell when placed in a hypertonic solution.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When an animal cell is placed in a hypertonic solution, water moves out of the cell, causing it to shrink.",
    "explanation": "This process occurs because the surrounding solution has a higher concentration of solutes than the cell’s interior, drawing water out through osmosis.",
    "topic": "Hypertonic Solutions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen021"
  },
  {
    "question_text": "Discuss the role of diffusion in gas exchange in cells.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Diffusion allows gases such as oxygen and carbon dioxide to move across the cell membrane from areas of high concentration to areas of low concentration.",
    "explanation": "This spontaneous process is critical for cellular respiration and metabolic activities, enabling oxygen to enter the cell where it is needed, and carbon dioxide to exit as waste.",
    "topic": "Diffusion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen022"
  },
  {
    "question_text": "Explain the processes of diffusion and osmosis in cells with examples, and detail their significance in cellular function.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Diffusion is the passive movement of molecules from areas of high concentration to low concentration, and osmosis is the specific diffusion of water. For example, oxygen diffuses into the cell and carbon dioxide diffuses out of it, while water moves into a cell in a hypotonic solution (leading to swelling) and out of a cell in a hypertonic solution (causing shrinkage).",
    "explanation": "These processes are essential for transporting gases and maintaining water balance within cells. In diffusion, no external energy is required since it is based solely on concentration gradients. Osmosis is especially critical in maintaining a balance of water and solutes to ensure proper cell function and homeostasis.",
    "topic": "Diffusion and Osmosis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen023"
  },
  {
    "question_text": "Describe the procedure and outcomes of the 'osmosis with an egg' experiment. Why does the egg swell in pure water and shrink in a concentrated salt solution?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The experiment involves dissolving the eggshell with dilute hydrochloric acid to expose the semipermeable membrane of the egg. When the egg is placed in pure water (a hypotonic solution), water enters the egg by osmosis causing it to swell. Conversely, when placed in a concentrated salt solution (a hypertonic solution), water exits the egg, leading it to shrink.",
    "explanation": "This experiment demonstrates osmotic principles. In hypotonic conditions, the concentration of water outside the egg is higher, resulting in a net influx of water. In hypertonic conditions, the solute concentration outside the egg is higher, which draws water out of the egg. This simple experiment effectively illustrates how cells interact with their environment through osmosis.",
    "topic": "Osmosis and Experimental Procedures",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen024"
  },
  {
    "question_text": "Discuss the various roles of the plasma membrane in cellular activities such as gas exchange, nutrient uptake, and endocytosis. How does its structure support these functions?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The plasma membrane is essential for maintaining cellular integrity and mediating vital activities such as gas exchange, nutrient uptake, and endocytosis. It is composed of a phospholipid bilayer with embedded proteins that provide selective permeability and flexibility. This structure allows the membrane to facilitate the diffusion of gases, transport nutrients into the cell via active and passive mechanisms, and enable endocytosis where the cell engulfs external materials. The fluid nature of the lipid bilayer is crucial in adapting to changes in the environment and in communicating with adjacent cells.",
    "explanation": "The structure of the plasma membrane, with its mixture of lipids and proteins, is fundamental to its function. The lipids provide a flexible, semi-fluid matrix, while the proteins act as channels and receptors for selective transport. These combined features support essential processes such as cellular respiration (via gas exchange), nutrient delivery, and cellular defense and communication via endocytosis.",
    "topic": "Plasma Membrane Structure and Function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen025"
  },
  {
    "question_text": "True or False: In a hypotonic solution, water always moves out of a cell.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In a hypotonic solution, the external water concentration is higher than inside the cell; therefore, water moves into the cell rather than out.",
    "topic": "Osmosis - Hypotonic Solutions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen026"
  },
  {
    "question_text": "True or False: Diffusion requires the input of energy to transport molecules from a region of high concentration to a region of low concentration.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Diffusion is a passive process that does not require energy input, as molecules naturally move from areas of high concentration to low concentration based on the concentration gradient.",
    "topic": "Diffusion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen027"
  },
  {
    "question_text": "True or False: Electron microscopes use beams of electrons to generate images, offering higher magnification and resolution than light microscopes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Electron microscopes utilize electrons instead of light and can achieve much higher magnifications and resolutions, which allow the detailed visualization of cellular ultrastructures such as membranes and organelles.",
    "topic": "Microscopy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc105",
    "section_id": "04_section_5_2",
    "question_id": "cbse_ix_iesc1dd_c105_gen028"
  }
]