[
  {
    "question_text": "Name the tissue responsible for movement in our body.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Muscular tissue",
    "explanation": "Muscular tissue is specialized for contraction and relaxation, which produces movement. It contains contractile proteins such as actin and myosin, and is classified into various types (skeletal, smooth, and cardiac) based on structure and control. This tissue is essential for both voluntary and involuntary movements in the body.",
    "topic": "Animal Tissues - Muscular Tissue",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic007"
  },
  {
    "question_text": "What does a neuron look like?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A neuron consists of a cell body (soma) containing a nucleus and cytoplasm, several short, branched processes called dendrites, and a single long process known as the axon that ends in nerve terminals.",
    "explanation": "Neurons are highly specialized cells of the nervous tissue. The cell body houses the nucleus and is the site of metabolic activities, while dendrites receive incoming signals from other neurons. The axon is typically long and transmits electrical impulses to target cells. This structure enables rapid communication throughout the body.",
    "topic": "Animal Tissues - Nervous Tissue",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic008"
  },
  {
    "question_text": "Give three features of cardiac muscles.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(i) Cardiac muscle cells are involuntary, functioning without conscious control; (ii) They are cylindrical and branched, which facilitates coordinated contraction across the heart; (iii) They are uninucleate and exhibit striations, reflecting the organized arrangement of contractile proteins.",
    "explanation": "Cardiac muscle tissue is unique among muscle types. Its involuntary control means that it contracts automatically to maintain the heartbeat. The branched structure allows for the formation of a cohesive network via intercalated discs, ensuring that electrical impulses travel efficiently across the heart. The presence of striations indicates a regular pattern of actin and myosin necessary for contraction, while being uninucleate differentiates it from the multinucleate skeletal muscles.",
    "topic": "Animal Tissues - Cardiac Muscle",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic009"
  },
  {
    "question_text": "What are the functions of areolar tissue?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Areolar tissue fills spaces between organs, supports and cushions internal structures, aids in tissue repair, connects the skin to muscles, and surrounds blood vessels and nerves.",
    "explanation": "Areolar connective tissue is a loose type of connective tissue that acts as a packing material in the body. Its fibrous matrix, composed of collagen and elastin fibers along with ground substance, provides flexibility and elasticity. This tissue plays an important role in supporting organs, enabling nutrient and waste exchange, and assisting in immune responses and repair processes by providing a framework for cell migration.",
    "topic": "Animal Tissues - Connective Tissue (Areolar Tissue)",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic010"
  },
  {
    "question_text": "What is a tissue?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A tissue is a group of cells that are similar in structure and work together to perform a specific function.",
    "explanation": "In multicellular organisms, cells with similar structure and function combine to form tissues. This organization allows cells to cooperate efficiently to perform complex tasks, such as muscle contraction, nerve impulse transmission, or supporting the body structure. This concept is fundamental in understanding cellular organization in biology.",
    "topic": "Cellular Organization and Tissues",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic001"
  },
  {
    "question_text": "What is the utility of tissues in multi-cellular organisms?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Tissues enable division of labour, specialization of functions, increased efficiency, and organized structural support, all of which contribute to the survival and coordination of multicellular organisms.",
    "explanation": "Tissues allow cells to specialize in specific functions, meaning that different tissues can perform distinct roles (e.g., epithelial tissue for protective coverings or muscle tissue for movement). This division of labour means that tasks are performed more efficiently and effectively, supporting complex processes within an organism. The specialized organization also aids in maintaining homeostasis and adaptation to environmental changes.",
    "topic": "Division of Labour and Organization in Multicellular Organisms",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic002"
  },
  {
    "question_text": "Which of the following tissues is responsible for voluntary movement in the human body?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Smooth muscle",
      "Cardiac muscle",
      "Skeletal muscle",
      "Nervous tissue"
    ],
    "correct_answer": "Skeletal muscle – because skeletal (striated) muscles are under conscious (voluntary) control and are attached to bones.",
    "explanation": "Skeletal muscles are voluntarily controlled and exhibit striations under the microscope due to their arrangement of contractile proteins. In contrast, smooth and cardiac muscles operate involuntarily.",
    "topic": "Muscular tissue",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen029"
  },
  {
    "question_text": "Which type of epithelial tissue is most suitable for gas exchange due to its thin, flat structure?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Stratified squamous epithelium",
      "Simple squamous epithelium",
      "Cuboidal epithelium",
      "Columnar epithelium"
    ],
    "correct_answer": "Simple squamous epithelium – because it is extremely thin and facilitates rapid diffusion of gases.",
    "explanation": "Simple squamous epithelium, with its flat shape and minimal intercellular material, is ideal for processes like gas exchange in the lung alveoli where diffusion is critical.",
    "topic": "Epithelial tissue",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen030"
  },
  {
    "question_text": "Which connective tissue is characterized by having a fluid matrix in which red blood corpuscles, white blood corpuscles, and platelets are suspended?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Bone",
      "Blood",
      "Cartilage",
      "Ligament"
    ],
    "correct_answer": "Blood – because it comprises various cells suspended in a liquid matrix called plasma.",
    "explanation": "Blood is a fluid connective tissue that transports gases, nutrients, hormones, and wastes. Its matrix, plasma, is a liquid medium that supports its different cell types.",
    "topic": "Connective tissue",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen031"
  },
  {
    "question_text": "What is the primary function of cilia on the ciliated columnar epithelium found in the respiratory tract?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Secreting hormones",
      "Absorbing nutrients",
      "Moving mucus",
      "Providing structural support"
    ],
    "correct_answer": "Moving mucus – because the coordinated movement of cilia helps to push mucus along the respiratory tract to clear inhaled particles.",
    "explanation": "Cilia on the surface of columnar epithelial cells move rhythmically to expel mucus and trapped debris from the airways, thereby protecting the respiratory system.",
    "topic": "Epithelial tissue",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen032"
  },
  {
    "question_text": "Define epithelial tissue and describe its general characteristics.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Epithelial tissue is a type of tissue that covers the surfaces of the body and lines internal cavities and organs. Its cells are tightly packed with minimal intercellular spaces, are arranged in continuous sheets, and are supported by an underlying fibrous basement membrane.",
    "explanation": "Epithelial tissue serves as a protective barrier, separates different compartments of the body, and can be specialized for absorption, secretion, or sensation. Its structure varies depending on its function, such as simple squamous for diffusion or stratified squamous for protection.",
    "topic": "Epithelial tissue",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen033"
  },
  {
    "question_text": "What are the main differences between stratified squamous epithelium and simple squamous epithelium?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Stratified squamous epithelium consists of multiple layers of cells primarily designed for protection against abrasion, while simple squamous epithelium is composed of a single layer of thin, flat cells that facilitate diffusion and filtration.",
    "explanation": "The key difference lies in the layering: stratified squamous provides a tough barrier in areas such as the skin or esophagus, whereas simple squamous is found in areas requiring rapid exchange, such as the alveoli in the lungs or lining of blood vessels.",
    "topic": "Epithelial tissue",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen034"
  },
  {
    "question_text": "List two functions of connective tissue in the animal body.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Connective tissue functions include providing structural support to the body (e.g., bones and cartilage) and enabling transportation of substances (e.g., blood transporting gases, nutrients, and wastes).",
    "explanation": "Connective tissue encompasses a variety of tissue types with unique matrices—blood as a fluid matrix and bone as a rigid structure—each supporting and connecting different parts of the body along with protection and repair functions.",
    "topic": "Connective tissue",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen035"
  },
  {
    "question_text": "Describe the structure of a typical neuron.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A typical neuron consists of a central cell body (soma) that contains the nucleus and cytoplasm, dendrites that extend from the cell body to receive signals, and a long axon that transmits nerve impulses away from the cell body.",
    "explanation": "Neurons are specialized for rapid communication. The dendrites receive information from other neurons, while the axon conducts impulses over long distances, making them essential for nervous system function.",
    "topic": "Nervous tissue",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen036"
  },
  {
    "question_text": "Explain how blood functions as a connective tissue in the animal body, including its components and their specific roles.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Blood functions as a connective tissue by serving as the medium that transports essential substances such as oxygen, nutrients, hormones, and waste products throughout the body. This is achieved through its components: red blood corpuscles (RBCs) which transport oxygen, white blood corpuscles (WBCs) which defend against pathogens, platelets which aid in blood clotting, and plasma, a fluid matrix that carries these cells along with dissolved proteins, salts, and hormones.",
    "explanation": "The role of blood as a connective tissue is pivotal because it links different parts of the body through circulation. The fluid nature of plasma allows rapid transport, while each cellular component plays a specialized role to maintain homeostasis and defense.",
    "topic": "Connective tissue",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen037"
  },
  {
    "question_text": "Compare and contrast the three types of muscular tissue (striated/skeletal, smooth, and cardiac) with respect to their cell structure, control mechanisms, and typical locations in the body.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Skeletal (striated) muscle fibers are long, cylindrical, multinucleate, show alternate light and dark bands (striations), and are under voluntary control, primarily attached to bones to facilitate movement. Smooth muscles are spindle-shaped, uninucleate, lack striations, and function involuntarily in the walls of organs such as the intestines and blood vessels. Cardiac muscle cells are cylindrical, branched, uninucleate, show striations, and operate involuntarily to pump blood by rhythmic contractions of the heart.",
    "explanation": "The three muscle types differ significantly: skeletal muscles enable deliberate movements, smooth muscles regulate internal functions such as peristalsis and blood flow, and cardiac muscles maintain continuous heart function. Their structural differences, including cell shape and nucleus arrangement, closely relate to their specific functions and control mechanisms.",
    "topic": "Muscular tissue",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen038"
  },
  {
    "question_text": "Discuss the relationship between the structure and function of epithelial tissues by comparing examples such as the lining of lung alveoli, the gastrointestinal tract, and the skin.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The structure of epithelial tissues is intricately related to their specific functions. For instance, the lung alveoli are lined by simple squamous epithelium, which is thin enough to facilitate rapid gas exchange. In contrast, the gastrointestinal tract is lined with tall columnar epithelium, often with microvilli, to increase surface area for absorption and secretion of digestive enzymes. The skin is composed of stratified squamous epithelium that provides multiple layers of protection against physical and chemical damage. This diversity in structure—ranging from a single thin layer to multiple dense layers—allows each epithelial tissue to effectively perform its role in protection, absorption, secretion, and filtration.",
    "explanation": "The epithelial tissue’s structure is adapted to its function: thin tissues allow rapid diffusion (as in the alveoli), while multiple layers provide robust protection (as in the skin). The gastrointestinal epithelium’s tall cells help in increasing the absorptive area, demonstrating a clear structure–function link.",
    "topic": "Epithelial tissue",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen039"
  },
  {
    "question_text": "True or False: Bone is a highly flexible connective tissue that allows for a wide range of movement.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False – Bone is a strong, rigid, and nonflexible connective tissue which provides structural support and protection, although flexibility is provided at joints by cartilage and ligaments.",
    "explanation": "Bones are designed to provide a sturdy framework for the body and protect vital organs; while joints and other connective tissues like cartilage allow for flexibility, the bone tissue itself is rigid.",
    "topic": "Connective tissue",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen040"
  },
  {
    "question_text": "True or False: Neurons, which can extend up to one metre in length, are specialized for the rapid transmission of nerve impulses throughout the body.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True – Neurons are highly specialized cells with long axons that enable the rapid transmission of nerve impulses, some extending up to one metre in length.",
    "explanation": "Neurons' long axons allow for communication over long distances in the body, ensuring quick responses to stimuli, which is essential for coordinated movement and function.",
    "topic": "Nervous tissue",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "06_section_6_3",
    "question_id": "cbse_ix_iesc1dd_c106_gen041"
  },
  {
    "question_text": "Which of the following tissues is primarily responsible for the longitudinal growth of stems and roots?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Apical meristem",
      "B. Lateral meristem",
      "C. Intercalary meristem",
      "D. Sclerenchyma"
    ],
    "correct_answer": "A. Apical meristem – This tissue is located at the tips of shoot and root and is responsible for increasing their length.",
    "explanation": "The apical meristem contains actively dividing cells which add new cells at the tip. Without it, primary growth (extension in length) would cease.",
    "topic": "Meristematic tissue and plant growth",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen015"
  },
  {
    "question_text": "During the experiment in Activity 6.1, what is the effect of cutting the root tips of one onion bulb?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The bulb’s roots show increased growth",
      "B. The bulb’s roots grow at the same rate",
      "C. The bulb’s roots stop growing significantly",
      "D. The bulb’s roots change color"
    ],
    "correct_answer": "C. The bulb’s roots stop growing significantly – Removing the apical meristem halts the growth of roots from that region.",
    "explanation": "Cutting the root tips removes the apical meristem, which is the active site of cell division. Without it, cell production ceases and root elongation is arrested.",
    "topic": "Meristematic tissue and experimental observations",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen016"
  },
  {
    "question_text": "Which of the following characteristics does NOT describe meristematic cells?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Dense cytoplasm",
      "B. Thin cell walls",
      "C. Large vacuoles",
      "D. Prominent nucleus"
    ],
    "correct_answer": "C. Large vacuoles – Meristematic cells have dense cytoplasm and lack large vacuoles, which are typical of mature, differentiated cells.",
    "explanation": "Rapidly dividing meristematic cells require a dense cytoplasm and minimal vacuolation to facilitate active cell division, unlike mature cells that accumulate large vacuoles for storage and support.",
    "topic": "Structure of meristematic cells",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen017"
  },
  {
    "question_text": "Guard cells play a crucial role in plant physiology. Which of the following best describes their function?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. They secrete wax to protect the plant surface",
      "B. They regulate gas exchange through stomata",
      "C. They transport water and minerals",
      "D. They provide structural support"
    ],
    "correct_answer": "B. They regulate gas exchange through stomata – Guard cells control the opening and closing of stomatal pores, thereby managing the exchange of gases and transpiration.",
    "explanation": "Guard cells, by changing shape, open and close the stomata to allow entry of CO₂ for photosynthesis and to minimize water loss, playing a direct role in gas exchange and transpiration processes.",
    "topic": "Epidermis, stomata, and guard cells",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen018"
  },
  {
    "question_text": "Define meristematic tissue and explain its role in plant growth.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Meristematic tissue is composed of actively dividing cells that are responsible for producing new cells in specific regions of the plant, leading to growth. It includes various types such as apical, lateral, and intercalary meristems, which are located at the tips, along the sides, or near nodes, respectively.",
    "explanation": "Meristematic tissues are undifferentiated cells that continuously produce new cells. These cells later differentiate into various specialized tissues (permanent tissues) as they mature, enabling both primary (length) and secondary (girth) growth in plants.",
    "topic": "Meristematic tissue",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen019"
  },
  {
    "question_text": "What is differentiation in the context of plant tissues? Briefly explain the significance of this process.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Differentiation is the process through which cells produced by the meristem become specialized to perform specific functions, forming permanent tissues with distinct shapes and roles.",
    "explanation": "Through differentiation, unspecialized meristematic cells acquire distinct structures and functions, such as those found in parenchyma, collenchyma, and sclerenchyma. This specialization is key to forming tissues that support photosynthesis, structural integrity, transport, and protection in the plant.",
    "topic": "Differentiation and permanent tissue",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen020"
  },
  {
    "question_text": "Compare and contrast the structures and functions of parenchyma, collenchyma, and sclerenchyma tissues.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Parenchyma cells are thin-walled, loosely arranged, and are typically involved in storage, photosynthesis, or even tissue regeneration. Collenchyma cells have irregularly thickened walls and provide flexible mechanical support to growing regions of plants. Sclerenchyma cells are dead at maturity, have thick, lignified walls, and offer structural rigidity and strength.",
    "explanation": "Each tissue type is adapted to specific roles: Parenchyma allows for metabolic functions and storage; collenchyma offers support while still permitting growth and flexibility; sclerenchyma, due to lignification and cell death, provides hard support in regions where flexibility is less required.",
    "topic": "Simple permanent tissues",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen021"
  },
  {
    "question_text": "List two main functions of the epidermis in leaves and briefly explain their importance.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The epidermis protects the plant from mechanical injury and water loss, and it also facilitates gas exchange through structures called stomata.",
    "explanation": "The epidermis forms a protective barrier against environmental stress, pathogens, and excessive water loss due to its waxy coating or cutin. The stomata, which are embedded within the epidermal layer, enable respiration and photosynthesis by regulating the entry of CO₂ and exit of oxygen, along with water vapor during transpiration.",
    "topic": "Epidermal tissue and stomata",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen022"
  },
  {
    "question_text": "Describe the experimental procedure outlined in Activity 6.1 and explain how cutting the root tips affects the growth of onion bulbs.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The experiment involves placing two onion bulbs in separate jars of water and monitoring the growth of their roots over several days. In one jar, root tips are cut on Day 4. The onion with intact root tips shows continued root growth, whereas the one with cut tips displays markedly reduced elongation. This difference is attributed to the removal of the apical meristem.",
    "explanation": "Activity 6.1 demonstrates that the apical meristem, located at the root tip, is essential for cell division and subsequent root growth. By cutting off this meristematic tissue, the bulb in that jar loses its primary growing zone, which drastically reduces its ability to generate new cells required for elongation. This experiment effectively links the role of active meristematic tissue with plant growth.",
    "topic": "Plant tissue growth and experiments",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen023"
  },
  {
    "question_text": "Discuss the differences between simple and complex permanent tissues in plants, focusing on how the structure of xylem and phloem supports their respective functions.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Simple permanent tissues consist of one type of cell and include parenchyma, collenchyma, and sclerenchyma, which primarily serve roles such as storage, support, and protection. Complex permanent tissues, like xylem and phloem, are made of different cell types coordinated to perform a common function. Xylem, composed of tracheids, vessels, xylem parenchyma, and fibres, is designed for the transport of water and minerals and provides structural support, while phloem, consisting of sieve tubes, companion cells, and other specialized cells, is responsible for the distribution of nutrients and organic compounds throughout the plant.",
    "explanation": "Simple tissues are uniform and perform basic functions, whereas complex tissues integrate multiple cell types to create efficient systems for transport. The tube-like structure of xylem cells (tracheids and vessels) facilitates the upward movement of water through transpiration pull, and the perforated sieve plates in phloem allow the flow of sugars and nutrients, highlighting the specialization required for effective plant physiology.",
    "topic": "Permanent tissues and vascular system",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen024"
  },
  {
    "question_text": "Evaluate the role of secondary growth, specifically the formation of cork in older stems, and discuss its advantages for plant survival.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Secondary growth, which includes the formation of protective cork, replaces the epidermis in older stems through the activity of a secondary meristem. Cork cells are dead, have thick cell walls impregnated with suberin, and form a barrier against water loss, mechanical damage, and pathogen invasion. This protective layer is essential for the longevity and survival of mature plants, especially in harsh environments.",
    "explanation": "As plants age, the original epidermal layer is insufficient to protect against external stresses. The cork provides a robust, water-impermeable covering that minimizes water loss and shields internal tissues. This adaptation is crucial for terrestrial life, where fluctuations in environmental conditions demand enhanced protective mechanisms.",
    "topic": "Secondary growth and protective tissues",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen025"
  },
  {
    "question_text": "True or False: Meristematic cells contain large vacuoles similar to mature, differentiated plant cells.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False – Meristematic cells lack large vacuoles because they require a dense cytoplasm for rapid cell division.",
    "explanation": "Unlike mature cells that often accumulate large central vacuoles for storage and turgor maintenance, meristematic cells are packed with cytoplasm to support their active metabolic processes and cell division.",
    "topic": "Meristematic cell structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen026"
  },
  {
    "question_text": "True or False: Stomata are exclusively found on the leaves of plants.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – While stomata are most commonly found on leaves, they may also be present on other aerial parts like stems where gas exchange is required.",
    "explanation": "Stomata function in gas exchange; although leaves are the primary sites due to high photosynthetic activity, some plants have stomata on stems and even in other specialized organs, depending on their environmental adaptations.",
    "topic": "Epidermal tissues and stomata",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen027"
  },
  {
    "question_text": "True or False: In complex tissues such as the xylem, all cells become dead at maturity to facilitate transport.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – Not all cells in xylem are dead; while tracheids and vessel elements are dead at maturity to provide hollow conduits for water transport, xylem parenchyma cells remain alive and are involved in storage and tissue repair.",
    "explanation": "The xylem is a complex tissue with several cell types working together for water conduction and structural support. The living xylem parenchyma is essential for storage and injury repair, whereas the dead cells form the conduits needed for efficient water transport.",
    "topic": "Xylem structure and function",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "04_section_6_2",
    "question_id": "cbse_ix_iesc1dd_c106_gen028"
  },
  {
    "question_text": "Define the term 'tissue'.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A tissue is a group of cells similar in structure and/or function that work together to perform a specific activity.",
    "explanation": "Tissues are collections of similar cells that collaborate to perform a common function. In both plants and animals, tissues are the building blocks that form organs with specialised roles.",
    "topic": "Tissues",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex001"
  },
  {
    "question_text": "How many types of elements together make up the xylem tissue? Name them.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Xylem tissue is composed of four types of elements: Tracheids, Vessels, Xylem Parenchyma, and Xylem Fibres.",
    "explanation": "Xylem is a complex tissue made up of four different cell types that together enable it to conduct water and minerals vertically through the plant, store food, and provide mechanical support.",
    "topic": "Plant Vascular Tissue",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex002"
  },
  {
    "question_text": "How are simple tissues different from complex tissues in plants?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Simple tissues are composed of only one type of cell (such as parenchyma, collenchyma, or sclerenchyma) while complex tissues are made up of more than one type of cell working together, as in xylem and phloem.",
    "explanation": "The distinction lies in cellular uniformity. Simple tissues contain cells that are similar in structure and function, whereas complex tissues consist of multiple cell types that coordinate to perform conducting and supportive functions.",
    "topic": "Plant Tissue Organization",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex003"
  },
  {
    "question_text": "Differentiate between parenchyma, collenchyma and sclerenchyma on the basis of their cell wall.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Parenchyma cells have thin, primary cell walls primarily made of cellulose; Collenchyma cells have unevenly thickened primary cell walls (rich in cellulose and pectin) especially at the corners; Sclerenchyma cells possess thick, lignified secondary cell walls.",
    "explanation": "The differences in cell wall composition and thickness confer different functions. Parenchyma is mainly for storage and photosynthesis, collenchyma provides flexible support in growing parts, and sclerenchyma lends rigidity and structural strength to mature tissues.",
    "topic": "Plant Simple Permanent Tissues",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex004"
  },
  {
    "question_text": "What are the functions of the stomata?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Stomata are responsible for gas exchange (taking in CO₂ for photosynthesis and releasing O₂) and for transpiration, which is the release of water vapor.",
    "explanation": "Stomata, small pores on the epidermis, regulate gas exchange and help in water regulation (via transpiration) which also creates a transpiration pull assisting in water uptake in plants.",
    "topic": "Plant Anatomy - Epidermis and Stomata",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex005"
  },
  {
    "question_text": "Diagrammatically show the difference between the three types of muscle fibres.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Students should draw diagrams showing: (a) Striated (skeletal) muscle fibres – long, cylindrical, multinucleate cells with peripheral nuclei and visible striations; (b) Smooth muscle fibres – spindle-shaped, uninucleate cells without striations; (c) Cardiac muscle fibres – cylindrical, branched, uninucleate cells with central nuclei and striations.",
    "explanation": "Refer to diagrams like Fig. 6.11 which illustrate that striated muscles are voluntary and attached to bones, smooth muscles are involuntary and found in organ walls, and cardiac muscles, which are involuntary, are specialized for the continuous rhythmic contractions required by the heart.",
    "topic": "Animal Muscular Tissue",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex006"
  },
  {
    "question_text": "What is the specific function of the cardiac muscle?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Cardiac muscle is responsible for the rhythmic contraction and relaxation of the heart, which pumps blood continuously throughout life.",
    "explanation": "Cardiac muscles generate the force required to circulate blood, ensuring that oxygen and nutrients are delivered to tissues and waste products are removed.",
    "topic": "Animal Muscular Tissue",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex007"
  },
  {
    "question_text": "Differentiate between striated, unstriated and cardiac muscles on the basis of their structure and site/location in the body.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Striated (skeletal) muscles are long, cylindrical, unbranched, multinucleate with peripheral nuclei and present in limbs and body walls; Unstriated (smooth) muscles are spindle-shaped, uninucleate, non-striated and located in internal organs like the intestine and blood vessels; Cardiac muscles are cylindrical, branched, uninucleate with central nuclei, and are found in the walls of the heart.",
    "explanation": "The differences in muscle fibre structure directly relate to their function and location in the body. Skeletal muscles are adapted for voluntary movement, smooth muscles control involuntary movements within internal organs, and cardiac muscle is specialized for continuous, rhythmic contraction to pump blood.",
    "topic": "Animal Muscular Tissue",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex008"
  },
  {
    "question_text": "Draw a labelled diagram of a neuron.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Students should produce a diagram similar to Fig. 6.12 depicting a neuron with a cell body (soma) containing the nucleus and cytoplasm, multiple dendrites extending from the cell body, a single long axon, and nerve endings at the axon terminal.",
    "explanation": "A neuron is the fundamental unit of nervous tissue. The cell body conducts metabolic functions, dendrites receive signals, and the axon transmits signals over long distances. The diagram is crucial for visualizing the structural basis of rapid nerve impulse transmission.",
    "topic": "Nervous Tissue",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex009"
  },
  {
    "question_text": "Name the following: (a) Tissue that forms the inner lining of our mouth. (b) Tissue that connects muscle to bone in humans. (c) Tissue that transports food in plants. (d) Tissue that stores fat in our body. (e) Connective tissue with a fluid matrix. (f) Tissue present in the brain.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(a) Squamous epithelium, (b) Tendon, (c) Phloem, (d) Adipose tissue, (e) Blood, (f) Nervous tissue.",
    "explanation": "Each part of the question requires identifying a tissue based on its location or function. The answers cover epithelial, connective, vascular, and nervous tissues, which are essential tissue types in both plants and animals.",
    "topic": "Tissue Types",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex010"
  },
  {
    "question_text": "Identify the type of tissue in the following: skin, bark of a tree, bone, lining of kidney tubule, and vascular bundle.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Skin is primarily composed of stratified squamous epithelium along with associated connective tissues; bark of a tree includes protective tissue such as cork (and phloem in some layers); bone is a connective tissue; the lining of kidney tubules is made of cuboidal epithelium; and a vascular bundle consists of complex permanent tissue (xylem and phloem).",
    "explanation": "Each tissue is identified based on its structure and function. For instance, skin protects the body, cork provides a protective outer layer in trees, bone supports structural integrity, kidney tubule lining functions in secretion/absorption, and vascular bundles facilitate transport in plants.",
    "topic": "Comparative Tissue Anatomy",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex011"
  },
  {
    "question_text": "Name the regions in which parenchyma tissue is present.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Parenchyma tissue is present in the cortex and pith of stems and roots, mesophyll of leaves, storage organs such as fruits and seeds, and is often associated with vascular bundles (xylem and phloem).",
    "explanation": "Parenchyma is an unspecialised tissue common in many parts of plants. Its presence in various regions highlights its role in storage, photosynthesis, and basic metabolic functions.",
    "topic": "Plant Simple Permanent Tissues",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex012"
  },
  {
    "question_text": "What is the role of the epidermis in plants?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The epidermis serves as a protective barrier against water loss, mechanical injury, and pathogen invasion, and it also facilitates gaseous exchange (via stomata) and, in roots, absorption (via root hairs).",
    "explanation": "Epidermal tissue covers all plant parts. It not only protects internal tissues but also plays a key role in regulating water loss and gas exchange, which are critical for the plant's survival in its environment.",
    "topic": "Plant Protective Tissues",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex013"
  },
  {
    "question_text": "How does the cork act as a protective tissue?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Cork acts as a protective tissue because its cells are dead, compactly arranged without intercellular spaces, and contain suberin in their walls, making them impermeable to water and gases.",
    "explanation": "Cork replaces the epidermis in older stems, providing a durable, waterproof barrier that guards against physical damage and prevents excessive water loss.",
    "topic": "Plant Protective Tissues",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex014"
  },
  {
    "question_text": "Complete the following chart: Permanent tissue branches into simple and complex. Simple tissues include parenchyma, collenchyma, and sclerenchyma, while complex tissues include xylem and phloem.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Permanent tissue is divided into two main types: Simple tissues (Parenchyma, Collenchyma, Sclerenchyma) and Complex tissues (Xylem and Phloem).",
    "explanation": "This categorization emphasizes that while simple tissues are composed of one cell type performing a single function, complex tissues are assemblies of different cell types collaborating for functions such as transport (in vascular tissues).",
    "topic": "Plant Tissue Differentiation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ex015"
  },
  {
    "question_text": "Name types of simple tissues.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Parenchyma, Collenchyma, and Sclerenchyma",
    "explanation": "Simple permanent tissues in plants are made up of a single type of cells. Parenchyma cells are unspecialized, typically involved in storage and photosynthesis; collenchyma cells provide flexibility and support due to their unevenly thickened walls; and sclerenchyma cells have thick lignified walls that render them hard and provide rigidity, as seen in structures such as the coconut husk.",
    "topic": "Plant Tissues - Simple Permanent Tissue",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic003"
  },
  {
    "question_text": "Where is the apical meristem found?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "At the growing tips of stems and roots.",
    "explanation": "The apical meristem is a region of actively dividing cells located at the tips of stems and roots. This tissue is responsible for the primary growth in plants, increasing in length. Its strategic position allows for the elongation necessary for the plant’s upward and downward growth.",
    "topic": "Plant Tissues - Meristematic Tissue",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic004"
  },
  {
    "question_text": "Which tissue makes up the husk of a coconut?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Sclerenchyma",
    "explanation": "The husk of a coconut is composed of sclerenchyma tissue. Sclerenchyma cells have thick, lignified walls that provide a hard and rigid structure, making them ideally suited for protective functions such as those required by the coconut husk.",
    "topic": "Plant Tissues - Simple Permanent Tissue",
    "bloom_level": "Remember",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic005"
  },
  {
    "question_text": "What are the constituents of phloem?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sieve tubes, companion cells, phloem parenchyma, and phloem fibres",
    "explanation": "Phloem is a complex permanent tissue responsible for transporting food substances within the plant. Its structure is composed of several cell types: sieve tubes (tubular cells with perforated walls for translocation of nutrients), companion cells (which assist the sieve tubes metabolically), phloem parenchyma (involved in storage and lateral transport), and phloem fibres (which provide structural support). This collaboration of cells ensures effective distribution of photosynthates throughout the plant.",
    "topic": "Plant Tissues - Complex Permanent Tissue",
    "bloom_level": "Understand",
    "source": "in-chapter",
    "chapter_id": "iesc106",
    "question_id": "cbse_ix_iesc1dd_c106_ic006"
  },
  {
    "question_text": "Which type of tissue in plants is primarily responsible for growth?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Meristematic Tissue",
      "B) Permanent Tissue",
      "C) Vascular Tissue",
      "D) Supportive Tissue"
    ],
    "correct_answer": "A) Meristematic Tissue",
    "explanation": "Meristematic tissue contains cells that continuously divide in specific regions, supporting plant growth. This characteristic distinguishes it from permanent tissues, which have differentiated cells.",
    "topic": "Plant Tissues",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen001"
  },
  {
    "question_text": "What is the primary reason that plants have a large amount of supportive tissue?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) To enhance nutrient absorption",
      "B) To help them move to new locations",
      "C) To maintain an upright posture",
      "D) To increase metabolic processing"
    ],
    "correct_answer": "C) To maintain an upright posture",
    "explanation": "Since plants are fixed and stationary, they require a considerable amount of supportive tissue (often containing dead cells) to remain erect and withstand gravitational forces.",
    "topic": "Plant Tissue Functions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen002"
  },
  {
    "question_text": "Which of the following statements best describes a major tissue difference between plants and animals?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Only animal tissues contain dead cells",
      "B) Plant tissues include supportive tissue with dead cells, whereas most animal tissues are living",
      "C) Growth in animals is localized to specific regions",
      "D) Both plants and animals have uniform cell division throughout their bodies"
    ],
    "correct_answer": "B) Plant tissues include supportive tissue with dead cells, whereas most animal tissues are living",
    "explanation": "Plants have supportive tissues often composed of dead cells to maintain structure, while animal tissues predominantly consist of living cells, reflecting their greater energy needs and movement.",
    "topic": "Comparison of Animal and Plant Tissues",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen003"
  },
  {
    "question_text": "Which of the following best describes the structural organization of organs in animals compared to plants?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Animal organs are less specialized than plant organs",
      "B) Animal organs are more specialized and localized",
      "C) Plant organs are more localized than animal organs",
      "D) Both have similar levels of organ specialization"
    ],
    "correct_answer": "B) Animal organs are more specialized and localized",
    "explanation": "Complex animals have highly specialized organs and organ systems to support active locomotion and higher metabolic demands; plants, despite their complexity, have a less localized structural organization.",
    "topic": "Organ System Specialization",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen004"
  },
  {
    "question_text": "Define meristematic tissue and explain its role in plant growth.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Meristematic tissue is a group of undifferentiated, actively dividing cells located in specific regions of a plant. Its role is to facilitate growth by producing new cells that can differentiate into various types of permanent tissues.",
    "explanation": "Meristematic tissues, found in regions like the tips of roots and shoots, are crucial for the plant's ability to grow and adapt. Their localized division ensures that growth is directed and organized.",
    "topic": "Plant Tissues",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen005"
  },
  {
    "question_text": "Why is cell growth in animals considered to be uniform, unlike in plants?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Animal cells generally divide uniformly throughout the body, which results in even growth. In contrast, plants have specialized regions (meristems) where cell division occurs, leading to localized growth.",
    "explanation": "The uniform division of cells in animals supports their dynamic movements and higher energy needs, while the localized meristematic activity in plants suits their stationary existence by providing controlled growth in specific areas.",
    "topic": "Animal Tissue Growth",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen006"
  },
  {
    "question_text": "Briefly describe how the functional demands of animals and plants influence the nature of their tissues.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Animal tissues are primarily composed of living cells that support active movement, high metabolism, and diverse functions, whereas plant tissues include supportive dead cells and localized meristematic tissues suited for stationary life and structural support.",
    "explanation": "The differing lifestyles – active locomotion in animals and sedentary existence in plants – drive these tissue adaptations. Animals require tissues that facilitate rapid energy consumption and complex organ systems, whereas plants benefit from having robust structural tissues and localized growth zones.",
    "topic": "Tissue Function Comparison",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen007"
  },
  {
    "question_text": "Compare and contrast the growth patterns of plant and animal tissues, considering the localization of cell division and overall organism structure.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In plants, growth occurs primarily in specialized regions known as meristems, where cells are actively dividing. This leads to localized growth which then differentiates into various permanent tissues. In contrast, animals undergo a relatively uniform cell division throughout the body, resulting in an even, non-localized growth pattern. This difference influences their overall structure, with plants developing distinct zones for growth and support, while animals develop highly specialized organs throughout their bodies.",
    "explanation": "Plants fix their growth to localized meristematic tissues, allowing for continuous but region-specific expansion. Animals, due to their need for coordinated movement and metabolic activities across the entire body, distribute cell growth more uniformly. This adaptation reflects the evolutionary pressures exerted by their respective ways of life.",
    "topic": "Comparative Growth Patterns",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen008"
  },
  {
    "question_text": "Discuss how the differences in tissue structure and growth between plants and animals reflect their respective lifestyles and functions. Provide examples to support your discussion.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Plants are adapted to a stationary lifestyle, which is reflected in their tissue structures, especially the presence of supportive tissues composed of dead cells that allow them to maintain an upright form. They also possess specialized areas of cell division (meristems) that enable controlled, localized growth. Animals, on the other hand, have tissues predominantly made up of living cells that facilitate movement, rapid response to stimuli, and energy-intensive functions. Their uniform cell division supports the development of highly specialized and localized organs, which is essential for functions such as locomotion, feeding, and complex sensory processing. For example, the rigid supportive structures in plants are analogous to skeletal elements in animals, though the latter are living tissues.",
    "explanation": "The structural and functional differences between plant and animal tissues are direct responses to their ecological niches. Plants must withstand gravitational forces without movement, so they develop extensive supportive tissue. Animals, requiring flexibility and intricate organ systems for movement and survival, have evolved tissues that support these processes. The examples provided illustrate how physical structure is intricately linked to lifestyle.",
    "topic": "Structure-Function Relationship in Tissues",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen009"
  },
  {
    "question_text": "True or False: All tissues in animals contain dead cells.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. While some animal tissues, such as parts of bone, contain non-living components, most animal tissues are primarily composed of living cells to accommodate their active lifestyles.",
    "explanation": "The statement is incorrect because the majority of animal tissues are living, which is essential for dynamic functions like movement, growth, and repair. Dead cells are typically limited to specific structural parts like the extracellular matrix or the outer layers of bones.",
    "topic": "Animal Tissue Composition",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen010"
  },
  {
    "question_text": "True or False: Plants display uniform cell division throughout their entire body similar to animals. If false, explain the correct pattern.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Plants do not have uniform cell division throughout their body. Instead, plants have localized regions called meristems where cell division occurs, leading to growth only in specific areas.",
    "explanation": "Unlike animals, which exhibit a uniform pattern of cell division, plants restrict cell division to certain specific regions. This localization is key to understanding how plants manage growth and structural support while remaining fixed in one place.",
    "topic": "Plant Growth Patterns",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen011"
  },
  {
    "question_text": "What functional advantage does supportive tissue provide in plants?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Supportive tissue in plants provides the necessary rigidity and strength to maintain an upright structure, ensuring that the plant can withstand gravitational forces and environmental stress.",
    "explanation": "Because plants are fixed and cannot move to avoid adverse conditions, supportive tissue—often composed of dead, lignified cells—plays a critical role in preserving the plant’s structure and positioning for optimal light capture.",
    "topic": "Plant Structural Adaptations",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen012"
  },
  {
    "question_text": "Explain how nutrient acquisition methods in plants and animals influence the development of their tissue types.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Nutrient acquisition in plants and animals directly impacts their tissue composition and organization. Plants acquire nutrients primarily through photosynthesis and absorption from the soil, necessitating the development of specialized tissues such as supportive tissues for structural stability and meristematic tissues for localized growth. In contrast, animals often consume organic matter through ingestion, which requires tissues that facilitate digestion, rapid transport of nutrients, and high metabolic activity, leading to the development of complex, specialized organs such as the digestive tract, circulatory system, and muscle tissue. These differences illustrate how the mode of nutrient acquisition impacts not only the physical structures but also the functional organization of tissues within these organisms.",
    "explanation": "The contrasting nutrient acquisition strategies—photosynthesis and absorption in plants versus consumption in animals—have driven the evolution of distinct tissue types and organizational structures. Plants require tissues that offer mechanical support and localized growth to maximize light exposure, while animals develop highly specialized systems that support active metabolism and mobility.",
    "topic": "Tissue Adaptation and Function",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen013"
  },
  {
    "question_text": "True or False: Once plants reach maturity, they completely lose all their dividing tissues.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Even after reaching maturity, plants retain localized dividing tissues known as meristems, which allow them to continue growing and regenerating parts such as leaves, stems, and roots.",
    "explanation": "Plants maintain meristematic tissues throughout their life, even after maturity, enabling them to grow new shoots and adapt to environmental changes. This continuous growth underpins the plant's ability to repair and expand.",
    "topic": "Plant Growth and Development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc106",
    "section_id": "02_section_6_1",
    "question_id": "cbse_ix_iesc1dd_c106_gen014"
  }
]