[
  {
    "question_text": "MCQ: Which of the following elements has a completely filled outer electron shell and, hence, a valency of 0?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Hydrogen (H)",
      "B. Helium (He)",
      "C. Lithium (Li)",
      "D. Oxygen (O)"
    ],
    "correct_answer": "B. Helium (He)",
    "explanation": "Helium has a complete outer shell (although with only 2 electrons, it is full for helium) and shows little chemical activity. Thus, its combining capacity or valency is zero.",
    "topic": "Valency and electron configuration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen029"
  },
  {
    "question_text": "MCQ: Given an element with an electron configuration ending in ...2, 8, 1, what is its valency?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. 0",
      "B. 1",
      "C. 2",
      "D. 8"
    ],
    "correct_answer": "B. 1",
    "explanation": "An outer electron configuration of 2, 8, 1 indicates there is one electron in the outermost shell. Losing that one electron results in a complete octet, so the valency is 1.",
    "topic": "Valency determination",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen030"
  },
  {
    "question_text": "MCQ: What is the valency of oxygen, and how is it determined from its electron configuration?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. 1",
      "B. 2",
      "C. 3",
      "D. 4"
    ],
    "correct_answer": "B. 2",
    "explanation": "Oxygen has 6 electrons in its outermost shell. To complete the octet, it needs to gain 2 electrons. Thus, its valency is determined as 8 - 6 = 2.",
    "topic": "Valency calculation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen031"
  },
  {
    "question_text": "MCQ: To achieve a stable electron configuration, atoms may lose, gain, or share electrons. Which of the following statements is correct?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Atoms only lose electrons to achieve an octet.",
      "B. Atoms only gain electrons to achieve an octet.",
      "C. Atoms only share electrons to achieve an octet.",
      "D. Atoms can lose, gain, or share electrons to achieve an octet."
    ],
    "correct_answer": "D. Atoms can lose, gain, or share electrons to achieve an octet.",
    "explanation": "Depending on their electron configuration, atoms may lose electrons (like magnesium), gain electrons (like fluorine), or share electrons (as in covalent bonding) to achieve a complete outer shell of 8 electrons.",
    "topic": "Electron configuration and bonding",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen032"
  },
  {
    "question_text": "Short Answer: Define 'valence electrons'.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Valence electrons are the electrons present in the outermost shell of an atom, which participate in chemical bonding and determine the reactivity of the element.",
    "explanation": "The outermost electrons (valence electrons) are key in chemical interactions because they are the electrons that interact with other atoms.",
    "topic": "Valency and electron configuration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen033"
  },
  {
    "question_text": "Short Answer: Explain the concept of an 'octet' in the context of atomic structure.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An 'octet' refers to a complete outer electron shell containing 8 electrons. Atoms tend to undergo chemical reactions to achieve an octet because it represents a stable, low-energy configuration.",
    "explanation": "The octet rule is a guiding principle in chemistry that explains why certain atoms react in ways that lead to a full outer electron shell, thereby achieving greater stability.",
    "topic": "Octet rule",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen034"
  },
  {
    "question_text": "Short Answer: How does magnesium (Mg) achieve a stable electron configuration?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Magnesium has an electron configuration of 2, 8, 2 in its shells. To achieve a stable configuration, it loses its 2 outer electrons, which gives it a valency of 2.",
    "explanation": "By losing the two electrons in the outermost shell, magnesium attains a configuration similar to neon, thereby attaining stability.",
    "topic": "Valency determination",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen035"
  },
  {
    "question_text": "Short Answer: Describe how the valency of elements that have nearly complete outer shells is determined.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For elements with nearly full outer shells, the valency is determined by subtracting the number of electrons in the outer shell from 8. For instance, fluorine has 7 electrons, so its valency is 8 - 7 = 1, because it readily gains one electron to complete the octet.",
    "explanation": "This method reflects the ease with which atoms can achieve a complete octet, favoring electron gain over losing many electrons.",
    "topic": "Valency and electron configuration",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen036"
  },
  {
    "question_text": "Long Answer: Discuss the electron arrangement in the first 18 elements and explain how their electron distributions determine their chemical reactivity and combining capacities (valencies). Include examples from the provided table.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The first 18 elements are arranged with electrons in various shells following the Bohr-Bury scheme. For example, hydrogen has one electron (valency 1) while helium has a complete first shell (valency 0). Lithium, with an electron configuration of 2, 1, is eager to lose one electron; whereas, neon, with a configuration of 2, 8, is chemically inert (valency 0). In elements like oxygen (2, 6) and fluorine (2, 7), the electrons are close to the complete octet, so they tend to gain electrons to achieve stability, resulting in valencies of 2 and 1 respectively. Thus, the electron distribution directly influences how readily an element reacts, with incomplete outer shells driving chemical interactions toward achieving a full octet.",
    "explanation": "The chemical reactivity is tied to the ability of an atom to achieve a more stable electron configuration. Atoms with incomplete outer shells (non-octets) react by losing, gaining, or sharing electrons to complete their octets, which is reflected in their valency.",
    "topic": "Electron arrangement and chemical reactivity",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen037"
  },
  {
    "question_text": "Long Answer: Explain, with appropriate examples and chemical equations, how atoms gain, lose, or share electrons in order to achieve a complete octet. Discuss both ionic and covalent bonding in your explanation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Atoms gain, lose, or share electrons to achieve a stable electron configuration known as an octet. In ionic bonding, atoms lose or gain electrons; for example, sodium (Na) loses one electron to form Na⁺, and chlorine (Cl) gains one electron to form Cl⁻, combining to form sodium chloride (NaCl) as shown in the balanced equation: Na → Na⁺ + e⁻; Cl + e⁻ → Cl⁻; Na⁺ + Cl⁻ → NaCl. In covalent bonding, atoms share electrons. For example, two oxygen atoms each share two electrons to form O₂, achieving a full octet through shared electrons. Therefore, the type of bonding depends on the tendency of the elements to lose, gain, or share electrons in order to obey the octet rule.",
    "explanation": "The process of electron transfer or sharing is central to the formation of stable compounds. Ionic bonds form between metals and non-metals, while covalent bonds typically form between non-metals, and both strategies aim to achieve a full outer electron shell.",
    "topic": "Chemical bonding",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen038"
  },
  {
    "question_text": "Long Answer: Analyze the trend in valency among the first 18 elements as shown in the table. How does the electron configuration of an element determine whether it loses, gains, or shares electrons during chemical reactions?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The table shows that elements with very few electrons in their outermost shell (like hydrogen, lithium, or sodium) tend to lose electrons to reach a stable noble gas configuration, hence they have low valencies corresponding to the number of electrons lost. In contrast, elements with nearly full outer shells (like oxygen or fluorine) tend to gain electrons to complete the octet, resulting in relatively low valencies determined by 8 minus the number of outer electrons. Elements with intermediate numbers, such as boron or nitrogen, may share electrons through covalent bonding to complete their octets. The decision to lose, gain, or share electrons is strongly influenced by the energy cost of removing electrons versus the energy gained by forming a complete octet, which explains the observed trends in chemical reactivity and valency.",
    "explanation": "The electron configuration of an element is the deciding factor in its chemical behavior. Atoms will adopt the electron exchange mechanism (losing, gaining, or sharing) that requires the least energy while leading to a stable configuration. This process explains why different elements have different combining capacities as seen in the first 18 elements.",
    "topic": "Trends in valency",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen039"
  },
  {
    "question_text": "True/False: Atoms with a full outer electron shell always have a valency of 0.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "An atom with a completely filled outer electron shell, whether it contains 2 electrons (as in helium) or 8 electrons (as in neon and other noble gases), is chemically inert, with a valency of 0.",
    "topic": "Chemical reactivity and valency",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen040"
  },
  {
    "question_text": "True/False: Fluorine has a valency of 7 because it has 7 electrons in its outermost shell.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Fluorine has a valency of 1.",
    "explanation": "Although fluorine has 7 electrons in its outer shell, it is easier for fluorine to gain one electron and complete its octet than to lose 7 electrons. Thus, its valency is calculated as 8 - 7 = 1.",
    "topic": "Valency determination",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc104",
    "section_id": "08_section_4_4",
    "question_id": "cbse_ix_iesc1dd_c104_gen041"
  }
]