[
  {
    "question_text": "Explain any one method of crop production which ensures high yield.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Crop variety improvement, which involves techniques like hybridisation or genetic modification to develop crop varieties with higher yield potential, disease/pest resistance, and tolerance to abiotic stresses.",
    "explanation": "Crop variety improvement uses scientific techniques to select or breed new varieties possessing desirable traits such as enhanced yield, improved resistance to pests and diseases, better tolerance to environmental stresses (e.g., drought or salinity), and optimal maturity duration. Techniques like hybridisation and genetic modification serve as experimental procedures to enhance the genetic makeup of crops, ensuring sustainable high yields.",
    "topic": "Crop Production, Agricultural Biotechnology",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex001"
  },
  {
    "question_text": "Why are manure and fertilizers used in fields?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Manure and fertilizers are applied to supply essential nutrients and organic matter to the soil, thereby enhancing its fertility and promoting healthy plant growth, which ultimately leads to increased crop yield.",
    "explanation": "The use of manure introduces organic matter that improves soil structure and microbial activity, while chemical fertilizers provide specific nutrients required by plants. This dual approach ensures that plants have access to the necessary minerals and conditions required for optimum growth, linking soil chemistry and biology to real-world agricultural productivity.",
    "topic": "Soil Fertility, Agronomy",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex002"
  },
  {
    "question_text": "What are the advantages of inter-cropping and crop rotation?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Inter-cropping maximizes resource use (water, light, nutrients), suppresses weeds, and reduces pest/disease spread, while crop rotation improves soil fertility, controls weeds, reduces soil-borne pests and diseases, and prevents nutrient depletion.",
    "explanation": "Inter-cropping allows different crops to grow simultaneously, utilizing available sunlight, water, and nutrients efficiently, and acting as a natural barrier against pest infestations. Crop rotation often involves alternating crops such as legumes which fix atmospheric nitrogen, thereby enriching soil fertility and breaking pest and disease cycles. Both methods are critical sustainable agriculture practices that enhance productivity.",
    "topic": "Crop Management, Sustainable Agriculture",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex003"
  },
  {
    "question_text": "What is genetic manipulation? How is it useful in agricultural practices?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Genetic manipulation, or genetic modification, involves the alteration or introduction of specific genes into crop plants to impart desired traits such as pest resistance, herbicide tolerance, enhanced nutritional content, or increased yield. This technique is useful in agriculture as it creates crop varieties that are more resilient to environmental stresses, reduce dependency on chemical inputs, and lead to sustainable increases in productivity.",
    "explanation": "Using methods such as recombinant DNA technology, scientists can insert genes from one organism into another or alter existing gene sequences in crops. For instance, Bt cotton is engineered to produce proteins toxic to certain pests, reducing the need for chemical pesticides. This scientific approach underpins modern biotechnology, enabling more precise and efficient breeding strategies that directly address challenges in food security and environmental sustainability.",
    "topic": "Genetic Engineering, Agricultural Biotechnology",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex004"
  },
  {
    "question_text": "How do storage grain losses occur?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Storage grain losses occur due to biotic factors such as insects, rodents, fungi, mites, and bacteria, as well as abiotic factors like improper moisture levels and unfavorable temperature conditions, which together compromise grain quality and germination potential.",
    "explanation": "In stored grains, biotic factors mechanically damage and contaminate the produce, while abiotic factors such as excessive moisture promote fungal growth or cause spoilage, and inappropriate temperatures can accelerate deterioration. Understanding these processes is essential for developing effective post-harvest management practices to minimize losses.",
    "topic": "Post-Harvest Management, Pest and Disease Control",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex005"
  },
  {
    "question_text": "How do good animal husbandry practices benefit farmers?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Good animal husbandry practices enhance livestock health and productivity, resulting in increased yields of milk, eggs, and meat, lower disease-related losses, and improved quality of animal products, ultimately leading to higher income for farmers.",
    "explanation": "By implementing proper feeding, breeding, hygiene, and disease control measures, farmers can ensure that their livestock remains healthy and productive. This systematic management not only improves the quality and quantity of the output but also reduces the risks and costs associated with animal diseases, thereby providing a direct economic benefit through increased productivity.",
    "topic": "Animal Husbandry, Livestock Management",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex006"
  },
  {
    "question_text": "What are the benefits of cattle farming?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Cattle farming provides multiple benefits such as the production of milk from dairy animals, provision of draught power for agricultural operations (e.g., tilling and irrigation), and the generation of manure that enriches soil fertility.",
    "explanation": "In addition to nutritional benefits provided by milk, cattle also contribute to farm labor, and their manure acts as an organic fertilizer, thereby closing the nutrient cycle on farms. This multi-functional use of cattle makes them an integral component of traditional and sustainable farming systems.",
    "topic": "Animal Husbandry, Cattle Farming",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex007"
  },
  {
    "question_text": "For increasing production, what is common in poultry, fisheries, and bee-keeping?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The common factor is the implementation of scientific management practices, which include selecting improved breeds or varieties, ensuring proper nutrition through balanced feeding, maintaining hygiene and biosecurity protocols, and managing the environmental conditions to optimize production.",
    "explanation": "Scientific management in these sectors involves systematic approaches such as controlled breeding, specialized feeding regimens, strict hygiene standards, and disease prevention measures. For example, in poultry, optimal housing conditions and vaccination schedules are maintained; in fisheries, proper water quality and feed are managed; and in bee-keeping, appropriate apiary management is followed. These practices collectively contribute to increasing the production efficiency and quality of animal-derived products.",
    "topic": "Animal Husbandry, Aquaculture, Apiculture",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex008"
  },
  {
    "question_text": "How do you differentiate between capture fishing, mariculture, and aquaculture?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Capture fishing involves harvesting fish directly from wild, natural water bodies; mariculture refers to the controlled cultivation of marine organisms in their natural saltwater environment; and aquaculture encompasses the cultivation of aquatic organisms in both freshwater and marine settings under controlled conditions.",
    "explanation": "Capture fishing relies on natural populations and is subject to environmental variability. Mariculture is a specialized segment of aquaculture that focuses on marine species and often involves techniques such as cage farming in coastal waters. Aquaculture, as a broader term, includes both freshwater fish farming in ponds and recirculating systems and marine farming practices, encompassing a range of experimental procedures to optimize growth and productivity under controlled conditions.",
    "topic": "Aquaculture, Fishery Science",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "iesc112",
    "question_id": "cbse_ix_iesc1dd_c112_ex009"
  }
]