[
  {
    "question_text": "Which of the following is an example of evaporation?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Boiling water",
      "B) Drying clothes",
      "C) Melting ice",
      "D) Freezing water"
    ],
    "correct_answer": "B) Drying clothes",
    "explanation": "Drying clothes is an example of evaporation, where water molecules escape from the surface of the wet clothes into the air without the liquid reaching its boiling point.",
    "topic": "Evaporation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen054"
  },
  {
    "question_text": "Which factor does NOT increase the rate of evaporation?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Increased surface area",
      "B) Lower humidity",
      "C) Increased wind speed",
      "D) Decreased temperature"
    ],
    "correct_answer": "D) Decreased temperature",
    "explanation": "Evaporation is enhanced by higher temperature, increased surface area, and greater wind speed. Lower temperature provides less kinetic energy to the molecules, thus decreasing evaporation.",
    "topic": "Factors Affecting Evaporation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen055"
  },
  {
    "question_text": "Evaporation is known as a surface phenomenon because:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Only particles in the interior of the liquid evaporate.",
      "B) Only particles at the liquid's surface, having higher kinetic energy, can escape into the vapor phase.",
      "C) All particles have the same kinetic energy, but only those near the surface are visible.",
      "D) The entire liquid instantly transforms into vapor when heated."
    ],
    "correct_answer": "B) Only particles at the liquid's surface, having higher kinetic energy, can escape into the vapor phase.",
    "explanation": "Evaporation is a surface phenomenon because only the molecules at the surface, which typically have higher kinetic energy, have a chance to overcome intermolecular forces and escape into the vapor phase.",
    "topic": "Evaporation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen056"
  },
  {
    "question_text": "During summer, why does wearing cotton clothes help in cooling the body?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A) They reflect sunlight effectively.",
      "B) They absorb sweat and increase its exposure to air, enhancing evaporation.",
      "C) They provide an insulating layer that traps cool air.",
      "D) They retain less water compared to synthetic fabrics."
    ],
    "correct_answer": "B) They absorb sweat and increase its exposure to air, enhancing evaporation.",
    "explanation": "Cotton is a good absorber of water; it absorbs perspiration and exposes it to the surrounding air, allowing for quicker evaporation. This evaporation process extracts heat from the body, thereby cooling it down.",
    "topic": "Cooling Due to Evaporation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen057"
  },
  {
    "question_text": "Define evaporation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Evaporation is the process in which particles from the surface of a liquid gain sufficient kinetic energy to overcome intermolecular forces and change into the vapor phase at temperatures below the boiling point.",
    "explanation": "This definition highlights the key aspects of evaporation, notably that it occurs at the surface of the liquid and does not require the liquid to reach its boiling point.",
    "topic": "Evaporation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen058"
  },
  {
    "question_text": "List two everyday examples of evaporation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Examples include water gradually disappearing from an uncovered container and the drying of wet clothes.",
    "explanation": "These examples illustrate evaporation occurring naturally in daily life without the need to reach boiling temperatures.",
    "topic": "Everyday Examples of Evaporation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen059"
  },
  {
    "question_text": "What is meant by the latent heat of vaporization, and how does it affect temperature during the process of evaporation?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Latent heat of vaporization is the amount of heat energy required to convert a unit mass of a liquid into vapor without a change in temperature. During evaporation, the liquid absorbs this heat from its surroundings, which can lead to a cooling effect in the vicinity.",
    "explanation": "This concept explains why evaporation cools the surface from which the liquid evaporates – energy is absorbed in the phase change, reducing the thermal energy of the surroundings.",
    "topic": "Latent Heat of Vaporization",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen060"
  },
  {
    "question_text": "Explain how air humidity affects the rate of evaporation.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "High humidity means the air is saturated with water vapor, reducing the gradient needed for more water to evaporate. Conversely, low humidity allows for faster evaporation since the air can accept more vapor.",
    "explanation": "This shows the inverse relationship between humidity and evaporation; more water vapor already present in the air slows down the process of additional evaporation.",
    "topic": "Factors Affecting Evaporation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen061"
  },
  {
    "question_text": "Describe an experimental activity to investigate the effect of surface area and wind velocity on evaporation. Include details of the experimental setup, variables to be controlled, and the expected observations.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An experiment can be set up using three containers: a test tube (small surface area) and two open china dishes (large surface area) placed under different conditions (e.g., near a window, under a fan, and inside a cupboard). The independent variables include the surface area and wind velocity, while the controlled variables are the volume of water (e.g., 5 mL) and ambient temperature (recorded). Expected observations are that water in the container with the largest surface area and highest wind speed (under a fan) will evaporate the fastest, while the container in a sheltered environment (inside a cupboard) will show the slowest evaporation.",
    "explanation": "This answer outlines a clear experimental design that tests the effect of surface area and wind speed on evaporation, mentioning key variables and providing a rationale based on scientific observations.",
    "topic": "Factors Affecting Evaporation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen062"
  },
  {
    "question_text": "Explain the process of cooling due to evaporation using the example of acetone evaporating from the skin. Include details of energy changes involved and the concept of latent heat.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "When acetone is applied on the skin, the acetone molecules require energy to transition into the vapor phase. These molecules absorb energy (latent heat of vaporization) from the skin, lowering its temperature. As the acetone evaporates, this energy absorption results in cooling of the skin surface. The process clearly demonstrates how the latent heat plays a critical role in reducing the temperature of the surrounding medium.",
    "explanation": "This response discusses the energy absorption during evaporation, highlighting the latent heat of vaporization and its direct effect on cooling. The example of acetone illustrates how a rapid phase change can extract heat from the body, thereby lowering skin temperature.",
    "topic": "Cooling Due to Evaporation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen063"
  },
  {
    "question_text": "Evaluate the impact of temperature and humidity on the rate of evaporation, and support your answer with relevant everyday examples and scientific reasoning.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Temperature increases the kinetic energy of liquid particles, resulting in a higher probability that molecules at the surface will escape into the vapor phase, thus accelerating evaporation. In contrast, high humidity means that the air is already saturated with water vapor, which reduces the evaporation rate. For instance, on a hot and dry day, clothes dry quickly because the high temperature promotes evaporation and the low humidity allows for the rapid removal of water vapor from the surface. Conversely, in a humid environment or during a rainy day, evaporation is significantly slower.",
    "explanation": "This answer links fundamental principles such as kinetic energy and saturation of water vapor with everyday experiences, providing a comprehensive evaluation of how temperature and humidity interplay to influence evaporation.",
    "topic": "Factors Affecting Evaporation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen064"
  },
  {
    "question_text": "True or False: Evaporation can only occur when a liquid reaches its boiling point.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False – Evaporation can occur at any temperature below the boiling point because molecules at the surface with higher kinetic energy can escape into the vapor phase.",
    "explanation": "The statement is false because evaporation is a process that takes place at the surface of a liquid at temperatures below its boiling point.",
    "topic": "Evaporation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen065"
  },
  {
    "question_text": "True or False: Increasing the wind speed around a container of water will slow down the rate of evaporation.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – Increasing wind speed removes the water vapor from the surface more quickly, thereby increasing the rate of evaporation.",
    "explanation": "This statement is false because higher wind speeds help carry away the evaporated molecules from the surface, which promotes more liquid molecules to turn into vapor.",
    "topic": "Factors Affecting Evaporation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen066"
  },
  {
    "question_text": "True or False: The presence of water droplets on the outer surface of a glass containing ice-cold water is due to evaporation of water from the glass.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False – The water droplets form due to condensation of water vapor from the surrounding air when it comes into contact with the cold surface of the glass.",
    "explanation": "This phenomenon occurs because the cold surface of the glass cools the surrounding air, causing water vapor to lose energy and condense into liquid droplets.",
    "topic": "Condensation and Evaporation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "09_section_1_5",
    "question_id": "cbse_ix_iesc1dd_c101_gen067"
  }
]