[
  {
    "question_text": "What observation in Activity 1.1 indicates that matter is made up of particles?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. The water level significantly increases after dissolving salt",
      "B. The salt visibly dissolves with no volume change",
      "C. The water color changes drastically",
      "D. The beaker breaks"
    ],
    "correct_answer": "B",
    "explanation": "Since dissolving salt does not change the water level, it indicates that salt particles are fitting into the spaces between water particles, which supports the particle theory of matter.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen001"
  },
  {
    "question_text": "In Activity 1.2, why does the water retain a pink/purple color even after several dilutions of potassium permanganate?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Because the water itself is pink",
      "B. Because the particles of potassium permanganate are extremely small and numerous",
      "C. Because potassium permanganate reacts with water to form a new colored compound",
      "D. Because the color comes from impurities in the water"
    ],
    "correct_answer": "B",
    "explanation": "The persistence of color indicates that even a small number of extremely tiny particles can color a large volume of water, demonstrating that each crystal contains a vast number of minute particles.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen002"
  },
  {
    "question_text": "Which school of thought believed that matter is continuous, like a block of wood?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Particle theory",
      "B. Discrete theory",
      "C. Continuous theory",
      "D. Chemical theory"
    ],
    "correct_answer": "C",
    "explanation": "The continuous theory considers matter as a smooth and uninterrupted substance, similar to a block of wood, contrary to the particulate view.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen003"
  },
  {
    "question_text": "What evidence from Activity 1.1 suggests the presence of intermolecular spaces between particles?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. Significant change in water level upon dissolution of salt/sugar",
      "B. No change in water level when salt/sugar dissolves",
      "C. Formation of bubbles during dissolution",
      "D. Change in temperature during dissolution"
    ],
    "correct_answer": "B",
    "explanation": "The fact that the water level remains unchanged after the salt or sugar dissolves implies that solute particles occupy the gaps between water particles, evidencing the presence of intermolecular spaces.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen004"
  },
  {
    "question_text": "Define matter as described in Section 1.1.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Matter is anything that has mass and occupies space.",
    "explanation": "This definition is based on the concept that matter is composed of particles that take up space and have mass.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen005"
  },
  {
    "question_text": "Explain how the dissolution of salt in water supports the particle theory of matter.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When salt dissolves, its particles separate and fit into the spaces between water molecules, leaving the overall volume of the water unchanged.",
    "explanation": "This observation of no significant volume change despite the disappearance of visible salt particles supports the idea that matter is made of tiny, discrete particles that can occupy existing spaces within a substance.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen006"
  },
  {
    "question_text": "What does the serial dilution experiment with potassium permanganate demonstrate about particle size?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The experiment demonstrates that even a tiny amount of substance contains an enormous number of extremely small particles.",
    "explanation": "The fact that a few minute particles from a crystal can color an entire volume of water indicates that these particles are very small and numerous, confirming the particulate nature of matter.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen007"
  },
  {
    "question_text": "Describe in detail how Activity 1.1 (dissolving salt/sugar in water) supports the existence of spaces between particles of matter.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The unchanged water level after dissolving salt or sugar suggests that the solute particles are fitting into the existing gaps between water molecules, thereby proving that there are spaces between the particles of matter.",
    "explanation": "Since there is no significant volume increase when the salt or sugar dissolves, it indicates that the solute is not adding extra volume but instead occupying previously empty spaces among the water particles. This supports the notion of interparticle spaces in matter.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen008"
  },
  {
    "question_text": "Explain in detail how the experiments in Activity 1.1 and Activity 1.2 collectively support the particle theory of matter.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Both experiments clearly show that matter is made up of discrete particles. Activity 1.1 reveals that when salt or sugar dissolves in water there is no significant change in volume, implying that the solute particles occupy the spaces between water molecules. Activity 1.2, through serial dilution, demonstrates that even a tiny amount of a substance (like potassium permanganate) contains such a vast number of tiny particles that they can impart color to a large quantity of water.",
    "explanation": "Activity 1.1 implies the existence of gaps or intermolecular spaces where solute particles can reside without altering the overall volume. Meanwhile, Activity 1.2 shows that the potency of a substance (its ability to color water) remains even after dilution, evidencing that each crystal consists of innumerable, extremely small particles. Together, these experiments robustly support the idea that matter is particulate in nature.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen009"
  },
  {
    "question_text": "Evaluate the experimental design of Activity 1.1 and suggest any improvements to further validate the particle theory of matter.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "While Activity 1.1 is an effective introductory experiment that shows the unchanged water level after dissolution indicating particle packing into available spaces, it can be improved. Enhancements might include using precise volumetric instruments like burettes to measure any minute changes, incorporating a control experiment using a non-dissolving substance, and testing multiple solutes to generalize the findings.",
    "explanation": "The experiment’s simplicity effectively aids conceptual understanding; however, improvements in measurement precision and experimental control would reduce errors and provide a more rigorous confirmation of the particulate nature of matter. Such refinements could include precise volume measurements and comparative studies with substances that do not dissolve.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen010"
  },
  {
    "question_text": "True or False: When salt dissolves in water, the water level increases significantly.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. Explanation: In the experiment, the level of water remains nearly unchanged because the salt particles occupy spaces between water molecules.",
    "explanation": "The observation that the water level does not change when salt dissolves supports the idea that solute particles fit into the intermolecular spaces of the solvent, rather than adding extra volume.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen011"
  },
  {
    "question_text": "True or False: The dissolution of sugar in water supports the idea that matter is continuous.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. Explanation: The dissolution of sugar shows that sugar particles distribute among water molecules without increasing overall volume, supporting the particulate nature of matter.",
    "explanation": "If matter were continuous, dissolving a substance would change the overall volume. Instead, the unchanged water level when sugar dissolves indicates that the particles simply occupy the existing spaces between water molecules.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen012"
  },
  {
    "question_text": "True or False: The serial dilution of potassium permanganate suggests that each crystal remains as one large entity in solution.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False. Explanation: The serial dilution experiment shows that a tiny amount of substance from a potassium permanganate crystal can color a large volume of water, which means the crystal is composed of countless minuscule particles.",
    "explanation": "The continued coloration of water even after many dilutions demonstrates that the substance is not a single large entity but is instead composed of a myriad of tiny particles that persist in solution.",
    "topic": "Physical Nature of Matter",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_ix_iesc1dd_c101_gen013"
  }
]