[
  {
    "question_text": "In a distance–time graph, what quantity is represented on the x–axis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Distance",
      "Time",
      "Speed",
      "Acceleration"
    ],
    "correct_answer": "Time. In a distance–time graph, time is always plotted on the x–axis.",
    "explanation": "The x–axis in a distance–time graph represents time, while the y–axis represents distance. This standard representation helps in analyzing how an object’s position changes over time.",
    "topic": "Graphical Representation of Motion",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen040"
  },
  {
    "question_text": "What does the slope of a distance–time graph represent?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Acceleration",
      "Speed",
      "Distance",
      "Time"
    ],
    "correct_answer": "Speed. The slope of a distance–time graph is equal to the speed of the moving object.",
    "explanation": "Since speed is defined as the change in distance over time, the slope (rise over run) of the distance–time graph directly gives the speed.",
    "topic": "Distance–Time Graphs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen041"
  },
  {
    "question_text": "Consider a car moving with a uniform velocity of 40 km/h. What is the distance traveled by the car in 2 hours as represented by its velocity–time graph?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "80 km",
      "40 km",
      "20 km",
      "None of the above"
    ],
    "correct_answer": "80 km. The area under the velocity–time graph (a rectangle) gives the displacement, which is equal to velocity multiplied by time.",
    "explanation": "For uniform velocity, the graph is a horizontal line. The distance traveled is the product of velocity and time (40 km/h × 2 h = 80 km).",
    "topic": "Velocity–Time Graphs",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen042"
  },
  {
    "question_text": "Define 'uniform speed' and describe how it is represented on a distance–time graph.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Uniform speed is when an object covers equal distances in equal intervals of time. It is represented on a distance–time graph as a straight line with a constant slope.",
    "explanation": "A straight line with a constant slope on a distance–time graph indicates that the ratio of distance to time is constant, meaning the object is moving with uniform speed (or uniform velocity, if direction is considered).",
    "topic": "Distance–Time Graphs",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen043"
  },
  {
    "question_text": "How can you determine the speed of an object from its distance–time graph? Explain your method briefly.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The speed of an object is determined by calculating the slope of its distance–time graph, which is the ratio of the change in distance (Δs) to the change in time (Δt).",
    "explanation": "By selecting two points on the distance–time graph, drawing horizontal and vertical lines to form a right triangle enables you to measure the differences in distance and time. The speed is given by (s₂ – s₁)/(t₂ – t₁), which is the slope of the graph.",
    "topic": "Graphical Representation of Motion",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen044"
  },
  {
    "question_text": "Describe the main differences between a distance–time graph for uniform motion and that for accelerated motion.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For uniform motion, the distance–time graph is a straight line with a constant slope indicating a constant speed; for accelerated motion, the graph is curved, showing that the distance increases non-linearly with time due to changing speed.",
    "explanation": "In uniform motion, equal intervals of time correspond to equal distances, resulting in a straight line. In accelerated motion, the rate of distance change with time increases or decreases, which is reflected as a curve (with increasing or decreasing slope) on the graph.",
    "topic": "Distance–Time Graphs",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen045"
  },
  {
    "question_text": "Explain how displacement can be determined from a velocity–time graph. Illustrate your explanation with examples of both uniform and accelerated motion.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Displacement is determined by calculating the area under the velocity–time graph. For uniform motion, the graph is a horizontal line so the area (a rectangle) equals velocity multiplied by time. In the case of accelerated motion, if the graph is a straight line through the origin, the area forms a triangle, and displacement is given by half the product of the final velocity and time. More complex motion might require breaking the graph into simple shapes (rectangles, triangles, trapeziums) and summing their areas.",
    "explanation": "The area under a velocity–time graph represents the total displacement as it accumulates the product of instantaneous velocity and time over the interval. In uniform motion, the direct multiplication yields displacement. For uniformly accelerated motion, using the formula for the area of a triangle accounts for the constant increase in velocity. For non-uniform acceleration, the graph is segmented into standard geometric shapes for area calculation.",
    "topic": "Velocity–Time Graphs",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen046"
  },
  {
    "question_text": "Using the data provided in Activity 7.9, plot a distance–time graph for the train and calculate its average speed between stations A and B, and between B and C. Explain your process and reasoning.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "To plot the graph, mark the points corresponding to station A (time 08:00, distance 0 km), station B (arrival at 11:15 with distance 120 km and departure at 11:30 with 120 km), and station C (arrival at 13:00 with 180 km and departure at 13:15 with 180 km). Connect A to B and B to C with straight-line segments (assuming uniform motion between stops), with horizontal segments during stops. The average speed from A to B is calculated by dividing the distance (120 km) by the time interval (from 08:00 to 11:15, i.e., 3.25 hours), which gives approximately 36.92 km/h. Between B and C, the distance is 60 km covered in 1.5 hours (from 11:30 to 13:00), resulting in an average speed of 40 km/h.",
    "explanation": "Plotting the graph involves marking time on the x–axis and distance on the y–axis. The segments represent periods of travel and stops. Calculating the slope (change in distance/change in time) for each travel segment yields the average speed. This process demonstrates how graphical analysis can be used to extract quantitative motion information.",
    "topic": "Graphical Representation of Motion",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen047"
  },
  {
    "question_text": "True or False: In a velocity–time graph, a horizontal line indicates that the object is accelerating.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False. A horizontal line on a velocity–time graph indicates that the object is moving with a constant velocity, not accelerating.",
    "explanation": "Acceleration is indicated by a change in velocity, which appears as a sloped line on a velocity–time graph. A horizontal line means the velocity does not change.",
    "topic": "Velocity–Time Graphs",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen048"
  },
  {
    "question_text": "True or False: A curved distance–time graph always indicates that an object is decelerating.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False. A curved distance–time graph does not always indicate deceleration; it can also indicate acceleration. The curvature reflects a non-uniform speed—increasing slope suggests acceleration, while a decreasing slope suggests deceleration.",
    "explanation": "A curve in the distance–time graph shows that the object’s speed is changing. If the slope increases, the speed is increasing (acceleration), and if the slope decreases, the speed is decreasing (deceleration).",
    "topic": "Distance–Time Graphs",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen049"
  },
  {
    "question_text": "What does the area under a velocity–time graph represent?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The area under a velocity–time graph represents the displacement (or distance traveled) by the object.",
    "explanation": "Multiplying velocity by time gives distance; graphically, this is represented as the area under the velocity–time curve.",
    "topic": "Velocity–Time Graphs",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen050"
  },
  {
    "question_text": "If a velocity–time graph for a vehicle shows a triangular region with an area of 150 m during its motion, what does this area represent?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Acceleration",
      "Distance traveled",
      "Displacement",
      "Average speed"
    ],
    "correct_answer": "Displacement. The area under the velocity–time graph, including triangular regions, represents the displacement of the vehicle over that time period.",
    "explanation": "For any segment of a velocity–time graph, the area bounded by the graph and the time axis gives the displacement. If the area is triangular, as in the case of uniformly accelerated motion starting from zero, that area still quantifies displacement.",
    "topic": "Velocity–Time Graphs",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "iesc107",
    "section_id": "08_section_7_4",
    "question_id": "cbse_ix_iesc1dd_c107_gen051"
  }
]