[
  {
    "question_text": "According to Dalton's Atomic Theory, what is matter composed of?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Divisible particles",
      "B. Indivisible atoms",
      "C. Molecules only",
      "D. Energy units"
    ],
    "correct_answer": "B. Indivisible atoms",
    "explanation": "Dalton's theory states that matter is composed of small, indivisible particles called atoms.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen097"
  },
  {
    "question_text": "Which of the following best represents Dalton's postulate about atoms of a given element?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. They have different masses.",
      "B. They have identical masses and properties.",
      "C. They can be subdivided into smaller particles.",
      "D. They vary in number depending on the compound."
    ],
    "correct_answer": "B. They have identical masses and properties.",
    "explanation": "Dalton's theory postulates that all atoms of a given element are identical in mass and properties, distinguishing them from atoms of other elements.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen098"
  },
  {
    "question_text": "Which one of the following is NOT a postulate of Dalton's Atomic Theory?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Matter consists of atoms that combine in fixed ratios.",
      "B. Chemical reactions involve rearrangement of atoms.",
      "C. Atoms can be created and destroyed during reactions.",
      "D. All atoms of an element are identical in properties."
    ],
    "correct_answer": "C. Atoms can be created and destroyed during reactions.",
    "explanation": "Dalton's theory asserts that during chemical reactions, atoms are rearranged and are neither created nor destroyed, so option C is incorrect.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen099"
  },
  {
    "question_text": "Dalton's Atomic Theory helped explain which of the following laws?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Gas laws only",
      "B. Laws of chemical combination",
      "C. Laws of thermodynamics",
      "D. The law of electromagnetic induction"
    ],
    "correct_answer": "B. Laws of chemical combination",
    "explanation": "Dalton's theory provided a basis for understanding the laws of chemical combination such as the law of constant composition and the law of multiple proportions.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen100"
  },
  {
    "question_text": "Describe in brief Dalton's four fundamental postulates of atomic theory.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1. Matter is made up of indivisible atoms. 2. All atoms of a given element are identical in mass and properties, while atoms of different elements vary in mass and properties. 3. Compounds are formed when atoms of different elements combine in fixed ratios. 4. Atoms are rearranged but neither created nor destroyed in chemical reactions.",
    "explanation": "The answer should clearly list all four of Dalton's postulates including the ideas of indivisibility of atoms, uniformity within an element, fixed ratio in compound formation, and conservation of atoms in reactions.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen101"
  },
  {
    "question_text": "How does Dalton's Atomic Theory explain the law of constant composition?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Dalton's theory explains the law of constant composition by stating that compounds are formed by atoms combining in fixed ratios. Since the atoms are indivisible and unique for each element, the overall composition of a compound remains constant.",
    "explanation": "By understanding that atoms combine in specific fixed ratios, Dalton's theory directly supports the concept that a compound always contains the same proportion of elements by mass regardless of the sample size.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen102"
  },
  {
    "question_text": "Identify one major limitation of Dalton's Atomic Theory mentioned in the text and explain its significance.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One major limitation is Dalton's inability to explain the laws of gaseous volumes. This is significant because it meant that while his theory could explain fixed ratios in compounds, it could not address the behavior of gases under varying conditions—a gap later filled by other scientists with discoveries like Avogadro's law.",
    "explanation": "The answer should highlight that Dalton's theory did not correctly account for the volumetric relationships in gaseous reactions, an issue later resolved with further scientific advances.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen103"
  },
  {
    "question_text": "In your own words, discuss how Dalton's Atomic Theory laid the groundwork for modern chemical understanding.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Dalton's Atomic Theory was revolutionary because it introduced the concept that matter is composed of individual atoms that combine in fixed ratios to form compounds. This provided a systematic explanation for chemical reactions and the laws of chemical combination. Although later refined, his ideas established the basis for identifying elements, understanding molecular composition, and advancing the overall structure of modern chemistry.",
    "explanation": "The response should explain the historical and scientific significance of Dalton's ideas, noting how these basic atomic concepts eventually led to more complex ideas in chemical bonding and molecular structure.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen104"
  },
  {
    "question_text": "Discuss in detail how Dalton's Atomic Theory has been modified by later scientific discoveries. Provide examples to support your answer.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Dalton's Atomic Theory laid a foundational framework, but it was later modified as new evidence emerged. For example, the discovery of electrons, protons, and neutrons showed that atoms have internal structure, contradicting the notion of atoms as indivisible particles. Additionally, the theory could not explain the behavior of gases as articulated by the laws of gaseous volumes, an issue later resolved by Avogadro's hypothesis. Modern atomic theory also incorporates quantum mechanics to explain electron behavior, energy levels, and chemical bonding.",
    "explanation": "The answer must detail how subsequent discoveries, such as the subatomic particles and quantum theory, refined Dalton's original postulates. This critical evaluation should particularly focus on the transition from indivisible atoms to complex atomic structures and explain how these changes improved our understanding of chemical phenomena.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen105"
  },
  {
    "question_text": "True or False: According to Dalton's Atomic Theory, the atoms in a chemical reaction are destroyed and then reformed into new compounds.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Dalton's theory states that chemical reactions involve rearrangement of atoms; atoms are neither created nor destroyed during the reaction.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen106"
  },
  {
    "question_text": "True or False: Dalton's Atomic Theory could fully explain the laws of gaseous volumes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text explicitly mentions that Dalton's theory could not explain the laws of gaseous volumes, which was a limitation addressed by later scientific studies.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen107"
  },
  {
    "question_text": "True or False: Dalton's Atomic Theory proposes that compounds are formed when atoms of different elements combine in fixed ratios.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "This is one of the fundamental postulates of Dalton's Atomic Theory, clearly indicating that compounds are formed from atoms combining in fixed and definite ratios.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen108"
  },
  {
    "question_text": "A water sample has a mass of 36 g. Using Dalton's Atomic Theory and the known atomic masses (H = 1 and O = 16), calculate the masses of hydrogen and oxygen in the water sample.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mass of hydrogen = 4 g; Mass of oxygen = 32 g",
    "explanation": "Water (H₂O) has two hydrogen atoms and one oxygen atom. The total mass of one water molecule is 2 × 1 + 16 = 18 u. For a 36 g sample, the number of moles of water is 36 g / 18 g/mol = 2 mol. The mass from hydrogen is 2 mol × (2 g/mol) = 4 g, and oxygen contributes 2 mol × 16 g/mol = 32 g.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen109"
  },
  {
    "question_text": "If 14 g of nitrogen react with 3 g of hydrogen according to the fixed ratio principle of Dalton's Atomic Theory, determine the simplest whole number ratio of atoms in the resultant compound and name the compound.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The ratio of N to H is 1:3; the compound is ammonia (NH₃).",
    "explanation": "Atomic mass of nitrogen = 14 g/mol and hydrogen = 1 g/mol. In 14 g of nitrogen, there is 1 mole of N, and in 3 g of hydrogen, there are 3 moles of H. Thus, the simplest whole number mole ratio is 1:3, which corresponds to the formula NH₃, known as ammonia.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen110"
  },
  {
    "question_text": "Dalton's Atomic Theory assumes that all atoms are indivisible. Given a sample of element M weighing 8 g contains 2.0 × 10^23 atoms, calculate the mass of one atom in atomic mass units (u). (Note: 1 u = 1.66 × 10^-24 g; Avogadro's number = 6.02 × 10^23 atoms/mol)",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 24 u",
    "explanation": "Step 1: Calculate the mass of one atom in grams by dividing the total mass by the number of atoms: 8 g / (2.0 × 10^23 atoms) = 4.0 × 10^-23 g per atom. Step 2: Convert the mass of one atom to atomic mass units: (4.0 × 10^-23 g) / (1.66 × 10^-24 g/u) ≈ 24.1 u, which is approximately 24 u.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen111"
  },
  {
    "question_text": "A compound XY is formed by the combination of elements X and Y in a fixed mass ratio. If a 20 g sample of XY contains 5 g of element X, calculate the mass percentage of element X and element Y in the compound.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Element X: 25%; Element Y: 75%",
    "explanation": "For a 20 g sample containing 5 g of X, the percentage of X is (5 g / 20 g) × 100 = 25%. The remaining mass is due to Y: (15 g / 20 g) × 100 = 75%. This illustrates Dalton's idea that elements combine in fixed ratios.",
    "topic": "Dalton's Atomic Theory",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kech101",
    "section_id": "07_section_1_6",
    "question_id": "cbse_xi_kech1dd_c101_gen112"
  }
]