[
  {
    "question_text": "How would you distinguish experimentally between an alcohol and a carboxylic acid?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "One effective method is to react the substance with sodium carbonate and observe the evolution of carbon dioxide gas. Carboxylic acids will react with sodium carbonate to produce carbon dioxide gas, water, and a salt, as shown in the reaction:\n\nCH₃COOH + Na₂CO₃ → 2CH₃COONa + H₂O + CO₂ ↑\n\nIn contrast, primary alcohols such as ethanol do not react with sodium carbonate under the same conditions, and no gas evolution will be observed.",
    "explanation": "To experimentally distinguish between an alcohol and a carboxylic acid, you can use their reactions with sodium carbonate. Carboxylic acids react with sodium carbonate to produce carbon dioxide gas, which can be observed as effervescence. The absence of gas evolution when reacting with sodium carbonate indicates the presence of an alcohol. This difference is due to the acidic nature of carboxylic acids, which enable them to react with carbonates, whereas alcohols lack sufficient acidity to undergo such a reaction.",
    "topic": "Properties of Ethanol and Ethanoic Acid",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "What are oxidizing agents?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Oxidizing agents are substances that have the ability to accept electrons from other substances during a chemical reaction. In the process, oxidizing agents themselves are reduced. They facilitate the oxidation of another species by accepting electrons.",
    "explanation": "An oxidizing agent, also known as an oxidant, is a chemical species that oxidizes another substance by accepting electrons from it. This process results in the reduction of the oxidizing agent itself. Common examples include oxygen, hydrogen peroxide (H₂O₂), and potassium permanganate (KMnO₄). Oxidizing agents are crucial in various chemical reactions, including combustion, respiration, and industrial processes like bleaching and synthesis of chemicals.",
    "topic": "General Chemistry Concepts",
    "bloom_level": "Remember"
  }
]