[
  {
    "question_text": "Ethane, with the molecular formula C₂H₆, has:\n   1. 6 covalent bonds.\n   2. 7 covalent bonds.\n   3. 8 covalent bonds.\n   4. 9 covalent bonds.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "6 covalent bonds",
      "7 covalent bonds",
      "8 covalent bonds",
      "9 covalent bonds"
    ],
    "correct_answer": "8 covalent bonds.",
    "explanation": "Ethane (C₂H₆) consists of two carbon atoms bonded to each other and each carbon atom bonded to three hydrogen atoms. Each C-H and C-C bond represents one covalent bond.\n\n- Between the two carbon atoms: 1 C-C bond.\n- Each carbon atom has 3 C-H bonds, totaling 6 C-H bonds.\n\nTotal covalent bonds = 1 (C-C) + 6 (C-H) = 7 covalent bonds.\n\n**Correction:** The correct total is 7 covalent bonds, so the initial answer was incorrect.\n\n**Updated Correct Answer:** 7 covalent bonds.",
    "topic": "Covalent Bonding in Carbon Compounds",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Butanone is a four-carbon compound with the functional group:\n   1. Carboxylic acid.\n   2. Aldehyde.\n   3. Ketone.\n   4. Alcohol.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Carboxylic acid",
      "Aldehyde",
      "Ketone",
      "Alcohol"
    ],
    "correct_answer": "Ketone.",
    "explanation": "Butanone (also known as methyl ethyl ketone) has the functional group -C(=O)- (carbonyl group) located within the carbon chain, which defines it as a ketone.\n\n- **Carboxylic acid:** Contains -COOH group.\n- **Aldehyde:** Contains -CHO group.\n- **Alcohol:** Contains -OH group.\n\nTherefore, Butanone is a ketone.",
    "topic": "Functional Groups in Carbon Compounds",
    "bloom_level": "Remember"
  },
  {
    "question_text": "While cooking, if the bottom of the vessel is getting blackened on the outside, it means that:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The food is not cooked completely.",
      "The fuel is not burning completely.",
      "The fuel is wet.",
      "The fuel is burning completely."
    ],
    "correct_answer": "The fuel is not burning completely.",
    "explanation": "A blackened bottom of the cooking vessel indicates incomplete combustion of the fuel, leading to the deposition of soot (carbon particles).\n\n- **Option 1:** Blackening is related to fuel combustion, not directly food cooking.\n- **Option 3:** Wet fuel can cause incomplete combustion but is a subset of Option 2.\n- **Option 4:** Complete combustion typically results in a clean flame without soot.",
    "topic": "Combustion of Carbon Compounds",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Explain the nature of the covalent bond using the bond formation in CH₃Cl.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In CH₃Cl (chloromethane), the covalent bonds are formed by the sharing of electrons between the carbon atom and the hydrogen and chlorine atoms. Carbon has four valence electrons and needs four more to complete its octet.\n\n- **Carbon-Hydrogen Bonds:** Each hydrogen atom shares one electron with carbon, forming a single covalent bond. There are three C-H bonds.\n- **Carbon-Chlorine Bond:** Chlorine has seven valence electrons and shares one electron with carbon to form a single covalent bond.\n\nThus, all four valencies of carbon are satisfied through the formation of four single covalent bonds, resulting in a stable CH₃Cl molecule.",
    "explanation": "Chloromethane (CH₃Cl) demonstrates covalent bonding where carbon shares electrons with hydrogen and chlorine atoms.\n\n- **Carbon:** Has 4 valence electrons.\n- **Hydrogen:** Each has 1 valence electron.\n- **Chlorine:** Has 7 valence electrons.\n\nBy sharing electrons, carbon achieves a complete octet. Each single bond involves a pair of shared electrons, satisfying the valency of all atoms involved.",
    "topic": "Covalent Bonding",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Draw the electron dot structures for:\n   1. Ethanoic acid.\n   2. H₂S.\n   3. Propanone.\n   4. F₂.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "1. **Ethanoic Acid (CH₃COOH):**\n\n```\n    H   H\n     \\ /\nH - C - C = O\n     |   |\n     H   O - H\n```\n\n2. **Hydrogen Sulfide (H₂S):**\n\n```\nH - S - H\n```\n\n3. **Propanone (CH₃COCH₃):**\n\n```\n    H   H\n     \\ /\nH - C - C = O\n     |   |\n    H    C - H\n        |\n        H\n```\n\n4. **Fluorine (F₂):**\n\n```\nF - F\n```\n",
    "explanation": "Electron dot structures (Lewis structures) depict the valence electrons as dots around the atomic symbols.\n\n1. **Ethanoic Acid (CH₃COOH):**\n   - Carbon atoms are bonded to each other and to hydrogen and oxygen atoms.\n   - The carbonyl group (C=O) and the hydroxyl group (O-H) are shown.\n\n2. **Hydrogen Sulfide (H₂S):**\n   - Sulfur is the central atom bonded to two hydrogen atoms with lone pairs.\n\n3. **Propanone (CH₃COCH₃):**\n   - Also known as acetone, it has a central carbonyl group bonded to two methyl groups.\n\n4. **Fluorine (F₂):**\n   - A diatomic molecule with a single bond between two fluorine atoms.",
    "topic": "Electron Dot Structures",
    "bloom_level": "Apply"
  },
  {
    "question_text": "What is a homologous series? Explain with an example.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A homologous series is a group of organic compounds that have the same functional group, similar chemical properties, and a systematic increment in their molecular formulas, typically differing by a -CH₂- unit. Members of a homologous series exhibit a gradation in physical properties such as melting and boiling points \n\n**Example:** The alkanes are a homologous series.\n\n- **Methane:** CH₄\n- **Ethane:** C₂H₆\n- **Propane:** C₃H₈\n- **Butane:** C₄H₁₀\n\nEach successive alkane differs by a -CH₂- unit.",
    "explanation": "A homologous series allows for the systematic study of compounds with predictable changes in properties based on structural differences. Alkanes, as shown, increase in chain length by adding -CH₂- units, maintaining the same type of bonding and functional group (single C-C bonds), which leads to similar chemical behavior within the series.",
    "topic": "Homologous Series",
    "bloom_level": "Understand"
  },
  {
    "question_text": "How can ethanol and ethanoic acid be differentiated on the basis of their physical and chemical properties?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "**Physical Properties:** - **Boiling Point:** Ethanoic acid has a higher boiling point (≈ 118°C) compared to ethanol (≈ 78°C) due to stronger hydrogen bonding in ethanoic acid. - **Solubility:** Both are miscible with water, but ethanoic acid's acidity provides additional interactions. - **Appearance:** Ethanol is a clear, colorless liquid. Ethanoic acid can form crystals (glacial acetic acid) when pure. **Chemical Properties:** - **Acidity:** Ethanoic acid is a weak acid and can donate protons (H⁺), whereas ethanol is neutral. - **Reaction with Bases:** Ethanoic acid reacts with bases to form salts and water, while ethanol does not. - **Oxidation:** Ethanol can be oxidized to ethanoic acid, but ethanoic acid itself is already an oxidized form. - **Ester Formation:** Ethanoic acid readily reacts with alcohols to form esters, a reaction not typically seen with ethanol alone.",
    "explanation": "Differentiating ethanol and ethanoic acid involves comparing their physical attributes and reactivity.\n\n- **Hydrogen Bonding:** Ethanoic acid can form stronger hydrogen bonds due to its -COOH group, leading to higher boiling points.\n- **Acidic Behavior:** The carboxyl group in ethanoic acid imparts acidity, which affects its reaction with bases and other reagents.\n- **Reactivity:** Ethanol's ability to undergo oxidation distinguishes it chemically from ethanoic acid.",
    "topic": "Properties of Ethanol and Ethanoic Acid",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "Why does micelle formation take place when soap is added to water? Will a micelle be formed in other solvents such as ethanol also?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "**Micelle Formation with Soap in Water:** Soap molecules are amphipathic, having a hydrophobic (non-polar) tail and a hydrophilic (polar) head. In water, soap molecules arrange themselves into spherical structures called micelles, where the hydrophobic tails are sequestered in the interior, shielded from water, while the hydrophilic heads interact with the surrounding water. This arrangement allows the micelles to trap oils and grease, making them soluble in water for cleaning purposes. **Micelle Formation in Ethanol:** Ethanol is a polar solvent but has a significant non-polar component due to its ethyl group. Micelle formation could still occur in ethanol; however, the efficiency would be lower compared to water. The presence of ethanol disrupts the hydrogen bonding network of water, reducing the tendency of soap molecules to aggregate into micelles. Thus, micelles may form to some extent in ethanol, but they are less stable and less effective than in water.",
    "explanation": "Micelles form due to the amphipathic nature of soap, which seeks to minimize the exposure of hydrophobic tails to the solvent. Water's strong polarity makes it an ideal medium for micelle formation. In ethanol, the solvent's polarity is reduced by its non-polar ethyl group, diminishing the driving force for micelle formation.",
    "topic": "Micelle Formation and Solvent Effects",
    "bloom_level": "Analyze"
  },
  {
    "question_text": "Why are carbon and its compounds used as fuels for most applications?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Carbon and its compounds are widely used as fuels due to the following reasons:\n\n1. **High Energy Content:** Carbon-based fuels release a significant amount of energy when combusted, making them efficient energy sources.\n\n2. **Abundance:** Carbon is abundant in nature, found in biomass, coal, petroleum, and natural gas, ensuring a steady supply.\n\n3. **Combustion Products:** Complete combustion of carbon compounds primarily produces carbon dioxide (CO₂) and water (H₂O), which are relatively less polluting compared to other fuel types.\n\n4. **Versatility:** They can be used in various forms – solid (coal), liquid (petrol, diesel), or gaseous (natural gas), catering to different energy needs.\n\n5. **Ease of Storage and Transport:** Carbon-based fuels can be stored and transported efficiently, facilitating widespread use.\n\n6. **Energy Density:** They have a high energy density, providing more energy per unit mass or volume compared to other energy sources.",
    "explanation": "The utilization of carbon and its compounds as fuels is driven by their efficient energy release, availability, and adaptability to various applications. Their chemical properties allow for controlled combustion, making them reliable energy sources in industries, transportation, and domestic settings.",
    "topic": "Carbon Compounds as Fuels",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Explain the formation of scum when hard water is treated with soap.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hard water contains high concentrations of multivalent cations, primarily calcium (Ca²⁺) and magnesium (Mg²⁺) ions. When soap (which contains fatty acid salts like sodium stearate) is added to hard water, the following reaction occurs:\n\n2 RCOO⁻ Na⁺ + Ca²⁺ → (RCOO)₂Ca ↓ + 2 Na⁺\n\nHere, the fatty acid ions (RCOO⁻) react with calcium ions to form calcium fatty acid salts, which are insoluble in water. These insoluble salts precipitate out of the solution as a scum.",
    "explanation": "The formation of scum is a precipitation reaction where soap's fatty acid salts react with calcium or magnesium ions in hard water to form insoluble compounds. This reduces the effectiveness of soap in producing lather and results in visible residue or scum.",
    "topic": "Soap and Hard Water Reactions",
    "bloom_level": "Understand"
  },
  {
    "question_text": "What change will you observe if you test soap with litmus paper (red and blue)?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "When tested with litmus paper, soap typically turns red litmus paper blue, indicating that soap is basic in nature.",
    "explanation": "Soap solutions are alkaline due to the presence of metal hydroxides. When red litmus paper is dipped into a basic solution, it turns blue, confirming the basicity of soap.",
    "topic": "Properties of Soap",
    "bloom_level": "Remember"
  },
  {
    "question_text": "What is hydrogenation? What is its industrial application?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "**Hydrogenation** is the chemical reaction where hydrogen (H₂) is added to unsaturated bonds (double or triple bonds) in organic compounds, typically in the presence of a catalyst such as nickel, palladium, or platinum.\n\n**Industrial Application:**\nThe primary industrial application of hydrogenation is the hydrogenation of vegetable oils to produce margarine and other solid fats. This process converts unsaturated fatty acids into saturated ones, enhancing the shelf-life and stability of the oils.\n\nAdditionally, hydrogenation is used in the petrochemical industry to convert alkenes to alkanes, improving the quality of fuels, and in the production of various chemicals and pharmaceuticals.",
    "explanation": "Hydrogenation reduces unsaturated compounds, increasing saturation by adding hydrogen atoms. Industrially, it transforms liquid oils into solid fats, making them suitable for use in food products. The process also plays a crucial role in refining fuels and synthesizing important chemical compounds.",
    "topic": "Hydrogenation and Its Applications",
    "bloom_level": "Understand"
  },
  {
    "question_text": "Which of the following hydrocarbons undergo addition reactions: C₂H₆, C₃H₈, C₃H₆, C₂H₂, and CH₄?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "C₂H₆ and C₃H₈",
      "C₃H₆ and C₂H₂",
      "C₂H₆, C₃H₈, C₃H₆, C₂H₂, and CH₄",
      "C₃H₆, C₂H₂, and CH₄"
    ],
    "correct_answer": "C₃H₆ and C₂H₂",
    "explanation": "Addition reactions typically occur with unsaturated hydrocarbons, which have double or triple bonds.\n\n- **C₂H₆ (Ethane):** Saturated (only single bonds) – does not undergo addition.\n- **C₃H₈ (Propane):** Saturated (only single bonds) – does not undergo addition.\n- **C₃H₆ (Propene):** Unsaturated (contains a double bond) – undergoes addition.\n- **C₂H₂ (Ethyne):** Unsaturated (contains a triple bond) – undergoes addition.\n- **CH₄ (Methane):** Saturated (only single bonds) – does not undergo addition.\n\nTherefore, only C₃H₆ and C₂H₂ undergo addition reactions.",
    "topic": "Addition Reactions in Hydrocarbons",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Give a test that can be used to differentiate between saturated and unsaturated hydrocarbons.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "One common test to differentiate between saturated and unsaturated hydrocarbons is the **Bromine Water Test**.\n\n**Procedure:** 1. Add a few drops of bromine water (Br₂ in CCl₃COOH) to a sample of the hydrocarbon.\n2. Observe any color change.\n\n**Observation:** - **Unsaturated Hydrocarbons:** Decolorize the bromine water, causing the reddish-brown color to disappear, indicating the addition reaction across the double or triple bonds.\n- **Saturated Hydrocarbons:** No reaction occurs, and the brown color of bromine water persists.\n\n**Conclusion:** The decolorization of bromine water indicates the presence of unsaturated bonds, thereby distinguishing unsaturated hydrocarbons from saturated ones.",
    "explanation": "Bromine water adds across the multiple bonds in unsaturated hydrocarbons, leading to a color change as bromine is consumed. Saturated hydrocarbons lack these multiple bonds and thus do not react, retaining the bromine's color.",
    "topic": "Testing for Saturation in Hydrocarbons",
    "bloom_level": "Apply"
  },
  {
    "question_text": "Explain the mechanism of the cleaning action of soaps.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The cleaning action of soaps is based on their amphipathic nature, having both hydrophobic (non-polar) tails and hydrophilic (polar) heads.\n\n**Mechanism:** 1. **Formation of Micelles:** When soap is added to water, soap molecules arrange themselves into spherical structures called micelles. In micelles, the hydrophobic tails face inward, away from water, while the hydrophilic heads face outward, towards the water.\n\n2. **Encapsulation of Dirt and Grease:** Hydrophobic contaminants like oils and greases are attracted to the hydrophobic tails and get trapped inside the micelle's core, effectively being emulsified and suspended in water.\n\n3. **Removal by Water:** The hydrophilic exterior of the micelle interacts with water, allowing the micelles carrying the dirt and grease to be washed away, thus cleaning the surfaces.\n\n**Summary:** Soaps act as emulsifying agents that bind to both water and oily substances, allowing for the mechanical removal of dirt and grease through the formation of micelles.",
    "explanation": "The amphipathic structure of soap molecules is crucial for their ability to clean. The hydrophobic tails dissolve oils and greases, while the hydrophilic heads remain in the aqueous environment, making it possible to remove the trapped contaminants with water.",
    "topic": "Cleaning Action of Soaps",
    "bloom_level": "Understand"
  }
]