[
  {
    "question_text": "By looking at a plant externally can you tell whether a plant is C3 or C4? Why and how?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "No, you cannot reliably tell based solely on external appearance because many external features are similar. The differences between C3 and C4 plants lie in their internal leaf anatomy, particularly the presence of Kranz anatomy in C4 plants.",
    "explanation": "External features do not clearly show whether a plant uses the C3 or C4 photosynthetic pathway. Instead, internal anatomy such as the arrangement of mesophyll and bundle sheath cells (Kranz anatomy) in C4 plants is needed to differentiate between the two. Thus, without examining a cross-section of the leaf, it is difficult to determine the pathway.",
    "topic": "C3 and C4 Pathways",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex001"
  },
  {
    "question_text": "By looking at which internal structure of a plant can you tell whether a plant is C3 or C4? Explain.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "By examining the internal leaf anatomy, specifically the arrangement of mesophyll cells versus bundle sheath cells (Kranz anatomy).",
    "explanation": "C4 plants have a distinct internal structure where bundle sheath cells, arranged in a wreath-like pattern around the vascular bundles, show a high concentration of chloroplasts. In contrast, C3 plants do not typically exhibit this clear separation. Observing this anatomical difference helps identify whether a plant is C3 or C4.",
    "topic": "Leaf Anatomy in C3 vs C4 Plants",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex002"
  },
  {
    "question_text": "Even though a very few cells in a C4 plant carry out the biosynthetic – Calvin pathway, yet they are highly productive. Can you discuss why?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The high productivity is due to the efficient CO2 concentrating mechanism in C4 plants, which minimizes photorespiration and greatly enhances the efficiency of the Calvin cycle in the bundle sheath cells.",
    "explanation": "C4 plants separate the initial CO2 fixation and the Calvin cycle between the mesophyll and bundle sheath cells. The mesophyll cells fix CO2 into 4-carbon compounds that are transported to the bundle sheath cells, where a high concentration of CO2 is released. This mechanism reduces the competitive oxygenation reaction and photorespiration, enabling the Calvin cycle to operate more efficiently even in a smaller number of cells.",
    "topic": "C4 Photosynthesis Efficiency",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex003"
  },
  {
    "question_text": "RuBisCO is an enzyme that acts both as a carboxylase and oxygenase. Why do you think RuBisCO carries out more carboxylation in C4 plants?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Because the C4 pathway concentrates CO2 in the bundle sheath cells, increasing the CO2 to O2 ratio at the enzyme’s active site, which favors the carboxylation activity of RuBisCO over its oxygenation activity.",
    "explanation": "In C4 plants, CO2 released in the bundle sheath cells leads to a higher local concentration of CO2. This concentration minimizes the binding of oxygen at the RuBisCO active site, thereby reducing photorespiration and ensuring that RuBisCO primarily acts as a carboxylase. This mechanism allows more efficient carbon fixation.",
    "topic": "RuBisCO Function in C4 Plants",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex004"
  },
  {
    "question_text": "Suppose there were plants that had a high concentration of Chlorophyll b, but lacked Chlorophyll a, would it carry out photosynthesis? Then why do plants have Chlorophyll b and other accessory pigments?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "No, the plants would not carry out photosynthesis efficiently because Chlorophyll a is essential in the reaction centre for the conversion of light energy. Chlorophyll b and other accessory pigments serve to broaden the spectrum of light absorption and transfer energy to Chlorophyll a.",
    "explanation": "Chlorophyll a is the primary pigment that directly participates in the light reactions by transferring energy to the reaction centre. Although Chlorophyll b and accessory pigments like carotenoids absorb light at different wavelengths and help protect the plant, they cannot replace the critical role of Chlorophyll a in the photochemical process. Their function is to capture additional light and funnel that energy to Chlorophyll a.",
    "topic": "Pigment Function in Photosynthesis",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex005"
  },
  {
    "question_text": "Why is the colour of a leaf kept in the dark frequently yellow, or pale green? Which pigment do you think is more stable?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "In the dark, chlorophyll degrades rapidly while accessory pigments, such as carotenoids, which are more stable, remain and give the leaf a yellow or pale green appearance.",
    "explanation": "When a leaf is kept in the dark, the synthesis of chlorophyll stops and existing chlorophyll breaks down, revealing the more stable accessory pigments like carotenoids. This change in pigment concentration results in a yellowish or pale green colour.",
    "topic": "Pigment Stability in Leaves",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex006"
  },
  {
    "question_text": "Look at leaves of the same plant on the shady side and compare it with the leaves on the sunny side. Which of them has leaves that are darker green? Why?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Leaves on the shady side are darker green because they produce more chlorophyll to compensate for the lower light availability.",
    "explanation": "Plants growing in shade tend to increase their chlorophyll concentration to maximize light absorption under low-light conditions, resulting in a darker green appearance. In contrast, leaves in full sunlight may have lower chlorophyll levels and develop other protective features.",
    "topic": "Effects of Light on Leaf Colour",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex007"
  },
  {
    "question_text": "Figure 11.10 shows the effect of light on the rate of photosynthesis. Based on the graph, answer the following questions: (a) At which point(s) in the curve is light a limiting factor? (b) What could be the limiting factor(s) in region A? (c) What do points C and D represent on the curve?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) Light is a limiting factor in the initial linear portion of the curve, referred to as region A. (b) In region A, the low intensity of light itself is the limiting factor for the rate of photosynthesis. (c) Points C and D represent the saturation phase where increases in light do not further increase the photosynthesis rate, with point D possibly indicating the onset of photoinhibition.",
    "explanation": "The graph shows that at low light intensities (region A), the rate of photosynthesis increases linearly as light is the limiting resource. As light intensity increases, the rate of photosynthesis plateaus at points C and D because other factors become limiting. At very high light intensities, photoinhibition may occur, which is suggested by point D.",
    "topic": "Light Impact on Photosynthesis",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex008"
  },
  {
    "question_text": "Give comparison between the following: (a) C3 and C4 pathways, (b) Cyclic and non-cyclic photophosphorylation, (c) Anatomy of leaf in C3 and C4 plants.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) In C3 plants, CO2 is fixed directly by RuBisCO in the mesophyll cells to produce a 3-carbon compound (PGA), whereas in C4 plants, CO2 is first fixed by PEP carboxylase in the mesophyll cells to produce a 4-carbon compound, which is then decarboxylated in bundle sheath cells for use in the Calvin cycle. (b) Non-cyclic photophosphorylation involves both PSII and PSI, producing ATP and NADPH, while cyclic photophosphorylation involves only PSI, recycling electrons to generate ATP without producing NADPH. (c) C3 leaves typically have mesophyll cells that perform both light and dark reactions, whereas C4 leaves exhibit Kranz anatomy with distinct mesophyll and bundle sheath cells; the latter compartmentalizes the Calvin cycle.",
    "explanation": "The comparison highlights key differences: C3 and C4 pathways differ in their initial CO2 fixation methods and cellular compartmentalization, which affects their efficiency and adaptation to different conditions. Similarly, non-cyclic photophosphorylation generates both ATP and NADPH through a linear electron flow involving both photosystems, while cyclic photophosphorylation focuses solely on ATP production by recycling electrons. Additionally, the internal leaf anatomy differs; C4 plants feature specialized bundle sheath cells (Kranz anatomy) that are absent in C3 plants, which is crucial for concentrating CO2 and reducing photorespiration.",
    "topic": "Comparative Photosynthesis",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "kebo111",
    "question_id": "cbse_xi_kebo1dd_c111_ex009"
  }
]