[
  {
    "question_text": "Which organ is primarily responsible for respiration in water in frogs?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cutaneous respiration through the skin",
      "Pulmonary respiration through the lungs",
      "Respiration through gills",
      "Buccal respiration through the mouth"
    ],
    "correct_answer": "Cutaneous respiration through the skin",
    "explanation": "In water, frogs exchange dissolved oxygen directly through their moist skin via the process of cutaneous respiration.",
    "topic": "Respiratory System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen019"
  },
  {
    "question_text": "Which structure in male frogs is responsible for sperm production?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Testes",
      "Ovaries",
      "Kidneys",
      "Cloaca"
    ],
    "correct_answer": "Testes",
    "explanation": "Male frogs possess a pair of testes that produce sperm; this is a key element of their reproductive system.",
    "topic": "Reproductive System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen020"
  },
  {
    "question_text": "What is the primary function of bile in the frog's digestive process?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Emulsify fats",
      "Break down proteins",
      "Neutralize stomach acid",
      "Digest carbohydrates"
    ],
    "correct_answer": "Emulsify fats",
    "explanation": "Bile, secreted by the liver and stored in the gall bladder, emulsifies fats to aid in their digestion in the duodenum.",
    "topic": "Digestive System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen021"
  },
  {
    "question_text": "Which of the following best describes the heart structure in frogs?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Two atria and one ventricle",
      "Two ventricles and one atrium",
      "Three atria",
      "Two atria and two ventricles"
    ],
    "correct_answer": "Two atria and one ventricle",
    "explanation": "Frogs possess a three-chambered heart comprising two atria and one ventricle, which facilitates the mixed circulation found in amphibians.",
    "topic": "Circulatory System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen022"
  },
  {
    "question_text": "How do frogs use mimicry as a protective mechanism?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "They change their colour to blend with the surroundings",
      "They produce toxins to deter predators",
      "They develop extra limbs to escape",
      "They use bright colors to warn predators"
    ],
    "correct_answer": "They change their colour to blend with the surroundings",
    "explanation": "Frogs are capable of changing the color of their skin to camouflage, thus hiding from predators. This protective coloration is an example of mimicry.",
    "topic": "Morphology and Adaptation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen023"
  },
  {
    "question_text": "Describe the role of the frog's skin in respiration.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The frog's skin, being moist due to mucus, facilitates cutaneous respiration by allowing the diffusion of dissolved oxygen from water directly into the blood.",
    "explanation": "Because frogs often live in aquatic environments, their skin serves as an additional respiratory surface, especially in water where oxygen is absorbed.",
    "topic": "Respiratory System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen024"
  },
  {
    "question_text": "How do frogs absorb water if they do not drink it?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Frogs absorb water directly through their skin via osmosis.",
    "explanation": "Instead of drinking water, frogs use their skin to absorb moisture. This adaptation is important for maintaining hydration.",
    "topic": "Morphology and Physiology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen025"
  },
  {
    "question_text": "Explain the concept of sexual dimorphism in frogs with examples from their physical features.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sexual dimorphism in frogs is evident where males possess features such as vocal sacs for sound production and a copulatory pad on the first digit of the forelimb, which are absent in females.",
    "explanation": "These differences in physical features between male and female frogs are adaptations for reproductive success, helping in attracting mates and facilitating mating.",
    "topic": "Reproductive System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen026"
  },
  {
    "question_text": "List two protective behaviors that frogs exhibit during extreme weather conditions.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Frogs take shelter in deep burrows during extreme temperatures, engaging in aestivation during summer and hibernation during winter.",
    "explanation": "These behaviors help frogs avoid the adverse effects of extreme heat in summer and cold in winter, ensuring their survival.",
    "topic": "Adaptations and Behavior",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen027"
  },
  {
    "question_text": "Describe the digestive system of frogs, highlighting the pathway food takes from ingestion to elimination.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Food is captured by the bilobed tongue and enters the mouth into the buccal cavity, then passes into the oesophagus and reaches the stomach. The stomach secretes gastric juices for digestion, and partially digested food (chyme) moves into the duodenum where it mixes with bile and pancreatic juices. Final digestion and absorption occur in the intestine through the action of villi and microvilli. The undigested solid waste is then passed into the rectum and eliminated through the cloaca.",
    "explanation": "The frog's digestive system is designed for a carnivorous diet, which is why the alimentary canal is relatively short. Each part of the system plays a crucial role in breaking down food, absorbing nutrients, and eliminating waste.",
    "topic": "Digestive System",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen028"
  },
  {
    "question_text": "Discuss the structure and function of the frog's circulatory system including the heart, special venous systems, and blood components.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Frogs have a well-developed closed circulatory system with a three-chambered heart consisting of two atria and one ventricle. The sinus venosus receives blood via the vena cava and directs it to the right atrium. Blood then enters the ventricle, which pumps it into the conus arteriosus and then to the arterial system. In addition, frogs possess special venous connections such as the hepatic portal system and renal portal system. The blood itself comprises plasma, nucleated red blood cells (erythrocytes) containing haemoglobin, white blood cells, and platelets. The system ensures that nutrients, gases, and water are efficiently transported to different parts of the body.",
    "explanation": "This detailed structure of the frog’s circulatory system allows for effective transport of substances and waste removal, despite the mixing of oxygenated and deoxygenated blood in the single ventricle.",
    "topic": "Circulatory System",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen029"
  },
  {
    "question_text": "Compare and contrast the respiratory methods of frogs in aquatic and terrestrial environments, including the role of different organs.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In aquatic environments, frogs primarily rely on cutaneous respiration where the moist skin facilitates diffusion of oxygen directly from water into the bloodstream. In terrestrial settings, frogs use pulmonary respiration where air is drawn through the nostrils into the buccal cavity and then into the lungs. Additionally, during periods of aestivation and hibernation, gas exchange may also occur through the skin. The dual respiratory methods reflect adaptations that allow frogs to effectively manage oxygen intake in both water and on land.",
    "explanation": "This comparison illustrates the versatility of the frog's respiratory system, highlighting how different anatomical structures are utilized depending on the environment.",
    "topic": "Respiratory System",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen030"
  },
  {
    "question_text": "True or False: Frogs possess a distinct neck and tail in their body structure.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Frogs do not have a distinct neck or tail; their body is divided only into the head and trunk, which is a characteristic of adult amphibians.",
    "topic": "Morphology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen031"
  },
  {
    "question_text": "True or False: The frog's skin remains moist primarily due to the production of mucus, which aids in respiration.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The secretion of mucus ensures that the skin remains moist, which is critical for effective cutaneous respiration, especially in aquatic environments.",
    "topic": "Morphology and Respiration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen032"
  },
  {
    "question_text": "True or False: Frogs have external ears that are clearly visible.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Frogs do not have external ears; instead, they possess a membranous tympanum that serves as the external part of the ear.",
    "topic": "Morphology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen033"
  },
  {
    "question_text": "True or False: Fertilisation in frogs is internal, with eggs being fertilised inside the female's body.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Fertilisation in frogs is external, occurring in water after the female lays eggs.",
    "topic": "Reproductive System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen034"
  },
  {
    "question_text": "True or False: The short alimentary canal in frogs is an adaptation to their carnivorous diet.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "A short alimentary canal is characteristic of carnivorous animals like frogs, as their diet requires less time and surface area for digestion and absorption.",
    "topic": "Digestive System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen035"
  },
  {
    "question_text": "True or False: During extreme weather conditions, frogs use hibernation in winter and aestivation in summer to survive.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Frogs retreat into deep burrows to protect themselves from extreme cold and heat, undergoing hibernation in winter and aestivation in summer.",
    "topic": "Behavioral Adaptations",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen036"
  },
  {
    "question_text": "If a mature female frog lays 2500 ova and only 20% survive to become tadpoles, how many tadpoles develop?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "500",
    "explanation": "20% of 2500 ova equals 0.20 x 2500, which results in 500 tadpoles surviving.",
    "topic": "Reproductive System",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo107",
    "section_id": "03_section_7_2",
    "question_id": "cbse_xi_kebo1dd_c107_gen037"
  }
]