[
  {
    "question_text": "Define vital capacity. What is its significance?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Vital capacity is the maximum volume of air that can be exhaled after a maximum inhalation. It is calculated as the sum of the tidal volume, inspiratory reserve volume (IRV), and expiratory reserve volume (ERV). Its significance lies in indicating the lung's capacity to move air, which is important for diagnosing respiratory health and identifying any pulmonary disorders.",
    "explanation": "Vital capacity reflects the efficiency of the lungs to take in and expel air. It is used clinically to assess lung function and can help in diagnosing conditions that affect breathing.",
    "topic": "Respiratory Volumes and Capacities",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex001"
  },
  {
    "question_text": "State the volume of air remaining in the lungs after a normal breathing.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The volume of air remaining after a normal expiration is called the Functional Residual Capacity (FRC), which is the sum of the Expiratory Reserve Volume (ERV) and the Residual Volume (RV). Typically, FRC is approximately 2100 to 2300 mL in a healthy adult.",
    "explanation": "After a normal expiration, the lungs do not completely empty. The remaining air (FRC) is important as it prevents lung collapse and maintains gas exchange between breaths. The FRC is derived from the combination of ERV and RV.",
    "topic": "Respiratory Volumes and Capacities",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex002"
  },
  {
    "question_text": "Diffusion of gases occurs in the alveolar region only and not in the other parts of the respiratory system. Why?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Diffusion of gases occurs primarily in the alveolar region because alveoli provide a large surface area, have extremely thin walls (made up of squamous epithelium), and are surrounded by a dense network of capillaries, which are ideal conditions for efficient gas exchange.",
    "explanation": "The alveolar structure is specialized for gas exchange. The thin barrier between air in the alveoli and blood in the capillaries minimizes the diffusion distance, while a huge surface area maximizes the exchange of oxygen and carbon dioxide.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex003"
  },
  {
    "question_text": "What are the major transport mechanisms for CO2? Explain.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "CO2 is transported in the blood by three main mechanisms: approximately 20-25% is carried bound to hemoglobin as carbaminohaemoglobin, about 70% is transported in the form of bicarbonate ions (HCO3–) in the plasma, and roughly 7% is dissolved directly in the plasma.",
    "explanation": "The majority of CO2 is converted to bicarbonate by the action of carbonic anhydrase in red blood cells, which facilitates the removal of CO2 from tissues. A smaller portion attaches directly to hemoglobin, and only a minimal amount is carried dissolved in plasma.",
    "topic": "Transport of Gases",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex004"
  },
  {
    "question_text": "What will be the pO2 and pCO2 in the atmospheric air compared to those in the alveolar air?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "pO2 lesser, pCO2 higher",
      "pO2 higher, pCO2 lesser",
      "pO2 higher, pCO2 higher",
      "pO2 lesser, pCO2 lesser"
    ],
    "correct_answer": "pO2 higher, pCO2 lesser",
    "explanation": "Atmospheric air has a higher partial pressure of oxygen (around 159 mm Hg) and a very low partial pressure of carbon dioxide (around 0.3 mm Hg) compared to alveolar air, where the pO2 is about 104 mm Hg and pCO2 is about 40 mm Hg.",
    "topic": "Exchange of Gases",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex005"
  },
  {
    "question_text": "Explain the process of inspiration under normal conditions.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "During inspiration, the diaphragm contracts and moves downward (flattens), while the external intercostal muscles contract to elevate the ribs and sternum. These actions increase the volume of the thoracic cavity, which in turn increases the pulmonary volume. This expansion lowers the intra-pulmonary pressure below the atmospheric pressure, drawing air into the lungs.",
    "explanation": "The increase in thoracic volume creates a negative pressure in the lungs compared to the outside atmosphere. This pressure gradient causes air to flow into the lungs, ensuring that fresh oxygen is brought in for gas exchange.",
    "topic": "Mechanism of Breathing",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex006"
  },
  {
    "question_text": "How is respiration regulated?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Respiration is regulated by neural centers in the brain, mainly the respiratory rhythm center in the medulla oblongata and the pneumotaxic center in the pons. Additionally, chemoreceptors located near these centers and in the aortic arch and carotid body monitor changes in CO2, H+ concentrations, and, to a lesser extent, oxygen levels, sending signals to adjust the respiratory rate accordingly.",
    "explanation": "The neural regulation of respiration ensures that the breathing rate adapts to the metabolic demands of the body. Chemoreceptors detect deviations in blood gas levels and relay this information to the brainstem centers, which then modify the rhythm and depth of breathing.",
    "topic": "Regulation of Respiration",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex007"
  },
  {
    "question_text": "What is the effect of pCO2 on oxygen transport?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An increase in pCO2 decreases the affinity of hemoglobin for oxygen (a rightward shift in the oxygen dissociation curve), thereby promoting the release of oxygen to the tissues. Conversely, a decrease in pCO2 increases hemoglobin's affinity for oxygen, facilitating oxygen uptake in the lungs.",
    "explanation": "This phenomenon, known as the Bohr effect, allows for more oxygen to be unloaded in tissues where CO2 (and H+) levels are high, and for oxygen to be bound more readily in the lungs where CO2 is lower.",
    "topic": "Transport of Oxygen",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex008"
  },
  {
    "question_text": "What happens to the respiratory process in a man going up a hill?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "At high altitudes, the partial pressure of oxygen in the atmosphere is lower, which results in a decreased pO2 in the alveoli. To compensate, the body increases the rate and depth of breathing (hyperventilation) to enhance oxygen uptake. Over time, physiological adjustments such as increased red blood cell production may occur to improve oxygen delivery to tissues.",
    "explanation": "The reduction in atmospheric oxygen at high altitudes triggers a cascade of adaptive responses, both immediate (increased ventilation) and long-term (acclimatization), to maintain adequate oxygen supply to body tissues.",
    "topic": "Mechanism of Breathing/Regulation of Respiration",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex009"
  },
  {
    "question_text": "What is the site of gaseous exchange in an insect?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "In insects, gaseous exchange occurs through a network of tubules called the tracheal system, specifically through the smaller branching tubes known as tracheoles.",
    "explanation": "Unlike vertebrates that use lungs, insects rely on their tracheal system to deliver air directly to tissues. This system efficiently diffuses oxygen to cells and removes carbon dioxide.",
    "topic": "Respiratory Organs",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex010"
  },
  {
    "question_text": "Define oxygen dissociation curve. Can you suggest any reason for its sigmoidal pattern?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The oxygen dissociation curve is a graph that plots the percentage saturation of hemoglobin with oxygen against the partial pressure of oxygen (pO2). Its sigmoidal shape is due to the cooperative binding of oxygen molecules to hemoglobin, meaning that the binding of one oxygen molecule increases the affinity for the next oxygen molecule.",
    "explanation": "The curve's sigmoidal pattern allows for efficient oxygen uptake in the high pO2 environment of the lungs and facilitates oxygen release in tissues where pO2 is lower. This cooperative binding is essential for effective oxygen delivery throughout the body.",
    "topic": "Transport of Oxygen",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex011"
  },
  {
    "question_text": "Have you heard about hypoxia? Try to gather information about it, and discuss with your friends.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hypoxia is a condition in which there is an insufficient supply of oxygen to the tissues. It can occur due to various reasons such as high altitude, respiratory disorders, or impaired pulmonary function.",
    "explanation": "This open-ended question encourages exploration and group discussion. Hypoxia is significant because it affects cellular metabolism and overall body function, and understanding its causes and effects can provide insights into various health conditions.",
    "topic": "Transport of Gases/Respiratory Disorders",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex012"
  },
  {
    "question_text": "Distinguish between (a) IRV and ERV, (b) Inspiratory capacity and Expiratory capacity, (c) Vital capacity and Total lung capacity.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) IRV (Inspiratory Reserve Volume) is the additional volume of air that can be inhaled after a normal inspiration (approx. 2500-3000 mL), while ERV (Expiratory Reserve Volume) is the additional volume of air that can be forcibly exhaled after a normal expiration (approx. 1000-1100 mL).\n(b) Inspiratory Capacity (IC) is the total volume of air that can be inhaled after a normal expiration, calculated as tidal volume (TV) plus IRV, whereas Expiratory Capacity (EC) is the total volume of air that can be exhaled after a normal inspiration, calculated as TV plus ERV.\n(c) Vital Capacity (VC) is the maximum volume of air that can be exhaled after a maximum inhalation (including IRV, TV, and ERV), while Total Lung Capacity (TLC) is the total volume of air in the lungs after maximum inhalation, which is the sum of VC and Residual Volume (RV).",
    "explanation": "These distinctions help in assessing lung health and functionality. Each volume or capacity provides specific information about the respiratory system's efficiency and can be used in diagnostic tests to identify potential problems.",
    "topic": "Respiratory Volumes and Capacities",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex013"
  },
  {
    "question_text": "What is Tidal volume? Find out the Tidal volume (approximate value) for a healthy human in an hour.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Tidal volume (TV) is the volume of air inhaled or exhaled during a normal breath, which is approximately 500 mL per breath. In a healthy human who breathes about 12-16 times per minute, the hourly tidal volume is calculated as 500 mL multiplied by the number of breaths per minute and then by 60 minutes. For example, using an average of 15 breaths per minute: 500 mL x 15 x 60 = 450,000 mL, or about 450 L per hour.",
    "explanation": "Tidal volume represents the air moved during one normal respiratory cycle. Multiplying it by the average number of breaths per minute and then by 60 minutes gives an estimation of the total volume of air moved in one hour, which is a useful measure in assessing respiratory function.",
    "topic": "Respiratory Volumes and Capacities",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "kebo114",
    "question_id": "cbse_xi_kebo1dd_c114_ex014"
  }
]