[
  {
    "question_text": "Define the following: (a) Exocrine gland, (b) Endocrine gland, (c) Hormone.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Exocrine glands are glands that release their secretions through ducts onto an epithelial surface. Endocrine glands are ductless glands that secrete hormones directly into the bloodstream. Hormones are non-nutrient chemical messengers produced in trace amounts that regulate various body functions.",
    "explanation": "Exocrine glands use ducts to release secretions (like sweat and digestive enzymes) while endocrine glands release hormones directly into the blood. Hormones act as intercellular messengers to regulate functions such as growth, metabolism, and reproduction.",
    "topic": "Endocrine Glands and Hormones",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex001"
  },
  {
    "question_text": "Diagrammatically indicate the location of the various endocrine glands in our body.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A diagram should show: in the head - hypothalamus, pituitary, pineal; in the neck - thyroid and parathyroid; in the chest - thymus; in the abdominal region - pancreas and adrenal glands; and in the lower abdomen - testes in males and ovaries in females.",
    "explanation": "The diagram should accurately depict the locations of the major endocrine glands as described in the chapter to reflect their anatomic positions: brain structures (hypothalamus, pituitary, pineal), neck structures (thyroid, parathyroid), chest (thymus), abdominal organs (pancreas, adrenal glands) and the gonads in the lower abdomen.",
    "topic": "Human Endocrine System",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex002"
  },
  {
    "question_text": "List the hormones secreted by the following: (a) Hypothalamus, (b) Pituitary, (c) Thyroid, (d) Parathyroid, (e) Adrenal, (f) Pancreas, (g) Testis, (h) Ovary, (i) Thymus, (j) Atrium, (k) Kidney, (l) G-I Tract.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hypothalamus: releasing hormones (e.g., GnRH) and inhibiting hormones (e.g., somatostatin); Pituitary: Anterior – GH, PRL, TSH, ACTH, LH, FSH; Intermediate – MSH; Posterior – Oxytocin and Vasopressin; Thyroid: T3 and T4, and thyrocalcitonin (TCT); Parathyroid: PTH; Adrenal: Adrenal cortex – cortisol, aldosterone, and small amounts of androgens; Adrenal medulla – adrenaline and noradrenaline; Pancreas: Insulin (β-cells) and Glucagon (α-cells); Testis: Androgens (mainly testosterone); Ovary: Estrogens and Progesterone; Thymus: Thymosins; Atrium (heart): Atrial Natriuretic Factor (ANF); Kidney: Erythropoietin; G-I Tract: Gastrin, Secretin, Cholecystokinin (CCK), and Gastric Inhibitory Peptide (GIP).",
    "explanation": "Each organ produces specific hormones; the hypothalamus produces both releasing and inhibiting hormones which regulate the pituitary, the pituitary secretes multiple hormones affecting growth and metabolism, and each gland (thyroid, parathyroid, adrenal, etc.) has a unique set of hormones as detailed in the chapter content.",
    "topic": "Human Endocrine System",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex003"
  },
  {
    "question_text": "Fill in the blanks:\n(a) Hypothalamic hormones __________________\n(b) Thyrotrophin (TSH) __________________\n(c) Corticotrophin (ACTH) __________________\n(d) Gonadotrophins (LH, FSH) __________________\n(e) Melanotrophin (MSH) __________________",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "a) Act on the anterior pituitary to regulate hormone release, b) Act on the thyroid gland to stimulate the synthesis and secretion of thyroid hormones, c) Act on the adrenal cortex to stimulate the production of glucocorticoids, d) Act on the gonads (ovaries and testes) to regulate sex hormone production and gametogenesis, e) Act on melanocytes to regulate skin pigmentation.",
    "explanation": "The blanks should be filled by identifying the target organs for each hormone: hypothalamic hormones act on the pituitary; TSH on the thyroid; ACTH on the adrenal cortex; gonadotrophins on gonads; and MSH on melanocytes.",
    "topic": "Mechanism of Hormone Action and Gland Functions",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex004"
  },
  {
    "question_text": "Write short notes on the functions of the following hormones: (a) Parathyroid hormone (PTH), (b) Thyroid hormones, (c) Thymosins, (d) Androgens, (e) Estrogens, (f) Insulin and Glucagon.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Parathyroid hormone (PTH) increases blood calcium levels by stimulating bone resorption, enhancing calcium reabsorption by the kidneys, and increasing calcium absorption from the intestines. Thyroid hormones (T3 and T4) regulate basal metabolic rate, protein synthesis, and are essential for growth and development. Thymosins aid in the differentiation of T-lymphocytes, essential for cell-mediated immunity and antibody production. Androgens (e.g., testosterone) regulate male reproductive development, secondary sexual characteristics, and contribute to anabolic functions. Estrogens promote the development of female secondary sexual characteristics, regulate the menstrual cycle, and aid in the growth and function of reproductive tissues. Insulin reduces blood glucose levels by facilitating cellular uptake of glucose and stimulating glycogenesis, while glucagon increases blood glucose levels by promoting glycogenolysis and gluconeogenesis.",
    "explanation": "Each hormone has specific functions that help in maintaining homeostasis. PTH regulates calcium balance, thyroid hormones influence metabolism, thymosins are critical for immune function, and the sex hormones (androgens and estrogens) regulate reproductive and secondary sexual characteristics. Insulin and glucagon work in tandem to maintain blood glucose homeostasis.",
    "topic": "Hormone Functions and Regulation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex005"
  },
  {
    "question_text": "Give example(s) of:\n(a) a hyperglycemic hormone and a hypoglycemic hormone,\n(b) a hypercalcemic hormone,\n(c) gonadotrophic hormones,\n(d) a progestational hormone,\n(e) a blood pressure lowering hormone,\n(f) androgens and estrogens.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "a) Hyperglycemic hormone: Glucagon; hypoglycemic hormone: Insulin. b) Hypercalcemic hormone: Parathyroid hormone (PTH). c) Gonadotrophic hormones: Luteinizing hormone (LH) and Follicle stimulating hormone (FSH). d) Progestational hormone: Progesterone. e) Blood pressure lowering hormone: Atrial natriuretic factor (ANF). f) Androgens: Testosterone; Estrogens: Estradiol (and other forms of estrogen).",
    "explanation": "The examples are based on the specific roles of these hormones: glucagon raises blood sugar, insulin lowers it; PTH raises blood calcium; LH and FSH stimulate the gonads; progesterone supports pregnancy; ANF lowers blood pressure; androgens and estrogens are responsible for secondary sex characteristics in males and females respectively.",
    "topic": "Hormone Functions and Effects",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex006"
  },
  {
    "question_text": "Which hormonal deficiency is responsible for the following: (a) Diabetes mellitus, (b) Goitre, (c) Cretinism.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Diabetes mellitus is typically due to insulin deficiency; goitre is usually caused by iodine deficiency leading to reduced thyroid hormone synthesis; and cretinism is the result of hypothyroidism during pregnancy or in early childhood.",
    "explanation": "Insulin deficiency leads to impaired blood glucose regulation (diabetes mellitus). Iodine deficiency causes inadequate thyroid hormone production, resulting in goitre, and maternal or early life hypothyroidism leads to cretinism, marked by stunted growth and developmental delays.",
    "topic": "Endocrine Disorders",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex007"
  },
  {
    "question_text": "Briefly mention the mechanism of action of FSH.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "FSH binds to its specific receptors on the target cell membranes (e.g., ovarian cells in females) which triggers a second messenger cascade (such as cyclic AMP) that eventually leads to gene transcription changes and cellular responses involved in follicular growth and maturation.",
    "explanation": "FSH is a protein hormone that triggers its action by binding to membrane-bound receptors. This binding activates intracellular signaling pathways that result in changes in gene expression, promoting the growth and development of ovarian follicles.",
    "topic": "Mechanism of Hormone Action",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex008"
  },
  {
    "question_text": "Match the following:\nColumn I: (a) T4, (b) PTH, (c) GnRH, (d) LH\nColumn II: Options: (i) Hypothalamus, (ii) Thyroid, (iii) Pituitary.\nProvide the correct matching for each item in Column I.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "a) T4 - (ii) Thyroid, b) PTH - [Parathyroid], c) GnRH - (i) Hypothalamus, d) LH - (iii) Pituitary",
      "a) T4 - (i) Hypothalamus, b) PTH - (ii) Thyroid, c) GnRH - (iii) Pituitary, d) LH - (i) Hypothalamus",
      "a) T4 - (ii) Thyroid, b) PTH - (ii) Thyroid, c) GnRH - (i) Hypothalamus, d) LH - (iii) Pituitary",
      "a) T4 - (iii) Pituitary, b) PTH - (i) Hypothalamus, c) GnRH - (ii) Thyroid, d) LH - (iii) Pituitary"
    ],
    "correct_answer": "a) T4 - (ii) Thyroid, b) PTH - [Parathyroid], c) GnRH - (i) Hypothalamus, d) LH - (iii) Pituitary",
    "explanation": "T4 (thyroxine) is secreted by the thyroid gland, GnRH is produced by the hypothalamus, and LH (luteinizing hormone) is secreted by the anterior pituitary. Although PTH is secreted by the parathyroid glands, the provided options do not list 'parathyroid', which indicates an oversight in the provided options. The correct answer identifies the source of each hormone as per standard endocrine knowledge.",
    "topic": "Hormone Sources and Secretion",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex009"
  },
  {
    "question_text": "Which type of hormone receptor is located inside target cells?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Membrane-bound receptors",
      "Extracellular receptors",
      "Intracellular receptors",
      "Cytoplasmic receptors"
    ],
    "correct_answer": "Intracellular receptors",
    "explanation": "Hormone receptors located inside target cells are termed intracellular receptors, which are mostly nuclear receptors present in the nucleus.",
    "topic": "Hormone receptors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen058"
  },
  {
    "question_text": "What is the primary mechanism by which peptide hormones exert their effects on target cells?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "By diffusing into the nucleus",
      "By binding to cytoplasmic receptors",
      "By binding to membrane-bound receptors and generating second messengers",
      "By directly altering the cell's DNA"
    ],
    "correct_answer": "By binding to membrane-bound receptors and generating second messengers",
    "explanation": "Protein/peptide hormones interact with membrane-bound receptors, triggering the production of second messengers such as cyclic AMP, which then regulate cellular metabolism.",
    "topic": "Mechanism of hormone action",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen059"
  },
  {
    "question_text": "Which of these hormones belongs to the steroid category?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Insulin",
      "Glucagon",
      "Cortisol",
      "Epinephrine"
    ],
    "correct_answer": "Cortisol",
    "explanation": "Cortisol is a steroid hormone, whereas insulin and glucagon are peptide hormones and epinephrine is an amino-acid derivative.",
    "topic": "Hormone classification",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen060"
  },
  {
    "question_text": "FSH binds to its receptor on the ovarian cell membrane primarily to:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Stimulate gene transcription directly",
      "Generate second messengers",
      "Enter the nucleus to bind DNA",
      "Inhibit protein synthesis"
    ],
    "correct_answer": "Generate second messengers",
    "explanation": "FSH binds to membrane-bound receptors which in turn trigger the production of second messengers like cyclic AMP or Ca++ that initiate a biochemical cascade in the cell.",
    "topic": "Hormone signaling",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen061"
  },
  {
    "question_text": "The hormone-receptor complex typically initiates which of the following biochemical changes in the target tissue?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Alteration in protein structure only",
      "Formation of a secondary receptor",
      "Activation of second messenger systems or gene transcription",
      "Changes in cell membrane fluidity"
    ],
    "correct_answer": "Activation of second messenger systems or gene transcription",
    "explanation": "Upon formation, the hormone-receptor complex leads to biochemical changes either by generating second messengers (for peptide hormones) or by altering gene transcription (for steroid hormones).",
    "topic": "Hormone action mechanism",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen062"
  },
  {
    "question_text": "Define the term 'hormone receptor' as used in hormone signaling.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A protein located in the target tissues which specifically binds to a hormone.",
    "explanation": "Hormone receptors are specific proteins found in target tissues that bind to hormones, initiating a cascade of biochemical events that result in physiological responses.",
    "topic": "Hormone receptors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen063"
  },
  {
    "question_text": "Differentiate between membrane-bound and intracellular hormone receptors.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Membrane-bound receptors are located on the cell membrane and interact with hormones that cannot pass through the cell membrane, leading to the activation of second messengers; intracellular receptors are located inside the cell, mainly in the nucleus, and bind hormones that diffuse through the cell membrane to directly influence gene transcription.",
    "explanation": "The key difference lies in their location and mechanism of action: membrane-bound receptors use second messengers, while intracellular receptors typically modulate gene expression by interacting directly with the genome.",
    "topic": "Hormone receptor types",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen064"
  },
  {
    "question_text": "List the four groups of hormones based on their chemical nature as mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Peptide/polypeptide/protein hormones, steroids, iodothyronines, and amino-acid derivatives.",
    "explanation": "The hormones are categorized based on chemical composition: peptide, steroid, iodothyronines (thyroid hormones), and amino-acid derivatives, each with distinct structures and mechanisms of action.",
    "topic": "Hormone classification",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen065"
  },
  {
    "question_text": "Explain the role of second messengers in the action of protein hormones.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Second messengers relay and amplify the signal from the hormone-receptor interaction at the cell membrane to trigger a cascade of intracellular biochemical responses.",
    "explanation": "When protein hormones bind to their membrane receptors, they do not enter the cell but instead lead to the production of second messengers like cyclic AMP or Ca++, which then activate enzymes and further signal transduction pathways to modulate cellular functions.",
    "topic": "Signal transduction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen066"
  },
  {
    "question_text": "Describe in detail the mechanism of action of steroid hormones, starting from their diffusion into the cell to the subsequent physiological response.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Steroid hormones, such as estrogen, diffuse through the cell membrane due to their lipophilic nature. Once inside, they bind to intracellular receptors, usually located in the nucleus. The hormone-receptor complex then interacts with specific DNA sequences, initiating or repressing transcription of target genes. The resulting mRNA is translated into proteins that bring about changes in cell function, leading to physiological responses like tissue growth and differentiation.",
    "explanation": "This answer outlines the complete pathway: passive diffusion into the cell, receptor binding in the nucleus, interaction with the genomic DNA for gene regulation, and the production of proteins that ultimately result in a physiological change.",
    "topic": "Steroid hormone mechanism",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen067"
  },
  {
    "question_text": "Discuss the role of hormone-receptor complexes in regulating target tissue metabolism. Compare the mechanisms of peptide and steroid hormones in your explanation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Hormone-receptor complexes regulate target tissue metabolism by initiating specific biochemical cascades. Peptide hormones bind to membrane-bound receptors, generating second messengers that activate intracellular enzymes and pathways, thereby modulating metabolism. In contrast, steroid hormones cross the membrane and bind to intracellular receptors, influencing gene expression by interacting directly with DNA, which leads to protein synthesis and long-term regulatory effects on metabolism. This dual mechanism ensures precise control over physiological processes.",
    "explanation": "The response should provide a comparative analysis of the two pathways: the rapid, second messenger-mediated pathway of peptide hormones versus the slower, genomic regulation by steroid hormones, highlighting how both ultimately affect metabolism.",
    "topic": "Hormone action mechanism",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen068"
  },
  {
    "question_text": "True or False: One hormone receptor is designed to bind multiple different hormones.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Hormone receptors are highly specific, with each receptor designed to bind only one hormone, ensuring the correct physiological response.",
    "topic": "Hormone receptors",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen069"
  },
  {
    "question_text": "True or False: Peptide hormones generally do not enter the target cell; they act by generating second messengers via membrane-bound receptors.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Peptide hormones are unable to cross the cell membrane, so they bind to receptors on the cell surface and activate second messengers like cyclic AMP to propagate the signal.",
    "topic": "Protein hormone mechanism",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen070"
  },
  {
    "question_text": "True or False: Steroid hormones typically bind to receptors on the cell membrane to produce their effects.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Steroid hormones are lipophilic and can cross the cell membrane; they therefore bind to intracellular, typically nuclear receptors, rather than to cell membrane receptors.",
    "topic": "Steroid hormone mechanism",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen071"
  },
  {
    "question_text": "True or False: The interaction of the hormone-receptor complex with the genome always leads directly to the immediate production of proteins.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While the hormone-receptor complex can regulate gene transcription, the process involves multiple intermediate steps such as mRNA synthesis and later translation before proteins are produced, which is not immediate.",
    "topic": "Hormone signaling",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen072"
  },
  {
    "question_text": "True or False: Hormone-receptor complex formation is essential for both the generation of second messengers and the direct regulation of gene expression.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The formation of a hormone-receptor complex is the initial and critical step in both signaling pathways: it either activates second messenger systems (in the case of peptide hormones) or directly regulates gene expression (in the case of steroid hormones).",
    "topic": "Hormone action mechanism",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen073"
  },
  {
    "question_text": "True or False: Iodothyronines, like other steroid hormones, regulate cellular functions by generating second messengers.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Iodothyronines (thyroid hormones) are lipophilic and act similarly to steroid hormones by entering the cell and regulating gene transcription, not by generating second messengers.",
    "topic": "Hormone classification and mechanism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "05_section_19_4",
    "question_id": "cbse_xi_kebo1dd_c119_gen074"
  },
  {
    "question_text": "Which hormone is secreted by the atrial wall of the heart to reduce blood pressure?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Atrial Natriuretic Factor (ANF)",
      "Erythropoietin",
      "Gastrin",
      "Cholecystokinin (CCK)"
    ],
    "correct_answer": "Atrial Natriuretic Factor (ANF)",
    "explanation": "ANF is secreted by the atrial wall when blood pressure is high, causing dilation of blood vessels to lower blood pressure.",
    "topic": "Hormones of Heart",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen039"
  },
  {
    "question_text": "Which hormone produced by the kidney’s juxtaglomerular cells stimulates the formation of red blood cells?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Atrial Natriuretic Factor (ANF)",
      "Gastrin",
      "Erythropoietin",
      "Secretin"
    ],
    "correct_answer": "Erythropoietin",
    "explanation": "Erythropoietin is secreted by the kidney and stimulates erythropoiesis, or the formation of red blood cells.",
    "topic": "Hormones of Kidney",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen040"
  },
  {
    "question_text": "Which gastrointestinal hormone acts on the gastric glands to stimulate the secretion of hydrochloric acid and pepsinogen?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Gastrin",
      "Secretin",
      "Cholecystokinin (CCK)",
      "Gastric Inhibitory Peptide (GIP)"
    ],
    "correct_answer": "Gastrin",
    "explanation": "Gastrin acts on the gastric glands to increase the secretion of hydrochloric acid and pepsinogen, aiding digestion in the stomach.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen041"
  },
  {
    "question_text": "Which hormone is responsible for stimulating the secretion of water and bicarbonate ions from the exocrine pancreas?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Secretin",
      "Gastrin",
      "Cholecystokinin (CCK)",
      "Erythropoietin"
    ],
    "correct_answer": "Secretin",
    "explanation": "Secretin acts on the exocrine pancreas to stimulate the secretion of water and bicarbonate, which helps neutralize stomach acid entering the duodenum.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen042"
  },
  {
    "question_text": "Which hormone acts on both the pancreas and gall bladder to stimulate the secretion of pancreatic enzymes and bile juice?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Gastrin",
      "Secretin",
      "Cholecystokinin (CCK)",
      "Gastric Inhibitory Peptide (GIP)"
    ],
    "correct_answer": "Cholecystokinin (CCK)",
    "explanation": "Cholecystokinin (CCK) stimulates the pancreas to secrete digestive enzymes and the gall bladder to release bile, aiding in digestion.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen043"
  },
  {
    "question_text": "Gastric inhibitory peptide (GIP) has which of the following effects on the gastrointestinal tract?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Stimulates gastric secretion",
      "Inhibits gastric secretion and motility",
      "Stimulates bile secretion",
      "Stimulates red blood cell formation"
    ],
    "correct_answer": "Inhibits gastric secretion and motility",
    "explanation": "GIP functions to inhibit gastric secretion and motility, helping to regulate digestive processes.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen044"
  },
  {
    "question_text": "Explain how atrial natriuretic factor (ANF) contributes to the regulation of blood pressure. Include its secretion trigger and mechanism of action.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "ANF is secreted by the atrial wall when blood pressure rises. It acts by dilating blood vessels, thereby reducing blood pressure.",
    "explanation": "This answer covers both the trigger (increased blood pressure) and the mechanism (blood vessel dilation) through which ANF helps regulate blood pressure.",
    "topic": "Hormones of Heart",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen045"
  },
  {
    "question_text": "Describe the role of secretin in digestion and the mechanism by which it aids in neutralizing stomach acid.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Secretin stimulates the exocrine pancreas to secrete water and bicarbonate ions which help neutralize the acidic chyme entering the duodenum from the stomach.",
    "explanation": "The answer explains that secretin's stimulation of water and bicarbonate secretion helps to protect the duodenum by neutralizing the acid from the stomach.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen046"
  },
  {
    "question_text": "How do gastrointestinal hormones such as gastrin, secretin, CCK, and GIP coordinate to optimize digestion?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Gastrin stimulates acid and pepsinogen secretion, secretin promotes water and bicarbonate secretion, CCK stimulates pancreatic enzymes and bile release, and GIP inhibits gastric secretion and motility. Together, they ensure appropriate digestion by balancing acid production, enzyme secretion, and gut motility.",
    "explanation": "The answer connects the distinct actions of the four key gastrointestinal hormones and explains how their coordinated activity facilitates efficient digestion.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen047"
  },
  {
    "question_text": "Discuss the role of growth factors secreted by non-endocrine tissues in tissue repair and regeneration.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Growth factors secreted by non-endocrine tissues promote the normal growth of tissues and are essential for repairing and regenerating damaged tissues.",
    "explanation": "This answer emphasizes the importance of non-endocrine growth factors in maintaining tissue health and facilitating repair processes.",
    "topic": "Growth Factors",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen048"
  },
  {
    "question_text": "Compare and contrast the roles of gastrin, secretin, CCK, and GIP in the gastrointestinal tract. In your answer, discuss their target organs and specific functions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Gastrin acts on the gastric glands to stimulate hydrochloric acid and pepsinogen secretion. Secretin targets the exocrine pancreas to promote the secretion of water and bicarbonate, thereby neutralizing stomach acid. CCK stimulates both the pancreas (for enzyme secretion) and the gall bladder (for bile release), aiding in digestion of fats and proteins. GIP inhibits gastric secretion and motility, thus regulating the digestive process.",
    "explanation": "The answer provides a comparative analysis of the four hormones by detailing each hormone's target organ and function, and shows how they complement one another in managing digestive processes.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen049"
  },
  {
    "question_text": "Discuss the dual hormonal regulation of blood pressure and red blood cell production, focusing on the roles of ANF and erythropoietin. How do these hormones interact with their target organs to maintain homeostasis?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "ANF, produced by the atrial wall, is secreted in response to high blood pressure and acts on blood vessels to induce dilation, thereby reducing blood pressure. Erythropoietin, produced by the kidney’s juxtaglomerular cells, stimulates the production of red blood cells, enhancing the oxygen-carrying capacity of blood. Both mechanisms are critical for maintaining cardiovascular homeostasis in different ways.",
    "explanation": "This comprehensive answer connects the regulation of blood pressure via ANF with the stimulation of red blood cell formation by erythropoietin, illustrating their roles in overall homeostasis.",
    "topic": "Hormones of Heart and Kidney",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen050"
  },
  {
    "question_text": "True or False: Atrial Natriuretic Factor (ANF) is secreted by endocrine glands.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "ANF is secreted by the atrial wall of the heart, which is not an endocrine gland, making the statement false.",
    "topic": "Hormones of Heart",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen051"
  },
  {
    "question_text": "True or False: Erythropoietin is responsible for stimulating erythropoiesis.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Erythropoietin, produced by the kidney, stimulates the formation of red blood cells, thereby affirming the statement.",
    "topic": "Hormones of Kidney",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen052"
  },
  {
    "question_text": "True or False: Gastrin decreases the secretion of hydrochloric acid and pepsinogen in the stomach.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Gastrin actually stimulates the secretion of hydrochloric acid and pepsinogen, so the statement is false.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen053"
  },
  {
    "question_text": "True or False: Cholecystokinin (CCK) stimulates the secretion of pancreatic enzymes and the release of bile juice from the gall bladder.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "CCK acts on both the pancreas and the gall bladder; it stimulates pancreatic enzyme secretion and bile release, making the statement true.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen054"
  },
  {
    "question_text": "True or False: Gastric Inhibitory Peptide (GIP) promotes gastric secretion and motility.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "GIP inhibits gastric secretion and motility; hence, the statement that it promotes these functions is false.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen055"
  },
  {
    "question_text": "True or False: Secretin increases the secretion of bicarbonate and water from the exocrine pancreas to help neutralize stomach acid.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Secretin stimulates the pancreas to secrete water and bicarbonate, which are key to neutralizing the acid from the stomach. This makes the statement true.",
    "topic": "Gastrointestinal Hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen056"
  },
  {
    "question_text": "Assume the normal red blood cell production rate is 2 million cells per second. During a hypoxic event, erythropoietin causes a 25% increase in this rate. Calculate the new erythropoiesis rate in million cells per second.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "2.5 million cells per second",
    "explanation": "A 25% increase on 2 million is 0.5 million, so the new production rate is 2 + 0.5 = 2.5 million cells per second.",
    "topic": "Hormones of Kidney",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "04_section_19_3",
    "question_id": "cbse_xi_kebo1dd_c119_gen057"
  },
  {
    "question_text": "Which type of hormone produced by the hypothalamus stimulates the synthesis and secretion of pituitary hormones?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Releasing hormones",
      "Inhibiting hormones",
      "Both releasing and inhibiting hormones",
      "None of the above"
    ],
    "correct_answer": "Releasing hormones",
    "explanation": "The hypothalamus produces two types of hormones: releasing hormones that stimulate the secretion of pituitary hormones and inhibiting hormones that block their secretion. In this case, the stimulating function is due to releasing hormones.",
    "topic": "The Hypothalamus",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen019"
  },
  {
    "question_text": "Which of the following hormones is secreted by the pars intermedia of the pituitary?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Growth Hormone (GH)",
      "Prolactin (PRL)",
      "Thyroid Stimulating Hormone (TSH)",
      "Melanocyte Stimulating Hormone (MSH)"
    ],
    "correct_answer": "Melanocyte Stimulating Hormone (MSH)",
    "explanation": "The pars intermedia of the pituitary primarily secretes Melanocyte Stimulating Hormone (MSH), although in humans it is nearly merged with the pars distalis.",
    "topic": "The Pituitary Gland",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen020"
  },
  {
    "question_text": "What disorder is primarily caused by iodine deficiency in the diet?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Hypothyroidism and goitre",
      "Hyperthyroidism",
      "Diabetes insipidus",
      "Addison's disease"
    ],
    "correct_answer": "Hypothyroidism and goitre",
    "explanation": "Iodine is essential for the synthesis of thyroid hormones. A deficiency leads to hypothyroidism and an enlargement of the thyroid gland, known as goitre.",
    "topic": "Thyroid Gland",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen021"
  },
  {
    "question_text": "Which hormones are secreted by the adrenal medulla?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Cortisol and Aldosterone",
      "Androgens",
      "Adrenaline and Noradrenaline",
      "Insulin and Glucagon"
    ],
    "correct_answer": "Adrenaline and Noradrenaline",
    "explanation": "The adrenal medulla produces catecholamines, specifically adrenaline (epinephrine) and noradrenaline (norepinephrine), which are released during stress responses.",
    "topic": "Adrenal Gland",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen022"
  },
  {
    "question_text": "Which cells in the Islets of Langerhans are responsible for the secretion of glucagon?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "α-cells",
      "β-cells",
      "δ-cells",
      "F-cells"
    ],
    "correct_answer": "α-cells",
    "explanation": "In the Islets of Langerhans of the pancreas, α-cells secrete glucagon, which plays a key role in increasing blood glucose levels.",
    "topic": "Pancreas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen023"
  },
  {
    "question_text": "Define the two types of hormones produced by the hypothalamus and state their primary roles.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The hypothalamus produces releasing hormones that stimulate the secretion of pituitary hormones and inhibiting hormones that suppress the secretion of pituitary hormones.",
    "explanation": "This answer identifies both types of hormones produced by the hypothalamus and explains their roles in regulating pituitary functions.",
    "topic": "The Hypothalamus",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen024"
  },
  {
    "question_text": "Explain the structural divisions of the pituitary gland and the primary hormone(s) produced by each division.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The pituitary gland is divided into the adenohypophysis (anterior pituitary) and the neurohypophysis (posterior pituitary). The adenohypophysis, which includes the pars distalis and pars intermedia, produces hormones such as GH, PRL, TSH, ACTH, LH, FSH, and MSH. The neurohypophysis stores and releases oxytocin and vasopressin, which are synthesized in the hypothalamus.",
    "explanation": "This answer outlines the two main divisions of the pituitary gland and provides examples of the hormones produced or stored in each division.",
    "topic": "Pituitary Gland",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen025"
  },
  {
    "question_text": "Describe the effects of thyroid hormones on metabolic processes in the body.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Thyroid hormones regulate the basal metabolic rate, support red blood cell production, and control the metabolism of carbohydrates, proteins, and fats, as well as maintaining water and electrolyte balance.",
    "explanation": "The response details the multifaceted roles of thyroid hormones, highlighting their broad impact on metabolic processes and homeostasis.",
    "topic": "Thyroid Gland",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen026"
  },
  {
    "question_text": "Discuss the hormonal interaction between the hypothalamus and the pituitary gland in regulating endocrine functions.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The hypothalamus produces releasing and inhibiting hormones that travel via the portal circulation to the anterior pituitary, where they regulate the release of various hormones. Additionally, the posterior pituitary is under direct neural control via hypothalamic nerve endings, which ensures precise hormone release into the bloodstream.",
    "explanation": "This answer analyzes how the hypothalamus and pituitary gland interact, highlighting the different pathways and control mechanisms for anterior and posterior pituitary hormone regulation.",
    "topic": "The Hypothalamus and Pituitary Gland",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen027"
  },
  {
    "question_text": "Describe the structure of the adrenal gland and discuss the functions of its different regions, including the hormones they secrete.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The adrenal gland consists of two main regions: the adrenal cortex and the adrenal medulla. The cortex is further divided into three layers: the zona glomerulosa, which synthesizes mineralocorticoids (primarily aldosterone) for electrolyte and water balance; the zona fasciculata, which produces glucocorticoids (such as cortisol) that are involved in metabolism, anti-inflammatory responses, and cardiovascular functions; and the zona reticularis, which secretes small amounts of androgenic steroids. The adrenal medulla produces catecholamines, specifically adrenaline and noradrenaline, which are crucial for the fight or flight response.",
    "explanation": "This detailed answer describes both the anatomical structure and the functional significance of each region of the adrenal gland, linking the specific hormone secretions to their physiological roles.",
    "topic": "Adrenal Gland",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen028"
  },
  {
    "question_text": "Explain the role of the pancreas in maintaining blood glucose levels and analyze how dysregulation of its hormonal output can lead to diabetes mellitus.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The pancreas maintains blood glucose levels through the balanced actions of insulin and glucagon produced by the β-cells and α-cells, respectively, within the Islets of Langerhans. Insulin promotes the uptake of glucose by cells and its storage as glycogen, thereby lowering blood sugar levels. Glucagon, on the other hand, stimulates glycogenolysis and gluconeogenesis in the liver, increasing blood glucose levels. Dysregulation, whether by insufficient insulin secretion or resistance to its effects, disrupts this balance, leading to chronic hyperglycemia, the hallmark of diabetes mellitus.",
    "explanation": "The answer clearly explains the antagonistic roles of insulin and glucagon in blood glucose regulation and discusses how an imbalance in these hormones can result in diabetes mellitus.",
    "topic": "Pancreas",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen029"
  },
  {
    "question_text": "Compare and contrast the endocrine functions of the testis and ovary, including the hormones produced and their effects on secondary sex characteristics and reproductive functions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The testis, located in the scrotum, functions as a primary sex organ and endocrine gland by producing androgens (mainly testosterone) from Leydig cells. Testosterone is essential for the development of male secondary sexual characteristics such as facial hair, a deeper voice, and increased muscle mass, as well as for stimulating spermatogenesis. In contrast, the ovary produces estrogens and progesterone. Estrogens are critical for the development of female secondary sexual characteristics, the growth of ovarian follicles, and the regulation of the menstrual cycle, while progesterone, secreted by the corpus luteum after ovulation, supports pregnancy by preparing the uterus for implantation. Thus, while both organs are involved in reproduction, they secrete different hormones that lead to distinct physiological outcomes in males and females.",
    "explanation": "This response provides a thorough comparison of the endocrine roles of the testis and ovary, highlighting both the similarities and differences in hormone production and their physiological effects.",
    "topic": "Sex Glands",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen030"
  },
  {
    "question_text": "Melatonin secreted by the pineal gland regulates the 24-hour sleep-wake cycle.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Melatonin is the key hormone produced by the pineal gland and is essential for the regulation of the circadian rhythm, including the sleep-wake cycle.",
    "topic": "Pineal Gland",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen031"
  },
  {
    "question_text": "The parathyroid hormone (PTH) decreases blood calcium levels.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "PTH is a hypercalcemic hormone that increases blood calcium levels by stimulating bone resorption, increasing calcium reabsorption in the kidneys, and enhancing calcium absorption in the gut.",
    "topic": "Parathyroid Gland",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen032"
  },
  {
    "question_text": "Oxytocin and vasopressin are synthesized in the posterior pituitary.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Although oxytocin and vasopressin are released by the posterior pituitary, they are actually synthesized in the hypothalamus and then transported to the posterior pituitary for storage and release.",
    "topic": "Pituitary Gland",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen033"
  },
  {
    "question_text": "Cortisol produced by the adrenal cortex only acts to increase blood glucose levels.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "While cortisol does stimulate gluconeogenesis and can increase blood glucose levels, it also has anti-inflammatory properties and affects protein and lipid metabolism, among other functions.",
    "topic": "Adrenal Gland",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen034"
  },
  {
    "question_text": "The thymus is solely responsible for developing T-lymphocytes for cell-mediated immunity.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Although the thymus plays a major role in the differentiation of T-lymphocytes, it also indirectly promotes antibody production and hence supports both cell-mediated and humoral immunity.",
    "topic": "Thymus",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen035"
  },
  {
    "question_text": "Insulin lowers blood glucose levels by enhancing its uptake by cells.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Insulin facilitates the uptake of glucose by cells, particularly in the liver and adipose tissue, thereby reducing the blood glucose concentration.",
    "topic": "Pancreas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen036"
  },
  {
    "question_text": "Approximately what percentage of the pancreatic tissue is composed of the Islets of Langerhans?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1 to 2 percent",
    "explanation": "The Islets of Langerhans account for about 1 to 2 percent of the pancreatic tissue, despite containing vital endocrine cells.",
    "topic": "Pancreas",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen037"
  },
  {
    "question_text": "Into how many layers is the adrenal cortex divided?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Three",
    "explanation": "The adrenal cortex is divided into three layers: the zona glomerulosa, zona fasciculata, and zona reticularis, each responsible for secreting different types of hormones.",
    "topic": "Adrenal Gland",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen038"
  },
  {
    "question_text": "Which of the following glands is known as a ductless gland?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Endocrine gland",
      "B: Exocrine gland",
      "C: Salivary gland",
      "D: Sweat gland"
    ],
    "correct_answer": "A: Endocrine gland",
    "explanation": "Endocrine glands are ductless glands because they secrete hormones directly into the bloodstream, unlike exocrine glands that use ducts.",
    "topic": "Endocrine glands and hormones",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen001"
  },
  {
    "question_text": "Which statement best reflects the modern definition of a hormone?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Hormones are produced in large amounts to initiate a reaction",
      "B: Hormones are non-nutrient chemicals that act as intercellular messengers in trace amounts",
      "C: Hormones are nutrients necessary for energy production",
      "D: Hormones are exclusively produced by exocrine glands"
    ],
    "correct_answer": "B: Hormones are non-nutrient chemicals that act as intercellular messengers in trace amounts",
    "explanation": "The modern definition of hormones emphasizes that they are non-nutrient chemicals acting as intercellular messengers and are produced in trace amounts, expanding beyond the classical view.",
    "topic": "Definition of hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen002"
  },
  {
    "question_text": "Which pair of endocrine glands is located within the brain?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Thyroid and parathyroid glands",
      "B: Pituitary and pineal glands",
      "C: Pancreas and adrenal glands",
      "D: Ovary and testis"
    ],
    "correct_answer": "B: Pituitary and pineal glands",
    "explanation": "The pituitary and pineal glands are located within the brain, playing crucial roles in regulating various bodily functions.",
    "topic": "Location of endocrine glands",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen003"
  },
  {
    "question_text": "Which of the following functions is regulated by hormones secreted by the endocrine glands?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Digestion exclusively",
      "B: Growth, metabolism, and reproduction",
      "C: Only reproduction",
      "D: Only metabolism"
    ],
    "correct_answer": "B: Growth, metabolism, and reproduction",
    "explanation": "Hormones regulate a wide array of bodily functions, including growth, metabolism, and reproduction. This is a primary role of the endocrine system.",
    "topic": "Bodily functions regulated by hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen004"
  },
  {
    "question_text": "Compared to vertebrates, invertebrates are characterized by an endocrine system that:",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A: Contains a large number of hormones with complex interactions",
      "B: Lacks endocrine glands entirely",
      "C: Possesses only a few hormones with simple coordination",
      "D: Has similar complexity to vertebrates"
    ],
    "correct_answer": "C: Possesses only a few hormones with simple coordination",
    "explanation": "Invertebrates have a simpler endocrine system with fewer hormones compared to the complex hormonal regulation seen in vertebrates.",
    "topic": "Vertebrate vs invertebrate endocrine systems",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen005"
  },
  {
    "question_text": "Define hormones according to the current scientific definition and mention one key difference from the classical definition.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hormones are non-nutrient chemicals that act as intercellular messengers produced in trace amounts. Unlike the classical definition that limits hormones to those produced by organized endocrine glands, the modern definition includes a broader range of molecules.",
    "explanation": "This answer covers the modern definition emphasizing trace amounts and intercellular messaging, and notes the expansion of the definition beyond just organized endocrine glands.",
    "topic": "Definition of hormones",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen006"
  },
  {
    "question_text": "What roles do the major endocrine glands play in regulating bodily functions?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "They secrete hormones that regulate functions such as growth, metabolism, and reproduction.",
    "explanation": "The major endocrine glands produce hormones responsible for a variety of physiological processes including growth, metabolic regulation, and reproduction.",
    "topic": "Function of endocrine glands",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen007"
  },
  {
    "question_text": "Describe the significance of knowing the location of endocrine glands as shown in the textbook diagrams.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Knowing the location of endocrine glands is important because it helps correlate anatomical structures with their specific functions, aids in diagnosing endocrine disorders, and enhances understanding of how hormones are transported to their target organs.",
    "explanation": "This answer emphasizes the diagnostic and functional importance of the anatomical placement of endocrine glands, as highlighted in the diagrams.",
    "topic": "Diagram of endocrine glands",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen008"
  },
  {
    "question_text": "How do the endocrine systems of invertebrates differ from those of vertebrates?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Invertebrates possess a simpler endocrine system with only a few hormones, whereas vertebrates have a more complex system with numerous hormones that regulate a variety of bodily functions.",
    "explanation": "This answer clarifies that invertebrate endocrine systems are basic in comparison to the complex, multi-hormonal systems seen in vertebrates.",
    "topic": "Endocrine systems in invertebrates vs vertebrates",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen009"
  },
  {
    "question_text": "Explain how hormones function as intercellular messengers in the human body and discuss why being produced in trace amounts is significant.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hormones are released by endocrine glands directly into the bloodstream and travel to distant target organs, where they bind to specific receptors to elicit a response. Their production in trace amounts is crucial because small concentrations are enough to trigger significant biological responses, and precise regulation prevents over- or under-stimulation of target tissues.",
    "explanation": "This answer details the mechanism of hormone action and the importance of their low concentration in maintaining proper physiological regulation.",
    "topic": "Mechanism of hormone action",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen010"
  },
  {
    "question_text": "Discuss the importance of the anatomical location of endocrine glands as illustrated in the diagrams, and how this arrangement supports their functional roles in human physiology.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The anatomical location of endocrine glands is critical because it ensures that hormones are strategically released into the bloodstream near major blood vessels, allowing rapid delivery to target organs. For example, glands in the brain (pituitary, pineal) regulate central processes like growth and circadian rhythms, while those in the neck (thyroid, parathyroid) influence metabolism. This spatial arrangement supports efficient hormonal coordination and helps diagnose related disorders.",
    "explanation": "This response links gland location with functional efficiency and underscores its importance in diagnosing endocrine disorders, reflecting the integration of structure and function.",
    "topic": "Anatomical location and function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen011"
  },
  {
    "question_text": "Compare the classical and modern definitions of hormones, and analyze the implications of this expanded definition on our understanding of endocrine communication in both vertebrates and invertebrates.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The classical definition of hormones focused on chemicals produced by organized endocrine glands and released into the blood, whereas the modern definition broadens this to include any non-nutrient chemical that acts as an intercellular messenger in trace amounts. This expanded definition implies that hormonal regulation is more diverse than previously thought, incorporating additional molecules that contribute to complex signaling networks in vertebrates and simpler systems in invertebrates. It enhances our understanding of how different organisms use hormonal signals to coordinate bodily functions.",
    "explanation": "By comparing both definitions, this answer highlights the evolution in our understanding of hormones and the broader implications for endocrine communication across different organisms.",
    "topic": "Evolution of hormone definitions",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen012"
  },
  {
    "question_text": "Endocrine glands have ducts to transport their secretions.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Endocrine glands are ductless glands that secrete hormones directly into the bloodstream.",
    "topic": "Characteristics of endocrine glands",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen013"
  },
  {
    "question_text": "Hormones are produced in large amounts by the endocrine glands.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Hormones are produced in trace amounts, which is sufficient for their role as intercellular messengers.",
    "topic": "Production of hormones",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen014"
  },
  {
    "question_text": "Vertebrates possess a more complex endocrine system compared to invertebrates.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Vertebrates have a complex endocrine system with many hormones involved in diverse regulatory functions, unlike invertebrates with simpler systems.",
    "topic": "Vertebrate versus invertebrate endocrine systems",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen015"
  },
  {
    "question_text": "The diagram illustrating the location of endocrine glands is essential for understanding their functions and related disorders.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The diagram aids in correlating anatomical structures with their functions, which is important for understanding how hormonal imbalances can lead to disorders.",
    "topic": "Diagrams of endocrine glands",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen016"
  },
  {
    "question_text": "Hormones are considered nutrient chemicals in the human body.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Hormones are classified as non-nutrient chemicals; they serve as signaling molecules rather than sources of nutrition.",
    "topic": "Nature of hormones",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen017"
  },
  {
    "question_text": "The presence of a large number of hormones in vertebrates indicates a higher level of regulatory complexity in their endocrine system.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "A greater diversity of hormones in vertebrates is associated with complex regulatory mechanisms that control various physiological processes.",
    "topic": "Complexity of endocrine regulation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "02_section_19_1",
    "question_id": "cbse_xi_kebo1dd_c119_gen018"
  }
]