[
  {
    "question_text": "How is a pinnately compound leaf different from a palmately compound leaf?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A pinnately compound leaf has leaflets arranged along both sides of a common central rachis, whereas a palmately compound leaf has leaflets that all attach at a common point at the tip of the petiole.",
    "explanation": "In a pinnately compound leaf the leaflets are arranged along a central axis, giving the appearance of a feather, while in a palmately compound leaf, the leaflets spread out like the fingers of a hand. Examples include the neem (pinnately compound) and silk cotton (palmately compound).",
    "topic": "Types of Leaves",
    "bloom_level": "Understand",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex027",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Explain with suitable examples the different types of phyllotaxy.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Phyllotaxy is the pattern in which leaves are arranged on a stem. The three main types are alternate (a single leaf per node arranged alternately, e.g., china rose, mustard, sunflower), opposite (two leaves per node positioned on opposite sides, e.g., Calotropis, guava), and whorled (three or more leaves per node forming a circle, e.g., Alstonia).",
    "explanation": "These patterns affect light capture and overall plant aesthetics. Alternate phyllotaxy means one leaf per node in an alternating fashion, opposite involves pairs at each node, and whorled has multiple leaves radiating from a single node. Examples provided in the chapter illustrate these distinctions.",
    "topic": "Phyllotaxy",
    "bloom_level": "Understand",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex028",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Define the following terms: (a) aestivation (b) placentation (c) actinomorphic (d) zygomorphic (e) superior ovary (f) perigynous flower (g) epipetalous stamen",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Aestivation refers to the arrangement of sepals or petals in the bud; placentation is the arrangement of ovules within the ovary; actinomorphic means having radial symmetry; zygomorphic means having bilateral symmetry; a superior ovary is one that is positioned above the point of attachment of other floral parts; a perigynous flower has floral parts attached around the ovary at roughly the same level, making the ovary half-inferior; epipetalous stamen is a stamen that is attached to the petals.",
    "explanation": "Each term describes key aspects of floral morphology. Aestivation is important for bud protection, placentation relates to ovule placement, and the terms actinomorphic and zygomorphic refer to the symmetry of the flower. Superior, perigynous, and epipetalous describe the positions and attachments of the flower parts relative to the ovary and other structures.",
    "topic": "Floral Morphology",
    "bloom_level": "Remember",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex029",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Differentiate between (a) Racemose and cymose inflorescence and (b) Apocarpous and syncarpous ovary.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Racemose inflorescence is characterized by a continuously growing main axis with flowers borne in an acropetal succession, whereas in cymose inflorescence, the main axis terminates in a flower with subsequent flowers borne basipetally. An apocarpous ovary consists of multiple free carpels, while a syncarpous ovary has carpels that are fused together.",
    "explanation": "In racemose inflorescence the axis continues to grow and new flowers emerge from lateral positions in a top-to-bottom order; in cymose, the terminal flower halts the growth of the main axis. Similarly, apocarpous ovaries have separate, unfused carpels, whereas syncarpous ovaries show fusion of the carpels, as seen in plants like tomato and mustard.",
    "topic": "Inflorescence and Flower Morphology",
    "bloom_level": "Understand",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex030",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Draw the labelled diagram of the following: (i) gram seed (ii) V.S. of maize seed.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For a gram seed, the diagram should include a well-defined seed coat with its layers (testa and tegmen), hilum, micropyle, two cotyledons, a radicle and a plumule. For a vertical section (V.S.) of a maize seed, the diagram should show the seed coat fused with the fruit wall, a bulky endosperm with an aleurone layer, and the embryo consisting of a scutellum, coleoptile, plumule, radicle and coleorhiza.",
    "explanation": "The gram seed, being dicotyledonous, has two distinct cotyledons and internal structures as described in the chapter, while the maize seed, representative of monocotyledonous seeds, features a prominent endosperm and specialized structures like the scutellum and coleoptile. Labeling each component is crucial to demonstrate an understanding of seed anatomy.",
    "topic": "Seed Structure",
    "bloom_level": "Apply",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex031",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Take one flower of the family Solanaceae and write its semi-technical description. Also draw their floral diagram.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A semi-technical description of a Solanaceae flower should include details of its vegetative and floral characters such as: a herbaceous stem, alternate simple leaves with reticulate venation, solitary or cymose inflorescence, bisexual and actinomorphic flower with five united sepals (calyx) showing valvate aestivation, five united petals (corolla), five stamens that are epipetalous, and a bicarpellary, syncarpous gynoecium with a superior ovary. The floral diagram should visually represent these parts arranged in successive whorls.",
    "explanation": "The answer should capture the characteristic traits of Solanaceae as provided in the chapter, detailing both the vegetative and reproductive structures. Drawing an accurate floral diagram reinforces the understanding of the spatial arrangement of these parts including the consistent five-part pattern in flowers of this family.",
    "topic": "Solanaceae and Floral Morphology",
    "bloom_level": "Create",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex032",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Describe the various types of placentations found in flowering plants.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The main types of placentation in flowering plants include marginal placentation (ovules attached along a ridge on the ventral suture of the ovary, e.g., pea), axile placentation (ovules attached to a central axis in a multilocular ovary, e.g., tomato, china rose), parietal placentation (ovules attached to the inner wall of the ovary), free central placentation (ovules borne on a central axis with no septa, e.g., Dianthus), and basal placentation (a single ovule attached at the base, e.g., sunflower).",
    "explanation": "This response explains the different positional arrangements of ovules within the ovary, each of which is important for understanding how reproductive structures are organized in different flowering plants. The distinctions are critical for classification and understanding the development of the ovary.",
    "topic": "Gynoecium and Placentation",
    "bloom_level": "Understand",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex033",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "What is a flower? Describe the parts of a typical angiosperm flower.",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A flower is the reproductive unit in angiosperms characterized by modifications of a shoot. It typically consists of four whorls: the calyx (sepals) which protects the bud, the corolla (petals) which attract pollinators, the androecium (stamens) which produce pollen, and the gynoecium (carpels) which contains the ovary, style, and stigma.",
    "explanation": "The description covers the fundamental parts of a flower and explains their functions in reproduction. The calyx and corolla are considered accessory structures while the androecium and gynoecium are responsible for sexual reproduction.",
    "topic": "Flower Structure",
    "bloom_level": "Understand",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex034",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Define the term inflorescence. Explain the basis for the different types of inflorescence in flowering plants.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Inflorescence is the arrangement of flowers on a plant’s floral axis. The two major types are racemose, where the main axis continues to grow and flowers are borne laterally in an acropetal order, and cymose, where the main axis terminates in a flower and growth is limited, resulting in flowers being borne in a basipetal order.",
    "explanation": "This answer explains that inflorescence refers to how flowers are organized on a stem. The developmental pattern—whether the apex continues to grow or terminates with a flower—determines whether the inflorescence is racemose or cymose, as discussed in the chapter.",
    "topic": "Inflorescence",
    "bloom_level": "Understand",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex035",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Describe the arrangement of floral members in relation to their insertion on thalamus.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The arrangement of floral members is described based on their insertion relative to the ovary on the thalamus. In a hypogynous flower, the gynoecium is at the highest position with other floral parts attached below it, giving a superior ovary. In a perigynous flower, the other parts are attached around the ovary so that they are almost on the same level, resulting in a half-inferior ovary. In an epigynous flower, the floral parts arise above an inferior ovary, as the thalamus grows upward to partially or completely enclose the ovary.",
    "explanation": "The answer provides a clear explanation of how the position of the calyx, corolla, and androecium relative to the ovary determines whether a flower is hypogynous, perigynous, or epigynous. This classification is essential for understanding the diversity of floral structures in angiosperms.",
    "topic": "Flower Structure and Floral Arrangement",
    "bloom_level": "Understand",
    "source": "exercise",
    "question_id": "cbse_xi_kebo1dd_c105_ex036",
    "chapter_id": "kebo105",
    "exercise_id": "12_exercise_unknown"
  },
  {
    "question_text": "Which part of the root protects the apical meristem as the root grows through the soil?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Root cap",
      "Region of elongation",
      "Region of maturation",
      "Root hair zone"
    ],
    "correct_answer": "Root cap",
    "explanation": "The root cap is a thimble-like structure that protects the sensitive apical meristem while the root pushes through the soil.",
    "topic": "Regions of the Root",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen001",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "In dicotyledonous plants, the direct elongation of the radicle leads to the formation of which type of root system?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Fibrous root system",
      "Taproot system",
      "Adventitious root system",
      "Lateral root system"
    ],
    "correct_answer": "Taproot system",
    "explanation": "Dicots develop a primary root (taproot system) from the radicle that elongates and gives rise to lateral roots.",
    "topic": "The Root",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen002",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "Which of the following best describes a fibrous root system?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A large, central root with many lateral branches",
      "Many thin roots of similar size with no dominant root",
      "Roots that mostly arise from non-root parts of the plant",
      "A root system specialized for nutrient storage"
    ],
    "correct_answer": "Many thin roots of similar size with no dominant root",
    "explanation": "The fibrous root system is characterized by numerous thin roots of similar size, typical in monocotyledonous plants.",
    "topic": "The Root",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen003",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "Which region of the root is responsible for the formation of fine, thread-like structures called root hairs?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Region of meristematic activity",
      "Region of elongation",
      "Region of maturation",
      "Root cap"
    ],
    "correct_answer": "Region of maturation",
    "explanation": "Root hairs, which absorb water and minerals, form in the region of maturation where cells differentiate.",
    "topic": "Regions of the Root",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen004",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "In monocotyledonous plants, the short-lived primary root is replaced by several roots originating from the base of the stem. What is this type of root system called?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Taproot system",
      "Fibrous root system",
      "Adventitious root system",
      "Secondary root system"
    ],
    "correct_answer": "Fibrous root system",
    "explanation": "Monocots form a fibrous root system where the primary root is short-lived and replaced by many similar sized roots from the stem base.",
    "topic": "The Root",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen005",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "Name one primary function of the root system.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Absorption of water and minerals, anchorage, storage of reserve food material, or synthesis of plant growth regulators.",
    "explanation": "The root system performs several functions including absorption of water and nutrients, anchorage, storage of reserve food, and synthesis of growth regulators.",
    "topic": "The Root",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen006",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "Compare the primary root system in dicotyledonous plants with the fibrous root system in monocotyledonous plants in terms of origin and structure.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Dicots have a taproot system originating directly from the radicle with a dominant primary root and lateral branches, whereas monocots develop a fibrous root system where the primary root is short-lived and numerous roots arise from the stem base.",
    "explanation": "Dicot plants develop a central taproot system from the radicle, while monocots form a fibrous system with many similarly sized roots from the stem base.",
    "topic": "The Root",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen007",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "Explain the role of the region of meristematic activity in root growth.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The region of meristematic activity contains small, thin-walled cells with dense protoplasm that are actively dividing to produce new cells for root growth.",
    "explanation": "This region is crucial as it produces the new cells that, after elongation and maturation, contribute to the overall growth and development of the root.",
    "topic": "Regions of the Root",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen008",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "Describe in detail the three primary zones found at the tip of a plant root and the key functions for each zone.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The three zones are: 1) The region of meristematic activity at the tip where cell division occurs; 2) The region of elongation where cells increase in length contributing to root growth; and 3) The region of maturation where cells differentiate, with some developing into root hairs for absorption.",
    "explanation": "Each region has a distinct role: the meristematic zone generates new cells, the elongation zone contributes to lengthening, and the maturation zone ensures cells are specialized for functions like nutrient uptake.",
    "topic": "Regions of the Root",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen009",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "Evaluate the adaptive advantages of having different types of root systems (taproot, fibrous, and adventitious) in plants under various soil conditions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Each root system offers unique advantages: a taproot system provides deep anchorage and access to deep water reserves, a fibrous system offers an extensive network for absorbing surface water and nutrients in shallow soils, and adventitious roots allow plants to establish anchors or propagate from non-root tissues under various conditions. The suitability of each system depends on environmental factors such as soil composition, moisture availability, and mechanical stability.",
    "explanation": "Different root systems ensure that plants can adapt to various environmental challenges, optimize nutrient and water uptake, and secure themselves in diverse soil conditions.",
    "topic": "The Root",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen010",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "True or False: The primary function of root hairs is to increase the surface area for absorption of water and minerals.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Root hairs are specialized structures that greatly increase the surface area of the root, enhancing absorption of water and minerals.",
    "topic": "Regions of the Root",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen011",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "True or False: The root cap is located just above the region of elongation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The root cap is located at the very tip of the root, covering the region of meristematic activity, not above the region of elongation.",
    "topic": "Regions of the Root",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen012",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "True or False: In dicotyledonous plants, the radicle develops into a primary root that supports the formation of secondary and tertiary roots.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "In dicots, the radicle elongates to form the primary root, which later develops lateral roots (secondary, tertiary, etc.) forming a taproot system.",
    "topic": "The Root",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen013",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "True or False: Adventitious roots only arise from the radicle in plants.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Adventitious roots form from parts of the plant other than the radicle, such as stems, leaves, or nodes, which distinguishes them from primary roots.",
    "topic": "The Root",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen014",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "True or False: In monocotyledonous plants, the primary root remains persistent throughout the plant's life.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In monocots, the primary root is short lived and is replaced by a network of roots forming a fibrous root system.",
    "topic": "The Root",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen015",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1"
  },
  {
    "question_text": "What is the ascending part of the plant axis that bears branches, leaves, flowers, and fruits called?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Leaf",
      "Stem",
      "Root",
      "Flower"
    ],
    "correct_answer": "Stem",
    "explanation": "The stem is described as the ascending part of the plant's axis that bears branches, leaves, flowers, and fruits.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen016",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Which of the following options correctly identifies the region of the stem where leaves are produced?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Internodes",
      "Nodes",
      "Buds",
      "Internodal zones"
    ],
    "correct_answer": "Nodes",
    "explanation": "Nodes are the specific regions on the stem where leaves are born.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen017",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Which of the following is a primary function of the stem in plants?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Food digestion",
      "Conducting water, minerals, and photosynthates",
      "Absorbing water from the soil",
      "Pollination"
    ],
    "correct_answer": "Conducting water, minerals, and photosynthates",
    "explanation": "The stem conducts water, minerals and photosynthates, playing a crucial role in the transport system of the plant.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen018",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Some stems perform functions other than conduction. Which of the following is one such additional function?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Support",
      "Transpiration",
      "Seed dispersal",
      "Enzymatic breakdown"
    ],
    "correct_answer": "Support",
    "explanation": "In addition to conduction, some stems provide support, store food, offer protection, and facilitate vegetative propagation.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen019",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "What color change does the stem often undergo as it matures?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "It remains green throughout its life",
      "It turns bright yellow",
      "It becomes woody and dark brown",
      "It turns red"
    ],
    "correct_answer": "It becomes woody and dark brown",
    "explanation": "Young stems are generally green, but as they mature, they often become woody and dark brown.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen020",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Define a node in the context of stem anatomy.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A node is the region on the stem where leaves are produced.",
    "explanation": "Nodes are specific parts of the stem that serve as the origin points for leaves and buds.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen021",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Describe the main differences between a stem and a root.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A stem is the ascending part of the plant that bears branches, leaves, flowers, and fruits and develops from the plumule of the embryo, whereas a root is generally the underground part responsible for anchoring the plant and absorbing water and nutrients.",
    "explanation": "The definition differentiates the stem and the root in terms of location, function, and developmental origin.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen022",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "List two functions of the stem in addition to conduction.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Storage of food and support",
    "explanation": "Apart from conduction, some stems also serve as storage organs, provide support, offer protection, and aid in vegetative propagation.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen023",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Explain the significance of buds on the stem.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Buds, both terminal and axillary, are crucial as they give rise to leaves, branches, or flowers, thereby facilitating growth and reproduction.",
    "explanation": "Buds are essential for the expansion and development of the plant, contributing to the emergence of various structures.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen024",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Discuss the multifunctional roles of the stem in plants and explain how its structure supports these functions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The stem not only spreads out branches to bear leaves, flowers, and fruits, but it also functions as a conduit for water, minerals, and photosynthates. Its structure, characterized by nodes and internodes, supports growth by providing systematic spacing for organ development. Additionally, some stems store food, offer physical support, provide protection, and are capable of vegetative propagation. The transition from a green, flexible tissue to a woody, rigid structure further enhances its supportive role as the plant matures.",
    "explanation": "This answer synthesizes the multiple roles of the stem, linking the anatomical features (nodes, internodes, buds) with their respective functions in conduction, storage, support, protection, and propagation.",
    "topic": "The Stem",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen025",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Examine how the development of the stem from the plumule contributes to vegetative propagation in plants.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The stem develops from the plumule of the embryo, and this early development is crucial as it establishes the plant's architecture by initiating branches and buds. These buds, which can be terminal or axillary, are important for vegetative propagation since they have the potential to initiate new growth. Moreover, in some plants, parts of the stem can store food and nutrients, providing the necessary resources for new shoots to emerge, thereby facilitating clonal propagation.",
    "explanation": "This answer explores the developmental origins of the stem and connects them to the plant's ability to reproduce vegetatively, emphasizing the role of buds and storage tissue.",
    "topic": "The Stem",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen026",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Compare and contrast the functions of nodes, internodes, and buds in the growth and development of the plant stem.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Nodes are the regions where leaves and buds are formed, making them critical for determining the point of new organ emergence. Internodes are the segments between nodes and are responsible for spacing these organs appropriately. Buds, which may occur at nodes (axillary) or at the tip (terminal), serve as the initiation sites for new leaves, branches, or flowers. Together, these structures orchestrate the pattern and rhythm of growth in the stem.",
    "explanation": "This answer differentiates the specific roles of nodes, internodes, and buds by explaining how each component contributes to the overall structure and function of the stem.",
    "topic": "The Stem",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen027",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "True or False: The stem develops from the radicle of the embryo.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The stem develops from the plumule, not the radicle. The radicle gives rise to the root system.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen028",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "True or False: Buds on the stem can only be found at the tips of the stem.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Buds can be either terminal (at the tip) or axillary (at the sides), not exclusively at the tips.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen029",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "True or False: In addition to conduction, the stem may also function in storage, support, protection, and vegetative propagation.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The stem is multifunctional, often storing food, providing support and protection, and facilitating vegetative propagation along with conducting water, minerals, and photosynthates.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen030",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "True or False: Internodes are the regions of the stem where leaves are produced.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Leaves are produced at the nodes, not on the internodes. Internodes are the segments located between nodes.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen031",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "True or False: Mature stems that have become woody provide enhanced support for the plant.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "As the stem matures and becomes woody and dark brown, it gains increased strength and rigidity, thereby providing better support.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen032",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "True or False: A stem that is green in appearance will always remain green throughout its life.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Young stems are generally green, but as they mature they often become woody and dark brown, indicating a change in structure and coloration.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen033",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Estimate the number of internodes on a stem that has 10 nodes, assuming that internodes occur only between adjacent nodes.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "9 internodes",
    "explanation": "Since internodes are found between nodes, a stem with 10 nodes will have 9 internodes.",
    "topic": "The Stem",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen034",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2"
  },
  {
    "question_text": "Which part of the leaf is the green expanded area that carries out photosynthesis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Lamina",
      "Petiole",
      "Leaf base",
      "Stipule"
    ],
    "correct_answer": "Lamina",
    "explanation": "The lamina, or leaf blade, is the green, expanded part of the leaf where photosynthesis takes place.",
    "topic": "The Leaf; Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen035",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "In monocotyledonous plants, the leaf base often expands into a structure that partially or wholly covers the stem. Which structure is this?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Pulvinus",
      "Sheath",
      "Stipule",
      "Rachis"
    ],
    "correct_answer": "Sheath",
    "explanation": "In monocotyledons, the leaf base expands into a sheath that covers the stem either partially or fully.",
    "topic": "Leaf; Leaf Base",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen036",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "Which venation pattern is most commonly found in dicotyledonous plants?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Reticulate",
      "Parallel",
      "Both equally common",
      "None of the above"
    ],
    "correct_answer": "Reticulate",
    "explanation": "Dicotyledonous plants generally exhibit reticulate venation, where veinlets form a network within the leaf lamina.",
    "topic": "Venation",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen037",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "When the incisions of the lamina extend all the way to the midrib, breaking it into separate leaflets, how is such a leaf classified?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Simple leaf",
      "Compound leaf",
      "Cordate leaf",
      "Basal leaf"
    ],
    "correct_answer": "Compound leaf",
    "explanation": "A leaf is classified as compound if its incisions reach the midrib, creating separate leaflets.",
    "topic": "Types of Leaves",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen038",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "In a pinnately compound leaf, what is the name of the common stalk to which all the leaflets are attached?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Petiole",
      "Rachis",
      "Midrib",
      "Stipule"
    ],
    "correct_answer": "Rachis",
    "explanation": "In a pinnately compound leaf, the rachis is the common axis (a continuation of the midrib) that supports the individual leaflets.",
    "topic": "Types of Leaves",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen039",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "Define the term 'lamina' as described in the section.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The lamina is the green, expanded part of a leaf that contains veins and is primarily responsible for photosynthesis.",
    "explanation": "The section describes the lamina as the leaf blade, which is the primary site for photosynthetic activity.",
    "topic": "Leaf; Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen040",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "Describe the role and importance of the petiole in a leaf's function.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The petiole holds the leaf blade in position to maximize light exposure and enables movement, such as fluttering in the wind, to cool the leaf and bring in fresh air.",
    "explanation": "The petiole is crucial because its flexibility and orientation help capture light for photosynthesis while also preventing overheating by facilitating air flow.",
    "topic": "Leaf; Petiole",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen041",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "What is the main difference between reticulate and parallel venation in leaves?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Reticulate venation forms a network of veins and veinlets, while parallel venation consists of veins running in parallel within the lamina.",
    "explanation": "Understanding the two patterns helps in identifying plant types: dicots generally have reticulate venation, while monocots usually exhibit parallel venation.",
    "topic": "Venation",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen042",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "Explain the significance of the axillary bud located at the base of a leaf in terms of plant growth.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The axillary bud, located in the leaf axil, is crucial as it has the potential to develop into a new branch, thereby contributing to the plant’s growth and overall architecture.",
    "explanation": "This bud's ability to form new branches allows the plant to expand its photosynthetic area and adapt its structure for improved light capture and growth.",
    "topic": "Leaf; Axillary Bud",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen043",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "Discuss the structural differences between simple and compound leaves. Include examples provided in the section.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Simple leaves have a single, undivided lamina or incisions that do not reach the midrib, whereas compound leaves have incisions that extend to the midrib, dividing the leaf into distinct leaflets. Examples include simple leaves (general form) and compound leaves such as pinnately compound leaves (Neem) and palmately compound leaves (Silk Cotton).",
    "explanation": "This answer should highlight that simple leaves maintain a continuous blade, while compound leaves are divided into multiple parts due to the incisions reaching the midrib, with the specific types given as examples from the text.",
    "topic": "Types of Leaves",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen044",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "Analyze how the structure of the petiole contributes to the efficiency of photosynthesis in leaves.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The petiole supports the leaf blade and ensures optimal positioning for light absorption. Its flexibility allows the leaf to flutter in the wind, which cools the leaf and promotes gas exchange by bringing in fresh air. This dynamic movement helps regulate temperature and enhances the overall efficiency of photosynthesis.",
    "explanation": "The answer should include an analysis of the petiole's structural role in positioning the lamina and facilitating movement for thermal regulation and efficient exchange of gases necessary for photosynthesis.",
    "topic": "Leaf; Petiole",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen045",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "Propose a hypothetical experiment to study the effect of different venation patterns on the efficiency of nutrient transport in leaves.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One possible experiment could involve selecting plant species with clear differences in venation (reticulate vs. parallel) and measuring rates of nutrient transport using dye tracers. The experiment would control for factors like leaf size, light exposure, and water availability, and then compare the movement of the tracer dye through the veins. Data on transport speed and distribution patterns would be collected and analyzed to determine the impact of venation pattern on efficiency.",
    "explanation": "The answer should reflect creativity in experimental design, consideration of variables, and a clear method to measure and compare nutrient transport efficiency in leaves with different venation patterns.",
    "topic": "Venation; Experimental Design",
    "bloom_level": "Create",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen046",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "True or False: The leaf is considered the most important vegetative organ for carrying out photosynthesis in plants.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section emphasizes that leaves are the primary organ for photosynthesis, making them the most important vegetative structures in a plant.",
    "topic": "The Leaf; Photosynthesis",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen047",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "True or False: In compound leaves, the axillary buds are found in the axil of each leaflet.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In compound leaves, the bud is present in the axil of the petiole, not on the axil of each individual leaflet.",
    "topic": "Types of Leaves; Axillary Bud",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen048",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "True or False: Alternate phyllotaxy means that only one leaf arises at each node in an alternate arrangement along the stem.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Alternate phyllotaxy is characterized by the emergence of a single leaf at each node, arranged in an alternating pattern along the stem.",
    "topic": "Phyllotaxy",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen049",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "True or False: In a pinnately compound leaf, the individual leaflets are attached along a common axis known as the rachis.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Pinnately compound leaves have their leaflets attached along the rachis, which functions as the common stalk, as noted in the section.",
    "topic": "Types of Leaves",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen050",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "True or False: Parallel venation is characteristic of most dicotyledonous plants.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Parallel venation is typical of most monocotyledonous plants, while dicots usually exhibit reticulate venation.",
    "topic": "Venation",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen051",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "True or False: Acropetal leaf arrangement means that the older leaves are found at the base and the younger leaves at the top of the shoot.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Acropetal arrangement indicates that new leaves develop at the apex while the older leaves remain at the base, confirming the statement.",
    "topic": "Phyllotaxy",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen052",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3"
  },
  {
    "question_text": "What transformation occurs in the shoot apical meristem when a shoot tip becomes a flower?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The shoot apical meristem becomes a root meristem",
      "The shoot apical meristem changes to floral meristem",
      "The shoot apical meristem produces only leaves",
      "The shoot apical meristem remains unchanged"
    ],
    "correct_answer": "The shoot apical meristem changes to floral meristem",
    "explanation": "When a shoot tip transforms into a flower, the shoot apical meristem is modified into a floral meristem, which then produces floral appendages instead of leaves.",
    "topic": "Inflorescence and flower development",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen053",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "In a racemose inflorescence, how are the flowers arranged along the main axis?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The flowers are arranged in basipetal order",
      "The flowers are borne laterally in acropetal succession",
      "The flowers develop simultaneously at all nodes",
      "The flowers form only at the terminal end"
    ],
    "correct_answer": "The flowers are borne laterally in acropetal succession",
    "explanation": "In racemose inflorescence, the main axis continues to grow and produces flowers laterally with the youngest at the apex (acropetal succession).",
    "topic": "Inflorescence types",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen054",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "Which type of inflorescence features a terminal flower that terminates further axis growth?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Racemose",
      "Cymose",
      "Both",
      "Neither"
    ],
    "correct_answer": "Cymose",
    "explanation": "In cymose inflorescences, the main axis terminates in a flower, which stops further growth along that axis.",
    "topic": "Inflorescence types",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen055",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "Which of the following best describes opposite phyllotaxy?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Leaves are arranged alternately at each node",
      "Two leaves emerge from the same node arranged on opposite sides of the stem",
      "Three or more leaves form a circular whorl",
      "Leaves are randomly arranged along the stem"
    ],
    "correct_answer": "Two leaves emerge from the same node arranged on opposite sides of the stem",
    "explanation": "Opposite phyllotaxy is characterized by two leaves emerging from a node positioned on opposite sides of the stem, as seen in the guava example.",
    "topic": "Phyllotaxy",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen056",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "Explain how the transformation of the shoot tip into a flower illustrates a modification in the shoot apical meristem.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The transformation involves the shoot apical meristem changing into a floral meristem that stops elongating internodes and produces floral organs instead of leaves.",
    "explanation": "When the shoot tip becomes a flower, the shoot apical meristem is modified into a floral meristem. This transformation halts the elongation of internodes, condenses the axis, and results in the production of floral appendages instead of typical leaves. This is a key developmental change in flowering plants.",
    "topic": "Inflorescence and floral development",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen057",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "Describe the main differences between racemose and cymose inflorescences in terms of axis growth and flower arrangement.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Racemose inflorescences have a continuously growing main axis with flowers arranged in acropetal succession, while cymose inflorescences have a terminating main axis with flowers arranged in basipetal order.",
    "explanation": "In racemose inflorescences, the main axis continues to grow and produces flowers laterally in acropetal succession. Conversely, in cymose inflorescences, the main axis ends in a flower which stops further growth, and the flowers develop in a basipetal sequence.",
    "topic": "Inflorescence types",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen058",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "What is the significance of phyllotaxy in plants?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Phyllotaxy is important for optimal light capture, efficient photosynthesis, and overall plant adaptation to its environment.",
    "explanation": "Phyllotaxy, the arrangement of leaves on a stem, affects how well a plant captures light, thereby influencing its photosynthetic efficiency and ecological adaptation.",
    "topic": "Phyllotaxy",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen059",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "Discuss the adaptive significance of different inflorescence arrangements (racemose and cymose) in facilitating effective pollination.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Different inflorescence arrangements have evolved to enhance pollination efficiency. In racemose inflorescences, the continual growth of the main axis and the acropetal arrangement of flowers can attract pollinators by providing a prolonged sequence of blooming flowers. In contrast, cymose inflorescences, with their terminal flower and basipetal order, may focus pollinator attraction towards a single, prominent bloom which can increase pollination precision. Both strategies reflect adaptations to specific ecological niches where pollinator behavior and environmental factors drive evolutionary change.",
    "explanation": "The arrangement of flowers within an inflorescence affects both the timing and the spatial display of reproductive structures. These arrangements can influence how pollinators interact with the plant by maximizing visibility and accessibility of flowers, ensuring that pollination events are timely and efficient, and ultimately enhancing reproductive success.",
    "topic": "Inflorescence and pollination",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen060",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "Analyze how changes in the shoot apical meristem contribute to morphological diversity in flowering plants, citing examples from the text.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Changes in the shoot apical meristem, such as its conversion to a floral meristem during flower development, enable a shift from vegetative to reproductive growth. This transformation results in the condensation of the axis and the specialized production of floral organs at lateral positions. Such modifications lead to the diversity seen in inflorescence structures like racemose and cymose types. Examples include the continuous axis growth in racemose inflorescences versus the terminal flower in cymose ones, demonstrating how slight variations in meristem activity can produce varied morphological outcomes that are adapted to different pollination strategies.",
    "explanation": "The modification of the shoot apical meristem is a critical step in the development of flowers and inflorescences. By altering growth patterns—such as ceasing internode elongation and reprogramming the meristem to produce floral parts—plants can develop diverse inflorescence architectures that optimize reproductive success in various ecological contexts.",
    "topic": "Floral development and morphological diversity",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen061",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "True or False: In racemose inflorescences, the main axis stops growing after the formation of the first flower.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In racemose inflorescences, the main axis continues to grow, which allows for the sequential (acropetal) development of flowers along the axis.",
    "topic": "Inflorescence types",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen062",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "True or False: The transformation of the shoot tip into a flower results in the elongation of internodes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "When the shoot tip transforms into a flower, internodes do not elongate; instead, the axis becomes condensed as the floral organs develop.",
    "topic": "Flower development",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen063",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "True or False: In cymose inflorescences, the order of flower development is basipetal.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Cymose inflorescences exhibit a basipetal order of flower development since the main axis terminates in a flower, and subsequent flowers develop from lateral buds in a downward (basipetal) sequence.",
    "topic": "Inflorescence types",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen064",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "True or False: Phyllotaxy affects only the ornamental appearance of plants and is not related to functional adaptations.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Phyllotaxy plays a crucial role in light capture and photosynthesis, which are essential functional adaptations for plant survival, not merely ornamental features.",
    "topic": "Phyllotaxy",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen065",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "True or False: The arrangement of flowers in an inflorescence is an adaptation that enhances pollination efficiency.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The spatial arrangement and sequential maturity of flowers in an inflorescence improve the attraction of pollinators, which in turn increases pollination success.",
    "topic": "Inflorescence and pollination",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen066",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "If a plant inflorescence contains 5 open flowers and 3 closed buds, how many total flower structures are present?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "8",
    "explanation": "By adding the 5 open flowers and the 3 closed buds, you obtain a total of 8 flower structures.",
    "topic": "Inflorescence structure",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen067",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4"
  },
  {
    "question_text": "Which part of the flower protects the bud in its early stage?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Calyx",
      "B) Corolla",
      "C) Androecium",
      "D) Gynoecium"
    ],
    "correct_answer": "A) Calyx",
    "explanation": "The calyx, composed of sepals, is the outermost whorl and protects the flower while it is still in the bud stage.",
    "topic": "Parts of a Flower - Calyx",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen068",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Which type of flower symmetry allows a flower to be divided into two equal halves in any radial plane passing through its centre?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Zygomorphic",
      "B) Actinomorphic",
      "C) Asymmetric",
      "D) Irregular"
    ],
    "correct_answer": "B) Actinomorphic",
    "explanation": "Actinomorphic (radial symmetry) means the flower can be divided into two equal halves along any radial plane passing through its centre.",
    "topic": "Flower symmetry",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen069",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "In epigynous flowers, where are the floral parts (calyx, corolla, and androecium) located in relation to the ovary?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Below the ovary",
      "B) Above the ovary",
      "C) At the same level as the ovary",
      "D) Surrounding the ovary without any specific order"
    ],
    "correct_answer": "B) Above the ovary",
    "explanation": "In epigynous flowers the margin of the thalamus grows upward enclosing the ovary completely, so the other parts are positioned above the ovary, making it inferior.",
    "topic": "Position of floral parts on thalamus",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen070",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Which type of aestivation is characterized by one large petal (the standard) overlapping two lateral petals (wings), which in turn overlap two smaller petals (keel)?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) Valvate",
      "B) Twisted",
      "C) Imbricate",
      "D) Vexillary"
    ],
    "correct_answer": "D) Vexillary",
    "explanation": "Vexillary or papilionaceous aestivation is found in pea and bean flowers where one large petal overlaps the lateral petals which then overlap the smallest petals.",
    "topic": "Aestivation in corolla",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen071",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Which type of placentation is characterized by ovules attached to a central axis without septa, as seen in Dianthus and Primrose?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A) Axile",
      "B) Marginal",
      "C) Free central",
      "D) Basal"
    ],
    "correct_answer": "C) Free central",
    "explanation": "In free central placentation, ovules are borne on a central axis without the presence of septa, unlike axile or basal placentation.",
    "topic": "Gynoecium - Placentation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen072",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Define a bisexual flower.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A bisexual flower contains both androecium and gynoecium in the same flower.",
    "explanation": "Bisexual flowers have both male (androecium) and female (gynoecium) reproductive organs, enabling self or cross-pollination.",
    "topic": "Flower reproductive organs",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen073",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Briefly explain the difference between bracteate and ebracteate flowers.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Bracteate flowers have reduced leaf-like structures called bracts at the base of the pedicel, whereas ebracteate flowers do not have such bracts.",
    "explanation": "Bracts may be reduced leaves present at the base of the flower (bracteate), and their absence characterizes ebracteate flowers.",
    "topic": "Flower morphology terminology",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen074",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "What is the primary function of the petals in a flower?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The petals attract pollinators through their bright colors and varied shapes.",
    "explanation": "Petals are often brightly colored and shaped in diverse ways to lure insects and other pollinators for successful fertilization.",
    "topic": "Parts of a Flower - Corolla",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen075",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Explain the difference between gamosepalous and polysepalous calyx arrangements.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Gamosepalous calyx has united sepals forming a single structure, whereas polysepalous calyx has sepals that are free from each other.",
    "explanation": "In gamosepalous calyx, the sepals are fused together, providing a more unified protective covering, while in polysepalous calyx, they remain separate.",
    "topic": "Parts of a Flower - Calyx",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen076",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Discuss the significance of the stages in flower development as shown in the diagram, including bud formation, full flower maturation, and post-fertilization.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The initial stage represents the early development when flower parts like petals, stamens, and pistil form; the next stages show the gradual opening and maturation of these parts facilitating pollination; and finally, after fertilization, the petals fall or close, the ovary swells into a fruit and seeds develop for plant propagation.",
    "explanation": "The progressive stages ensure that the flower is fully functional for successful pollination and subsequent seed development, which is vital for reproduction and species propagation.",
    "topic": "Flower Development",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen077",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Compare and contrast hypogynous, perigynous, and epigynous flowers based on the position of their floral parts relative to the ovary. Discuss the implications of ovary position on fruit development.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Hypogynous flowers have floral parts arranged below a superior ovary, perigynous flowers have parts on a rim around a half-inferior ovary, and epigynous flowers exhibit floral parts arising above an inferior ovary due to a fused thalamus. The position of the ovary affects fruit formation, as a superior ovary usually develops into a fruit where the other parts do not become part of it, whereas an inferior ovary can result in the incorporation of additional floral tissue in the fruit.",
    "explanation": "The positional differences not only affect the structural classification of the flowers but also influence the resulting fruit type and how it protects and disperses seeds.",
    "topic": "Position of floral parts on thalamus",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen078",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Analyze the different types of placentation described in the section. How do these variations in placentation contribute to differences in fruit structure and seed dispersal?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Placentation can be marginal, axile, parietal, basal, central, or free central. Marginal placentation involves ovules arranged along a ridge, axile placentation has ovules attached to a central column in a multilocular ovary, parietal placentation attaches ovules to the ovary wall, basal placentation has a single ovule at the base, and free central placentation features ovules on a central axis. These differences affect fruit structure by influencing the number and arrangement of chambers within the ovary, which in turn can affect the mechanisms of seed protection and dispersal.",
    "explanation": "The arrangement and number of ovules within the ovary directly modify how the fruit develops and releases its seeds, affecting dispersal strategies and overall reproductive success.",
    "topic": "Gynoecium - Placentation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen079",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "The calyx is primarily composed of petals.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The calyx is composed of sepals, not petals. Petals make up the corolla.",
    "topic": "Parts of a Flower - Calyx and Corolla",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen080",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Actinomorphic flowers possess radial symmetry.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Actinomorphic flowers have radial symmetry, meaning they can be divided into equal halves along any diameter through the centre.",
    "topic": "Flower symmetry",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen081",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "In pea flowers, the stamens are organized in a diadelphous manner.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "In pea flowers, the stamens are arranged in two bundles (diadelphous), a characteristic feature in many legumes.",
    "topic": "Androecium - Stamens configuration",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen082",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "The ovary in hypogynous flowers is considered inferior.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In hypogynous flowers, the ovary isSuperior because the other floral parts are attached below it.",
    "topic": "Position of floral parts on thalamus",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen083",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Aestivation in flower buds can assist in classifying plants into different evolutionary groups.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "The arrangement of sepals and petals (aestivation) is often species-specific and can be used as a taxonomic characteristic in plant classification.",
    "topic": "Aestivation in corolla",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen084",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "Staminodes are functional stamens that produce pollen.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Staminodes are sterile stamens and do not produce pollen; they may serve other roles such as attracting pollinators or mimicking functional stamens.",
    "topic": "Androecium - Stamens",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen085",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5"
  },
  {
    "question_text": "What is the fruit in flowering plants defined as?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A mature or ripened ovary developed after fertilisation",
      "A modified leaf used for photosynthesis",
      "An unfertilized flower part",
      "A protective seed coat"
    ],
    "correct_answer": "A mature or ripened ovary developed after fertilisation",
    "explanation": "The fruit is described as a mature or ripened ovary that develops after fertilisation, which distinguishes it from other plant parts.",
    "topic": "Fruit and its development",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen086",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "A fruit that develops without fertilisation of the ovary is known as a:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Agamospermous fruit",
      "Parthenocarpic fruit",
      "Accessory fruit",
      "Simple fruit"
    ],
    "correct_answer": "Parthenocarpic fruit",
    "explanation": "A fruit that forms without the fertilisation of the ovary is referred to as a parthenocarpic fruit, as stated in the text.",
    "topic": "Fruit formation",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen087",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "In mango fruits, the pericarp is well differentiated into three layers. Which layer directly surrounds the seed?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Epicarp",
      "Mesocarp",
      "Endocarp",
      "Exocarp"
    ],
    "correct_answer": "Endocarp",
    "explanation": "The endocarp is the inner layer that surrounds the seed; in mango, it is described as stony hard and directly encases the seed.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen088",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "Which of the following fruits is classified as a drupe according to the text?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Apple",
      "Mango",
      "Banana",
      "Berry"
    ],
    "correct_answer": "Mango",
    "explanation": "Both mango and coconut are mentioned as drupes, but mango is correct among these options. A drupe is characterized by having a single seed with a well-differentiated pericarp.",
    "topic": "Fruit types",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen089",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "Explain the differentiation of the pericarp in fleshy fruits such as mango.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Fleshy fruits have a pericarp that is differentiated into three layers: the epicarp (outer skin), the mesocarp (middle fleshy and edible layer), and the endocarp (inner stony layer surrounding the seed).",
    "explanation": "This answer explains that in fleshy fruits like mango, the pericarp is divided into three distinct layers each with a unique function: protection, edibility to attract dispersers, and physical seed protection.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen090",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "Describe the concept of placentation in flowering plants as illustrated in the section.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Placentation is the arrangement of ovules within the ovary. It can vary in type, including marginal, axile, parietal, free central, and basal placentation, which help in the classification and understanding of reproductive biology in plants.",
    "explanation": "The answer covers the definition of placentation and mentions the different types shown in the diagrams, highlighting its importance in plant reproductive biology.",
    "topic": "Placentation in flowering plants",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen091",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "Discuss how the mesocarp contributes to both the protection of the seed and its dispersal.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The mesocarp, being the fleshy middle layer of the fruit's pericarp, not only provides nutrition to the developing seed but also attracts animals due to its edible nature. This attraction aids in seed dispersal as animals consume the fruit and later excrete the seeds at different locations.",
    "explanation": "This answer details the dual role of the mesocarp: protecting the seed by providing nourishment and facilitating seed dispersal by acting as an attractant for animals.",
    "topic": "Fruit structure and seed dispersal",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen092",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "What is a parthenocarpic fruit and give an example of when such a fruit might develop?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A parthenocarpic fruit is one that develops without fertilisation of the ovary. Such fruits may form in conditions where fertilisation fails or is bypassed, resulting in seedless fruits. An example is certain varieties of seedless cucumbers.",
    "explanation": "This answer defines parthenocarpy, highlighting that these fruits develop without fertilisation, and provides a commonly known example for clarity.",
    "topic": "Fruit formation",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen093",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "Analyze the differences in the structure of the mesocarp in mango and coconut drupes as mentioned in the text.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In mango, the mesocarp is described as thick, fleshy, and edible, which not only provides nutritional value but also aids in seed dispersal by attracting animals. In contrast, in coconut, the mesocarp is fibrous. This fibrous mesocarp provides a different type of protection and structural support, and it aids in buoyancy for water dispersal rather than attracting animals for dispersal.",
    "explanation": "The answer outlines the differences in the mesocarp structure between mango and coconut, highlighting both functional and structural differences in relation to seed dispersal strategies.",
    "topic": "Fruit structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen094",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "Compare and contrast the various types of placentation mentioned in the section, providing examples if possible.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The section describes several types of placentation including marginal, axile, parietal, free central, and basal placentation. Marginal placentation, as seen in the pea pod, involves ovules attached along one margin of the ovary. Axile placentation typically involves ovules located in the center of a divided ovary, whereas parietal placentation features ovules attached to the ovary wall. Free central placentation and basal placentation are other arrangements that differ in the positioning of the ovules relative to the ovary. These variations are important for plant classification and reflect different evolutionary adaptations in reproductive biology.",
    "explanation": "This answer presents a detailed comparison of the different placentation types described in the text and relates them to the overall classification and reproductive strategies of flowering plants.",
    "topic": "Placentation",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen095",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "Evaluate the role of fruit structure in protecting the developing seed and facilitating its dispersal.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The structure of the fruit, particularly the pericarp, plays a critical role in both protecting the developing seed and aiding in its dispersal. The outer epicarp protects the fruit externally, while the mesocarp, often fleshy and nutritious, attracts animals that consume the fruit and subsequently disperse the seed through excretion. The inner endocarp, which is often hard or stony, physically protects the seed from damage. In essence, the combination of these layers ensures that the seed is well-protected during development and is effectively dispersed to a new location, increasing the plant's chances of successful propagation.",
    "explanation": "This answer evaluates how each layer of the fruit contributes to both the protection of the seed and its dispersal by detailing the functions of the epicarp, mesocarp, and endocarp.",
    "topic": "Fruit structure and seed dispersal",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen096",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "True or False: A parthenocarpic fruit develops as a result of fertilisation of the ovary.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "A parthenocarpic fruit develops without fertilisation of the ovary. Therefore, the statement is false.",
    "topic": "Fruit formation",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen097",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "True or False: In marginal placentation, as observed in a pea pod, the ovules are attached along one margin of the ovary.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Marginal placentation is characterized by ovules attached along one margin of the ovary, as specifically mentioned with the pea pod diagram in the text.",
    "topic": "Placentation",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen098",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "True or False: In drupes like mango, the mesocarp is fibrous and non-edible.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In mango, the mesocarp is described as fleshy and edible, unlike in coconut where the mesocarp is fibrous.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen099",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "True or False: The epicarp is the outer skin of the fruit and serves as its first line of protection.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The epicarp is indeed the outermost layer of the fruit and provides protection against physical and environmental damage.",
    "topic": "Fruit structure",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen100",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "True or False: The diagram showing a pea pod illustrates axile placentation.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The pea pod diagram specifically illustrates marginal placentation, where ovules are attached along one margin, not axile placentation.",
    "topic": "Placentation",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen101",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "True or False: The fleshy mesocarp in many fruits plays an important role in attracting animals for seed dispersal.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The mesocarp often provides nutrition and appeal to animals, which aids in seed dispersal by attracting them to consume the fruit.",
    "topic": "Seed dispersal and fruit structure",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen102",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "If a fruit has three distinct layers in its pericarp, how many layers does it have? Provide a numerical answer.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "3",
    "explanation": "The fruit has three layers of pericarp: the epicarp, mesocarp, and endocarp, which totals to 3 layers.",
    "topic": "Fruit structure",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen103",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6"
  },
  {
    "question_text": "Which of the following correctly lists the components of a dicotyledonous seed?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Seed coat, embryo (radicle, embryonal axis, and one cotyledon)",
      "Seed coat, embryo (radicle, embryonal axis, and two cotyledons)",
      "Seed coat, embryo (plumule, cotyledons, and scutellum)",
      "Seed coat, endosperm, and embryo (coleoptile and coleorhiza)"
    ],
    "correct_answer": "Seed coat, embryo (radicle, embryonal axis, and two cotyledons)",
    "explanation": "Dicotyledonous seeds typically have an embryo that comprises a radicle, an embryonal axis, and two cotyledons. The outer layer is the seed coat which consists of the testa and tegmen.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen104",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "What is the name of the scar on the seed coat through which the seed was connected to the fruit?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Micropyle",
      "Hilum",
      "Coleorhiza",
      "Aleurone layer"
    ],
    "correct_answer": "Hilum",
    "explanation": "The hilum is the scar on the seed coat where the developing seed was attached to the fruit.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen105",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "In monocotyledonous seeds such as cereals, which of the following structures serves as the cotyledon?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Coleorhiza",
      "Scutellum",
      "Aleurone layer",
      "Plumule"
    ],
    "correct_answer": "Scutellum",
    "explanation": "In monocot seeds, the large shield-shaped cotyledon is called the scutellum, which plays a critical role in nutrient absorption from the endosperm.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen106",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Which protective structure encloses the radicle in monocotyledonous seeds?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Coleoptile",
      "Tegmen",
      "Coleorhiza",
      "Aleurone layer"
    ],
    "correct_answer": "Coleorhiza",
    "explanation": "In monocot seeds, the radicle is enclosed in a sheath called the coleorhiza, which protects it during germination.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen107",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Which small pore in a seed allows water entry and is located above the hilum?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Micropyle",
      "Hilum",
      "Aleurone pore",
      "Tegmen"
    ],
    "correct_answer": "Micropyle",
    "explanation": "The micropyle is the small pore found above the hilum in seeds, which enables water to enter for germination.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen108",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Describe two key differences between dicotyledonous and monocotyledonous seeds.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Dicotyledonous seeds typically have two cotyledons and an embryo not situated in a groove, with a separate seed coat. Monocotyledonous seeds generally have one cotyledon (scutellum), a bulky endosperm, and the seed coat is fused with the fruit wall.",
    "explanation": "Dicots show structural differences such as the number of cotyledons and the orientation of the embryo compared to monocots, which often have a well-developed endosperm and a single, shield-shaped cotyledon.",
    "topic": "Seed Structure Comparison",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen109",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Define the hilum in the context of seed anatomy.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The hilum is the scar on the seed coat that marks the point where the seed was attached to the fruit or ovary wall.",
    "explanation": "The hilum indicates the former connection between the seed and the ovary, and is a key identifying feature in seeds.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen110",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "What is the function of the aleurone layer in monocotyledonous seeds?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The aleurone layer is a proteinous covering that surrounds the endosperm, serving as a protective barrier and playing a role in the mobilization of stored nutrients during germination.",
    "explanation": "It acts as a protective layer separating the embryo from the nutrient-rich endosperm and assists in enzyme production during seed germination.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen111",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Explain the significance of endospermic and non-endospermic seeds with respect to seed development.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Endospermic seeds contain a well-developed endosperm that serves as a food storage tissue formed as a result of double fertilization, providing nutrients for the developing plant. In contrast, non-endospermic seeds lack an endosperm at maturity; the stored food is instead contained within the cotyledons.",
    "explanation": "This difference impacts how the seed supports the embryo during germination. Endospermic seeds may have a larger endosperm, while in non-endospermic seeds, nutrient reserves are relocated to the cotyledons.",
    "topic": "Seed Food Storage Tissue",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen112",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Discuss the structure of a dicotyledonous seed, including details of its external and internal components.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A dicotyledonous seed has an outer seed coat that consists of two layers: the outer testa and the inner tegmen. The hilum, a scar formed by the attachment to the ovary, is visible on the seed coat. Inside, the embryo is located, which includes the embryonal axis with a radicle at one end and a plumule at the other. The embryo also contains two cotyledons that often store food for the developing plant. Additionally, the micropyle is a small pore above the hilum that allows water entry during germination.",
    "explanation": "This detailed description covers both the external protective structures and the internal developmental components that are crucial for seed germination and seedling development.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen113",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Compare and contrast the structural features of dicotyledonous and monocotyledonous seeds.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Dicotyledonous seeds typically have two cotyledons that store food, a distinct seed coat with an outer testa and inner tegmen, and clear markings such as the hilum and micropyle. The embryo is free within the seed. Monocotyledonous seeds, on the other hand, usually have a single cotyledon known as the scutellum, a prominent endosperm that stores food, and a seed coat that is generally fused with the fruit wall. In monocots, the embryo is small and situated in a groove at one end of the endosperm, and the radicle and plumule are protected by sheaths, namely the coleorhiza and coleoptile respectively.",
    "explanation": "This answer highlights the key differences and similarities in the arrangement and function of the various components in both seed types, as described in the source material.",
    "topic": "Comparative Seed Structure",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen114",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Discuss the role of the seed coat in protecting the embryo, and explain how structures like the micropyle and hilum are functionally significant during seed development and germination.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The seed coat serves as the first line of defense, protecting the embryo from physical damage, pathogens, and environmental stresses. It is composed of two layers in dicots — the outer testa and inner tegmen — and in monocots, it is usually membranous and fused with the fruit wall. The hilum marks the site of attachment to the fruit and indicates where nutrients were supplied during development. The micropyle, a small pore positioned above the hilum, allows water to enter the seed during germination, thus triggering the growth processes. These structures work together to ensure that the seed remains viable until conditions are favorable for the embryo to begin developing into a seedling.",
    "explanation": "This discussion addresses the protective and functional aspects of the seed coat and related structures, elucidating their roles in both seed development and the initiation of germination.",
    "topic": "Seed Protection and Germination",
    "bloom_level": "Create",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen115",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "True or False: In a dicotyledonous seed, the micropyle is located above the hilum.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text states that above the hilum there is a small pore called the micropyle, making the statement true.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen116",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "True or False: In monocotyledonous seeds, the seed coat is generally not fused with the fruit wall.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The section clearly states that in monocotyledonous seeds, the seed coat is membranous and generally fused with the fruit wall.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen117",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "True or False: The aleurone layer found in monocotyledonous seeds is primarily composed of proteinaceous material.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The aleurone layer is described as a proteinous layer that separates the endosperm from the embryo in monocot seeds.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen118",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "True or False: The embryonal axis in dicotyledonous seeds has two ends, one forming the radicle and the other forming the plumule.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The embryonal axis of a dicotyledonous seed has two distinct ends, with the radicle at one end and the plumule at the opposite end, as stated in the text.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen119",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "True or False: Non-endospermous seeds contain a well-developed endosperm at maturity.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Non-endospermous seeds do not have a well-developed endosperm at maturity; instead, the reserve food is stored in the cotyledons.",
    "topic": "Seed Food Storage",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen120",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "True or False: In monocotyledonous seeds, the scutellum functions as the cotyledon.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "In the monocot seed, the scutellum is the single, large shield-shaped cotyledon that plays a key role during nutrient mobilization.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen121",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7"
  },
  {
    "question_text": "Which floral part does the symbol 'A' represent in a floral formula?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Calyx",
      "Corolla",
      "Androecium",
      "Gynoecium"
    ],
    "correct_answer": "Androecium",
    "explanation": "The symbol 'A' in the floral formula stands for the androecium, which represents the stamens or the male reproductive parts of the flower.",
    "topic": "Floral formula symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen122",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "In the floral diagram, what does the dot on the top represent?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Focal point of fusion",
      "Mother axis",
      "Petal attachment",
      "Bracteate structure"
    ],
    "correct_answer": "Mother axis",
    "explanation": "The dot at the top of the floral diagram indicates the position of the mother axis relative to the flower, serving as an important landmark in the diagram.",
    "topic": "Floral diagram details",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen123",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Which family is represented by the floral diagram in Figure 5.16?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Brassicaceae",
      "Rosaceae",
      "Liliaceae",
      "Solanaceae"
    ],
    "correct_answer": "Brassicaceae",
    "explanation": "The floral diagram in the section represents characteristics of the mustard plant, which belongs to the Brassicaceae family.",
    "topic": "Floral diagram application",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen124",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "What information does the floral formula provide about a flower?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Only qualitative description of floral parts",
      "Arrangement and relation of floral parts within whorls",
      "Quantitative information about the number of each floral part",
      "Both the arrangement and quantitative details of floral parts"
    ],
    "correct_answer": "Both the arrangement and quantitative details of floral parts",
    "explanation": "A floral formula offers a compact representation that shows not only the symmetry and arrangement of flower parts but also provides quantitative data such as the number of each part, along with details on fusion and adhesion.",
    "topic": "Floral formula details",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen125",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "How are fusion and adhesion indicated in a floral formula?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Fusion is indicated by brackets and adhesion by a line over symbols",
      "Fusion is indicated by an underline and adhesion by brackets",
      "Fusion is shown with a dot and adhesion by numerical values",
      "Fusion is represented by parentheses and adhesion by additional symbols"
    ],
    "correct_answer": "Fusion is indicated by brackets and adhesion by a line over symbols",
    "explanation": "In a floral formula, fusion among parts is represented by enclosing the symbols within brackets, whereas adhesion between parts is indicated by drawing a line over the respective symbols.",
    "topic": "Interpretation of floral formulas",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen126",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Define what is meant by the term 'bracteate' in the context of a flowering plant's description.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Bracteate means having bracts, which are modified or specialized leaves associated with a reproductive structure, such as a flower or an inflorescence.",
    "explanation": "In botanical terminology, 'bracteate' describes a plant or a flowering structure that is accompanied by bracts, emphasizing its modified leaf structures near reproductive parts.",
    "topic": "Morphological features",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen127",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "List the main steps in describing the morphological features of a flowering plant as outlined in the section.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The description starts with the habit of the plant, followed by vegetative characters (roots, stem, and leaves), then floral characters (inflorescence and flower parts), and finally the presentation of the floral diagram and floral formula.",
    "explanation": "The section outlines a sequence beginning with general habit and vegetative structures before moving on to detailed floral characteristics, which are summarized by a floral diagram and floral formula.",
    "topic": "Plant description sequence",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen128",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Explain how information about cohesion and adhesion is represented in a floral formula.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Cohesion or fusion in a floral formula is indicated by enclosing the symbols within brackets, while adhesion is represented by drawing a line above the symbols of the floral parts.",
    "explanation": "This method allows for a clear distinction: brackets denote that parts are fused together (cohesion), whereas a line indicates that parts are attached to each other without being fused (adhesion).",
    "topic": "Floral formula notation",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen129",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Discuss the significance of using both a floral diagram and a floral formula in plant taxonomy.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Using both a floral diagram and a floral formula is significant because the diagram provides a visual, spatial understanding of the flower's organization while the formula offers a concise symbolic summary that includes numerical details, symmetry, fusion, and adhesion. Together, they allow taxonomists to compare and classify plants effectively.",
    "explanation": "The combination of a visual and a symbolic representation ensures a more comprehensive analysis of floral characteristics, which is essential for accurate plant identification and classification in taxonomy.",
    "topic": "Taxonomic methods",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen130",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Describe in detail the process of detailing a typical flowering plant's morphology, starting from habit to the presentation of the floral formula. Explain how each component contributes to the overall understanding of the plant's structure.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The process begins with describing the plant's habit, which includes its general appearance and growth form. Next, the vegetative characters such as roots, stem, and leaves are detailed to provide insights into the plant's overall health and adaptability. Following this, the floral characters are described starting with the inflorescence and then the individual flower parts. Finally, a floral diagram is presented to graphically represent the spatial arrangement of the calyx, corolla, androecium, and gynoecium, while the floral formula summarizes this information symbolically, including details on number, symmetry, cohesion, and adhesion. Each component contributes incremental information that helps in understanding both the structure and function of the plant, thereby aiding in identification and taxonomic classification.",
    "explanation": "Each step in the description adds a layer to the overall profile of the plant, with the vegetative parts indicating growth and adaptation and the floral parts providing key reproductive details necessary for precise taxonomy.",
    "topic": "Morphological description",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen131",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Evaluate the advantages and limitations of using a floral diagram and floral formula as tools in plant taxonomy, citing examples from the mustard plant described in the section.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Advantages include the concise visual representation provided by the floral diagram, which makes it easy to compare the spatial arrangement of floral parts across species. The floral formula adds precision by summarizing numerical data and fusion/adhesion details, which is especially useful in distinguishing closely related species such as those within the Brassicaceae family. Limitations, however, include the potential oversimplification of complex structures, which may omit subtle variations, and the reliance on prior knowledge for proper interpretation. For the mustard plant, while these tools effectively capture its key features, they may not fully express the variation in petal shape or the detailed morphology of reproductive organs.",
    "explanation": "This response weighs both the strengths and weaknesses of the tools, emphasizing that while they streamline comparisons across plants, they might miss some fine-scale details critical for a deeper understanding.",
    "topic": "Taxonomic tools",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen132",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Design a hypothetical floral diagram and corresponding floral formula for a fictional plant that has unique traits. Your design should include details on symmetry, fusion, adhesion, and the number of floral parts.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A well-designed answer might describe a fictional plant with an actinomorphic (radially symmetric) flower. For example, the floral diagram could show a three-whorled structure: an outer calyx with 5 separate sepals, a middle corolla with 5 petals that are fused at the base (indicated by brackets), and an inner androecium with 10 stamens arranged in two whorls, where 5 stamens are free and 5 show adhesion (indicated by a line above their symbols). The central gynoecium could consist of 3 fused carpels forming a compound pistil with a superior ovary. The corresponding floral formula might be represented as 5K, 5C (with brackets), 5+5A (with a line above the second set), and (3)G. This design highlights both fusion (brackets) and adhesion (line) while specifying symmetry and number.",
    "explanation": "This question challenges students to synthesize information on floral structure and notation, using creativity to design a novel example that incorporates key elements like symmetry, fusion, adhesion, and quantitative aspects.",
    "topic": "Floral diagram and formula design",
    "bloom_level": "Create",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen133",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "The floral diagram places the calyx at the center of the flower.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In a floral diagram, the calyx is depicted as the outermost whorl, not at the center. The gynoecium is typically found at the central position.",
    "topic": "Floral diagram structure",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen134",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "In the floral formula, the symbol 'C' represents petals.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The symbol 'C' indeed stands for the corolla, which comprises the petals in the floral formula.",
    "topic": "Floral formula symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen135",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "A line drawn above symbols in a floral formula indicates fusion between parts.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "A line drawn above symbols indicates adhesion, meaning the parts are attached but not necessarily fused. Fusion is represented by enclosing the symbols within brackets.",
    "topic": "Floral formula notation",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen136",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "The dot on the floral diagram represents the point of contact of the inflorescence with the plant's mother axis.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The dot marks the position of the mother axis relative to the flower, indicating where the flower is attached in relation to the main shoot or axis.",
    "topic": "Floral diagram details",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen137",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Fusion of floral parts is represented in a floral formula by enclosing the figures within brackets, which indicates adhesion rather than actual fusion.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Enclosing symbols within brackets indicates fusion of the floral parts (cohesion), not adhesion. Adhesion is separately indicated by a line drawn above the symbols.",
    "topic": "Floral formula interpretation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen138",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "The mustard plant belongs to the family Brassicaceae.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section explicitly mentions that the floral diagram and floral formula provided represent the mustard plant, which is in the Brassicaceae family.",
    "topic": "Plant taxonomy",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen139",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "If a floral formula indicates the presence of 4K, 4C, 6A, and 1G, what is the total number of distinct floral parts shown?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "15",
    "explanation": "The total number is calculated by adding the parts: 4 (calyx) + 4 (corolla) + 6 (androecium) + 1 (gynoecium) = 15.",
    "topic": "Quantitative aspects of floral formula",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen140",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8"
  },
  {
    "question_text": "Which of the following regions is NOT typically inhabited by plants in the Solanaceae family?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Tropics",
      "Subtropics",
      "Temperate zones",
      "Arctic regions"
    ],
    "correct_answer": "Arctic regions",
    "explanation": "The Solanaceae family is widely distributed in tropics, subtropics, and even temperate zones, but not in the extreme conditions of the Arctic regions.",
    "topic": "Distribution of Solanaceae",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen141",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "Which type of fruit is typically produced by plants in the Solanaceae family?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Berry",
      "Pome",
      "Drupe",
      "Nut"
    ],
    "correct_answer": "Berry",
    "explanation": "Many plants in the Solanaceae family produce berries as fruits, as noted in the description of their reproductive structures.",
    "topic": "Reproductive Characters",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen142",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "The leaves of Solanaceae are typically arranged in which manner?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Alternate",
      "Opposite",
      "Whorled",
      "Basal"
    ],
    "correct_answer": "Alternate",
    "explanation": "According to the textbook section, the leaves are alternate and mostly simple.",
    "topic": "Vegetative Characters",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen143",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "The flower of a Solanaceae plant is described as actinomorphic. Which term best corresponds to this description?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Radial symmetry",
      "Bilateral symmetry",
      "Asymmetry",
      "Irregular"
    ],
    "correct_answer": "Radial symmetry",
    "explanation": "Actinomorphic flowers are radially symmetrical, meaning they can be divided into similar halves by multiple planes passing through the center.",
    "topic": "Floral Characters",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen144",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "In the context of Solanaceae gynoecium, the term 'syncarpous' refers to the fusion of which parts?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Carpels",
      "Sepals",
      "Petals",
      "Stamens"
    ],
    "correct_answer": "Carpels",
    "explanation": "Syncarpous means that the carpels are fused together to form a compound ovary, which is characteristic of the Solanaceae family.",
    "topic": "Floral Characters",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen145",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "Describe the typical structure of the Solanaceae stem, including its various characteristics as noted in the section.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The stem in the Solanaceae family is primarily herbaceous (rarely woody), aerial, erect, cylindrical, and branched. It can be solid or hollow and may be hairy or glabrous; in potato (Solanum tuberosum) it includes an underground stem.",
    "explanation": "This answer encompasses the key features described in the textbook, highlighting both aerial and subterranean characteristics as they pertain to the family.",
    "topic": "Vegetative Characters",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen146",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "List the key components of the gynoecium in Solanaceae.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The gynoecium in Solanaceae is bicarpellary, syncarpous with a superior ovary that is bilocular and contains an axile placenta loaded with many ovules.",
    "explanation": "The answer directly reflects the floral description provided in the section, noting important features of the reproductive structure.",
    "topic": "Floral Characters",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen147",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "Explain the term 'valvate aestivation' as it applies to the calyx and corolla of Solanaceae flowers.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Valvate aestivation refers to the arrangement in the floral bud in which the sepals (or petals) meet edge-to-edge without overlapping each other.",
    "explanation": "This definition clarifies the meaning and significance of valvate aestivation in the context of floral development.",
    "topic": "Floral Characters",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen148",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "Provide two examples of economically important plants in the Solanaceae family and mention their uses.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Examples include tomato and potato. Tomato is an essential food crop, while potato serves as a major food source. Other examples include brinjal as a food crop, chilli as a spice, belladonna for medicinal uses, tobacco for fumigatory purposes, and petunia as an ornamental plant.",
    "explanation": "This answer lists not only the examples but briefly highlights their economic importance.",
    "topic": "Economic Importance",
    "bloom_level": "Apply",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen149",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "Discuss the vegetative characters of the Solanaceae family, including details about the plant structure and leaf characteristics.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The Solanaceae family mainly consists of herbs, shrubs, and rarely small trees. Their stems are predominantly herbaceous though in cases like potato, an underground stem is present. The aerial part of the stem is erect, cylindrical, and branched, and can be either solid or hollow. Additionally, stems may be hairy or glabrous. The leaves are typically alternate, simple, and have reticulate venation, although there are some instances of pinnately compound leaves. They are also described as exstipulate, meaning they lack stipules at the base.",
    "explanation": "This answer covers all the key vegetative features as described in the textbook, providing a comprehensive overview of the structural and leaf attributes.",
    "topic": "Vegetative Characters",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen150",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "Explain the floral structure of the Solanaceae family and discuss how each part contributes to its reproductive function.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The flower in the Solanaceae family is bisexual and actinomorphic, meaning it has radial symmetry. The calyx consists of five united, persistent sepals that open in a valvate manner. The corolla has five united petals, also exhibiting valvate aestivation. The androecium is made up of five stamens that are epipetalous, meaning they are attached to the petals. The gynoecium comprises two carpels that are fused together (syncarpous) to form a superior, bilocular ovary with an axile placenta that is swollen with many ovules. Each of these parts plays a critical role: the sepals and petals attract pollinators or protect the developing flower, the stamens provide the pollen, and the gynoecium houses the ovules for fertilization.",
    "explanation": "This detailed answer links the structural features of the flower to its reproductive functions, demonstrating understanding of both anatomy and function.",
    "topic": "Floral Characters",
    "bloom_level": "Analyze",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen151",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "Evaluate the economic importance of Solanaceae plants by discussing how their morphological diversity has contributed to various human uses.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Solanaceae plants have significant economic importance due to their diverse uses and morphological traits. For instance, the development of fleshy berries or capsules in many members of this family makes them ideal for food crops like tomato, potato, and brinjal. In addition to edibles, some species produce compounds used as spices (e.g., chilli), medicines (e.g., belladonna, ashwagandha), and even for fumigation (e.g., tobacco). The structural diversity, including variations in the flower and fruit morphology, has allowed these plants to adapt to various environments, thereby fostering a broad range of applications in agriculture, medicine, and horticulture. This morphological versatility is a key factor in their widespread cultivation and economic utility.",
    "explanation": "This answer evaluates the connection between morphological characteristics and economic uses, reflecting on how such diversity supports various industries and applications.",
    "topic": "Economic Importance and Morphological Diversity",
    "bloom_level": "Evaluate",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen152",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "True or False: The Solanaceae family is restricted to tropical regions.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The Solanaceae family is widely distributed across tropics, subtropics, and even temperate zones, not just tropical regions.",
    "topic": "Distribution",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen153",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "True or False: In Solanum tuberosum, the potato, the stem is also present as an underground structure.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text states that the potato has an underground stem, which is an important vegetative character in this case.",
    "topic": "Vegetative Characters",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen154",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "True or False: The floral diagram in the Solanaceae section does not include information on stamens or carpels.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The floral diagram specifically represents the arrangement of parts including sepals, petals, stamens, and carpels.",
    "topic": "Floral Characters",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen155",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "True or False: The leaves of plants in the Solanaceae family are typically exstipulate, meaning they lack stipules.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The textbook section clearly notes that the leaves are exstipulate, which means they do not have stipules.",
    "topic": "Vegetative Characters",
    "bloom_level": "Remember",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen156",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  },
  {
    "question_text": "True or False: Epipetalous stamens in Solanaceae indicate that the stamens are free from the petals.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Epipetalous stamens are those that are attached to the petals, not free from them.",
    "topic": "Floral Characters",
    "bloom_level": "Understand",
    "source": "generated",
    "question_id": "cbse_xi_kebo1dd_c105_gen157",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9"
  }
]