[
  {
    "question_text": "Name the components of the formed elements in the blood and mention one major function of each of them.",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The formed elements of blood include erythrocytes, leucocytes, and platelets. Erythrocytes (red blood cells) are mainly responsible for gas transport (carrying oxygen and carbon dioxide); leucocytes (white blood cells) play a key role in defense mechanisms and immune responses; and platelets are crucial for blood clotting (coagulation).",
    "explanation": "This answer lists the three formed elements present in blood and explains the primary function of each. Erythrocytes are abundant and carry hemoglobin, leucocytes are involved in immunity and fighting infections, and platelets contribute to the clotting process necessary to prevent blood loss.",
    "topic": "Formed Elements in Blood",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex001"
  },
  {
    "question_text": "What is the importance of plasma proteins?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Plasma proteins serve several important functions: fibrinogen is essential for blood clotting, globulins function in the body’s defense mechanisms, and albumins help maintain osmotic balance. They also contribute to the transport of various substances in the blood.",
    "explanation": "Plasma proteins are significant because they perform multiple roles including coagulation (fibrinogen), immune response (globulins), and regulation of osmotic pressure (albumins) which is vital in maintaining fluid balance across blood vessels.",
    "topic": "Plasma",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex002"
  },
  {
    "question_text": "Match Column I with Column II:\n\nColumn I:\n(a) Eosinophils\n(b) RBC\n(c) AB Group\n(d) Platelets\n(e) Systole\n\nColumn II:\n(i) Coagulation\n(ii) Universal Recipient\n(iii) Resist Infections\n(iv) Contraction of Heart\n(v) Gas transport",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Option A: a - Resist Infections, b - Gas transport, c - Universal Recipient, d - Coagulation, e - Contraction of Heart",
      "Option B: a - Coagulation, b - Gas transport, c - Universal Recipient, d - Resist Infections, e - Contraction of Heart",
      "Option C: a - Resist Infections, b - Contraction of Heart, c - Gas transport, d - Coagulation, e - Universal Recipient",
      "Option D: a - Gas transport, b - Resist Infections, c - Universal Recipient, d - Contraction of Heart, e - Coagulation"
    ],
    "correct_answer": "Option A: a - Resist Infections, b - Gas transport, c - Universal Recipient, d - Coagulation, e - Contraction of Heart",
    "explanation": "Each element from Column I is correctly paired with its function or characteristic in Column II. Eosinophils help resist infections, RBCs transport gases due to hemoglobin, AB blood group individuals are universal recipients, platelets are involved in blood coagulation, and systole refers to the contraction phase of the heart.",
    "topic": "Blood Components & Cardiac Function",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex003"
  },
  {
    "question_text": "Why do we consider blood as a connective tissue?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Blood is considered a connective tissue because it originates from mesenchymal cells, consists of a fluid matrix (plasma) in which cells (formed elements) are suspended, and helps in connecting body systems by transporting nutrients, gases, waste products, and immune cells.",
    "explanation": "Unlike typical tissues, blood has a liquid extracellular matrix (plasma) that binds various cellular components, which is a key characteristic of connective tissues. Its role in transport and defense further supports its classification as connective tissue.",
    "topic": "Blood",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex004"
  },
  {
    "question_text": "What is the difference between lymph and blood?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Blood is a circulatory fluid composed of plasma and formed elements (cells and cell fragments) that contains clotting factors, whereas lymph is the tissue fluid that collects in the lymphatic system, is essentially similar to plasma in mineral content but lacks most of the formed elements and clotting factors.",
    "explanation": "The primary differences lie in composition and function. Blood contains components like red and white cells and platelets along with clotting factors and proteins, while lymph is mostly a filtrate of plasma, maintaining similar mineral balance but without the cellular elements and clotting proteins, and mainly carries lymphocytes for immune responses.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex005"
  },
  {
    "question_text": "What is meant by double circulation? What is its significance?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Double circulation refers to the separation of the circulatory pathway into two distinct circuits: one circuit carries deoxygenated blood from the heart to the lungs (pulmonary circulation) and the other circuit carries oxygenated blood from the heart to the body (systemic circulation). Its significance lies in allowing efficient oxygenation of blood and ensuring that oxygen-rich blood is delivered separately to the tissues, thereby maximizing the efficiency of nutrient and gas exchange.",
    "explanation": "By separating the flow of blood into pulmonary and systemic circuits, the heart ensures that deoxygenated and oxygenated blood do not mix, which increases the efficiency of gas exchange in the lungs and the delivery of oxygen to tissues. This separation is critical for maintaining high metabolic activity in organs.",
    "topic": "Circulatory Pathways",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex006"
  },
  {
    "question_text": "Write the differences between:\n(a) Blood and Lymph\n(b) Open and Closed system of circulation\n(c) Systole and Diastole\n(d) P-wave and T-wave",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) Blood is a fluid connective tissue that contains plasma, cells, and clotting factors, whereas lymph is derived from the interstitial fluid, lacking most formed elements and clotting factors. (b) In an open circulatory system, blood flows freely into body cavities (sinuses) and is not confined entirely within vessels, while in a closed system, blood is contained within a network of vessels. (c) Systole is the phase of the cardiac cycle during which the heart muscles contract and pump blood out of the chambers, while diastole is the relaxation phase when the heart chambers fill with blood. (d) The P-wave of an ECG represents the depolarization (excitation) of the atria, whereas the T-wave represents the repolarization (return to resting state) of the ventricles.",
    "explanation": "Each part of the question requires comparing two related concepts. The answer clearly differentiates between blood and lymph by composition and function, distinguishes between the open and closed circulatory systems based on the confinement of blood, contrasts systole and diastole based on the phases of heart activity, and explains the distinct features of ECG segments (P-wave vs. T-wave).",
    "topic": "Blood, Circulatory System, and ECG",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex007"
  },
  {
    "question_text": "Describe the evolutionary change in the pattern of heart among the vertebrates.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The evolution of the heart in vertebrates shows a progression from simple to complex structures. Fishes possess a 2-chambered heart with a single circulation system. Amphibians and most reptiles have a 3-chambered heart with two atria and one ventricle, leading to incomplete separation of oxygenated and deoxygenated blood. In contrast, birds and mammals have a 4-chambered heart with complete separation of the atria and ventricles, which allows for double circulation and more efficient oxygenation.",
    "explanation": "This answer outlines the key changes in heart structure throughout vertebrate evolution. The addition of chambers and the development of complete separation in birds and mammals are critical adaptations that support higher metabolic demands and more efficient oxygen delivery.",
    "topic": "Circulatory Pathways",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex008"
  },
  {
    "question_text": "Why do we call our heart myogenic?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Our heart is called myogenic because it has the inherent ability to generate its own electrical impulses without any external stimulation, due to the specialized nodal tissues within the cardiac muscle.",
    "explanation": "The term myogenic refers to the spontaneous generation of electrical impulses by the heart muscle itself, particularly through structures like the sino-atrial node, which ensures continuous rhythmic contractions.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex009"
  },
  {
    "question_text": "Sino-atrial node is called the pacemaker of our heart. Why?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The sino-atrial node is called the pacemaker because it is capable of generating the highest number of action potentials (70–75 per minute) which initiates and regulates the heartbeat by setting the heart's rhythm.",
    "explanation": "The sino-atrial node's autoexcitable property and its ability to set the pace of the heart’s contractions make it the natural pacemaker, ensuring that the heart beats in a regular and coordinated manner.",
    "topic": "Electrocardiograph (ECG) and Cardiac Cycle",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex010"
  },
  {
    "question_text": "What is the significance of atrio-ventricular node and atrio-ventricular bundle in the functioning of heart?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The atrio-ventricular (AV) node and AV bundle are critical for the proper conduction and timing of electrical impulses. The AV node delays the impulse from the atria, allowing the ventricles enough time to fill with blood, while the AV bundle transmits the impulse through the ventricular septum to ensure that the ventricular contraction occurs in a coordinated manner.",
    "explanation": "The delay provided by the AV node ensures efficient filling of the ventricles, and the conduction through the AV bundle (and further branching into Purkinje fibers) guarantees that the contraction of the ventricles is synchronized, which is essential for effective pumping of blood.",
    "topic": "Human Circulatory System and Cardiac Cycle",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex011"
  },
  {
    "question_text": "Define a cardiac cycle and the cardiac output.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A cardiac cycle is the complete sequence of events in the heart involving both systole (contraction) and diastole (relaxation) of the atria and ventricles. Cardiac output is defined as the amount of blood pumped out by each ventricle per minute, typically about 5000 mL in a healthy individual.",
    "explanation": "The cardiac cycle encompasses all the phases of heart activity that occur with each beat. Cardiac output, calculated by multiplying the stroke volume by the heart rate, measures the efficiency of the heart in maintaining circulation.",
    "topic": "Cardiac Cycle",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex012"
  },
  {
    "question_text": "Explain heart sounds.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Heart sounds, commonly described as 'lub' and 'dub', are produced by the closing of heart valves. The first heart sound ('lub') is associated with the closure of the tricuspid and bicuspid (mitral) valves, while the second heart sound ('dub') is related to the closure of the semilunar valves. These sounds are important for diagnosing cardiac function.",
    "explanation": "The distinct 'lub-dub' sounds correspond to specific valve closures in the cardiac cycle. Their timing and quality provide crucial clinical insights into the functioning of the heart, making them valuable in physical examinations.",
    "topic": "Cardiac Cycle and Heart Sounds",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex013"
  },
  {
    "question_text": "Draw a standard ECG and explain the different segments in it.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A standard ECG tracing includes several key segments: the P-wave represents atrial depolarization, the QRS complex represents ventricular depolarization which leads to ventricular contraction, and the T-wave represents ventricular repolarization. The intervals and segments between these waves (such as the PR interval and ST segment) provide information about the conduction time and recovery of the heart muscle.",
    "explanation": "This answer outlines the major components of an ECG tracing, correlating each segment with specific electrical events in the heart. The P-wave, QRS complex, and T-wave are fundamental in diagnosing cardiac conditions, and their analysis helps in assessing the heart’s rhythm and function.",
    "topic": "Electrocardiograph (ECG)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex014"
  }
]