[
  {
    "question_text": "Which of the following best describes cellulose?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A polymer made of fructose",
      "A homopolymer of glucose",
      "A branched polysaccharide storing energy",
      "A complex polysaccharide with amino-sugar units"
    ],
    "correct_answer": "A homopolymer of glucose",
    "explanation": "Cellulose is a polysaccharide composed entirely of glucose units, making it a homopolymer. It is not branched and does not store energy like starch or glycogen.",
    "topic": "Polysaccharides",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen076"
  },
  {
    "question_text": "Which polysaccharide is predominantly found in animal tissues as a store of energy?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cellulose",
      "Starch",
      "Glycogen",
      "Inulin"
    ],
    "correct_answer": "Glycogen",
    "explanation": "Glycogen is the form of polysaccharide that serves as a storage form of energy in animals, whereas starch is used for energy storage in plants.",
    "topic": "Polysaccharides",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen077"
  },
  {
    "question_text": "In a polysaccharide chain like glycogen, what are the names given to the two opposite ends of the chain?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Alpha end and beta end",
      "Phosphoryl end and dephosphoryl end",
      "Reducing end and nonreducing end",
      "Terminal end and subterminal end"
    ],
    "correct_answer": "Reducing end and nonreducing end",
    "explanation": "Polysaccharide chains have two ends: one where the free aldehyde or ketone group is present (reducing end) and the other is termed the nonreducing end.",
    "topic": "Polysaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen078"
  },
  {
    "question_text": "Why does starch form a blue coloration when treated with iodine (I2) while cellulose does not?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Because starch has a helical structure that traps iodine",
      "Because starch contains fructose units",
      "Because cellulose is soluble in water",
      "Because cellulose contains amino-sugars"
    ],
    "correct_answer": "Because starch has a helical structure that traps iodine",
    "explanation": "Starch has helical secondary structures that can incorporate iodine molecules, resulting in a blue coloration. Cellulose lacks such helices and, therefore, does not show this color change.",
    "topic": "Polysaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen079"
  },
  {
    "question_text": "Define polysaccharides and mention one example each from plants and animals.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Polysaccharides are long chains of sugar molecules linked together. In plants, an example is starch, and in animals, an example is glycogen.",
    "explanation": "Polysaccharides are macromolecules composed of many monosaccharides. Starch serves as the plant's energy store while glycogen performs the same function in animal tissues.",
    "topic": "Polysaccharides",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen080"
  },
  {
    "question_text": "Explain the key structural differences between starch and glycogen.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Starch typically consists of two types of molecules, amylose and amylopectin, with amylose forming a helical structure and amylopectin being branched, while glycogen is more highly branched than amylopectin, making it more accessible for quick energy release.",
    "explanation": "Both starch and glycogen are energy storage polysaccharides, but glycogen’s extra branching allows for rapid mobilization of glucose units, a feature that is particularly important in animal metabolism.",
    "topic": "Polysaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen081"
  },
  {
    "question_text": "Describe the role of glycosidic bonds in the structure and breakdown of glycogen.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Glycosidic bonds link individual glucose molecules in glycogen, forming a branched structure. During glycogen breakdown, these bonds are enzymatically cleaved to release glucose units.",
    "explanation": "The glycosidic bonds hold the glucose units together in a specific arrangement that allows glycogen to be efficiently synthesized and degraded, making it an effective energy storage molecule.",
    "topic": "Polysaccharides",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen082"
  },
  {
    "question_text": "Compare and contrast the structures of cellulose, starch, and glycogen in terms of their monosaccharide composition and branching patterns.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Cellulose is a homopolymer consisting solely of glucose and forms long, unbranched chains which provide strength to plant cell walls. Starch, found in plants, exists as a combination of amylose (a helical, mostly unbranched structure) and amylopectin (a branched structure) and serves as an energy reserve. Glycogen, present in animals, is similar to amylopectin but with an even higher degree of branching, facilitating rapid mobilization of glucose.",
    "explanation": "The structural differences among these polysaccharides dictate their functional roles. Cellulose's unbranched structure lends rigidity, starch's mixture provides a balance between compact storage and energy accessibility, and glycogen's extensive branching enables quick glucose release.",
    "topic": "Polysaccharides",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen083"
  },
  {
    "question_text": "Discuss the biological significance of complex polysaccharides like chitin, including its composition and role in nature.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Chitin is a complex polysaccharide composed of amino-sugars and chemically modified sugars. It is the main component of arthropod exoskeletons and provides both strength and flexibility. The structural complexity of chitin not only supports the physical framework of organisms but also provides resistance against environmental stressors and pathogens.",
    "explanation": "Chitin's unique chemical composition allows it to form robust and resilient structures in nature, highlighting its essential role in the biology of insects, crustaceans, and other arthropods.",
    "topic": "Polysaccharides",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen084"
  },
  {
    "question_text": "True or False: Cellulose is a branched polysaccharide that forms the structural component of plant cell walls.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Cellulose is an unbranched polysaccharide made up solely of glucose units. Its linear structure is crucial for forming strong plant cell walls.",
    "topic": "Polysaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen085"
  },
  {
    "question_text": "True or False: Inulin is a polymer that is exclusively made up of fructose molecules.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Inulin is a polysaccharide composed solely of fructose molecules as its repeating units, making it a homopolymer of fructose.",
    "topic": "Polysaccharides",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen086"
  },
  {
    "question_text": "True or False: The helical structure of starch allows it to trap iodine molecules, which results in a blue coloration.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The helical secondary structure of starch forms a cavity which can accommodate iodine molecules, leading to the observed blue color when iodine is added.",
    "topic": "Polysaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen087"
  },
  {
    "question_text": "True or False: Glycogen and starch are structurally identical in terms of their branching, making them functionally interchangeable in plants and animals.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Although both glycogen and starch serve as energy reserves, glycogen is more highly branched than starch, which allows animals to rapidly mobilize glucose compared to the slower release from starch in plants.",
    "topic": "Polysaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen088"
  },
  {
    "question_text": "True or False: Complex polysaccharides in nature, such as those found in arthropod exoskeletons, are generally homopolymers.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Many complex polysaccharides, including chitin in arthropod exoskeletons, are homopolymers or contain repetitive units that are chemically modified, ensuring consistency in their structural properties.",
    "topic": "Polysaccharides",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen089"
  },
  {
    "question_text": "True or False: The presence of glycosidic bonds in polysaccharides has no significant impact on their biochemical function.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Glycosidic bonds are critical for both the formation and breakdown of polysaccharides, directly influencing their structural stability and energy release mechanisms.",
    "topic": "Polysaccharides",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen090"
  },
  {
    "question_text": "A typical polysaccharide chain has how many ends?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "2",
    "explanation": "Every polysaccharide chain has two ends: the reducing end and the nonreducing end.",
    "topic": "Polysaccharides",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "06_section_9_5",
    "question_id": "cbse_xi_kebo1dd_c109_gen091"
  }
]