[
  {
    "question_text": "How is a pinnately compound leaf different from a palmately compound leaf?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In pinnately compound leaves, the leaflets are arranged along a common rachis, resembling a feather, whereas in palmately compound leaves all the leaflets arise from a single point at the end of the petiole, resembling the spread of a hand.",
    "explanation": "Pinnately compound leaves exhibit a central axis (rachis) with leaflets attached along both sides. In contrast, palmately compound leaves have all leaflets originating from one point at the petiole tip. This distinction is key to understanding leaf morphology in angiosperms.",
    "topic": "Leaf – Types of Compound Leaves",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex001"
  },
  {
    "question_text": "Explain with suitable examples the different types of phyllotaxy.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Phyllotaxy refers to the pattern of leaf arrangement on a plant stem. Examples include alternate phyllotaxy, where one leaf is borne per node in a staggered pattern (e.g., china rose, mustard), opposite phyllotaxy, where two leaves arise from each node on opposite sides (e.g., Calotropis, guava), and whorled phyllotaxy, where three or more leaves arise at the same node forming a circle (e.g., Alstonia).",
    "explanation": "The answer describes the three main types of leaf arrangements: alternate (single leaf per node in an alternate pattern), opposite (pair of leaves per node at opposing sides) and whorled (three or more leaves from a single node). Examples from the chapter help in understanding these arrangements.",
    "topic": "Leaf – Phyllotaxy",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex002"
  },
  {
    "question_text": "Define the following terms: (a) aestivation (b) placentation (c) actinomorphic (d) zygomorphic (e) superior ovary (f) perigynous flower (g) epipetalous stamen",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Aestivation is the arrangement of sepals or petals in a floral bud; placentation is the arrangement of ovules within the ovary; actinomorphic means having radial symmetry; zygomorphic means having bilateral symmetry; a superior ovary is one that is positioned above the attachment of other floral parts; a perigynous flower has floral parts attached around a cup-shaped thalamus resulting in a half-inferior ovary; epipetalous stamen refers to stamens that are attached to the petals.",
    "explanation": "Each term is defined based on the structural characteristics of flowers. Aestivation explains how sepals and petals are arranged before blooming, while placentation details ovule positions. Actinomorphic and zygomorphic describe the types of symmetry in flowers. Superior ovary and perigynous flowers relate to the position of the ovary relative to other parts, and epipetalous describes the specific attachment of stamens to petals.",
    "topic": "Flower – Floral Morphology",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex003"
  },
  {
    "question_text": "Differentiate between (a) Racemose and cymose inflorescence and (b) Apocarpous and syncarpous ovary",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Racemose inflorescence has an indeterminate main axis with flowers arranged in an acropetal succession, while cymose inflorescence has a determinate main axis that terminates in a flower with subsequent flowers developing basipetally. An apocarpous ovary consists of free, separate carpels, whereas a syncarpous ovary has carpels that are fused together.",
    "explanation": "The distinction in racemose inflorescence involves continuous growth of the main axis allowing sequential flower development from the base upward, unlike the cymose type where the growth stops at the terminal flower. Similarly, apocarpous ovaries have individually free carpels (as seen in some dicots), while syncarpous ovaries feature fused carpels, impacting the structure and development of the fruit.",
    "topic": "Inflorescence and Flower – Ovary Types",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex004"
  },
  {
    "question_text": "Draw the labelled diagram of the following: (i) gram seed and (ii) V.S. of maize seed",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "For a gram seed (dicotyledonous), the diagram should include the seed coat with its two layers (testa and tegmen), hilum, and the internal embryo showing two cotyledons, radicle and plumule. For a maize seed (monocotyledonous), the diagram should depict the seed coat fused with the fruit wall, the large endosperm with an aleurone layer, and a small embryo with a single cotyledon (scutellum) along with the coleoptile, plumule, radicle, and coleorhiza.",
    "explanation": "The answer requires drawing two separate diagrams that capture the unique anatomical features of dicot (gram seed) and monocot (maize seed) seeds. The gram seed diagram must highlight the two distinct cotyledons along with the embryonic axis, while the maize seed diagram must emphasize the large endosperm, aleurone layer, and specialized structures such as the scutellum and protective sheaths.",
    "topic": "Seed Structure – Dicotyledonous and Monocotyledonous Seeds",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex005"
  },
  {
    "question_text": "Take one flower of the family Solanaceae and write its semi-technical description. Also draw its floral diagram.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A typical answer should include details such as the flower being solitary or arranged in axillary/cymose inflorescence, bisexual, and actinomorphic with a five-sepaled calyx (usually united with valvate aestivation), five united petals forming the corolla, five stamens that are epipetalous, and a bicarpellary, syncarpous gynoecium with a superior, bilocular ovary and axile placentation. The floral diagram should depict these features in concentric whorls on the thalamus.",
    "explanation": "The response must cover both descriptive and diagrammatic aspects of the Solanaceae flower. It should mention the vegetative background as well as the reproductive parts, and accurately represent the relationships and arrangement of floral parts in the diagram. This demonstrates both detailed knowledge and the ability to synthesize and represent floral morphology.",
    "topic": "Solanaceae – Flower Morphology and Floral Diagram",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex006"
  },
  {
    "question_text": "Describe the various types of placentations found in flowering plants.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The various types of placentation include marginal placentation, where ovules are attached along a margin; axile placentation, where ovules are attached to a central column in a multilocular ovary; parietal placentation, where ovules develop on the inner wall of the ovary; free central placentation, with ovules attached to a central axis in a unilocular ovary; and basal placentation, where a single ovule is attached at the base of the ovary.",
    "explanation": "Each type of placentation describes a distinct way in which ovules are arranged within the ovary, influencing seed development and fruit structure. The answer should include definitions and, if possible, examples from the chapter to illustrate the differences.",
    "topic": "Flower – Placentation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex007"
  },
  {
    "question_text": "What is a flower? Describe the parts of a typical angiosperm flower.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A flower is the reproductive unit of angiosperms, specialized for sexual reproduction. A typical flower consists of four whorls: the calyx (sepals) for protection, the corolla (petals) for attracting pollinators, the androecium (stamens) which produce pollen, and the gynoecium (carpels) which form the ovary, style, and stigma. Additional structures include the pedicel, and variations in these parts determine the type and symmetry of the flower.",
    "explanation": "The answer integrates the definition of a flower with a detailed description of its primary parts and functions. This comprehensive overview is essential for understanding the reproductive mechanisms in flowering plants.",
    "topic": "Flower – Basic Structure",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex008"
  },
  {
    "question_text": "Define the term inflorescence. Explain the basis for the different types of inflorescence in flowering plants.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Inflorescence is the arrangement or grouping of flowers on a plant’s floral axis. The differences in inflorescence types are mainly based on the growth pattern of the main axis: in racemose inflorescences the main axis continues to grow with flowers emerging acropetally, whereas in cymose inflorescences the main axis terminates in a flower with subsequent flowers developing in a basipetal order.",
    "explanation": "The answer should provide a definition of inflorescence and distinguish between the racemose and cymose types by describing how flower development originates from the floral axis. Examples from the chapter help to clarify these differences.",
    "topic": "Inflorescence",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex009"
  },
  {
    "question_text": "Describe the arrangement of floral members in relation to their insertion on thalamus.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Floral members are arranged in concentric whorls on the thalamus. Typically, the calyx forms the outermost whorl, followed by the corolla, then the androecium, and finally the gynoecium in the center. The insertion of these parts can affect the relative position of the ovary, determining whether it is superior, half-inferior (perigynous), or inferior (epigynous).",
    "explanation": "This answer explains the systematic and concentric arrangement of the calyx, corolla, androecium, and gynoecium on the thalamus, and shows how variations in the insertion of these parts can alter the position of the ovary. Understanding this arrangement is fundamental in categorizing flower types.",
    "topic": "Flower – Floral Arrangement and Ovary Position",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo105",
    "question_id": "cbse_xi_kebo1dd_c105_ex010"
  },
  {
    "question_text": "What is the term used to describe the arrangement of flowers on a floral axis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Phyllotaxy",
      "B. Inflorescence",
      "C. Floral meristem",
      "D. Acropetal succession"
    ],
    "correct_answer": "B. Inflorescence",
    "explanation": "Inflorescence is the correct term referring to the arrangement of flowers on the floral axis, as described in the section.",
    "topic": "Inflorescence",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen056"
  },
  {
    "question_text": "Which of the following best distinguishes racemose inflorescence from cymose inflorescence?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. In racemose, the main axis terminates in a flower; in cymose it continues to grow.",
      "B. In racemose, flowers are borne in a basipetal order; in cymose they are in acropetal succession.",
      "C. In racemose, the main axis continues to grow with acropetal flower succession; in cymose, the main axis terminates in a flower with basipetal order.",
      "D. In racemose, lateral buds develop; in cymose, buds are only at the apex."
    ],
    "correct_answer": "C. In racemose, the main axis continues to grow with acropetal flower succession; in cymose, the main axis terminates in a flower with basipetal order.",
    "explanation": "Racemose inflorescence features continuous growth of the main axis and acropetal order, whereas cymose inflorescence terminates with a flower at the apex and shows a basipetal order.",
    "topic": "Inflorescence",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen057"
  },
  {
    "question_text": "In the transformation of a shoot into a flower, what specific change occurs at the shoot apical meristem?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. It becomes a leaf meristem.",
      "B. It transforms into a floral meristem.",
      "C. It develops internodal elongation.",
      "D. It divides into multiple shoots."
    ],
    "correct_answer": "B. It transforms into a floral meristem.",
    "explanation": "During the transformation process, the shoot apical meristem changes into a floral meristem, which leads to flower formation.",
    "topic": "Flower Transformation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen058"
  },
  {
    "question_text": "Which mode of flower arrangement is characteristic of racemose inflorescence?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Basipetal succession",
      "B. Lateral whorls",
      "C. Acropetal succession",
      "D. Terminal clustering"
    ],
    "correct_answer": "C. Acropetal succession",
    "explanation": "Racemose inflorescence is marked by the main axis growing continuously with flowers development in acropetal succession, meaning the youngest are at the tip.",
    "topic": "Inflorescence",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen059"
  },
  {
    "question_text": "Which type of inflorescence sees the main axis terminate in a flower?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Racemose",
      "B. Panicle",
      "C. Cymose",
      "D. Spike"
    ],
    "correct_answer": "C. Cymose",
    "explanation": "Cymose inflorescence is characterized by the termination of the main axis with a flower, leading to a limited growth pattern with a basipetal order of flowers.",
    "topic": "Inflorescence",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen060"
  },
  {
    "question_text": "Explain the process by which a shoot transforms into a flower.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The shoot apical meristem transforms into a floral meristem, and internodes do not elongate, resulting in a condensed axis. The apex then produces floral appendages laterally at successive nodes, rather than leaves.",
    "explanation": "This answer covers the transformation process including the change of the shoot apical meristem into a floral meristem, aspects of internodal growth, and the lateral initiation of floral parts which distinguishes flowers from regular shoots.",
    "topic": "Flower Transformation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen061"
  },
  {
    "question_text": "Define inflorescence and describe its significance in flowering plants.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Inflorescence is the arrangement of flowers on the floral axis. It is significant as it ensures effective pollination by arranging the flowers in a sequence that may enhance attraction to pollinators and optimize reproductive success.",
    "explanation": "This answer defines the term inflorescence and explains its relevance in facilitating reproductive processes in plants, linking it with pollination.",
    "topic": "Inflorescence",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen062"
  },
  {
    "question_text": "How do acropetal and basipetal orders differ in the context of inflorescence?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Acropetal order refers to the sequential development of flowers from the base toward the apex (younger at the tip), as seen in racemose inflorescence, while basipetal order refers to the development from the apex downward (older at the tip), as seen in cymose inflorescence.",
    "explanation": "This answer differentiates between acropetal and basipetal flower development orders by explaining their directionality and linking them with their corresponding inflorescence types.",
    "topic": "Inflorescence",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen063"
  },
  {
    "question_text": "Discuss the differences in leaf arrangement (phyllotaxy) among China rose, Guava, and Alstonia as described in the section.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "China rose exhibits alternate phyllotaxy where leaves occur one per node and alternate sides, Guava displays opposite phyllotaxy with two leaves per node on opposite sides, and Alstonia shows whorled phyllotaxy where three or more leaves arise from a single node.",
    "explanation": "This answer clearly explains the differences in phyllotaxy for each of the three plants by describing how the leaves are arranged at the nodes of their stems.",
    "topic": "Phyllotaxy",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen064"
  },
  {
    "question_text": "Compare and contrast racemose and cymose inflorescences, including their patterns of flower development and overall growth behavior.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Racemose inflorescences have a continuously growing main axis with flowers developing in an acropetal sequence (youngest at the tip), whereas cymose inflorescences have their main axis terminate in a flower, leading to a limited growth pattern with flowers developing in a basipetal order (from the tip downward). This difference affects the overall architecture and timing of flower production in the plant.",
    "explanation": "The answer provides a detailed comparison by noting both structural and developmental differences between the two types of inflorescence, highlighting their implications for plant growth and reproduction.",
    "topic": "Inflorescence",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen065"
  },
  {
    "question_text": "Explain the ecological significance of phyllotaxy in plants, particularly in relation to light capture and pollination.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Phyllotaxy, or the arrangement of leaves on a stem, is ecologically significant because it directly influences a plant's efficiency in capturing light for photosynthesis. Different phyllotactic arrangements, such as alternate, opposite, and whorled, optimize light exposure and minimize shading. Additionally, proper leaf arrangement can affect the display and accessibility of flowers to pollinators, indirectly enhancing the plant's reproductive success.",
    "explanation": "This answer discusses how various phyllotactic patterns optimize light capture and also impact the visibility and accessibility of flowers, thereby linking morphology with both photosynthetic efficiency and reproductive strategies.",
    "topic": "Phyllotaxy and Plant Ecology",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen066"
  },
  {
    "question_text": "Analyze the diagram illustrating stages of flower development in the inflorescence (as per the section description). Discuss how the sequential development of buds to open flowers might impact pollination efficiency.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The diagram shows various developmental stages of flowers—from closed buds, which are pink, to fully opened yellow petals. This sequential development ensures that not all flowers bloom simultaneously, which can extend the period during which pollinators can visit the plant, thus enhancing pollination efficiency. The staggered bloom may also reduce competition among the flowers for pollinator attention, ensuring that each flower has a better chance of being pollinated.",
    "explanation": "This response elaborates on how the timing and sequence of flowering could modify pollinator behavior and increase overall reproductive success by providing a prolonged flowering period and reducing intra-inflorescence competition for pollinators.",
    "topic": "Inflorescence",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen067"
  },
  {
    "question_text": "True or False: In racemose inflorescence, the main axis stops growing after the formation of the first flower.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In racemose inflorescence, the main axis continues to grow, allowing for the sequential development of flowers in an acropetal manner.",
    "topic": "Inflorescence",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen068"
  },
  {
    "question_text": "True or False: In cymose inflorescence, the arrangement of flowers follows a basipetal order, meaning they develop from the apex downward.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The description states that in cymose inflorescence, the main axis terminates in a flower and flowers develop in a basipetal order (from the apex downward).",
    "topic": "Inflorescence",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen069"
  },
  {
    "question_text": "True or False: Alternate phyllotaxy means that two leaves arise from the same node, positioned on opposite sides of the stem.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Alternate phyllotaxy implies one leaf per node, alternating in position along the stem. The statement describes opposite phyllotaxy where two leaves arise per node on opposite sides.",
    "topic": "Phyllotaxy",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen070"
  },
  {
    "question_text": "True or False: In the genus Senna, which exhibits alternate phyllotaxy and compound leaves, the vibrant yellow flowers play a key role in the plant's reproduction by attracting pollinators.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section describes Senna as having alternate leaves, vibrant yellow flowers, and reproductive structures designed for pollination, confirming the statement.",
    "topic": "Flower Structure and Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen071"
  },
  {
    "question_text": "True or False: When a shoot tip transforms into a flower, it always produces a cluster of multiple flowers simultaneously.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text specifies that when a shoot tip transforms into a flower, it is always solitary, meaning a single flower is produced, not a cluster.",
    "topic": "Flower Transformation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen072"
  },
  {
    "question_text": "True or False: Phyllotaxy has a significant impact on light capture for photosynthesis in plants.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Phyllotaxy, being the arrangement of leaves on a stem, directly affects how leaves are exposed to sunlight, thus influencing light capture for photosynthesis.",
    "topic": "Phyllotaxy",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen073"
  },
  {
    "question_text": "Based on the description provided, how many petals are visible in the flowers of the plant species from the genus Senna?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "5",
    "explanation": "The section description of the Senna species indicates that the flowers display five petals.",
    "topic": "Flower Structure and Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen074"
  },
  {
    "question_text": "In Alstonia, a whorled phyllotaxy is observed. What is the minimum number of leaves that originate from a single node in this type of arrangement?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "3",
    "explanation": "Whorled phyllotaxy in Alstonia is described as having three or more leaves emerging from a single node, so the minimum number is 3.",
    "topic": "Phyllotaxy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xi_kebo1dd_c105_gen075"
  },
  {
    "question_text": "Which of the following correctly describes the layers of the seed coat in a dicotyledonous seed?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Outer testa and inner tegmen",
      "Outer tegmen and inner testa",
      "Single homogeneous layer",
      "Outer hilum and inner micropyle"
    ],
    "correct_answer": "Outer testa and inner tegmen",
    "explanation": "In dicotyledonous seeds the seed coat has two layers: the outer layer is called the testa and the inner layer is called the tegmen.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen112"
  },
  {
    "question_text": "Which structure on the seed coat serves as a scar indicating the attachment of the seed to the fruit?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Micropyle",
      "Hilum",
      "Aleurone layer",
      "Cotyledon"
    ],
    "correct_answer": "Hilum",
    "explanation": "The hilum is a scar on the seed coat where the developing seed was attached to the fruit.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen113"
  },
  {
    "question_text": "In a dicotyledonous seed, what is the function of the micropyle?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It is a pore for water entry",
      "It stores food",
      "It protects the embryo",
      "It provides structural support"
    ],
    "correct_answer": "It is a pore for water entry",
    "explanation": "The micropyle is a small pore in the seed coat of a dicotyledonous seed that allows water to enter during germination.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen114"
  },
  {
    "question_text": "In monocotyledonous seeds such as cereals, which structure protects the radicle?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Coleoptile",
      "Coleorhiza",
      "Scutellum",
      "Aleurone layer"
    ],
    "correct_answer": "Coleorhiza",
    "explanation": "In monocot seeds, the radicle is protected by a sheath known as the coleorhiza.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen115"
  },
  {
    "question_text": "Describe two differences between dicotyledonous and monocotyledonous seed structures.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Dicot seeds typically have two cotyledons and a seed coat with two layers (testa and tegmen), whereas monocot seeds usually have one cotyledon (scutellum), and the seed coat is often fused with the fruit wall. Additionally, the nutritive tissue in monocots is predominantly endosperm, while many dicots may be non-endospermic.",
    "explanation": "This answer highlights key differences: the number of cotyledons, the structure of the seed coat, and the nature of the nutritive reserve tissue.",
    "topic": "Comparative Structures",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen116"
  },
  {
    "question_text": "Explain the role of the aleurone layer in monocotyledonous seeds.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The aleurone layer is a proteinous layer that surrounds the endosperm in monocot seeds, separating it from the embryo. It plays a key role in storing and mobilizing nutrients during the germination process.",
    "explanation": "The answer specifies that the aleurone layer acts as a protective and nutritive mediator, vital during seed germination.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen117"
  },
  {
    "question_text": "What is the function of the endosperm in a seed?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The endosperm serves as a food storage tissue for the developing embryo, providing essential nutrients during germination.",
    "explanation": "The endosperm, formed as a result of double fertilisation in some seeds, stores food and thus plays a critical function in nourishing the growing embryo.",
    "topic": "Seed Nutrient Reservoirs",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen118"
  },
  {
    "question_text": "Discuss the structural components of a dicotyledonous seed and their respective functions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A dicotyledonous seed consists of an outer seed coat (with an outer testa and inner tegmen) that provides protection, and an embryo containing two cotyledons, the radicle, and the plumule. The hilum marks the point where the seed was attached to the fruit, and the micropyle is a pore that permits water entry. The cotyledons store food reserves, the radicle develops into the root, and the plumule becomes the shoot, all of which contribute to the successful germination and development of the plant.",
    "explanation": "This answer details each part of the dicot seed along with its function, reflecting a comprehensive understanding of the structure and its significance during germination.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen119"
  },
  {
    "question_text": "Compare and contrast the seed structures of dicotyledonous and monocotyledonous plants, focusing on aspects of protection and nutrient storage.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Dicotyledonous seeds typically possess two cotyledons and a distinct seed coat comprising an outer testa and an inner tegmen, with the embryo featuring both a radicle and a plumule. In many dicots, the endosperm may be absent or plays a lesser role, with cotyledons storing sufficient food. In contrast, monocotyledonous seeds often have a single, shield-shaped cotyledon (scutellum) and the seed coat is merged with the fruit wall. Their large endosperm serves as the primary food reserve, and they include specialized structures such as the coleoptile and coleorhiza that protect the plumule and radicle respectively.",
    "explanation": "This answer compares the two types of seeds by examining their structural differences and the functions of their components, particularly in terms of protection and nutrient storage.",
    "topic": "Comparative Seed Structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen120"
  },
  {
    "question_text": "True or False: In a dicotyledonous seed, the micropyle is located below the hilum.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The micropyle is actually located above the hilum, not below it, in a dicotyledonous seed.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen121"
  },
  {
    "question_text": "True or False: The aleurone layer in monocotyledonous seeds is a proteinous covering that separates the embryo from the endosperm.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The aleurone layer is a proteinous layer that surrounds the endosperm and acts as a boundary between the endosperm and the embryo in monocot seeds.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen122"
  },
  {
    "question_text": "True or False: Castor seeds are an example of non-endospermic seeds.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Castor seeds possess endosperm, which is a result of double fertilisation, classifying them as endospermic rather than non-endospermic.",
    "topic": "Seed Nutrient Reservoirs",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen123"
  },
  {
    "question_text": "True or False: In most monocotyledonous seeds, the seed coat is fused with the fruit wall.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Monocot seeds generally have a membranous seed coat that is fused with the fruit wall, providing added protection.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen124"
  },
  {
    "question_text": "True or False: In a dicotyledonous seed, the radicle develops into the embryonic shoot.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The radicle develops into the root, not the shoot; the embryonic shoot comes from the plumule.",
    "topic": "Structure of a Dicotyledonous Seed",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen125"
  },
  {
    "question_text": "In a maize seed, if the endosperm occupies 75% of the seed's volume and the total volume is 2 cubic centimeters, what is the volume of the endosperm?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1.5 cubic centimeters",
    "explanation": "Calculating 75% of 2 cubic centimeters gives 0.75 x 2 = 1.5 cubic centimeters, which is the volume occupied by the endosperm.",
    "topic": "Structure of a Monocotyledonous Seed",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "08_section_5_7",
    "question_id": "cbse_xi_kebo1dd_c105_gen126"
  },
  {
    "question_text": "Which symbol in the floral formula stands for the calyx?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Br",
      "K",
      "C",
      "A"
    ],
    "correct_answer": "K",
    "explanation": "In the floral formula, the symbol 'K' represents the calyx, which is the outermost whorl of a flower.",
    "topic": "Floral formula symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen127"
  },
  {
    "question_text": "In the floral diagram, which part of the flower is depicted as cloud-like shapes?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Calyx",
      "Petals",
      "Androecium",
      "Gynoecium"
    ],
    "correct_answer": "Petals",
    "explanation": "The petals, which form the corolla, are shown as cloud-like shapes in the floral diagram.",
    "topic": "Floral diagram details",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen128"
  },
  {
    "question_text": "In a floral diagram, what does the dot on the top represent?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Fusion of floral parts",
      "Adhesion between whorls",
      "Position of the mother axis",
      "Zygomorphic symmetry"
    ],
    "correct_answer": "Position of the mother axis",
    "explanation": "The dot indicates the position of the mother axis relative to the flower in the floral diagram.",
    "topic": "Floral diagram symbols",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen129"
  },
  {
    "question_text": "What does enclosing the figure within brackets in a floral formula indicate?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Cohesion",
      "Fusion",
      "Adhesion",
      "Symmetry"
    ],
    "correct_answer": "Fusion",
    "explanation": "Enclosing parts of the floral formula within brackets is used to indicate that they are fused together.",
    "topic": "Floral formula notation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen130"
  },
  {
    "question_text": "Which floral part in the diagram is located in the center of the floral whorls?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Calyx",
      "Corolla",
      "Androecium",
      "Gynoecium"
    ],
    "correct_answer": "Gynoecium",
    "explanation": "The gynoecium is depicted at the center of the flower in the floral diagram, making it the innermost whorl.",
    "topic": "Arrangement of floral parts",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen131"
  },
  {
    "question_text": "Describe the sequence used for providing a semi-technical description of a flowering plant.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The description begins with the plant's habit, then covers vegetative characters including the roots, stem, and leaves, followed by floral characters such as the inflorescence and flower parts, and concludes with a floral diagram and floral formula.",
    "explanation": "The standard sequence starts broadly with general habits, moves to vegetative structures, then details the reproductive parts before presenting the summarizing diagram and formula.",
    "topic": "Plant description sequence",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen132"
  },
  {
    "question_text": "Explain the importance of the floral formula in flower morphology and plant taxonomy.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The floral formula concisely represents the number, arrangement, and relationships of floral parts using standardized symbols, which aids in classifying plants and comparing morphological traits across species.",
    "explanation": "It provides essential data on the structure of the flower, including details such as symmetry, fusion, and adhesion among parts, all of which are crucial for taxonomic analysis.",
    "topic": "Floral formula significance",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen133"
  },
  {
    "question_text": "What information can be inferred from the symbols used in a floral diagram?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The symbols can indicate the number of parts, their arrangement in whorls, the type of symmetry (actinomorphic or zygomorphic), as well as details on fusion (indicated by brackets) and adhesion (indicated by connecting lines) among the floral parts.",
    "explanation": "These symbols provide a visual shorthand for the detailed morphology of the flower, revealing key structural and taxonomical information.",
    "topic": "Interpreting floral diagrams",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen134"
  },
  {
    "question_text": "Discuss the steps involved in constructing a semi-technical description of a flowering plant and why each step is significant.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The steps begin with describing the overall habit of the plant, then detailing the vegetative characters like roots, stem, and leaves. Following this, the floral characters such as the inflorescence and flower parts are described. Finally, the floral diagram and floral formula are provided. Each step is significant because they build a complete profile of the plant, starting with general growth form and moving to specific reproductive structures that are critical for taxonomy and identification.",
    "explanation": "This systematic description allows for a clear and concise presentation of the plant's morphology, making it easier to identify specific features and compare them across different species, which is essential in plant taxonomy.",
    "topic": "Semi-technical plant description",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen135"
  },
  {
    "question_text": "Evaluate how the floral diagram and floral formula complement each other in understanding flower morphology, providing examples from the mustard plant to support your explanation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The floral diagram visually represents the spatial arrangement of the flower's parts in successive whorls, showing the relative position (calyx outside, followed by corolla, androecium, and gynoecium in the center), whereas the floral formula provides a symbolic representation of the number, symmetry, and fusion of these parts. For example, in the mustard plant (Family: Brassicaceae), the diagram reveals the orderly sequence of structures, and the formula uses specific symbols to detail the number of sepals, petals, stamens, and carpels. Together, they offer a complete picture by combining spatial and quantitative information.",
    "explanation": "This complementary use improves clarity and aids in taxonomic classification by presenting both detailed spatial relationships and numerical data, which helps in the identification and comparison of species.",
    "topic": "Complementarity of floral diagram and formula",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen136"
  },
  {
    "question_text": "True or False: The floral diagram provides information about the number and arrangement of the floral parts.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The floral diagram is specifically designed to illustrate the number, arrangement, and spatial relationships of the floral parts.",
    "topic": "Floral diagram details",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen137"
  },
  {
    "question_text": "True or False: Fusion of floral parts in the floral formula is indicated by drawing a line above their symbols.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In the floral formula, fusion is indicated by enclosing the figure within brackets, not by a line above the symbols. A line above the symbols represents adhesion between different parts.",
    "topic": "Floral formula notation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen138"
  },
  {
    "question_text": "True or False: In the floral formula, the symbol '⊕' is used to denote actinomorphic symmetry in flowers.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The symbol '⊕' in the floral formula represents actinomorphic symmetry, meaning the flower is radially symmetrical.",
    "topic": "Floral formula symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen139"
  },
  {
    "question_text": "True or False: The outermost whorl in a floral diagram is the gynoecium.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The outermost whorl in a floral diagram is the calyx, not the gynoecium, which is positioned at the center.",
    "topic": "Arrangement of floral parts",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen140"
  },
  {
    "question_text": "True or False: The floral diagram and formula illustrate both cohesion within whorls and adhesion between different whorls.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "The floral formula explicitly shows both cohesion (within whorls) and adhesion (between different whorls) among floral parts, which is reflected in the diagram as well.",
    "topic": "Floral diagram and formula relationships",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen141"
  },
  {
    "question_text": "If a flower has 4 sepals, 4 petals, 6 stamens, and 2 carpels, represent its floral formula using the symbols K for sepals, C for petals, A for stamens, and G for carpels.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "K4 C4 A6 G2",
    "explanation": "The floral formula is constructed by writing the symbol for each floral tissue followed by the number of parts. In this case, 4 sepals (K4), 4 petals (C4), 6 stamens (A6), and 2 carpels (G2) combine to form the full formula.",
    "topic": "Floral formula construction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen142"
  },
  {
    "question_text": "What structure protects the apical meristem as the root grows through the soil?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Root cap",
      "Bud",
      "Node",
      "Internode"
    ],
    "correct_answer": "Root cap",
    "explanation": "The root cap is a thimble-like structure that protects the delicate apical meristem as the root pushes through the soil.",
    "topic": "Root structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen001"
  },
  {
    "question_text": "Which type of root system is typically found in monocotyledonous plants?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Taproot system",
      "Fibrous root system",
      "Lateral root system",
      "Adventitious root system"
    ],
    "correct_answer": "Fibrous root system",
    "explanation": "Monocotyledonous plants usually develop a fibrous root system where the primary root is short-lived and replaced by many roots arising from the base of the stem.",
    "topic": "Root types",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen002"
  },
  {
    "question_text": "Which region of the root is primarily responsible for cell division?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Root cap",
      "Region of maturation",
      "Region of meristematic activity",
      "Region of elongation"
    ],
    "correct_answer": "Region of meristematic activity",
    "explanation": "The region of meristematic activity, located just above the root cap, consists of small, thin-walled cells that divide repeatedly.",
    "topic": "Regions of the root",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen003"
  },
  {
    "question_text": "Root hairs, which increase the surface area for absorption, arise from which region of the root?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Region of meristematic activity",
      "Region of elongation",
      "Region of maturation",
      "Root cap"
    ],
    "correct_answer": "Region of maturation",
    "explanation": "As the cells in the elongation zone gradually differentiate and mature, some epidermal cells develop into root hairs in the region of maturation, enhancing the absorption of water and minerals.",
    "topic": "Regions of the root",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen004"
  },
  {
    "question_text": "Which of the following is NOT a function of the root system?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Absorption of water and minerals",
      "Storage of reserve food materials",
      "Synthesis of plant growth regulators",
      "Photosynthesis"
    ],
    "correct_answer": "Photosynthesis",
    "explanation": "The root system is responsible for absorption, anchorage, storage, and synthesis of growth regulators; photosynthesis is carried out by the shoot system.",
    "topic": "Functions of the roots",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen005"
  },
  {
    "question_text": "Explain the role of the region of elongation in root growth.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The region of elongation is where cells undergo rapid enlargement, significantly increasing in length to contribute to the overall growth of the root.",
    "explanation": "In the region of elongation, cells not only grow in size but their increased length propels the root tip deeper into the soil, facilitating further growth.",
    "topic": "Zones of the root",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen006"
  },
  {
    "question_text": "List the main functions of the root system as mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The root system functions in the absorption of water and minerals, anchorage of the plant, storage of reserve food materials, and synthesis of plant growth regulators.",
    "explanation": "These functions collectively support the plant by providing necessary nutrients, stabilizing the plant, storing energy, and regulating growth.",
    "topic": "Functions of the roots",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen007"
  },
  {
    "question_text": "Define adventitious roots and provide an example of a plant that possesses them.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Adventitious roots are roots that arise from parts of the plant other than the radicle, such as stems, leaves, or nodes. Examples include grass, Monstera, and the banyan tree.",
    "explanation": "Unlike primary roots which originate from the radicle, adventitious roots develop from other organs and serve functions like support and additional absorption.",
    "topic": "Types of roots",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen008"
  },
  {
    "question_text": "Describe the structural differences between a taproot system and a fibrous root system.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A taproot system features a single, dominant primary root with branching lateral roots, as seen in many dicotyledonous plants. In contrast, a fibrous root system comprises many thin, similarly sized roots that form a network, typical of monocotyledonous plants.",
    "explanation": "The taproot provides strong anchorage and accesses deeper soil layers, whereas the fibrous system spreads out widely near the surface to maximize water and nutrient uptake.",
    "topic": "Root types and structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen009"
  },
  {
    "question_text": "Compare and contrast the taproot, fibrous, and adventitious root systems in terms of their structure and function.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The taproot system, common in dicotyledonous plants, consists of a large, primary root that penetrates deep into the soil with secondary lateral roots. The fibrous root system, typical of monocots, is made up of numerous thin roots with no single dominant root, ensuring extensive surface area. Adventitious roots develop from parts of the plant other than the radicle, such as stems or nodes, and can provide support and additional nutrient absorption. Each system adapts to different environmental conditions, offering various advantages such as depth of penetration or extensive surface contact with the soil.",
    "explanation": "This answer requires analyzing the structure and functional differences among the three systems based on development, architecture, and ecological adaptation.",
    "topic": "Types of roots",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen010"
  },
  {
    "question_text": "Discuss the three regions of the root tip, highlighting their distinct roles in root development.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The root tip is divided into three regions: the region of meristematic activity, where cell division occurs; the region of elongation, where cells rapidly enlarge to push the root forward; and the region of maturation, where cells differentiate to form specialized structures such as root hairs for absorption. Each region contributes sequentially to the development and function of the root.",
    "explanation": "This explanation details the progression from protection and division near the tip to elongation for growth, followed by maturation for functional specialization.",
    "topic": "Regions of the root",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen011"
  },
  {
    "question_text": "Evaluate how the differences in root systems, such as taproot versus fibrous and adventitious roots, reflect plant adaptations to various soil conditions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Plants with taproot systems are often adapted to environments where deep penetration into soil is beneficial for accessing water and nutrients at greater depths. On the other hand, fibrous root systems spread widely to exploit shallow, moisture-rich layers in the soil, which is common in monocots. Adventitious roots provide additional anchorage and absorption, especially in unstable or nutrient-poor substrates. These differences illustrate how root architecture is tailored to optimize survival and resource acquisition under different environmental conditions.",
    "explanation": "This answer assesses the ecological significance of root architecture variations and underscores the adaptive benefits each system provides in response to soil and climate conditions.",
    "topic": "Root systems and adaptation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen012"
  },
  {
    "question_text": "True or False: The root cap is involved in the absorption of water and minerals.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The root cap functions primarily to protect the apical meristem as the root grew through the soil; absorption is carried out by the mature region where root hairs are present.",
    "topic": "Root structure and function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen013"
  },
  {
    "question_text": "True or False: In dicotyledonous plants, the primary root formed by the radicle often develops into a taproot system.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text states that in the majority of dicotyledonous plants, the radicle elongates to form a primary root that develops into a taproot system.",
    "topic": "Root systems",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen014"
  },
  {
    "question_text": "True or False: A fibrous root system is characterized by one dominant central root with few lateral branches.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "A fibrous root system consists of many thin roots of similar size without a single dominant central root, which is the characteristic feature of a taproot system.",
    "topic": "Root types",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen015"
  },
  {
    "question_text": "True or False: Adventitious roots arise exclusively from the radicle of a plant.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Adventitious roots develop from plant parts other than the radicle, such as stems, leaves, or nodes, and not exclusively from the primary root.",
    "topic": "Types of roots",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen016"
  },
  {
    "question_text": "True or False: Root hairs play a crucial role in increasing the surface area for absorption of water and minerals.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Root hairs are fine extensions of cells in the region of maturation that significantly increase the surface area available for the absorption of water and minerals.",
    "topic": "Root function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen017"
  },
  {
    "question_text": "If the region of meristematic activity produces 5 new cells per minute, how many cells will be produced in 15 minutes?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "75 cells",
    "explanation": "Multiplying the production rate (5 cells/min) by the number of minutes (15) gives 5 x 15 = 75 cells.",
    "topic": "Root zones",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "02_section_5_1",
    "question_id": "cbse_xi_kebo1dd_c105_gen018"
  },
  {
    "question_text": "Which organ of the plant is primarily responsible for photosynthesis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Leaf",
      "Stem",
      "Root",
      "Flower"
    ],
    "correct_answer": "Leaf",
    "explanation": "Leaves are the primary sites for photosynthesis, converting light energy into chemical energy which fuels plant growth.",
    "topic": "Leaf Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen037"
  },
  {
    "question_text": "In compound leaves, an axillary bud is found in the axil of the petiole but not in the axil of which other part?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Leaflet",
      "Lamina",
      "Stipule",
      "Rachis"
    ],
    "correct_answer": "Leaflet",
    "explanation": "The text explains that although a bud is present in the axil of the petiole in both simple and compound leaves, it is not present in the axils of the leaflets in a compound leaf.",
    "topic": "Leaf Structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen038"
  },
  {
    "question_text": "Which type of venation is characteristic of most monocotyledonous plants?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Reticulate",
      "Parallel",
      "Both Reticulate and Parallel",
      "None of these"
    ],
    "correct_answer": "Parallel",
    "explanation": "Monocotyledonous plants typically have parallel venation, whereas dicotyledonous plants usually have reticulate venation.",
    "topic": "Venation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen039"
  },
  {
    "question_text": "Which term describes the pattern of arrangement of leaves on a stem or branch?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Phyllotaxy",
      "Venation",
      "Lamina",
      "Midrib"
    ],
    "correct_answer": "Phyllotaxy",
    "explanation": "Phyllotaxy refers to the pattern of arrangement of leaves on a stem or branch. It includes alternate, opposite, and whorled arrangements as described in the section.",
    "topic": "Phyllotaxy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen040"
  },
  {
    "question_text": "In a pinnately compound leaf, what is the name of the structure to which the leaflets are attached?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Leaf base",
      "Petiole",
      "Rachis",
      "Stipule"
    ],
    "correct_answer": "Rachis",
    "explanation": "In pinnately compound leaves, the leaflets are attached along a common axis known as the rachis, which essentially represents the midrib of the entire leaf.",
    "topic": "Types of Leaves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen041"
  },
  {
    "question_text": "Define the term 'lamina' as it relates to the structure of a leaf.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The lamina is the green, expanded part of the leaf with veins, primarily responsible for photosynthesis.",
    "explanation": "The text describes the lamina or leaf blade as the green and expanded portion of the leaf that contains veins and is crucial for photosynthetic activity.",
    "topic": "Leaf Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen042"
  },
  {
    "question_text": "Describe the primary differences between simple and compound leaves.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A simple leaf has an entire lamina or incisions that do not reach the midrib, whereas a compound leaf has incisions that reach the midrib and divide the leaf into separate leaflets.",
    "explanation": "The section differentiates between simple and compound leaves by the extent of incisions on the lamina relative to the midrib; compound leaves are divided into leaflets while simple leaves are not.",
    "topic": "Types of Leaves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen043"
  },
  {
    "question_text": "Explain how the petiole aids in a leaf's function.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The petiole holds the leaf blade in an optimal position for receiving light and allows it to flutter in the wind, which cools the leaf and improves air circulation.",
    "explanation": "According to the text, the petiole plays a key role in positioning the leaf blade towards light, and its flexibility helps in leaf cooling and gas exchange via wind-induced movement.",
    "topic": "Leaf Structure",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen044"
  },
  {
    "question_text": "What is the significance of the midrib in the structure of a leaf?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The midrib provides structural support and acts as the main channel for the transport of water, minerals, and food materials in the leaf.",
    "explanation": "The midrib is highlighted in the text as a prominent vein that not only adds rigidity to the leaf but also facilitates the effective distribution of nutrients and water.",
    "topic": "Leaf Structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen045"
  },
  {
    "question_text": "Discuss the various parts of a typical leaf and elaborate on their respective functions.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A typical leaf consists of three main parts: the leaf base, the petiole, and the lamina. The leaf base attaches the leaf to the stem and may have stipules. The petiole supports the lamina and positions it for optimal light exposure, also facilitating movement for cooling. The lamina, the green expanded blade, is the primary site of photosynthesis and houses vascular structures like the midrib and veins that transport water, minerals, and food.",
    "explanation": "This answer covers each component as described in the text: the leaf base's attachment function, the petiole's support and facilitation of movement, and the lamina’s role in photosynthesis and nutrient transport via its venation.",
    "topic": "Leaf Structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen046"
  },
  {
    "question_text": "Analyze the differences between reticulate and parallel venation and explain how these features help in classifying plants as dicots or monocots.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Reticulate venation, which forms a net-like network, is common in dicotyledonous plants, whereas parallel venation, where veins run side by side, characterizes most monocotyledonous plants. These differences in venation not only affect leaf structure and rigidity but also reflect evolutionary adaptations linked to the overall morphology and physiology of the plant groups.",
    "explanation": "This answer examines the structural differences in venation patterns and relates them to plant classification, drawing on key characteristics described in the section regarding how dicots and monocots differ with respect to their leaf venation.",
    "topic": "Venation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen047"
  },
  {
    "question_text": "Evaluate the significance of phyllotaxy in plant adaptation, particularly in optimizing light capture and resource distribution.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Phyllotaxy, the arrangement of leaves on the stem, plays a crucial role in optimizing light capture, reducing shading among leaves, and ensuring efficient resource distribution. Alternate, opposite, and whorled patterns each have adaptive advantages in different environmental contexts. For example, alternate phyllotaxy can allow for maximal light exposure for each leaf, while whorled arrangements can be beneficial in densely vegetated habitats.",
    "explanation": "The answer links the concept of phyllotaxy with functional advantages such as improved light interception and nutrient distribution, drawing from the examples and descriptions provided in the text.",
    "topic": "Phyllotaxy",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen048"
  },
  {
    "question_text": "True or False: The lamina of a leaf is not involved in photosynthesis.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The lamina, or leaf blade, is the primary site where photosynthesis occurs due to its green color and abundant chloroplasts.",
    "topic": "Leaf Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen049"
  },
  {
    "question_text": "True or False: In monocotyledons, the leaf base expands into a sheath that partially or wholly covers the stem.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text indicates that monocotyledonous plants commonly have a leaf base that develops into a sheath covering the stem partially or completely.",
    "topic": "Leaf Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen050"
  },
  {
    "question_text": "True or False: In compound leaves, axillary buds can be found at both the petiole and the leaflet axils.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While axillary buds are present in the axil of the petiole in compound leaves, they are not found in the axils of the individual leaflets.",
    "topic": "Types of Leaves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen051"
  },
  {
    "question_text": "True or False: Reticulate venation is characterized by a network of veins and is typical of dicotyledonous plants.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Dicotyledonous plants usually exhibit reticulate venation, where the veins branch out into a network, as mentioned in the text.",
    "topic": "Venation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen052"
  },
  {
    "question_text": "True or False: The primary function of the petiole is nutrient transport, and it does not play a significant role in supporting the leaf blade.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "The petiole primarily supports the leaf blade by holding it in an optimal position for light exposure and allowing movement for cooling, although it may help in transport, its main role is structural.",
    "topic": "Leaf Structure",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen053"
  },
  {
    "question_text": "True or False: In whorled phyllotaxy, more than two leaves arise at a node.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Whorled phyllotaxy is defined as the arrangement where more than two leaves arise at a single node, forming a whorl.",
    "topic": "Phyllotaxy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen054"
  },
  {
    "question_text": "If a dicot leaf has 6 secondary veins and each secondary vein gives rise to 4 minor veinlets, how many minor veinlets are there in total?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "24",
    "explanation": "By multiplying the number of secondary veins (6) by the number of minor veinlets per secondary vein (4), the total is 6 x 4 = 24 minor veinlets.",
    "topic": "Venation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen055"
  },
  {
    "question_text": "What part of the germinating seed's embryo gives rise to the stem?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Radicle",
      "B: Plumule",
      "C: Hypocotyl",
      "D: Cotyledon"
    ],
    "correct_answer": "B: Plumule",
    "explanation": "The stem develops from the plumule of the embryo, distinguishing it from structures like the radicle which develops into the root.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen019"
  },
  {
    "question_text": "Which specific part of the stem is responsible for the production of leaves?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Internodes",
      "B: Nodes",
      "C: Axillary buds",
      "D: Terminal buds"
    ],
    "correct_answer": "B: Nodes",
    "explanation": "Nodes are the regions on the stem where leaves are produced, while internodes lie between the nodes.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen020"
  },
  {
    "question_text": "Which of the following is NOT a function performed by the stem?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Conducting water, minerals, and photosynthates",
      "B: Storage of food",
      "C: Photosynthesis in leaves",
      "D: Vegetative propagation"
    ],
    "correct_answer": "C: Photosynthesis in leaves",
    "explanation": "While the stem plays roles in conduction, storage, and propagation, photosynthesis is mainly a function of the leaves rather than the stem.",
    "topic": "The Stem",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen021"
  },
  {
    "question_text": "Based on the text, what characteristic directly distinguishes a stem from a root?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A: Stems bear buds and nodes",
      "B: Stems perform storage functions",
      "C: Roots bear branches and leaves",
      "D: Roots conduct water in the same way as stems"
    ],
    "correct_answer": "A: Stems bear buds and nodes",
    "explanation": "Stems are characterized by the presence of buds and nodes which are absent in roots. This feature is crucial in differentiating stems from roots.",
    "topic": "The Stem",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen022"
  },
  {
    "question_text": "Evaluate the importance of the stem in vegetative propagation by identifying which feature of the stem directly supports this process.",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A: The presence of buds",
      "B: The arrangement of internodes",
      "C: The green color of young stems",
      "D: The development of woody tissue"
    ],
    "correct_answer": "A: The presence of buds",
    "explanation": "Buds on the stem are essential for initiating new growth in vegetative propagation, making them directly responsible for this function.",
    "topic": "The Stem",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen023"
  },
  {
    "question_text": "What are the segments between nodes on a stem called?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Internodes",
    "explanation": "Internodes are the portions of the stem located between two nodes where leaves are not directly attached.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen024"
  },
  {
    "question_text": "Describe two main functions of the stem as mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The stem conducts water, minerals, and photosynthates; it also provides support to branches bearing leaves, flowers, and fruits.",
    "explanation": "The text highlights that the stem is crucial for conduction of substances and for physically supporting the plant structures that grow from it.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen025"
  },
  {
    "question_text": "How might the transition of a stem's color from green to woody and dark brown affect its function?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The color change marks the shift from primary growth to secondary growth, indicating increased structural support and potential changes in storage capabilities.",
    "explanation": "Young, green stems are generally softer and actively growing, while maturation into woody and dark brown stems enhances support and durability.",
    "topic": "The Stem",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen026"
  },
  {
    "question_text": "Analyze how the structural components of the stem contribute to its ability to spread out branches effectively.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The presence of nodes and internodes on the stem provides specific sites for bud formation and leaf attachment, allowing branches to be spaced out optimally for photosynthesis and growth.",
    "explanation": "Nodes are critical for initiating growth while internodes ensure adequate spacing, contributing to an effective distribution of branches.",
    "topic": "The Stem",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen027"
  },
  {
    "question_text": "Discuss the various functions of the stem and explain how its structural features, such as nodes, internodes, and buds, support these functions including conduction and storage.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The stem conducts water, minerals, and photosynthates, and its structure, with nodes and internodes, facilitates the proper attachment and spacing of leaves, flowers, and fruits. Additionally, some stems store food, provide structural support, and facilitate vegetative propagation through the presence of buds. By ensuring that these features are appropriately developed, the stem is able to fulfill multiple vital functions in the plant.",
    "explanation": "This answer covers the conduction, storage, support, and reproductive functions of the stem along with explaining how its physical components like nodes, internodes, and buds are fundamental to these processes.",
    "topic": "The Stem",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen028"
  },
  {
    "question_text": "Design an experiment to investigate the role of buds in the vegetative propagation of stems. Your plan should include control and experimental groups and describe how you would measure the success of vegetative propagation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An effective experiment could involve selecting identical stem cuttings and dividing them into two groups: one where buds are left intact (control) and one where buds are removed (experimental). Over a specified period, monitor and record the growth of new shoots and the success rate of vegetative propagation. The difference in new growth between the two groups would indicate the role of buds in propagation. Measurements could include the number of new shoots, shoot length, and overall plant health.",
    "explanation": "This experimental design highlights the importance of buds in vegetative propagation by comparing intact and bud-removed stems, illustrating how buds contribute to new growth and plant development.",
    "topic": "The Stem",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen029"
  },
  {
    "question_text": "Explain in detail how the arrangement of nodes and internodes influences the distribution of leaves, flowers, and fruits on a plant stem.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Nodes are the points on the stem where leaves, buds, flowers, and fruits form, while internodes provide the spacing between these sites. This regular arrangement ensures that leaves are positioned optimally for light capture, and flowers and fruits are spaced out effectively to facilitate reproduction and dispersion.",
    "explanation": "A clear understanding of the spatial arrangement provided by nodes and internodes helps explain how the physical structure of stems contributes to overall plant efficiency and reproductive success.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen030"
  },
  {
    "question_text": "True or False: The stem develops from the radicle of the embryo.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The stem develops from the plumule, not the radicle. The radicle gives rise to the root.",
    "topic": "The Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen031"
  },
  {
    "question_text": "True or False: Nodes are the specific regions on a stem where leaves are born.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "According to the text, nodes are the regions on the stem responsible for the birth of leaves.",
    "topic": "The Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen032"
  },
  {
    "question_text": "True or False: Young stems are typically woody and dark brown in color.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text indicates that young stems are generally green, and only later do they often become woody and dark brown.",
    "topic": "The Stem",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen033"
  },
  {
    "question_text": "True or False: Some stems perform vegetative propagation due to their ability to produce and maintain buds.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "Vegetative propagation is a function performed by certain stems precisely because they have buds that can form new shoots.",
    "topic": "The Stem",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen034"
  },
  {
    "question_text": "True or False: Internodes are crucial in providing the necessary spacing between sites of leaf, flower, and fruit attachment on the stem.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Internodes provide the spacing required for optimal arrangement and function of leaves and reproductive organs on the stem.",
    "topic": "The Stem",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen035"
  },
  {
    "question_text": "True or False: A stem that fails to produce or maintain its buds may compromise its ability to undergo vegetative propagation.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "Buds are essential for vegetative propagation. Without them, the stem loses its potential to form new growth, thus impairing the propagation process.",
    "topic": "The Stem",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "03_section_5_2",
    "question_id": "cbse_xi_kebo1dd_c105_gen036"
  },
  {
    "question_text": "Which floral whorl is the outermost structure that protects the flower in its bud stage?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Calyx",
      "Corolla",
      "Androecium",
      "Gynoecium"
    ],
    "correct_answer": "Calyx",
    "explanation": "The calyx, consisting of sepals which are generally green and leaf-like, is the outermost whorl that protects the flower in the bud stage.",
    "topic": "Flower Structure - Calyx",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen076"
  },
  {
    "question_text": "In an epigynous flower, where do the other floral parts (calyx, corolla, and androecium) arise in relation to the ovary?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Below the ovary",
      "Around the ovary",
      "Above the ovary",
      "At the same level as the ovary"
    ],
    "correct_answer": "Above the ovary",
    "explanation": "In epigynous flowers, the margin of the thalamus grows upward, enclosing the ovary, and the other parts of the flower arise above the ovary, making it inferior.",
    "topic": "Floral Positioning",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen077"
  },
  {
    "question_text": "Which type of aestivation is characteristic of pea and bean flowers?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Valvate",
      "Twisted",
      "Imbricate",
      "Vexillary"
    ],
    "correct_answer": "Vexillary",
    "explanation": "Pea and bean flowers exhibit vexillary (or papilionaceous) aestivation, where one large petal (the standard) overlaps two lateral petals (wings), which then overlap the two smallest petals (the keel).",
    "topic": "Aestivation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen078"
  },
  {
    "question_text": "Which type of placentation is characterized by a placenta that forms a ridge along the ventral suture of the ovary, bearing ovules in two rows?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Axile",
      "Marginal",
      "Parietal",
      "Basal"
    ],
    "correct_answer": "Marginal",
    "explanation": "In marginal placentation, the placenta forms a ridge along the ventral suture of the ovary, and the ovules are borne on this ridge forming two rows.",
    "topic": "Placentation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen079"
  },
  {
    "question_text": "Which statement correctly describes unisexual flowers?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "They possess both stamens and carpels",
      "They have either only stamens or only carpels",
      "They lack both petals and sepals",
      "They contain all reproductive organs in one flower"
    ],
    "correct_answer": "They have either only stamens or only carpels",
    "explanation": "Unisexual flowers contain either only stamens (male organs) or only carpels (female organs), as opposed to bisexual flowers that have both.",
    "topic": "Sexual Reproduction in Flowers",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen080"
  },
  {
    "question_text": "Explain the difference between gamosepalous and polysepalous calyx.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A gamosepalous calyx has sepals that are united, whereas a polysepalous calyx has free, not united, sepals.",
    "explanation": "In the context of flower structure, gamosepalous refers to sepals that are fused together, while polysepalous indicates that the sepals exist as separate, distinct entities.",
    "topic": "Calyx Structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen081"
  },
  {
    "question_text": "Describe what is meant by a 'bisexual flower'.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A bisexual flower contains both the androecium (stamens) and the gynoecium (carpels) within the same flower.",
    "explanation": "Bisexual flowers have complete reproductive structures including male and female organs, facilitating self-pollination or cross-pollination.",
    "topic": "Flower Reproduction",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen082"
  },
  {
    "question_text": "Explain the difference between actinomorphic and zygomorphic flowers with appropriate examples.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Actinomorphic flowers have radial symmetry, meaning they can be divided into equal halves by any plane passing through the center (e.g., mustard, datura, chilli), whereas zygomorphic flowers have bilateral symmetry, being divisible into equal halves only by one particular vertical plane (e.g., pea, gulmohur, bean).",
    "explanation": "The main difference is in symmetry: actinomorphic flowers always produce similar halves regardless of the division plane, while zygomorphic flowers restrict this to one specific plane, thereby influencing pollination strategies.",
    "topic": "Symmetry in Flowers",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen083"
  },
  {
    "question_text": "Define 'aestivation' in the context of flowers.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Aestivation is the mode of arrangement of sepals or petals in a floral bud in relation to one another.",
    "explanation": "This term describes how the sepals or petals are arranged before the flower opens, with types including valvate, twisted, imbricate, and vexillary.",
    "topic": "Aestivation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen084"
  },
  {
    "question_text": "Discuss the developmental process of a flower from bud formation to post-fertilization, including the changes in floral parts and their significance in plant reproduction.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The flower begins as a bud with small, fused or free floral organs, including developing petals, stamens, and pistil. As it opens, the petals spread, and the stamens and pistil become fully mature to allow for pollination. After fertilization, the petals close or fall off, the ovary enlarges, and seeds develop inside, ensuring the continuation of the plant species. This process is essential as it allows for genetic recombination and the production of viable seeds.",
    "explanation": "This answer outlines the stages of flower development: early bud with developing floral parts; full maturation where pollination can occur; and post-fertilization where the ovary matures into a fruit containing seeds. Each stage is vital for successful sexual reproduction in plants.",
    "topic": "Flower Development and Reproduction",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen085"
  },
  {
    "question_text": "Compare and contrast hypogynous, perigynous, and epigynous flowers in terms of the position of the gynoecium and the resulting ovary classification.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Hypogynous flowers have the gynoecium at the highest position with other parts below it, resulting in a superior ovary. Perigynous flowers have the gynoecium in the center with the other floral parts arranged around it at the rim of the thalamus, making the ovary half inferior. In epigynous flowers, the thalamus grows upward to completely enclose and fuse with the ovary, resulting in an inferior ovary with the other parts arising above it.",
    "explanation": "The answer delineates the three flower types based on the position of the gynoecium. The position of stamens, petals, and sepals relative to the ovary distinguishes the superior, half inferior, and inferior ovary types, which are critical for taxonomy and developmental biology of plants.",
    "topic": "Floral Morphology and Ovary Position",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen086"
  },
  {
    "question_text": "True or False: In most flowers, the calyx is composed of brightly colored structures to attract pollinators.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The calyx is composed of sepals which are generally green and leaf-like, serving the function of protecting the flower in the bud stage, rather than attracting pollinators.",
    "topic": "Calyx",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen087"
  },
  {
    "question_text": "True or False: Staminodes are sterile stamens that do not produce pollen.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Staminodes are indeed sterile stamens that do not function in pollen production, often serving other roles in flower morphology or pollination mechanisms.",
    "topic": "Androecium",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen088"
  },
  {
    "question_text": "True or False: In a gamopetalous corolla, the petals are free from one another.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "A gamopetalous corolla is one in which the petals are united, not free. Petals that are free are described as polypetalous.",
    "topic": "Corolla Structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen089"
  },
  {
    "question_text": "True or False: In axile placentation, the placenta forms a central column in a multilocular ovary, and the ovules are attached to it.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Axile placentation is characterized by the ovules being attached to a central column in a multilocular ovary due to the fusion of carpels.",
    "topic": "Placentation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen090"
  },
  {
    "question_text": "True or False: Unisexual flowers always occur on the same plant as both male and female reproductive structures.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Unisexual flowers contain either only stamens or only carpels, and while they can occur on the same plant (in monoecious species) or on different plants (in dioecious species), the statement that both are always on the same plant is incorrect.",
    "topic": "Sexual Reproduction in Flowers",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen091"
  },
  {
    "question_text": "True or False: The arrangement of floral parts in a bud is known as aestivation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Aestivation refers to the pattern or arrangement of sepals or petals (or other floral organs) in the floral bud prior to blooming.",
    "topic": "Aestivation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen092"
  },
  {
    "question_text": "If a flower has five petals arranged in a vexillary aestivation, how many petals form the standard, the lateral (wing) petals, and the keel, respectively?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1, 2, and 2 respectively",
    "explanation": "In vexillary (papilionaceous) aestivation, the flower typically has one large standard petal, two lateral wing petals, and two smaller keel petals, making a total of five.",
    "topic": "Aestivation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "06_section_5_5",
    "question_id": "cbse_xi_kebo1dd_c105_gen093"
  },
  {
    "question_text": "What is the fruit in flowering plants, according to the text?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A mature or ripened ovary developed after fertilisation",
      "A vegetative structure used for photosynthesis",
      "An unfertilized ovary that remains unchanged",
      "A seed surrounded by endosperm"
    ],
    "correct_answer": "A mature or ripened ovary developed after fertilisation",
    "explanation": "The fruit is defined as a mature or ripened ovary that develops after fertilisation; this is a key characteristic of flowering plants.",
    "topic": "Fruit development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen094"
  },
  {
    "question_text": "Which of the following best describes the layers of the pericarp in fleshy fruits?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Epicarp, mesocarp, and endocarp",
      "Exocarp, mesocarp, and seed coat",
      "Mesocarp only",
      "Endocarp and seed only"
    ],
    "correct_answer": "Epicarp, mesocarp, and endocarp",
    "explanation": "Fleshy fruits have a pericarp which is differentiated into three layers: the outer epicarp, the middle mesocarp, and the inner endocarp.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen095"
  },
  {
    "question_text": "Mango and coconut are classified as drupes because they develop from monocarpellary superior ovaries and are one seeded. Which statement correctly differentiates their mesocarp characteristics?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Mango has a thin fibrous mesocarp while coconut has a thick fleshy mesocarp",
      "Mango has a thick, fleshy edible mesocarp while coconut has a fibrous mesocarp",
      "Both mango and coconut have identical mesocarp types",
      "Mango's mesocarp is stony while coconut's is edible and fleshy"
    ],
    "correct_answer": "Mango has a thick, fleshy edible mesocarp while coconut has a fibrous mesocarp",
    "explanation": "In mango, the pericarp is well differenti-ated with an edible mesocarp, whereas in coconut the mesocarp is fibrous, reflecting differences in their dispersal and nutritional roles.",
    "topic": "Drupes and mesocarp variation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen096"
  },
  {
    "question_text": "Identify the type of placentation shown in a longitudinal section of a pea pod, where ovules are attached along one margin of the ovary.",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Marginal placentation",
      "Axile placentation",
      "Parietal placentation",
      "Basal placentation"
    ],
    "correct_answer": "Marginal placentation",
    "explanation": "The pea pod's ovules are attached along one margin of the ovary, which is a classic example of marginal placentation.",
    "topic": "Placentation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen097"
  },
  {
    "question_text": "What is the primary function of the mesocarp in fruits such as coconut as described in the section?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "To provide structural support to the tree",
      "To protect the seed by forming a hard barrier",
      "To provide nutrition and attract animals for seed dispersal",
      "To produce pollen for fertilisation"
    ],
    "correct_answer": "To provide nutrition and attract animals for seed dispersal",
    "explanation": "The mesocarp plays an important role in providing nutrition and attracting animals, which assists in the process of seed dispersal.",
    "topic": "Fruit function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen098"
  },
  {
    "question_text": "Define parthenocarpic fruit.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A fruit that is formed without the fertilisation of the ovary.",
    "explanation": "A parthenocarpic fruit is one that develops without fertilisation, meaning no seeds are formed as a result of the process.",
    "topic": "Fruit development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen099"
  },
  {
    "question_text": "Describe the typical structure of a fruit in flowering plants.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A typical fruit consists of a pericarp (which may be dry or fleshy) and seeds. In fleshy fruits, the pericarp is usually divided into an outer epicarp, a middle mesocarp, and an inner endocarp.",
    "explanation": "The answer highlights that the fruit is made up of the pericarp and seeds, with fleshy fruits having a distinct three-layered pericarp.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen100"
  },
  {
    "question_text": "Explain how the different types of placentation, as illustrated in the diagrams, can be used to classify flowering plants.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The arrangement of ovules within the ovary (placentation) can help classify flowering plants. For example, marginal, axile, parietal, free central, and basal placentation offer insights into the internal structure of ovaries and can be used as a taxonomic feature.",
    "explanation": "Understanding placentation types assists botanists in distinguishing and classifying plant species based on the positional arrangement of ovules.",
    "topic": "Placentation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen101"
  },
  {
    "question_text": "Compare the pericarp structure of mango and coconut as explained in the section.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Mango possesses a pericarp that is differentiated into a thin epicarp, a fleshy, edible mesocarp, and a stony hard endocarp. In contrast, coconut has a pericarp where the mesocarp is fibrous, reflecting different adaptations for seed dispersal.",
    "explanation": "The answer compares the distinct layers of the pericarp in mango and coconut, noting differences in texture and function, which are crucial for their respective seed dispersal mechanisms.",
    "topic": "Fruit structure and function",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen102"
  },
  {
    "question_text": "Discuss the development of fruit from the ovary and its significance in plant reproduction.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Fruit development from the ovary is a critical process that follows fertilisation. It transforms the ovary into a structure that not only protects the developing seeds but also facilitates their dispersal. This process ensures the continuation of the species by safeguarding the genetic material and providing means for the seeds to reach new locations where they can germinate.",
    "explanation": "This answer covers both the developmental process of the ovary into a fruit after fertilisation and underscores its biological importance in protecting seeds and ensuring reproductive success.",
    "topic": "Fruit development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen103"
  },
  {
    "question_text": "Evaluate the role of the layered pericarp in protecting seeds and facilitating their dispersal, using examples from the text.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The layered pericarp plays a crucial role in seed protection and dispersal. The epicarp acts as an outer barrier, the mesocarp provides nourishment and attraction for dispersal agents (such as animals), and the endocarp offers a hard, protective layer around the seed. For example, in mango, a fleshy mesocarp attracts animals to help in seed dispersal, while in coconut, the fibrous mesocarp not only facilitates dispersal by water but also protects the seed during its journey.",
    "explanation": "This answer links the structure of the pericarp with its function in both seed protection and dispersal, using the specific examples provided in the text to demonstrate the varied adaptations in fruit morphology.",
    "topic": "Fruit function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen104"
  },
  {
    "question_text": "Propose a hypothetical experiment to study the differences in mesocarp composition between drupes like mango and coconut. Describe the methods you would use and the expected outcomes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One could design an experiment involving the collection of drupes (mango and coconut) at similar stages of maturity. The mesocarp tissue from each fruit would then be subjected to biochemical analyses, such as nutrient profiling and fiber content measurement. Microscopic examination would be used to characterize cell structure differences. The expected outcomes would include quantitative differences in nutrient and fiber composition, reflecting the functional adaptations for seed dispersal in different environments.",
    "explanation": "This answer outlines a clear experimental design with objectives, methods, and expected results, demonstrating the application of scientific investigation techniques to compare fruit mesocarp composition.",
    "topic": "Experimental design in fruit biology",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen105"
  },
  {
    "question_text": "True or False: The fruit is a ripened ovary that develops after fertilisation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The fruit is indeed defined as a mature or ripened ovary that develops after fertilisation.",
    "topic": "Fruit development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen106"
  },
  {
    "question_text": "True or False: A parthenocarpic fruit is formed after the fertilisation of the ovary.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "A parthenocarpic fruit is formed without fertilisation of the ovary.",
    "topic": "Fruit development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen107"
  },
  {
    "question_text": "True or False: In fleshy fruits, the pericarp is divided into three layers: epicarp, mesocarp, and endocarp.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Fleshy fruits typically have their pericarp differentiated into an outer epicarp, a middle mesocarp, and an inner endocarp.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen108"
  },
  {
    "question_text": "True or False: Marginal placentation is characterized by ovules attached along the outer edge of the ovary.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Marginal placentation occurs when the ovules are attached along one margin of the ovary, as illustrated in the pea pod diagram.",
    "topic": "Placentation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen109"
  },
  {
    "question_text": "True or False: Drupes like mango and coconut develop from polycarpellary inferior ovaries.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Drupes such as mango and coconut develop from monocarpellary superior ovaries, not polycarpellary inferior ovaries.",
    "topic": "Drupes and ovary structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen110"
  },
  {
    "question_text": "True or False: The fibrous mesocarp in coconut is an adaptation that helps in seed dispersal by water.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "The fibrous nature of the coconut's mesocarp aids in buoyancy and helps in the dispersal of the seed by water.",
    "topic": "Fruit function and adaptation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen111"
  },
  {
    "question_text": "What is the common name for the Solanaceae family?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Potato family",
      "Legume family",
      "Grass family",
      "Rose family"
    ],
    "correct_answer": "Potato family",
    "explanation": "The Solanaceae family is commonly known as the 'potato family' as mentioned in the section.",
    "topic": "Solanaceae overview",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen143"
  },
  {
    "question_text": "Which type of leaf arrangement is typical in plants of the Solanaceae family?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Alternate",
      "Opposite",
      "Whorled",
      "Basal"
    ],
    "correct_answer": "Alternate",
    "explanation": "The section specifies that leaves are alternate.",
    "topic": "Vegetative Characters - Leaves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen144"
  },
  {
    "question_text": "Which of the following parts is found underground in the potato (Solanum tuberosum)?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Roots",
      "Stem",
      "Flowers",
      "Leaves"
    ],
    "correct_answer": "Stem",
    "explanation": "Solanum tuberosum has an underground stem that develops into the potato, as mentioned in the text.",
    "topic": "Vegetative Characters - Stem",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen145"
  },
  {
    "question_text": "What type of venation is characteristic of the leaves in the Solanaceae family?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Reticulate",
      "Parallel",
      "Dichotomous",
      "Palmate"
    ],
    "correct_answer": "Reticulate",
    "explanation": "The section indicates that the leaves have a reticulate venation pattern.",
    "topic": "Vegetative Characters - Leaves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen146"
  },
  {
    "question_text": "What is the common inflorescence arrangement in Solanaceae flowers?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Solitary",
      "Spike",
      "Panicle",
      "Umbel"
    ],
    "correct_answer": "Solitary",
    "explanation": "The text specifies that the inflorescence can be solitary, axillary, or occasionally cymose, with solitary being a common feature.",
    "topic": "Floral Characters - Inflorescence",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen147"
  },
  {
    "question_text": "Describe the key characteristics of the floral structure of the Solanaceae family.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The flower is bisexual and actinomorphic with a calyx consisting of five united sepals showing valvate aestivation, a corolla of five united petals also with valvate aestivation, five epipetalous stamens as the androecium, and a bicarpellary, syncarpous gynoecium that is superior, bilocular with an axile placenta and many ovules.",
    "explanation": "The answer covers the essential floral characters described in the section, including the features of the calyx, corolla, stamens, and gynoecium.",
    "topic": "Floral Characters",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen148"
  },
  {
    "question_text": "List at least three economically important plants from the Solanaceae family and mention one of their uses.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Examples include tomato (food), chilli (spice), and tobacco (fumigatory).",
    "explanation": "The section lists several plants such as tomato, brinjal, potato for food; chilli for spice; tobacco for fumigatory; and others for ornamental and medicinal purposes.",
    "topic": "Economic Importance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen149"
  },
  {
    "question_text": "What does the term 'exstipulate' refer to in relation to the leaves of the Solanaceae family?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Exstipulate means that the leaves lack stipules at the base of the petiole.",
    "explanation": "The term is used in the text to indicate that stipules are absent in the leaves of Solanaceae plants.",
    "topic": "Vegetative Characters - Leaves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen150"
  },
  {
    "question_text": "Explain what is meant by 'valvate aestivation' as observed in the floral parts of the Solanaceae family.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Valvate aestivation refers to the arrangement of petals or sepals in a bud where the parts meet edge to edge without overlapping each other.",
    "explanation": "This explanation directly addresses the botanical term as used in the context of how petals and sepals are arranged in the flower.",
    "topic": "Floral Characters - Calyx and Corolla",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen151"
  },
  {
    "question_text": "Discuss the significance of vegetative and floral characters in the identification of members of the Solanaceae family.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Vegetative characters such as being mostly herbaceous with alternate, simple leaves and specific stem types, along with floral characteristics including a bisexual, actinomorphic flower with 5 united petals and sepals, 5 epipetalous stamens, and a bicarpellary, syncarpous gynoecium, provide key distinguishing features. These traits help botanists accurately classify and differentiate Solanaceae plants from those of other families.",
    "explanation": "This answer discusses both vegetative and floral features, highlighting how each set of characters contributes to the overall identification and classification of the Solanaceae family.",
    "topic": "Vegetative and Floral Characters",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen152"
  },
  {
    "question_text": "Compare and contrast the vegetative features of Solanaceae with those of another plant family of your choice.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Solanaceae are primarily herbaceous plants with alternate, simple leaves and cylindrical, sometimes underground stems, while many other plant families, such as the Fabaceae (legume family), typically exhibit compound leaves and often have more robust, woody stems. In Solanaceae, the reticulate venation is notable whereas other families might display different venation patterns or leaf structures, highlighting distinctive evolutionary adaptations.",
    "explanation": "The answer highlights differences in leaf structure, stem type, and venation patterns, demonstrating analytical skills in comparing two plant families.",
    "topic": "Vegetative Characters",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen153"
  },
  {
    "question_text": "Evaluate the economic importance of the Solanaceae family by discussing how various species contribute to different industries.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The Solanaceae family has significant economic importance due to its diverse species that contribute to multiple industries. For example, tomato, brinjal, and potato are major food sources globally; chilli is used as a spice in culinary dishes; tobacco plays a role in the fumigatory and recreational industries; while belladonna and ashwagandha have medicinal properties. Additionally, ornamental plants like petunia enhance the aesthetic value in horticulture. This diversity underscores the multifaceted impact of the family on agriculture, health, industry, and aesthetics.",
    "explanation": "The answer encompasses various sectors such as food, spice, medicine, fumigatory use, and ornamentals, and explains how each contributes to the overall economic value of the Solanaceae family.",
    "topic": "Economic Importance",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen154"
  },
  {
    "question_text": "Most Solanaceae plants are herbs and shrubs.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section mentions that plants in the Solanaceae family are mostly herbs and shrubs, with rarely small trees.",
    "topic": "Vegetative Characters",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen155"
  },
  {
    "question_text": "The leaves of the Solanaceae family are typically pinnately compound.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The section states that the leaves are alternate and simple, with only rare occurrences of being pinnately compound.",
    "topic": "Vegetative Characters - Leaves",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen156"
  },
  {
    "question_text": "In the Solanaceae family, the ovary is inferior.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text specifies that the ovary in Solanaceae is superior.",
    "topic": "Floral Characters - Gynoecium",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen157"
  },
  {
    "question_text": "The floral diagram provided in the section represents the arrangement of sepals, petals, stamens, and carpels.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section clearly mentions that the floral diagram is a symbolic representation showing the arrangement of these floral parts.",
    "topic": "Floral Characters",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen158"
  },
  {
    "question_text": "All Solanaceae plants possess woody stems.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The majority of Solanaceae plants are herbaceous, and woody stems are rare.",
    "topic": "Vegetative Characters - Stem",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen159"
  },
  {
    "question_text": "In Solanum, a member of the Solanaceae family, a cymose inflorescence is sometimes observed.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text notes that inflorescences can be solitary, axillary, or cymose, with the cymose arrangement occurring in Solanum.",
    "topic": "Floral Characters - Inflorescence",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen160"
  },
  {
    "question_text": "What is the number of sepals present in a typical Solanaceae flower?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "5",
    "explanation": "The section specifies that there are five sepals in the calyx of a Solanaceae flower.",
    "topic": "Floral Characters - Calyx",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen161"
  },
  {
    "question_text": "Calculate the total number of petals in a Solanaceae flower if each flower has a set of united petals.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "5",
    "explanation": "Each Solanaceae flower typically has 5 united petals as stated in the description of the corolla.",
    "topic": "Floral Characters - Corolla",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "10_section_5_9",
    "question_id": "cbse_xi_kebo1dd_c105_gen162"
  }
]