[
  {
    "question_text": "Which of the following best describes viruses?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Unicellular organisms with cell membranes",
      "Acellular entities with an inert crystalline structure",
      "Organisms made entirely of proteins",
      "Multicellular organisms with specialized tissues"
    ],
    "correct_answer": "Acellular entities with an inert crystalline structure",
    "explanation": "Viruses are not considered truly living as they lack cellular structure and can only replicate inside a host cell. Their inert crystalline structure outside the cell distinguishes them from cellular organisms.",
    "topic": "Viruses",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen096"
  },
  {
    "question_text": "In the structure of a T4 bacteriophage, what is the primary function of the tail fibers?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "To attach the phage to the host cell surface",
      "To inject the viral DNA into the host",
      "To recognize the genetic material",
      "To protect the viral proteins from degradation"
    ],
    "correct_answer": "To attach the phage to the host cell surface",
    "explanation": "The tail fibers are crucial as they enable the bacteriophage to recognize and attach to the bacterial host cell, initiating the infection process.",
    "topic": "Viruses, Bacteriophage",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen097"
  },
  {
    "question_text": "Which of the following statements is true regarding the genetic material of viruses?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It may contain both RNA and DNA simultaneously",
      "It is always composed of single stranded RNA",
      "It can be either DNA or RNA, but not both",
      "It is only found in the form of double stranded DNA"
    ],
    "correct_answer": "It can be either DNA or RNA, but not both",
    "explanation": "Viruses contain genetic material that is either RNA or DNA, but no virus contains both. This distinction is key to understanding viral replication and classification.",
    "topic": "Viruses",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen098"
  },
  {
    "question_text": "Who demonstrated that viruses could be crystallised, indicating that they largely consist of proteins?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Dmitri Ivanowsky",
      "M.W. Beijerinek",
      "W.M. Stanley",
      "T.O. Diener"
    ],
    "correct_answer": "W.M. Stanley",
    "explanation": "W.M. Stanley was responsible for crystallising viruses and showing that they are primarily composed of proteins, which was a significant breakthrough in virology.",
    "topic": "Viruses",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen099"
  },
  {
    "question_text": "In the symbiotic association of lichens, what role does the algal component (phycobiont) play?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Absorbing mineral nutrients",
      "Providing shelter to the fungus",
      "Preparing food through photosynthesis",
      "Protecting the fungal structure"
    ],
    "correct_answer": "Preparing food through photosynthesis",
    "explanation": "In lichens, the algal component (phycobiont) uses photosynthesis to prepare food, which is then shared with the fungal partner (mycobiont).",
    "topic": "Lichens",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen100"
  },
  {
    "question_text": "Define a virus and explain why viruses are not considered truly living organisms.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Viruses are acellular entities that consist of a protein coat and genetic material (either DNA or RNA) but lack the internal cellular machinery required for independent life. They are not considered truly living because they cannot reproduce or carry out metabolic processes on their own and require a host cell for replication.",
    "explanation": "Viruses are classified as non-living because they lack cellular structure, which is fundamental for the characteristics of life. Their dependency on host cells for replication supports this classification.",
    "topic": "Viruses",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen101"
  },
  {
    "question_text": "What structural components make up a T4 bacteriophage and how do these components contribute to its function?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A T4 bacteriophage consists of a head that contains the viral DNA, a contractile sheath that helps inject the DNA into the host cell, and tail fibers that attach to the bacterial cell surface. Each component plays a specific role: the head stores the genetic material, the sheath contracts to drive the DNA into the host, and the tail fibers ensure the virus attaches correctly to initiate infection.",
    "explanation": "Each structural component of the bacteriophage is essential for a successful infection. The head safeguards the viral DNA, the sheath enables DNA delivery, and the tail fibers are critical for host recognition and attachment.",
    "topic": "Bacteriophages",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen102"
  },
  {
    "question_text": "Differentiate between a viroid and a virus.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A viroid is a small infectious agent composed solely of a free RNA molecule without a protective protein coat, whereas a virus contains both genetic material (either RNA or DNA) and a protein coat (capsid). This difference in structure fundamentally affects their mode of infection and replication.",
    "explanation": "The absence of a protein coat in viroids contrasts with viruses, which have a protective capsid. This key difference is central to understanding their distinct biological roles and methods of infection.",
    "topic": "Viroids vs Viruses",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen103"
  },
  {
    "question_text": "How are lichens formed and why are they significant as environmental indicators?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Lichens are formed through a symbiotic relationship between a fungus (mycobiont) and an alga (phycobiont) where the alga conducts photosynthesis to supply nutrients and the fungus provides structural support and mineral absorption. They are significant as environmental indicators because they are highly sensitive to air pollution and other environmental changes, often failing to grow in contaminated areas.",
    "explanation": "The mutual benefits in lichens not only support both organisms but also make them reliable indicators of environmental quality, especially regarding air pollution.",
    "topic": "Lichens",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen104"
  },
  {
    "question_text": "Discuss the classification challenges of viruses and explain why they are not included in the five kingdom classification system.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Viruses are not included in the five kingdom classification because they lack cellular structure and are considered non-living. Unlike organisms in the five kingdoms that have a cell structure and can independently carry out metabolic processes, viruses consist of only a protein coat and genetic material and are inert outside a host cell. They rely on the host’s cellular machinery for replication and metabolism, further justifying their exclusion from traditional classification systems.",
    "explanation": "The absence of key cellular features and metabolic independence in viruses makes it challenging to classify them alongside living organisms, explaining why they are excluded from the five kingdom system.",
    "topic": "Viruses, Classification",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen105"
  },
  {
    "question_text": "Explain the structure-function relationship in viral infection mechanisms using the examples of rod-shaped viruses and bacteriophages.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Rod-shaped viruses possess a helical capsid structure composed of repeating protein subunits that encase their RNA genome, which facilitates a uniform and stable structure for infection. In bacteriophages, the head containing the DNA is linked to a contractile sheath and tail fibers. The tail fibers attach to the bacterial host, the sheath contracts to inject the DNA into the cell, and the head safeguards the genetic material. This detailed structural arrangement directly supports their infective strategy, ensuring efficient host penetration and replication.",
    "explanation": "The precise structure of each virus type highlights how form facilitates function. In rod-shaped viruses, the helical structure provides stability, while the complex structure of bacteriophages ensures precise mechanisms for host recognition and genetic injection.",
    "topic": "Virus Structure and Function",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen106"
  },
  {
    "question_text": "Evaluate the impact of prions on human health by comparing them with other acellular infectious agents like viruses and viroids.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Prions are misfolded proteins that cause neurodegenerative diseases such as Creutzfeldt-Jakob Disease. Unlike viruses and viroids, which contain nucleic acids necessary for replication, prions propagate by inducing normal proteins to adopt their abnormal configuration. This unique mode of transmission results in progressive and incurable neurological conditions, posing significant challenges for diagnosis and treatment. Their effect on human health is severe because improper protein folding disrupts normal cellular functions in the nervous system, differentiating them from other acellular agents that rely on genetic material.",
    "explanation": "The absence of nucleic acids in prions and their mechanism of self-propagation through protein misfolding highlight their distinct and particularly dangerous impact on human health compared to viruses and viroids.",
    "topic": "Prions, Viruses, and Viroids",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen107"
  },
  {
    "question_text": "True or False: Viruses are considered living organisms because they carry genetic material and can replicate independently.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Viruses are not considered living because, despite carrying genetic material, they depend entirely on a host cell for replication and lack independent metabolic activity.",
    "topic": "Viruses",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen108"
  },
  {
    "question_text": "True or False: Bacteriophages typically have double stranded DNA as their genetic material.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Bacteriophages usually contain double stranded DNA, which is a key feature in their classification and replication process.",
    "topic": "Bacteriophages",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen109"
  },
  {
    "question_text": "True or False: Viroids contain a protective protein coat similar to viruses.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Viroids are composed solely of a small RNA molecule and do not have a protective protein coat, which differentiates them from viruses.",
    "topic": "Viroids",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen110"
  },
  {
    "question_text": "True or False: Lichens are formed by a single organism that is capable of surviving in polluted environments.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Lichens are a symbiotic association between algae and fungi. They are sensitive to pollution and typically do not grow in contaminated areas.",
    "topic": "Lichens",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen111"
  },
  {
    "question_text": "True or False: The viral genetic material is always encapsulated in a capsid made of capsomeres arranged in helical or polyhedral forms.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The capsid, which is composed of capsomeres in helical or polyhedral arrangements, protects the viral genetic material. This structural organization is characteristic of many viruses.",
    "topic": "Viruses",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen112"
  },
  {
    "question_text": "True or False: Prions are infectious agents caused by misfolded proteins and are similar in size to viruses.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "Prions are indeed misfolded proteins which, despite their small size similar to viruses, propagate by inducing misfolding in normal proteins, leading to severe neurological diseases.",
    "topic": "Prions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen113"
  },
  {
    "question_text": "If a virus produces 100 new virus particles and each virus kills one host cell in a population of 10,000 cells, what percentage of the cell population is destroyed?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "1%",
    "explanation": "If 100 cells are killed out of 10,000, then the percentage destroyed is (100/10,000) * 100 = 1%.",
    "topic": "Viruses, Infection",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xi_kebo1dd_c102_gen114"
  }
]