[
  {
    "question_text": "Which organ of the plant is primarily responsible for photosynthesis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Leaf",
      "Stem",
      "Root",
      "Flower"
    ],
    "correct_answer": "Leaf",
    "explanation": "Leaves are the primary sites for photosynthesis, converting light energy into chemical energy which fuels plant growth.",
    "topic": "Leaf Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen037"
  },
  {
    "question_text": "In compound leaves, an axillary bud is found in the axil of the petiole but not in the axil of which other part?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Leaflet",
      "Lamina",
      "Stipule",
      "Rachis"
    ],
    "correct_answer": "Leaflet",
    "explanation": "The text explains that although a bud is present in the axil of the petiole in both simple and compound leaves, it is not present in the axils of the leaflets in a compound leaf.",
    "topic": "Leaf Structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen038"
  },
  {
    "question_text": "Which type of venation is characteristic of most monocotyledonous plants?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Reticulate",
      "Parallel",
      "Both Reticulate and Parallel",
      "None of these"
    ],
    "correct_answer": "Parallel",
    "explanation": "Monocotyledonous plants typically have parallel venation, whereas dicotyledonous plants usually have reticulate venation.",
    "topic": "Venation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen039"
  },
  {
    "question_text": "Which term describes the pattern of arrangement of leaves on a stem or branch?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Phyllotaxy",
      "Venation",
      "Lamina",
      "Midrib"
    ],
    "correct_answer": "Phyllotaxy",
    "explanation": "Phyllotaxy refers to the pattern of arrangement of leaves on a stem or branch. It includes alternate, opposite, and whorled arrangements as described in the section.",
    "topic": "Phyllotaxy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen040"
  },
  {
    "question_text": "In a pinnately compound leaf, what is the name of the structure to which the leaflets are attached?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Leaf base",
      "Petiole",
      "Rachis",
      "Stipule"
    ],
    "correct_answer": "Rachis",
    "explanation": "In pinnately compound leaves, the leaflets are attached along a common axis known as the rachis, which essentially represents the midrib of the entire leaf.",
    "topic": "Types of Leaves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen041"
  },
  {
    "question_text": "Define the term 'lamina' as it relates to the structure of a leaf.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The lamina is the green, expanded part of the leaf with veins, primarily responsible for photosynthesis.",
    "explanation": "The text describes the lamina or leaf blade as the green and expanded portion of the leaf that contains veins and is crucial for photosynthetic activity.",
    "topic": "Leaf Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen042"
  },
  {
    "question_text": "Describe the primary differences between simple and compound leaves.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A simple leaf has an entire lamina or incisions that do not reach the midrib, whereas a compound leaf has incisions that reach the midrib and divide the leaf into separate leaflets.",
    "explanation": "The section differentiates between simple and compound leaves by the extent of incisions on the lamina relative to the midrib; compound leaves are divided into leaflets while simple leaves are not.",
    "topic": "Types of Leaves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen043"
  },
  {
    "question_text": "Explain how the petiole aids in a leaf's function.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The petiole holds the leaf blade in an optimal position for receiving light and allows it to flutter in the wind, which cools the leaf and improves air circulation.",
    "explanation": "According to the text, the petiole plays a key role in positioning the leaf blade towards light, and its flexibility helps in leaf cooling and gas exchange via wind-induced movement.",
    "topic": "Leaf Structure",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen044"
  },
  {
    "question_text": "What is the significance of the midrib in the structure of a leaf?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The midrib provides structural support and acts as the main channel for the transport of water, minerals, and food materials in the leaf.",
    "explanation": "The midrib is highlighted in the text as a prominent vein that not only adds rigidity to the leaf but also facilitates the effective distribution of nutrients and water.",
    "topic": "Leaf Structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen045"
  },
  {
    "question_text": "Discuss the various parts of a typical leaf and elaborate on their respective functions.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A typical leaf consists of three main parts: the leaf base, the petiole, and the lamina. The leaf base attaches the leaf to the stem and may have stipules. The petiole supports the lamina and positions it for optimal light exposure, also facilitating movement for cooling. The lamina, the green expanded blade, is the primary site of photosynthesis and houses vascular structures like the midrib and veins that transport water, minerals, and food.",
    "explanation": "This answer covers each component as described in the text: the leaf base's attachment function, the petiole's support and facilitation of movement, and the lamina’s role in photosynthesis and nutrient transport via its venation.",
    "topic": "Leaf Structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen046"
  },
  {
    "question_text": "Analyze the differences between reticulate and parallel venation and explain how these features help in classifying plants as dicots or monocots.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Reticulate venation, which forms a net-like network, is common in dicotyledonous plants, whereas parallel venation, where veins run side by side, characterizes most monocotyledonous plants. These differences in venation not only affect leaf structure and rigidity but also reflect evolutionary adaptations linked to the overall morphology and physiology of the plant groups.",
    "explanation": "This answer examines the structural differences in venation patterns and relates them to plant classification, drawing on key characteristics described in the section regarding how dicots and monocots differ with respect to their leaf venation.",
    "topic": "Venation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen047"
  },
  {
    "question_text": "Evaluate the significance of phyllotaxy in plant adaptation, particularly in optimizing light capture and resource distribution.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Phyllotaxy, the arrangement of leaves on the stem, plays a crucial role in optimizing light capture, reducing shading among leaves, and ensuring efficient resource distribution. Alternate, opposite, and whorled patterns each have adaptive advantages in different environmental contexts. For example, alternate phyllotaxy can allow for maximal light exposure for each leaf, while whorled arrangements can be beneficial in densely vegetated habitats.",
    "explanation": "The answer links the concept of phyllotaxy with functional advantages such as improved light interception and nutrient distribution, drawing from the examples and descriptions provided in the text.",
    "topic": "Phyllotaxy",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen048"
  },
  {
    "question_text": "True or False: The lamina of a leaf is not involved in photosynthesis.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The lamina, or leaf blade, is the primary site where photosynthesis occurs due to its green color and abundant chloroplasts.",
    "topic": "Leaf Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen049"
  },
  {
    "question_text": "True or False: In monocotyledons, the leaf base expands into a sheath that partially or wholly covers the stem.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text indicates that monocotyledonous plants commonly have a leaf base that develops into a sheath covering the stem partially or completely.",
    "topic": "Leaf Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen050"
  },
  {
    "question_text": "True or False: In compound leaves, axillary buds can be found at both the petiole and the leaflet axils.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While axillary buds are present in the axil of the petiole in compound leaves, they are not found in the axils of the individual leaflets.",
    "topic": "Types of Leaves",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen051"
  },
  {
    "question_text": "True or False: Reticulate venation is characterized by a network of veins and is typical of dicotyledonous plants.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Dicotyledonous plants usually exhibit reticulate venation, where the veins branch out into a network, as mentioned in the text.",
    "topic": "Venation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen052"
  },
  {
    "question_text": "True or False: The primary function of the petiole is nutrient transport, and it does not play a significant role in supporting the leaf blade.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "The petiole primarily supports the leaf blade by holding it in an optimal position for light exposure and allowing movement for cooling, although it may help in transport, its main role is structural.",
    "topic": "Leaf Structure",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen053"
  },
  {
    "question_text": "True or False: In whorled phyllotaxy, more than two leaves arise at a node.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Whorled phyllotaxy is defined as the arrangement where more than two leaves arise at a single node, forming a whorl.",
    "topic": "Phyllotaxy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen054"
  },
  {
    "question_text": "If a dicot leaf has 6 secondary veins and each secondary vein gives rise to 4 minor veinlets, how many minor veinlets are there in total?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "24",
    "explanation": "By multiplying the number of secondary veins (6) by the number of minor veinlets per secondary vein (4), the total is 6 x 4 = 24 minor veinlets.",
    "topic": "Venation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "04_section_5_3",
    "question_id": "cbse_xi_kebo1dd_c105_gen055"
  }
]