[
  {
    "question_text": "Which of the following is not correct? (a) Robert Brown discovered the cell. (b) Schleiden and Schwann formulated the cell theory. (c) Virchow explained that cells are formed from pre-existing cells. (d) A unicellular organism carries out its life activities within a single cell.",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Robert Brown discovered the cell.",
      "Schleiden and Schwann formulated the cell theory.",
      "Virchow explained that cells are formed from pre-existing cells.",
      "A unicellular organism carries out its life activities within a single cell."
    ],
    "correct_answer": "Robert Brown discovered the cell.",
    "explanation": "Anton Von Leeuwenhoek was the first to see and describe a live cell, while Robert Brown is credited with discovering the nucleus. Thus, the statement that Robert Brown discovered the cell is not correct.",
    "topic": "Cell History and Cell Theory",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex001"
  },
  {
    "question_text": "New cells generate from",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "bacterial fermentation",
      "regeneration of old cells",
      "pre-existing cells",
      "abiotic materials"
    ],
    "correct_answer": "pre-existing cells",
    "explanation": "According to the cell theory as modified by Virchow, all cells arise from pre-existing cells, making option (c) the correct answer.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex002"
  },
  {
    "question_text": "Match the following: (a) Cristae (i) Flat membranous sacs in stroma, (b) Cisternae (ii) Infoldings in mitochondria, (c) Thylakoids (iii) Disc-shaped sacs in Golgi apparatus.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Cristae: (ii), Cisternae: (iii), Thylakoids: (i)",
    "explanation": "Cristae are the infoldings of the inner mitochondrial membrane, cisternae are the disc-shaped sacs present in the Golgi apparatus, and thylakoids are the flat membranous sacs found in the chloroplast stroma.",
    "topic": "Cell Organelles",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex003"
  },
  {
    "question_text": "Which of the following is correct: (a) Cells of all living organisms have a nucleus. (b) Both animal and plant cells have a well defined cell wall. (c) In prokaryotes, there are no membrane bound organelles. (d) Cells are formed de novo from abiotic materials.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cells of all living organisms have a nucleus.",
      "Both animal and plant cells have a well defined cell wall.",
      "In prokaryotes, there are no membrane bound organelles.",
      "Cells are formed de novo from abiotic materials."
    ],
    "correct_answer": "In prokaryotes, there are no membrane bound organelles.",
    "explanation": "Prokaryotic cells lack a well-defined nucleus and other membrane-bound organelles, unlike eukaryotic cells. This makes option (c) the correct statement.",
    "topic": "Prokaryotic vs Eukaryotic Cells",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex004"
  },
  {
    "question_text": "What is a mesosome in a prokaryotic cell? Mention the functions that it performs.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A mesosome is a specialized infolding of the plasma membrane in prokaryotic cells. It is involved in functions such as cell wall formation, DNA replication, distribution of genetic material during cell division, and increasing the surface area for electron transport and enzymatic reactions related to respiration and secretion.",
    "explanation": "Mesosomes are unique to prokaryotes and serve multiple functions including enhancing the surface area of the plasma membrane and assisting in processes like cell division and respiration. Their structure as infoldings of the membrane supports these functions.",
    "topic": "Prokaryotic Cells",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex005"
  },
  {
    "question_text": "How do neutral solutes move across the plasma membrane? Can the polar molecules also move across it in the same way? If not, then how are these transported across the membrane?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Neutral solutes move across the plasma membrane by simple diffusion along the concentration gradient. Polar molecules, however, cannot easily pass through the nonpolar lipid bilayer and are transported by carrier proteins via facilitated diffusion or by active transport mechanisms when moving against a concentration gradient.",
    "explanation": "Simple diffusion allows neutral solutes to cross the lipid bilayer without assistance, but because polar molecules are repelled by the hydrophobic interior of the membrane, they require specialized transport proteins to help them cross.",
    "topic": "Cell Membrane and Transport",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex006"
  },
  {
    "question_text": "Name two cell-organelles that are double membrane bound. What are the characteristics of these two organelles? State their functions and draw labelled diagrams of both.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Mitochondria and Chloroplasts are two double membrane bound organelles. Mitochondria have an outer membrane and a highly folded inner membrane (cristae) that increase surface area, and they are the site of aerobic respiration and ATP production. Chloroplasts also have a double membrane; their inner membrane encloses the stroma, within which stacks of thylakoids (grana) are found, essential for photosynthesis.",
    "explanation": "Both mitochondria and chloroplasts are critical for energy conversion processes in the cell, with mitochondria generating ATP through respiration and chloroplasts carrying out photosynthesis to produce sugars. Their double membrane structure is crucial for compartmentalizing the processes.",
    "topic": "Mitochondria and Plastids",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex007"
  },
  {
    "question_text": "What are the characteristics of prokaryotic cells?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Prokaryotic cells are generally small, lack a well-defined nucleus, and do not possess membrane-bound organelles (except ribosomes). They have a cell envelope which includes a plasma membrane and usually a cell wall, and contain naked circular DNA, sometimes with additional plasmids. Some may have structures like mesosomes and flagella.",
    "explanation": "The defining features of prokaryotic cells include the absence of a nucleus and most organelles which are present in eukaryotic cells. Their structure is simpler, which relates to their rapid reproduction and adaptability.",
    "topic": "Prokaryotic Cells",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex008"
  },
  {
    "question_text": "Multicellular organisms have division of labour. Explain.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In multicellular organisms, cells are specialized to perform specific tasks. This division of labour increases the efficiency of the organism by allowing cells to focus on a narrow range of functions, which, when coordinated, support the survival, growth, and reproduction of the entire organism.",
    "explanation": "Cell specialization means that different cells, tissues, and organs perform distinct functions such as nutrient absorption, defense, and signal transmission. This integrated function is essential for the overall operation and efficiency of multicellular life forms.",
    "topic": "Cell Specialization and Organisation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex009"
  },
  {
    "question_text": "Cell is the basic unit of life. Discuss in brief.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The cell is considered the basic unit of life because it is the smallest unit that can perform all life functions. It carries out essential activities such as metabolism, energy conversion, and reproduction. Both unicellular and multicellular organisms are composed of cells, and their structure and function make them capable of independent living or participation in a larger, coordinated system.",
    "explanation": "This discussion covers the historical and functional significance of cells, emphasizing that all living organisms are made up of cells that support life functions. The cell’s role as a fundamental building block is central to biology.",
    "topic": "What is a Cell?",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex010"
  },
  {
    "question_text": "What are nuclear pores? State their function.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Nuclear pores are small openings found in the nuclear envelope that allow for the regulated exchange of molecules between the nucleus and the cytoplasm, such as the passage of RNA and proteins.",
    "explanation": "Nuclear pores are crucial for maintaining cellular function by controlling the flow of molecules, thereby regulating gene expression and the overall activity within the nucleus.",
    "topic": "Nucleus",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex011"
  },
  {
    "question_text": "Both lysosomes and vacuoles are endomembrane structures, yet they differ in terms of their functions. Comment.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Lysosomes are membrane-bound vesicles that contain hydrolytic enzymes for intracellular digestion, while vacuoles are storage organelles that hold water, sap, and waste products. Lysosomes function primarily in degradation and recycling of cellular components, whereas vacuoles are involved in storage and maintaining cell turgor.",
    "explanation": "Although both are part of the endomembrane system, lysosomes and vacuoles have distinct roles. Lysosomes break down macromolecules, while vacuoles store substances, which reflects their specialised functions in the cell.",
    "topic": "Endomembrane System",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex012"
  },
  {
    "question_text": "Describe the structure of the following with the help of labelled diagrams: (i) Nucleus (ii) Centrosome.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The nucleus is enclosed by a double membrane called the nuclear envelope, which contains nuclear pores, and houses chromatin and one or more nucleoli. The centrosome consists of a pair of centrioles surrounded by pericentriolar material and plays a key role in organizing microtubules during cell division.",
    "explanation": "This answer outlines the key structural components of the nucleus and centrosome, essential for understanding their roles in controlling genetic information and assisting in cell division respectively. Labelled diagrams typically highlight features such as the nuclear envelope, pores, chromatin, nucleoli, centrioles, and surrounding material.",
    "topic": "Nucleus and Centrosome",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex013"
  },
  {
    "question_text": "What is a centromere? How does the position of centromere form the basis of classification of chromosomes. Support your answer with a diagram showing the position of centromere on different types of chromosomes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A centromere is the primary constriction on a chromosome where two sister chromatids are held together. The position of the centromere divides the chromosome into arms and forms the basis for classification into metacentric (centromere in the middle), submetacentric (centromere slightly off center), acrocentric (centromere near one end), and telocentric (centromere at the very end) chromosomes.",
    "explanation": "The centromere is essential for proper chromosome segregation during cell division. Its location on the chromosome determines the relative lengths of the arms, which is used to classify chromosome types. A diagram typically illustrates these different positions to help visualise the classifications.",
    "topic": "Chromosomes",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex014"
  },
  {
    "question_text": "Which of the following lists all the four basic shapes of bacteria?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Bacillus, coccus, vibrio, spirillum",
      "Bacillus, rod, oval, spiral",
      "Coccus, rod, square, curved",
      "Spirillum, oval, rod, filament"
    ],
    "correct_answer": "Bacillus, coccus, vibrio, spirillum",
    "explanation": "The text clearly states that the four basic shapes of bacteria are bacillus (rod like), coccus (spherical), vibrio (comma shaped), and spirillum (spiral).",
    "topic": "Prokaryotic Cell Morphology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen052"
  },
  {
    "question_text": "Which component in prokaryotic cells is responsible for protein synthesis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Endoplasmic reticulum",
      "Nucleus",
      "Ribosomes",
      "Mitochondria"
    ],
    "correct_answer": "Ribosomes",
    "explanation": "Prokaryotic cells lack a well-defined nucleus and other organelles found in eukaryotes; the ribosomes present are the site of protein synthesis.",
    "topic": "Ribosomes in Prokaryotes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen053"
  },
  {
    "question_text": "What is unique about mycoplasma compared to most other prokaryotic cells?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "They have a well-defined nucleus",
      "They lack a cell wall",
      "They contain abundant plasmids",
      "They are larger than typical bacteria"
    ],
    "correct_answer": "They lack a cell wall",
    "explanation": "The text mentions that most prokaryotes have a cell wall surrounding the cell membrane except in mycoplasma which is an exception.",
    "topic": "Prokaryotic Cell Structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen054"
  },
  {
    "question_text": "What is the significance of plasmids found in some bacteria?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "They aid in cell division",
      "They carry genetic traits like antibiotic resistance",
      "They are involved in energy production",
      "They store reserve nutrients"
    ],
    "correct_answer": "They carry genetic traits like antibiotic resistance",
    "explanation": "Plasmids are smaller circular DNA molecules that confer unique phenotypic traits such as antibiotic resistance to bacteria.",
    "topic": "Plasmids in Prokaryotes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen055"
  },
  {
    "question_text": "Which structure, formed by infoldings of the cell membrane, is characteristic of prokaryotes?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Mitochondrion",
      "Mesosome",
      "Golgi apparatus",
      "Chloroplast"
    ],
    "correct_answer": "Mesosome",
    "explanation": "Mesosomes are specialized infoldings of the prokaryotic plasma membrane involved in various functions such as cell wall formation and DNA replication.",
    "topic": "Cell Structure – Mesosomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen056"
  },
  {
    "question_text": "Define the glycocalyx in bacterial cells and discuss its variations.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The glycocalyx is the outermost layer of the cell envelope in bacteria; it can be a loose slime layer or a thick, tough capsule. It plays roles in protection, adhesion to surfaces, and evasion of host defenses.",
    "explanation": "The glycocalyx differs in composition and thickness among bacteria and acts as part of a complex cell envelope protecting the cell.",
    "topic": "Cell Envelope Modifications",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen057"
  },
  {
    "question_text": "What role do mesosomes play in the functioning of prokaryotic cells?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mesosomes assist in cell wall formation, DNA replication, distribution of DNA during cell division, and may increase the surface area for processes such as respiration and secretion.",
    "explanation": "The text specifies that mesosomes, as infoldings of the cell membrane, are involved in several cellular processes including respiration and cell division.",
    "topic": "Cell Structure – Mesosomes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen058"
  },
  {
    "question_text": "List two functions of bacterial flagella based on the section content.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Bacterial flagella primarily provide motility by enabling movement and may also help in chemotactic responses by allowing bacteria to navigate towards favorable environments.",
    "explanation": "Flagella are the motile structures in bacteria that facilitate movement, and while the text does not elaborate extensively on chemotaxis, movement is a primary function.",
    "topic": "Bacterial Motility",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen059"
  },
  {
    "question_text": "Compare the structural roles of pili and fimbriae in bacteria. How do these structures contribute to bacterial survival?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Pili are elongated tubular structures made of specific proteins and facilitate functions like attachment, conjugation, and sometimes motility. Fimbriae are smaller, bristle-like fibers that mainly serve as adhesins to attach bacteria to surfaces and host tissues. Both structures aid in environmental adhesion and colonization, which are crucial for bacterial survival.",
    "explanation": "The answer highlights that while both pili and fimbriae are surface structures, pili are generally longer and involved in more complex processes such as conjugation, whereas fimbriae primarily assist in adherence.",
    "topic": "Surface Structures of Bacteria",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen060"
  },
  {
    "question_text": "Discuss the main differences between prokaryotic and eukaryotic cells as mentioned in the text.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Prokaryotic cells are generally smaller, lack a well-defined nucleus, and do not contain membrane-bound organelles (except ribosomes), whereas eukaryotic cells are larger, have a defined nucleus enclosed by a nuclear membrane, and possess multiple specialized organelles. Additionally, prokaryotes often have unique structures like mesosomes and inclusions, which are not found in eukaryotes.",
    "explanation": "This answer encapsulates key differences including cell size, nuclear organization, organelle presence, and the existence of unique structures such as mesosomes in prokaryotes.",
    "topic": "Comparative Cell Organization",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen061"
  },
  {
    "question_text": "Explain the structure of the prokaryotic cell envelope and describe the function of each layer.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The prokaryotic cell envelope typically consists of three layers: the outermost glycocalyx, the cell wall, and the plasma membrane. The glycocalyx, which can be either a loose slime layer or a thick capsule, provides protection and aids in adhesion. The cell wall maintains cell shape and protects against physical stress, and the plasma membrane controls the transport of substances in and out of the cell.",
    "explanation": "This answer details the structure and integral functions of each layer in the bacterial cell envelope, linking structure with function as described in the text.",
    "topic": "Cell Envelope Structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen062"
  },
  {
    "question_text": "Evaluate the roles of ribosomes and inclusion bodies in prokaryotic cells in relation to overall cellular metabolism.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Ribosomes in prokaryotic cells are essential for protein synthesis, forming polyribosomes that translate mRNA into proteins necessary for cell function. Inclusion bodies serve as storage granules for reserve materials like phosphate, glycogen, and other substances, providing a resource during nutrient scarcity. Together, they support the metabolic activities of the cell by ensuring a constant supply of proteins and storage of essential materials.",
    "explanation": "This answer links the functional importance of ribosomes and inclusion bodies to overall metabolism by discussing how protein synthesis and reserve storage are vital processes for cellular activity and survival.",
    "topic": "Ribosomes and Inclusion Bodies",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen063"
  },
  {
    "question_text": "True or False: Prokaryotic cells possess a well-defined nucleus enclosed by a nuclear membrane.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Prokaryotic cells do not have a well-defined nucleus; their genetic material is naked and not enclosed within a nuclear membrane.",
    "topic": "Cell Organization",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen064"
  },
  {
    "question_text": "True or False: Mycoplasma, unlike most prokaryotic cells, do not have a cell wall.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text states that mycoplasma are an exception among prokaryotes as they lack the cell wall that normally surrounds the cell membrane.",
    "topic": "Cell Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen065"
  },
  {
    "question_text": "True or False: The mesosome in prokaryotes is a specialized structure formed by infoldings of the plasma membrane.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The mesosome is indeed described as a specialized, differentiated form of the cell membrane that appears as infoldings, playing roles in various cellular activities.",
    "topic": "Mesosomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen066"
  },
  {
    "question_text": "True or False: Plasmids are only found in eukaryotic cells and are absent in prokaryotic cells.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Plasmids are small circular DNA molecules found in many bacteria (prokaryotic cells), not in eukaryotic cells.",
    "topic": "Genetic Material",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen067"
  },
  {
    "question_text": "True or False: Pili and fimbriae primarily function to enable bacterial adhesion to surfaces and host tissues.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Both pili and fimbriae are surface structures that assist bacteria in adhering to surfaces and host tissues. However, pili may also play roles in conjugation.",
    "topic": "Surface Structures",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen068"
  },
  {
    "question_text": "True or False: Chromatophores are membranous extensions found exclusively in non-photosynthetic bacteria.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Chromatophores are described in the text as membranous extensions found in photosynthetic bacteria like cyanobacteria, and they contain pigments.",
    "topic": "Cell Extensions",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen069"
  },
  {
    "question_text": "A typical eukaryotic cell is approximately 10-20 μm in size, while a typical bacterial cell is about 1-2 μm. Approximately how many times smaller is the bacterial cell compared to the eukaryotic cell?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 5 to 10 times smaller",
    "explanation": "Given that eukaryotic cells are roughly 10-20 μm and bacterial cells are about 1-2 μm, dividing the ranges yields a ratio of about 5 to 10.",
    "topic": "Cell Size Comparison",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen070"
  },
  {
    "question_text": "If a PPLO is about 0.1 μm in size and a typical bacterium is 1 μm in size, calculate the size ratio of PPLO to the bacterium.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "PPLO is approximately 1/10 the size of a typical bacterium",
    "explanation": "Since 0.1 μm is one-tenth of 1 μm, the PPLO is about 10 times smaller than a typical bacterium.",
    "topic": "Size Comparison",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xi_kebo1dd_c108_gen071"
  },
  {
    "question_text": "What is the cell according to the textbook section?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A complete structure of a cell that ensures independent living",
      "A structure that is partially complete",
      "Any group of molecules found in organisms",
      "A complex network of tissues"
    ],
    "correct_answer": "A complete structure of a cell that ensures independent living",
    "explanation": "The cell is defined as the fundamental structural and functional unit of all living organisms, capable of independent existence and performing essential life functions, which emphasizes the need for completeness.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen001"
  },
  {
    "question_text": "Who was the first scientist to see and describe a live cell?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Anton Von Leeuwenhoek",
      "Robert Brown",
      "Louis Pasteur",
      "Charles Darwin"
    ],
    "correct_answer": "Anton Von Leeuwenhoek",
    "explanation": "Anton Von Leeuwenhoek is credited as the first to see and describe a live cell, as mentioned in the section.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen002"
  },
  {
    "question_text": "Which scientist is credited with the discovery of the nucleus?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Anton Von Leeuwenhoek",
      "Robert Brown",
      "Gregor Mendel",
      "James Watson"
    ],
    "correct_answer": "Robert Brown",
    "explanation": "Robert Brown is mentioned in the section as the scientist who discovered the nucleus, a key component within the cell.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen003"
  },
  {
    "question_text": "Which of the following properties does a cell NOT need to ensure independent living?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Ability to perform essential functions of life",
      "Having a nucleus",
      "Complete structural organization",
      "Capability of independent existence"
    ],
    "correct_answer": "Having a nucleus",
    "explanation": "While many cells do have a nucleus, the essential criteria for independent living of unicellular organisms is the complete structure capable of performing essential functions, not necessarily the presence of a nucleus, as some prokaryotes lack one.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen004"
  },
  {
    "question_text": "How did the invention and subsequent improvement of the microscope contribute to our understanding of cells?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "It allowed scientists to see live cells and all their structural details",
      "It replaced the need for biological experiments",
      "It proved that cells are unnecessary for life",
      "It only improved our knowledge of animal biology"
    ],
    "correct_answer": "It allowed scientists to see live cells and all their structural details",
    "explanation": "The development from the simple microscope to the electron microscope revealed detailed structural information about cells, greatly enhancing our understanding of their components and functions.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen005"
  },
  {
    "question_text": "Explain why a cell is considered the fundamental structural and functional unit of all living organisms.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Because the cell is the smallest unit that can perform all the functions necessary for life and can exist independently in unicellular organisms.",
    "explanation": "The cell is the most basic unit that carries out all essential functions such as metabolism, reproduction, and response to the environment, making it fundamental to all life forms.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen006"
  },
  {
    "question_text": "Describe the role of the microscope in advancing our understanding of cell structure.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The microscope, especially with improvements leading to the electron microscope, allowed scientists to see live cells and all their intricate details, revealing the complexity of cell structures.",
    "explanation": "The invention of the microscope opened a new world in biology by allowing visualization of cells, and its improvements over time further enhanced our understanding of the different structural components of the cell.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen007"
  },
  {
    "question_text": "Who first observed a live cell and what did this discovery signify for biology?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Anton Von Leeuwenhoek first observed a live cell, marking the beginning of cell biology and the use of microscopy in studying living organisms.",
    "explanation": "This discovery was crucial since it provided the first glimpse into the existence of cells, establishing the groundwork for understanding that all life forms are composed of cells.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen008"
  },
  {
    "question_text": "Why is a complete cell necessary for independent living?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A complete cell contains all essential parts and functions required to sustain life, such as metabolism, reproduction, and interaction with the environment, which incomplete structures cannot support.",
    "explanation": "Complete cellular structures ensure that all the required functions to maintain life can be performed, a condition that is not met by any partial or incomplete cellular components.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen009"
  },
  {
    "question_text": "Discuss the significance of the invention of the microscope and its improvements in the field of cell biology.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The invention of the microscope revolutionized biology by making it possible to see cells for the first time. Improvements, particularly the development of the electron microscope, allowed scientists to observe detailed structures and understand cell organization and function, thereby deepening our knowledge of life at the cellular level.",
    "explanation": "This question invites an explanation of how the microscope provided critical insights into cell structure, leading to discoveries such as the nucleus and other organelles, which are fundamental to understanding cellular functions and biological processes.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen010"
  },
  {
    "question_text": "Evaluate the contributions of Anton Von Leeuwenhoek and Robert Brown to the development of cell biology.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Anton Von Leeuwenhoek's observation and description of live cells opened up the study of the microscopic world, while Robert Brown's discovery of the nucleus further refined our understanding of cell structure. Together, their discoveries laid the foundation for modern cell biology by establishing that cells are the fundamental units of life and highlighting the importance of cellular compartments.",
    "explanation": "This answer provides a comparative evaluation of how each scientist contributed to the field, with Leeuwenhoek initiating the microscopic study of cells and Brown enhancing structural understanding by discovering the nucleus.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen011"
  },
  {
    "question_text": "Cells are the basic unit of life.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "This statement is true because, as mentioned in the section, the cell is the fundamental structural and functional unit of all living organisms.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen012"
  },
  {
    "question_text": "Unicellular organisms are capable of performing essential functions of life.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section clearly states that unicellular organisms can perform essential functions of life, which is one of the prerequisites for independent living.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen013"
  },
  {
    "question_text": "A structure less than a complete cell can ensure independent living.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The section emphasizes that anything less than a complete structure of a cell does not ensure independent living, making this statement false.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen014"
  },
  {
    "question_text": "Robert Brown was the first to see and describe a live cell.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While Robert Brown is known for discovering the nucleus, it was Anton Von Leeuwenhoek who first saw and described a live cell.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen015"
  },
  {
    "question_text": "The electron microscope has revealed all structural details of the cell.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The electron microscope provided much more detailed images of the cell's internal structures, revealing numerous details that were not visible with light microscopes.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen016"
  },
  {
    "question_text": "Improvements in microscope technology had no significant impact on our understanding of cell structure.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Microscope improvements, especially the development of the electron microscope, greatly enhanced our understanding of the cell's detailed structure and function, making this statement false.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen017"
  },
  {
    "question_text": "Based on the section, how many scientists are specifically named for their contributions to cell biology?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "2",
    "explanation": "The section names two scientists: Anton Von Leeuwenhoek, who first saw and described a live cell, and Robert Brown, who discovered the nucleus.",
    "topic": "8.1 WHAT IS A CELL?",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "02_section_8_1",
    "question_id": "cbse_xi_kebo1dd_c108_gen018"
  },
  {
    "question_text": "Which two scientists are credited with formulating the cell theory by stating that both plant and animal bodies are composed of cells and their products?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Matthias Schleiden and Theodore Schwann",
      "Theodore Schwann and Rudolf Virchow",
      "Matthias Schleiden and Rudolf Virchow",
      "Matthias Schleiden and Robert Hooke"
    ],
    "correct_answer": "Matthias Schleiden and Theodore Schwann",
    "explanation": "Schleiden and Schwann formulated the initial cell theory by observing plants and animals, respectively, and concluding that both are composed of cells.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen019"
  },
  {
    "question_text": "What unique feature did Theodore Schwann associate specifically with plant cells?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Presence of a nucleus",
      "Presence of the cell wall",
      "Presence of mitochondria",
      "Presence of ribosomes"
    ],
    "correct_answer": "Presence of the cell wall",
    "explanation": "Schwann noted that, in contrast to animal cells, plant cells have a cell wall, which is a distinctive characteristic of plants.",
    "topic": "Cell Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen020"
  },
  {
    "question_text": "What was Rudolf Virchow's significant contribution to the cell theory?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "He observed that plants have cells.",
      "He discovered the plasma membrane of animal cells.",
      "He proposed that all cells come from pre-existing cells.",
      "He identified different types of tissues."
    ],
    "correct_answer": "He proposed that all cells come from pre-existing cells.",
    "explanation": "Virchow modified the cell theory by stating that new cells are formed only from already existing cells, encapsulated in his phrase ‘Omnis cellulae ex cellulae’.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen021"
  },
  {
    "question_text": "Which of the following best represents the modern cell theory?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "All living organisms consist of cells that arise independently from chemical reactions.",
      "All living organisms are composed of cells and all cells are formed by spontaneous generation.",
      "All living organisms are composed of cells and products of cells, and all cells arise from pre-existing cells.",
      "All living organisms are composed of cells, but their origin remains unknown."
    ],
    "correct_answer": "All living organisms are composed of cells and products of cells, and all cells arise from pre-existing cells.",
    "explanation": "The modern cell theory states both that all living organisms are made up of cells and that every cell is derived from a pre-existing cell.",
    "topic": "Cell Theory",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen022"
  },
  {
    "question_text": "What observation did Matthias Schleiden make regarding plant cells?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "He noticed that plants are composed of different types of cells forming their tissues.",
      "He observed that animal cells have a distinct cell wall.",
      "He concluded that all cells arise from spontaneous generation.",
      "He discovered the plasma membrane in plant cells."
    ],
    "correct_answer": "He noticed that plants are composed of different types of cells forming their tissues.",
    "explanation": "Schleiden studied plants extensively and noted that they are made up of various types of cells that come together to form tissues.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen023"
  },
  {
    "question_text": "State the two main statements of the modern cell theory.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "All living organisms are composed of cells and their products, and all cells arise from pre-existing cells.",
    "explanation": "The modern cell theory includes two key ideas: first, every living organism is made up of cells and their derivatives; second, every cell comes from a previously existing cell.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen024"
  },
  {
    "question_text": "Explain how Theodore Schwann's study of animal cells contributed to the development of the cell theory.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Schwann observed that animal cells have a thin outer layer known as the plasma membrane and, along with his observations on plant cells, led to the hypothesis that both plants and animals are made up of cells.",
    "explanation": "Schwann's work on animal tissues provided evidence that cells are a common structural unit in both plants and animals, which was crucial in forming the unified cell theory.",
    "topic": "Cell Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen025"
  },
  {
    "question_text": "Differentiate between the contributions of Matthias Schleiden and Rudolf Virchow to the cell theory.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Schleiden contributed by observing that plants are made up of cells, while Virchow clarified that new cells form only from pre-existing cells. Schleiden focused on the composition of plant tissues, whereas Virchow focused on the process of cell division.",
    "explanation": "While Schleiden's work established that assemblages of cells form plant tissues, Virchow's insight addressed the mechanism of cell reproduction, refining and completing the cell theory.",
    "topic": "Cell Theory",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen026"
  },
  {
    "question_text": "Discuss the development of the cell theory by describing the contributions of Matthias Schleiden, Theodore Schwann, and Rudolf Virchow. In your answer, include the specific observations made by each scientist.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Matthias Schleiden observed that plants are composed of a variety of cells that form tissues, establishing the idea that cells are the basic units of life in plants. Theodore Schwann extended this observation to animals by studying animal cells and identifying the plasma membrane, hence supporting the similarity between plant and animal cells. Rudolf Virchow then refined the cell theory by proposing that new cells arise only from existing cells, encapsulated in his phrase 'Omnis cellulae ex cellulae'.",
    "explanation": "Each scientist made critical observations: Schleiden’s work on plants, Schwann’s focus on animal cells, and Virchow’s explanation of cell division, together forming a comprehensive theory that underpins modern biology.",
    "topic": "Cell Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen027"
  },
  {
    "question_text": "Evaluate the impact of the cell theory on modern biology and explain why the contributions of Schleiden, Schwann, and Virchow were essential in shaping our understanding of life.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The cell theory has had a profound impact on modern biology by establishing that all living organisms are composed of cells, which are the fundamental structural and functional units of life. Schleiden and Schwann’s observations provided the initial evidence that cells are universal components of life, while Virchow’s contribution that new cells must arise from existing cells laid the foundation for understanding cell division and propagation. These ideas collectively revolutionized biological research, influencing fields such as embryology, pathology, and genetics.",
    "explanation": "The combined work of these scientists led to a unified and robust framework for understanding biology. The cell theory not only explains the structure of organisms but also informs research into growth, development, and disease, highlighting the importance of each scientist's contribution.",
    "topic": "Cell Theory",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen028"
  },
  {
    "question_text": "Matthias Schleiden was a German botanist who studied animal cells. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Matthias Schleiden was a German botanist known for his studies of plant cells, not animal cells.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen029"
  },
  {
    "question_text": "The plasma membrane of animal cells was first identified by Theodore Schwann. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Theodore Schwann is credited with identifying the thin outer layer of animal cells, which is known today as the plasma membrane.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen030"
  },
  {
    "question_text": "According to the modern cell theory, new cells can form spontaneously without the need for pre-existing cells. True or False?",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The modern cell theory, as modified by Rudolf Virchow, clearly states that new cells arise only from pre-existing cells, not spontaneously.",
    "topic": "Cell Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen031"
  },
  {
    "question_text": "The phrase 'Omnis cellulae ex cellulae' is associated with Rudolf Virchow's explanation of cell division. True or False?",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The phrase 'Omnis cellulae ex cellulae' means that every cell arises from a pre-existing cell, which was a key addition to the cell theory by Rudolf Virchow.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen032"
  },
  {
    "question_text": "The original cell theory proposed by Schleiden and Schwann fully explained how new cells are formed. True or False?",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "While Schleiden and Schwann formulated the cell theory, it did not address cell formation; this gap was later filled by Virchow, who stated that cells arise from pre-existing cells.",
    "topic": "Cell Theory",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen033"
  },
  {
    "question_text": "Plant cells uniquely have a cell wall in addition to a plasma membrane, which differentiates them from animal cells. True or False?",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "One of the distinguishing features of plant cells is the presence of a cell wall, a structure not found in animal cells, although both cell types have a plasma membrane.",
    "topic": "Cell Theory",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen034"
  },
  {
    "question_text": "In which year did Rudolf Virchow propose that all cells arise from pre-existing cells?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1855",
    "explanation": "Rudolf Virchow introduced the concept that every cell comes from a pre-existing cell in the year 1855, which completed the cell theory.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "03_section_8_2",
    "question_id": "cbse_xi_kebo1dd_c108_gen035"
  },
  {
    "question_text": "Which of the following correctly defines a eukaryotic cell?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A cell with a membrane-bound nucleus and organelles",
      "A cell without a membrane-bound nucleus",
      "A cell that only contains cytoplasm",
      "A cell that only has ribosomes"
    ],
    "correct_answer": "A cell with a membrane-bound nucleus and organelles",
    "explanation": "Eukaryotic cells are characterized by having a membrane-bound nucleus and other organelles, which distinguishes them from prokaryotic cells.",
    "topic": "Cell structure overview",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen036"
  },
  {
    "question_text": "In an onion cell, which layer is immediately inside the cell wall?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Nucleus",
      "Ribosomes",
      "Cytoplasm",
      "Cell membrane"
    ],
    "correct_answer": "Cell membrane",
    "explanation": "In plant cells such as an onion cell, the cell membrane is located just within the cell wall.",
    "topic": "Cell structure overview",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen037"
  },
  {
    "question_text": "Which one of the following is common to both prokaryotic and eukaryotic cells?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Nucleus",
      "Cytoplasm",
      "Golgi complex",
      "Endoplasmic reticulum"
    ],
    "correct_answer": "Cytoplasm",
    "explanation": "Both prokaryotic and eukaryotic cells have cytoplasm, which is the semi-fluid matrix where cellular activities occur.",
    "topic": "Cell structure overview",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen038"
  },
  {
    "question_text": "Which structure in animal cells helps in cell division?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Chloroplast",
      "Centrosome",
      "Lysosome",
      "Vacuole"
    ],
    "correct_answer": "Centrosome",
    "explanation": "Animal cells contain a centrosome that plays a crucial role in organizing the microtubules during cell division.",
    "topic": "Cell structure overview",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen039"
  },
  {
    "question_text": "Which option best describes the shape of red blood cells as discussed in the text?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Disc-like and biconcave",
      "Columnar",
      "Irregular",
      "Polygonal"
    ],
    "correct_answer": "Disc-like and biconcave",
    "explanation": "Red blood cells are depicted as round and biconcave in shape, which facilitates their efficiency in transporting oxygen.",
    "topic": "Cell diversity and function",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen040"
  },
  {
    "question_text": "Describe the main function of the cytoplasm in a cell.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The cytoplasm serves as the site where most cellular activities and chemical reactions occur, keeping the cell in a 'living state'.",
    "explanation": "The cytoplasm is a semi-fluid matrix that houses various cellular components and facilitates the chemical reactions necessary for the cell's life processes.",
    "topic": "Cellular matrix and function",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen041"
  },
  {
    "question_text": "What is the primary distinguishing feature between eukaryotic and prokaryotic cells?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Eukaryotic cells have a membrane-bound nucleus and distinct organelles, whereas prokaryotic cells lack a membrane-bound nucleus and membrane-bound organelles.",
    "explanation": "The presence of a membrane-bound nucleus and other organelles is what differentiates eukaryotic cells from prokaryotic cells.",
    "topic": "Cellular classification",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen042"
  },
  {
    "question_text": "List two membrane-bound organelles present in eukaryotic cells and two non-membrane bound structures.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Membrane-bound organelles: nucleus and mitochondria; Non-membrane bound structures: ribosomes and centrosome.",
    "explanation": "Eukaryotic cells have several membrane-bound organelles like the nucleus and mitochondria, while ribosomes and the centrosome (in animal cells) are examples of non-membrane bound structures.",
    "topic": "Cell organelles",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen043"
  },
  {
    "question_text": "Discuss the role of the nucleus and ribosomes in cell function, and explain how their presence is significant in eukaryotic cells.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The nucleus acts as the control center of the cell by housing the chromosomes that contain the genetic material (DNA). Ribosomes are the sites of protein synthesis and are found in the cytoplasm, on the rough endoplasmic reticulum, and within organelles such as mitochondria and chloroplasts. Their coordinated actions allow for regulated gene expression and the production of proteins essential for cell structure and function.",
    "explanation": "The nucleus stores and manages genetic information, directing cellular activities, while ribosomes synthesize proteins that perform multiple cellular functions. In eukaryotes, the compartmentalization ensures efficient regulation and processing of cellular functions.",
    "topic": "Nucleus and ribosomes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen044"
  },
  {
    "question_text": "Compare and contrast the structural features of plant and animal cells, citing examples from the text to illustrate their functional differences.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Plant cells, such as those in an onion peel, have a rigid cell wall, a cell membrane, and chloroplasts for photosynthesis, while animal cells, like human cheek cells, have only a cell membrane and contain structures like centrosomes that are involved in cell division. Both cell types have a nucleus and cytoplasm, but the additional structures in plant cells are adapted for a fixed, energy-producing lifestyle, whereas animal cells are more variable in shape and support motility and dynamic processes.",
    "explanation": "This comparison emphasizes the distinct cell structures that are adapted to the specific needs of plants and animals. The cell wall and chloroplasts in plant cells contribute to structural integrity and energy production, whereas animal cells utilize other specialized structures like centrosomes to handle dynamic functions like cell division.",
    "topic": "Plant vs. Animal cell structure",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen045"
  },
  {
    "question_text": "True or False: All cells observed under a microscope, including those from plants and animals, have a cell wall.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Animal cells (such as human cheek cells) do not have cell walls; they are enclosed only by a cell membrane.",
    "topic": "Cell structure differences",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen046"
  },
  {
    "question_text": "True or False: The nucleus found inside a eukaryotic cell is not bound by any membrane.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The nucleus in eukaryotic cells is membrane-bound, which is a defining characteristic of these cells.",
    "topic": "Nucleus structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen047"
  },
  {
    "question_text": "True or False: Prokaryotic cells contain membrane-bound organelles such as mitochondria and the Golgi complex.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Prokaryotic cells lack membrane-bound organelles; organelles like mitochondria and the Golgi complex are features of eukaryotic cells.",
    "topic": "Cellular classification",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen048"
  },
  {
    "question_text": "True or False: Ribosomes are exclusively found on the rough endoplasmic reticulum in eukaryotic cells.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Ribosomes are found free in the cytoplasm, on the rough endoplasmic reticulum, and also within certain organelles such as mitochondria and chloroplasts in plant cells.",
    "topic": "Ribosomes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen049"
  },
  {
    "question_text": "True or False: In animal cells, the centrosome is responsible for organizing microtubules during cell division.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The centrosome in animal cells plays a key role during cell division by organizing microtubules to form the spindle apparatus.",
    "topic": "Cell division",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen050"
  },
  {
    "question_text": "Approximately how many micrometers (µm) in diameter are human red blood cells, as described in the text?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "7.0 µm",
    "explanation": "The text indicates that human red blood cells are about 7.0 µm in diameter.",
    "topic": "Cell size and diversity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "04_section_8_3",
    "question_id": "cbse_xi_kebo1dd_c108_gen051"
  },
  {
    "question_text": "Which of the following structures is absent in animal cells?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cell wall",
      "Centriole",
      "Nucleus",
      "Mitochondrion"
    ],
    "correct_answer": "Cell wall",
    "explanation": "Animal cells lack a cell wall, which is present in plant cells along with other structures such as plastids and a large central vacuole.",
    "topic": "Eukaryotic Cells - Plant vs Animal Cells",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen072"
  },
  {
    "question_text": "What is the main function of mitochondria in eukaryotic cells?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Protein synthesis",
      "DNA replication",
      "ATP production",
      "Photosynthesis"
    ],
    "correct_answer": "ATP production",
    "explanation": "Mitochondria are known as the powerhouses of the cell because they generate ATP through aerobic respiration.",
    "topic": "Mitochondria",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen073"
  },
  {
    "question_text": "According to the fluid mosaic model, what property of the plasma membrane allows proteins to move laterally within it?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Selectively permeable nature",
      "Cholesterol content",
      "Quasi-fluid nature of lipids",
      "Protein-carbohydrate ratio"
    ],
    "correct_answer": "Quasi-fluid nature of lipids",
    "explanation": "The quasi-fluid nature of the phospholipid bilayer allows the lateral movement of proteins, which is a key feature of the fluid mosaic model.",
    "topic": "Cell Membrane - Fluid Mosaic Model",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen074"
  },
  {
    "question_text": "Which organelle is primarily responsible for packaging and modifying proteins before they are secreted or transported to other parts of the cell?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Mitochondria",
      "Golgi apparatus",
      "Endoplasmic reticulum",
      "Chloroplast"
    ],
    "correct_answer": "Golgi apparatus",
    "explanation": "The Golgi apparatus modifies, packages, and sorts proteins and lipids received from the ER.",
    "topic": "Golgi Apparatus and Endomembrane System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen075"
  },
  {
    "question_text": "Which statement correctly describes the difference in ribosomal subunit sizes between eukaryotes and prokaryotes?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "60S for eukaryotic, 40S for prokaryotic",
      "80S for eukaryotic, 70S for prokaryotic",
      "70S for eukaryotic, 80S for prokaryotic",
      "90S for eukaryotic, 60S for prokaryotic"
    ],
    "correct_answer": "80S for eukaryotic, 70S for prokaryotic",
    "explanation": "Eukaryotic ribosomes are 80S, composed of 60S and 40S subunits, while prokaryotic ribosomes are 70S, composed of 50S and 30S subunits.",
    "topic": "Ribosomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen076"
  },
  {
    "question_text": "Describe two differences between plant and animal cells.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Plant cells have a rigid cell wall, chloroplasts for photosynthesis, and a large central vacuole for storage, whereas animal cells lack these structures but possess centrioles and often have microvilli.",
    "explanation": "This answer highlights the distinguishing features such as the presence of cell walls, chloroplasts, and a large vacuole in plant cells compared to centrioles and microvilli in animal cells.",
    "topic": "Eukaryotic Cells - Plant vs Animal Cells",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen077"
  },
  {
    "question_text": "Define the term 'fluidity' as it pertains to the plasma membrane.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Fluidity refers to the dynamic, flexible nature of the plasma membrane that allows its lipid and protein molecules to move laterally within the bilayer.",
    "explanation": "The concept of fluidity explains the lateral motion of components in the lipid bilayer, crucial for various cellular processes.",
    "topic": "Cell Membrane - Fluid Mosaic Model",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen078"
  },
  {
    "question_text": "How does the structure of chloroplasts facilitate the process of photosynthesis?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Chloroplasts have a double membrane structure with thylakoid membranes arranged in stacks called grana, which increase the surface area for light absorption, while the stroma contains enzymes required for the Calvin cycle.",
    "explanation": "This answer explains how the organization of thylakoids and stroma within the chloroplast optimizes light capture and subsequent biochemical reactions in photosynthesis.",
    "topic": "Plastids - Chloroplast Structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen079"
  },
  {
    "question_text": "Explain the role of the Golgi apparatus within the endomembrane system.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The Golgi apparatus receives proteins and lipids from the endoplasmic reticulum, modifies them through processes such as glycosylation, and then packages them into vesicles for transport to their final destinations either within or outside the cell.",
    "explanation": "This answer links the structural organization of the Golgi to its functional role in processing and sorting cellular materials as part of the endomembrane system.",
    "topic": "Golgi Apparatus and Endomembrane System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen080"
  },
  {
    "question_text": "Discuss the structure and functions of the endoplasmic reticulum in eukaryotic cells. Compare the rough and smooth endoplasmic reticulum in your answer.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The endoplasmic reticulum (ER) is a continuous network of membranous tubules with two distinct regions: the rough ER, which has ribosomes attached to its surface and is involved in protein synthesis and processing, and the smooth ER, which lacks ribosomes and is primarily responsible for lipid synthesis, detoxification, and calcium storage. Both regions are connected to the nuclear envelope and are integral in transporting molecules within the cell.",
    "explanation": "This comprehensive answer covers the dual nature of the ER, explaining the distinct functions of its rough and smooth regions and their significance in cellular activities.",
    "topic": "Endoplasmic Reticulum",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen081"
  },
  {
    "question_text": "Explain the roles of mitochondria and chloroplasts in energy conversion, highlighting both their similarities and differences in structure and function.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Mitochondria and chloroplasts are both double membrane-bound organelles involved in energy conversion. Mitochondria generate ATP through aerobic respiration, with energy-producing processes occurring along the cristae and within the matrix. In contrast, chloroplasts capture light energy to drive photosynthesis; they have thylakoid membranes organized into grana to maximize light absorption and stroma where the Calvin cycle takes place. Although both organelles contain their own DNA and ribosomes and divide by fission, their roles in energy transformation differ significantly in terms of substrates and environmental conditions.",
    "explanation": "The answer outlines how similar structural features (such as double membranes and internal membrane infoldings) in mitochondria and chloroplasts relate to their energy conversion roles, while also clarifying the distinct metabolic pathways they support.",
    "topic": "Mitochondria and Plastids",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen082"
  },
  {
    "question_text": "Analyze the role of the cytoskeleton and associated structures like cilia, flagella, and centrioles in maintaining cell structure and facilitating cell movement.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The cytoskeleton is a network of microtubules, microfilaments, and intermediate filaments that provides structural support, maintains cell shape, and enables intracellular transport. Cilia and flagella, which extend from the cell surface, contain a 9+2 arrangement of microtubules and are responsible for motility either of the cell itself or of extracellular fluids. Centrioles, found within the centrosome, play a key role in organizing microtubules during cell division and act as basal bodies for cilia and flagella formation. Together, these components integrate to support both the structural integrity and dynamic functions of eukaryotic cells.",
    "explanation": "This answer provides an in-depth analysis of the cytoskeleton and its related structures, explaining how each contributes to both maintaining cell architecture and enabling movement.",
    "topic": "Cytoskeleton, Cilia, Flagella, and Centrosomes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen083"
  },
  {
    "question_text": "True or False: The plasma membrane is composed solely of lipids.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The plasma membrane is composed mainly of lipids, but it also contains proteins and carbohydrates that play crucial roles in cellular functions.",
    "topic": "Cell Membrane",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen084"
  },
  {
    "question_text": "True or False: The Golgi apparatus is a component of the endomembrane system that modifies and packages proteins and lipids.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The Golgi apparatus plays a central role in the endomembrane system by processing, modifying, and packaging proteins and lipids for transport.",
    "topic": "Golgi Apparatus and Endomembrane System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen085"
  },
  {
    "question_text": "True or False: Ribosomes in eukaryotic cells have a sedimentation coefficient of 70S.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Eukaryotic ribosomes are 80S, not 70S, which is the type found in prokaryotic cells.",
    "topic": "Ribosomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen086"
  },
  {
    "question_text": "True or False: The inner membrane of chloroplasts is less permeable than the outer membrane.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The inner membrane of chloroplasts is relatively less permeable and helps maintain the internal environment necessary for the light-independent reactions of photosynthesis.",
    "topic": "Chloroplast Structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen087"
  },
  {
    "question_text": "True or False: Both cilia and flagella in eukaryotic cells emerge from basal bodies derived from centrioles.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Cilia and flagella share a common origin in basal bodies, which are derived from centrioles.",
    "topic": "Cilia and Flagella",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen088"
  },
  {
    "question_text": "True or False: Nuclear pores in the nuclear envelope allow the movement of RNA and protein molecules between the nucleus and cytoplasm.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Nuclear pores are essential structures that regulate the exchange of molecules such as RNA and proteins between the nucleus and cytoplasm.",
    "topic": "Nucleus",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen089"
  },
  {
    "question_text": "Calculate the percentage of carbohydrates and other components in a human red blood cell membrane if it contains 52% protein and 40% lipids.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "8%",
    "explanation": "Since the membrane is 100% in total, subtracting the protein and lipid percentages (52% + 40% = 92%) leaves 8% for carbohydrates and other components.",
    "topic": "Cell Membrane Composition",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen090"
  },
  {
    "question_text": "In a plant cell with a total volume of 1000 μm³, if the vacuole occupies up to 90% of the cell volume, what is the approximate volume of the vacuole?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "900 μm³",
    "explanation": "90% of 1000 μm³ is 900 μm³, which is the volume occupied by the vacuole.",
    "topic": "Vacuoles",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo108",
    "section_id": "06_section_8_5",
    "question_id": "cbse_xi_kebo1dd_c108_gen091"
  }
]