[
  {
    "question_text": "Which of the following best describes the primary structure of an enzyme?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "The three-dimensional folded structure of the enzyme",
      "The sequence of amino acids in the protein chain",
      "The active pocket where substrate binds",
      "The quaternary arrangement of subunits"
    ],
    "correct_answer": "The sequence of amino acids in the protein chain",
    "explanation": "The primary structure refers to the specific linear sequence of amino acids in the enzyme's protein chain.",
    "topic": "Enzyme structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen128"
  },
  {
    "question_text": "What is the term for the pocket or crevice on an enzyme where the substrate binds?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Allosteric site",
      "Active site",
      "Binding motif",
      "Catalytic center"
    ],
    "correct_answer": "Active site",
    "explanation": "The active site is the specific region of an enzyme where the substrate binds and the reaction is catalyzed.",
    "topic": "Active site and enzyme catalysis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen129"
  },
  {
    "question_text": "Which cofactor is tightly bound to an enzyme and is known as a prosthetic group?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Vitamin-derived coenzyme",
      "Metal ion",
      "Haem group in peroxidase",
      "Transient coenzyme"
    ],
    "correct_answer": "Haem group in peroxidase",
    "explanation": "A prosthetic group is an organic compound that is tightly bound to the enzyme. In peroxidase, the haem group serves as a prosthetic group.",
    "topic": "Co-factors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen130"
  },
  {
    "question_text": "Which type of inhibitor closely resembles the substrate in structure and competes for binding at the active site?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Non-competitive inhibitor",
      "Uncompetitive inhibitor",
      "Competitive inhibitor",
      "Irreversible inhibitor"
    ],
    "correct_answer": "Competitive inhibitor",
    "explanation": "Competitive inhibitors have a structure similar to the substrate and compete for binding at the enzyme's active site, thereby reducing the enzyme's activity.",
    "topic": "Enzyme inhibition",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen131"
  },
  {
    "question_text": "Which of the following enzyme classes catalyzes the transfer of a functional group between substrates?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Oxidoreductases",
      "Transferases",
      "Hydrolases",
      "Lyases"
    ],
    "correct_answer": "Transferases",
    "explanation": "Transferases are enzymes that transfer a group (other than hydrogen) from one molecule to another. This distinguishes them from other classes like oxidoreductases and hydrolases.",
    "topic": "Classification and nomenclature of enzymes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen132"
  },
  {
    "question_text": "Explain how the tertiary structure of an enzyme is related to its function.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The tertiary structure refers to the overall three-dimensional folding of the enzyme, which creates specific crevices or pockets (including the active site) essential for substrate binding and catalytic activity.",
    "explanation": "An enzyme's function depends on its three-dimensional shape. The folding of the protein chain forms an active site with the proper orientation and environment needed to facilitate the chemical reaction.",
    "topic": "Enzyme structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen133"
  },
  {
    "question_text": "Describe the role of the enzyme-substrate (ES) complex in catalysis.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The enzyme-substrate (ES) complex is a transient complex where the substrate binds to the enzyme's active site, allowing the enzyme to lower the activation energy and convert the substrate into the product(s).",
    "explanation": "The formation of the ES complex is the critical first step in enzyme catalysis. It positions the substrate in the right orientation for chemical bond breaking and making, leading to the formation of the product.",
    "topic": "Enzyme catalysis",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen134"
  },
  {
    "question_text": "Define the transition state in an enzyme-catalyzed reaction and its importance.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The transition state is a high-energy, unstable intermediate configuration of the substrate during the conversion to the product. It is important because enzymes lower the activation energy required to reach this state, thereby speeding up the reaction.",
    "explanation": "The transition state represents the peak of the energy barrier in a reaction pathway. Enzymes stabilize this state, reducing the energy required to reach it and thus accelerating the overall reaction.",
    "topic": "Activation energy and transition state",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen135"
  },
  {
    "question_text": "Discuss the steps involved in the catalytic cycle of an enzyme from substrate binding to product release.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The catalytic cycle begins with the substrate binding to the enzyme's active site, forming an enzyme-substrate (ES) complex. This binding often induces a conformational change in the enzyme to better fit the substrate. The enzyme then facilitates the breaking and making of bonds as the substrate is converted into the product through a transient transition state. Once the reaction is complete, the enzyme-product (EP) complex forms before finally releasing the product. Thereafter, the enzyme is free to bind with another substrate molecule and repeat the cycle.",
    "explanation": "This detailed description outlines each step of enzyme catalysis, highlighting the importance of the ES complex, conformational changes, transition state, and product release in ensuring efficient catalysis.",
    "topic": "Mechanism of enzyme action",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen136"
  },
  {
    "question_text": "Compare and contrast the effects of temperature and pH on enzyme activity. In your answer, include a discussion of optimal conditions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Both temperature and pH significantly affect enzyme activity by influencing the enzyme's structure. Enzymes have an optimum temperature and pH at which their activity is maximal. Temperature increases reaction rates up to a point; however, if the temperature exceeds the optimum (usually around 40°C for most enzymes), the enzyme may denature and lose its function. Similarly, enzymes have an optimal pH, and deviations from this optimal value can alter the ionic bonds and structure of the enzyme, leading to reduced activity. In contrast, low temperatures may slow down the reaction without denaturing the enzyme, preserving its structure but reducing the reaction velocity.",
    "explanation": "This response compares the dual effects of temperature and pH, focusing on how both factors influence enzyme conformation and activity. The explanation clearly addresses optimum conditions and the negative impacts of deviations.",
    "topic": "Factors affecting enzyme activity",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen137"
  },
  {
    "question_text": "True or False: Almost all enzymes are proteins, but there are nucleic acids called ribozymes that can behave like enzymes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Although most enzymes are proteins, ribozymes are nucleic acids that have catalytic properties, confirming the statement.",
    "topic": "Enzyme composition",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen138"
  },
  {
    "question_text": "True or False: Competitive inhibitors bind to a site other than the active site, thereby reducing the enzyme activity indirectly.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Competitive inhibitors resemble the substrate and directly bind to the active site, blocking the substrate from binding.",
    "topic": "Enzyme inhibition",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen139"
  },
  {
    "question_text": "True or False: Enzymes lower the activation energy of a reaction, which makes the transition from substrate to product easier.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Enzymes act as catalysts by lowering the activation energy required for a reaction, thereby facilitating the conversion of substrate to product.",
    "topic": "Activation energy",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen140"
  },
  {
    "question_text": "True or False: An enzyme permanently changes its structure after completing one catalytic cycle.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "After completing a catalytic cycle, an enzyme releases its product and remains unchanged, ready to bind to another substrate molecule.",
    "topic": "Enzyme activity and catalysis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen141"
  },
  {
    "question_text": "True or False: Enzyme activity can be regulated by specific chemicals that act as inhibitors by binding to the enzyme.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Enzyme activity can indeed be regulated by inhibitors, which bind either to the active site or another site on the enzyme, affecting its activity.",
    "topic": "Regulation of enzyme activity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen142"
  },
  {
    "question_text": "A reaction, in the absence of carbonic anhydrase, produces 200 molecules of carbonic acid in one hour. When catalyzed by carbonic anhydrase, the reaction produces 600,000 molecules per second. Calculate approximately how many times the enzyme increases the reaction rate.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 10 million times",
    "explanation": "First, convert 600,000 molecules per second to per hour by multiplying by 3600, yielding about 2.16 billion molecules per hour. Dividing 2.16 billion by 200 gives approximately 10,800,000, which is in the order of 10 million times increase in the reaction rate.",
    "topic": "Enzyme catalysis and reaction rate",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo109",
    "section_id": "09_section_9_8",
    "question_id": "cbse_xi_kebo1dd_c109_gen143"
  }
]