[
  {
    "question_text": "Briefly describe the structure of the Brain.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The brain is divided into three major parts: the forebrain, midbrain, and hindbrain. The forebrain includes the cerebrum, thalamus, and hypothalamus, with the cerebrum further divided into left and right hemispheres connected by the corpus callosum. It features a cerebral cortex (grey matter) and internal white matter. The midbrain is located between the forebrain and hindbrain and contains structures such as the corpora quadrigemina. The hindbrain consists of the pons, cerebellum, and medulla oblongata, with the medulla connecting to the spinal cord.",
    "explanation": "This answer describes the major divisions and structures of the brain as outlined in section 18.4 of the chapter, noting key features such as cerebral hemispheres, corpus callosum, and subdivision of the brain into forebrain, midbrain, and hindbrain.",
    "topic": "Central Neural System, Human Brain",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex001"
  },
  {
    "question_text": "Compare the following: (a) Central neural system (CNS) and Peripheral neural system (PNS); (b) Resting potential and action potential.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For (a) the CNS is comprised of the brain and spinal cord and serves as the main processing and control center, while the PNS includes all the nerves that branch out from the CNS and is divided into somatic and autonomic systems; for (b) resting potential is the electrical potential across a neuron's membrane when it is at rest, maintained by ion gradients and the sodium-potassium pump, whereas an action potential is a rapid reversal of this polarity (depolarization followed by repolarization) that travels along the axon.",
    "explanation": "The comparison highlights the fundamental differences in structure and function between CNS and PNS as described in section 18.2. It also explains that the resting potential is the stable state of the neuron and that the action potential is the active process of transmitting a signal along the nerve fibre as detailed in section 18.3.1.",
    "topic": "Human Neural System and Generation of Nerve Impulse",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex002"
  },
  {
    "question_text": "Explain the following processes: (a) Polarisation of the membrane of a nerve fibre; (b) Depolarisation of the membrane of a nerve fibre; (c) Transmission of a nerve impulse across a chemical synapse.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Polarisation refers to the state of a neuron when the inside of the axon has a negative charge relative to the outside, maintained by differential ion permeability and the sodium-potassium pump. Depolarisation is the process by which a stimulus causes the membrane to become permeable to Na+ ions, leading to an influx of Na+ and a reversal of the membrane’s potential at the stimulated site. Transmission across a chemical synapse involves the arrival of an action potential at the axon terminal, triggering the fusion of synaptic vesicles with the membrane and the release of neurotransmitters into the synaptic cleft, which then bind to receptors on the postsynaptic neuron to generate a new potential.",
    "explanation": "This answer covers the sequential events: the stabilised polarized state of the neuron (resting potential), the initiation of the action potential by depolarisation due to Na+ influx, and how the chemical synapse converts the electrical signal into a chemical signal, which then triggers a response in the next neuron. These processes are explained in sections 18.3.1 and 18.3.2.",
    "topic": "Generation and Conduction of Nerve Impulse, Transmission of Impulses",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex003"
  },
  {
    "question_text": "Draw labelled diagrams of the following: (a) Neuron; (b) Brain.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For the neuron, the diagram should include the cell body (soma) with the nucleus and Nissl's granules, dendrites receiving signals, and a long axon with a myelin sheath (if myelinated), Nodes of Ranvier, and axon terminals (synaptic knobs). For the brain, the diagram should depict the major parts including the forebrain (with cerebrum, thalamus, and hypothalamus), midbrain, and hindbrain (including pons, cerebellum, and medulla).",
    "explanation": "The answer describes the essential labels and structures needed in the diagrams as per the descriptions in sections 18.3 and 18.4. Drawing these diagrams demonstrates comprehension of the spatial organisation and key features of the neuron and the human brain.",
    "topic": "Neuron Structure and Central Neural System",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex004"
  },
  {
    "question_text": "Write short notes on the following: (a) Neural coordination; (b) Forebrain; (c) Midbrain; (d) Hindbrain; (e) Synapse.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Neural coordination involves the rapid transmission of signals through neurons that enable reflex actions and complex processing in the brain. The forebrain consists of the cerebrum, thalamus, and hypothalamus, and is responsible for higher functions including sensory processing, voluntary movement, and regulation of autonomic functions. The midbrain is located between the forebrain and hindbrain, containing components such as the corpora quadrigemina. The hindbrain includes the pons, cerebellum, and medulla, where vital functions like respiration and balance are controlled. A synapse is the junction between two neurons where neurotransmitters are released to propagate nerve impulses.",
    "explanation": "These short notes summarize key information from the chapter regarding neural coordination and major brain regions, as well as the function of synapses, effectively capturing the essence of the topics in a concise format.",
    "topic": "Neural Coordination and Brain Regions",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex005"
  },
  {
    "question_text": "Give a brief account of Mechanism of synaptic transmission.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When an action potential reaches the axon terminal of a presynaptic neuron, it triggers the fusion of synaptic vesicles with the membrane, leading to the release of neurotransmitters into the synaptic cleft. These neurotransmitters then bind to specific receptors on the postsynaptic membrane, causing ion channels to open and a new potential to be generated in the postsynaptic neuron, which can be either excitatory or inhibitory.",
    "explanation": "The explanation follows the process outlined in section 18.3.2, detailing how the electrical signal is converted to a chemical one at the synapse and then back to an electrical signal in the postsynaptic neuron.",
    "topic": "Transmission of Impulses, Synapse",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex006"
  },
  {
    "question_text": "Explain the role of Na+ in the generation of action potential.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Na+ plays a crucial role in the generation of an action potential by entering the neuron when a stimulus increases the membrane's permeability to sodium ions. This influx of Na+ reverses the resting negative potential of the neuron (depolarization), initiating the action potential that propagates along the axon.",
    "explanation": "The answer is based on the process described in section 18.3.1, where the rise in sodium permeability leads to depolarization, which is fundamental to nerve impulse generation.",
    "topic": "Generation and Conduction of Nerve Impulse",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex007"
  },
  {
    "question_text": "Differentiate between: (a) Myelinated and non-myelinated axons; (b) Dendrites and axons; (c) Thalamus and Hypothalamus; (d) Cerebrum and Cerebellum.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Myelinated axons are covered by a myelin sheath formed by Schwann cells, which speeds up impulse conduction, whereas non-myelinated axons lack this sheath and conduct impulses more slowly. Dendrites are short, branched processes that receive incoming signals and transmit them to the cell body, while axons are long projections that transmit impulses away from the cell body toward other neurons or effectors. The thalamus acts as a major relay station for sensory and motor signals to the cerebral cortex, whereas the hypothalamus is involved in regulating functions such as temperature, hunger, thirst, and the circadian rhythm, as well as controlling the endocrine system. The cerebrum, the largest part of the brain, is responsible for higher brain functions such as thought, emotion, and voluntary movement, while the cerebellum primarily regulates coordination, balance, and fine motor control.",
    "explanation": "The answer provides clear distinctions between pairs based on structure and function as discussed in sections 18.3 and 18.4 of the chapter. It highlights the importance of myelination, the roles of dendrites versus axons, and the specific responsibilities of different brain regions.",
    "topic": "Neuron Structure and Brain Organization",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex008"
  },
  {
    "question_text": "Answer the following: (a) Which part of the human brain is the most developed? (b) Which part of our central neural system acts as a master clock?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(a) The cerebrum is the most developed part of the human brain. (b) The hypothalamus, particularly the suprachiasmatic nucleus within it, functions as the master clock regulating circadian rhythms.",
    "explanation": "The cerebrum is noted for its advanced structure and functions, making it the most developed part of the brain. The hypothalamus is responsible for regulating various autonomic functions, including circadian rhythms, by acting as a master clock.",
    "topic": "Forebrain, Central Neural System",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex009"
  },
  {
    "question_text": "Distinguish between: (a) Afferent neurons and efferent neurons; (b) Impulse conduction in a myelinated nerve fibre and an unmyelinated nerve fibre; (c) Cranial nerves and spinal nerves.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Afferent neurons transmit sensory information from peripheral tissues to the CNS, whereas efferent neurons relay motor commands from the CNS to peripheral effectors. In myelinated nerve fibres, the presence of a myelin sheath allows for saltatory conduction, which is much faster than the continuous conduction seen in unmyelinated nerve fibres. Cranial nerves emerge from the brain and primarily serve the head and neck, while spinal nerves emerge from the spinal cord and innervate the rest of the body.",
    "explanation": "The answer differentiates between the types of neurons based on the direction of impulse transmission, the conduction speed based on myelination, and the origin as well as target regions of cranial versus spinal nerves. These distinctions are drawn from the descriptions in sections 18.2 and 18.3.",
    "topic": "Neural Impulse Conduction and Peripheral Neural System",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex010"
  }
]