[
  {
    "question_text": "Which type of hormone produced by the hypothalamus stimulates the synthesis and secretion of pituitary hormones?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Releasing hormones",
      "Inhibiting hormones",
      "Both releasing and inhibiting hormones",
      "None of the above"
    ],
    "correct_answer": "Releasing hormones",
    "explanation": "The hypothalamus produces two types of hormones: releasing hormones that stimulate the secretion of pituitary hormones and inhibiting hormones that block their secretion. In this case, the stimulating function is due to releasing hormones.",
    "topic": "The Hypothalamus",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen019"
  },
  {
    "question_text": "Which of the following hormones is secreted by the pars intermedia of the pituitary?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Growth Hormone (GH)",
      "Prolactin (PRL)",
      "Thyroid Stimulating Hormone (TSH)",
      "Melanocyte Stimulating Hormone (MSH)"
    ],
    "correct_answer": "Melanocyte Stimulating Hormone (MSH)",
    "explanation": "The pars intermedia of the pituitary primarily secretes Melanocyte Stimulating Hormone (MSH), although in humans it is nearly merged with the pars distalis.",
    "topic": "The Pituitary Gland",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen020"
  },
  {
    "question_text": "What disorder is primarily caused by iodine deficiency in the diet?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Hypothyroidism and goitre",
      "Hyperthyroidism",
      "Diabetes insipidus",
      "Addison's disease"
    ],
    "correct_answer": "Hypothyroidism and goitre",
    "explanation": "Iodine is essential for the synthesis of thyroid hormones. A deficiency leads to hypothyroidism and an enlargement of the thyroid gland, known as goitre.",
    "topic": "Thyroid Gland",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen021"
  },
  {
    "question_text": "Which hormones are secreted by the adrenal medulla?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Cortisol and Aldosterone",
      "Androgens",
      "Adrenaline and Noradrenaline",
      "Insulin and Glucagon"
    ],
    "correct_answer": "Adrenaline and Noradrenaline",
    "explanation": "The adrenal medulla produces catecholamines, specifically adrenaline (epinephrine) and noradrenaline (norepinephrine), which are released during stress responses.",
    "topic": "Adrenal Gland",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen022"
  },
  {
    "question_text": "Which cells in the Islets of Langerhans are responsible for the secretion of glucagon?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "α-cells",
      "β-cells",
      "δ-cells",
      "F-cells"
    ],
    "correct_answer": "α-cells",
    "explanation": "In the Islets of Langerhans of the pancreas, α-cells secrete glucagon, which plays a key role in increasing blood glucose levels.",
    "topic": "Pancreas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen023"
  },
  {
    "question_text": "Define the two types of hormones produced by the hypothalamus and state their primary roles.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The hypothalamus produces releasing hormones that stimulate the secretion of pituitary hormones and inhibiting hormones that suppress the secretion of pituitary hormones.",
    "explanation": "This answer identifies both types of hormones produced by the hypothalamus and explains their roles in regulating pituitary functions.",
    "topic": "The Hypothalamus",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen024"
  },
  {
    "question_text": "Explain the structural divisions of the pituitary gland and the primary hormone(s) produced by each division.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The pituitary gland is divided into the adenohypophysis (anterior pituitary) and the neurohypophysis (posterior pituitary). The adenohypophysis, which includes the pars distalis and pars intermedia, produces hormones such as GH, PRL, TSH, ACTH, LH, FSH, and MSH. The neurohypophysis stores and releases oxytocin and vasopressin, which are synthesized in the hypothalamus.",
    "explanation": "This answer outlines the two main divisions of the pituitary gland and provides examples of the hormones produced or stored in each division.",
    "topic": "Pituitary Gland",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen025"
  },
  {
    "question_text": "Describe the effects of thyroid hormones on metabolic processes in the body.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Thyroid hormones regulate the basal metabolic rate, support red blood cell production, and control the metabolism of carbohydrates, proteins, and fats, as well as maintaining water and electrolyte balance.",
    "explanation": "The response details the multifaceted roles of thyroid hormones, highlighting their broad impact on metabolic processes and homeostasis.",
    "topic": "Thyroid Gland",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen026"
  },
  {
    "question_text": "Discuss the hormonal interaction between the hypothalamus and the pituitary gland in regulating endocrine functions.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The hypothalamus produces releasing and inhibiting hormones that travel via the portal circulation to the anterior pituitary, where they regulate the release of various hormones. Additionally, the posterior pituitary is under direct neural control via hypothalamic nerve endings, which ensures precise hormone release into the bloodstream.",
    "explanation": "This answer analyzes how the hypothalamus and pituitary gland interact, highlighting the different pathways and control mechanisms for anterior and posterior pituitary hormone regulation.",
    "topic": "The Hypothalamus and Pituitary Gland",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen027"
  },
  {
    "question_text": "Describe the structure of the adrenal gland and discuss the functions of its different regions, including the hormones they secrete.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The adrenal gland consists of two main regions: the adrenal cortex and the adrenal medulla. The cortex is further divided into three layers: the zona glomerulosa, which synthesizes mineralocorticoids (primarily aldosterone) for electrolyte and water balance; the zona fasciculata, which produces glucocorticoids (such as cortisol) that are involved in metabolism, anti-inflammatory responses, and cardiovascular functions; and the zona reticularis, which secretes small amounts of androgenic steroids. The adrenal medulla produces catecholamines, specifically adrenaline and noradrenaline, which are crucial for the fight or flight response.",
    "explanation": "This detailed answer describes both the anatomical structure and the functional significance of each region of the adrenal gland, linking the specific hormone secretions to their physiological roles.",
    "topic": "Adrenal Gland",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen028"
  },
  {
    "question_text": "Explain the role of the pancreas in maintaining blood glucose levels and analyze how dysregulation of its hormonal output can lead to diabetes mellitus.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The pancreas maintains blood glucose levels through the balanced actions of insulin and glucagon produced by the β-cells and α-cells, respectively, within the Islets of Langerhans. Insulin promotes the uptake of glucose by cells and its storage as glycogen, thereby lowering blood sugar levels. Glucagon, on the other hand, stimulates glycogenolysis and gluconeogenesis in the liver, increasing blood glucose levels. Dysregulation, whether by insufficient insulin secretion or resistance to its effects, disrupts this balance, leading to chronic hyperglycemia, the hallmark of diabetes mellitus.",
    "explanation": "The answer clearly explains the antagonistic roles of insulin and glucagon in blood glucose regulation and discusses how an imbalance in these hormones can result in diabetes mellitus.",
    "topic": "Pancreas",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen029"
  },
  {
    "question_text": "Compare and contrast the endocrine functions of the testis and ovary, including the hormones produced and their effects on secondary sex characteristics and reproductive functions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The testis, located in the scrotum, functions as a primary sex organ and endocrine gland by producing androgens (mainly testosterone) from Leydig cells. Testosterone is essential for the development of male secondary sexual characteristics such as facial hair, a deeper voice, and increased muscle mass, as well as for stimulating spermatogenesis. In contrast, the ovary produces estrogens and progesterone. Estrogens are critical for the development of female secondary sexual characteristics, the growth of ovarian follicles, and the regulation of the menstrual cycle, while progesterone, secreted by the corpus luteum after ovulation, supports pregnancy by preparing the uterus for implantation. Thus, while both organs are involved in reproduction, they secrete different hormones that lead to distinct physiological outcomes in males and females.",
    "explanation": "This response provides a thorough comparison of the endocrine roles of the testis and ovary, highlighting both the similarities and differences in hormone production and their physiological effects.",
    "topic": "Sex Glands",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen030"
  },
  {
    "question_text": "Melatonin secreted by the pineal gland regulates the 24-hour sleep-wake cycle.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Melatonin is the key hormone produced by the pineal gland and is essential for the regulation of the circadian rhythm, including the sleep-wake cycle.",
    "topic": "Pineal Gland",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen031"
  },
  {
    "question_text": "The parathyroid hormone (PTH) decreases blood calcium levels.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "PTH is a hypercalcemic hormone that increases blood calcium levels by stimulating bone resorption, increasing calcium reabsorption in the kidneys, and enhancing calcium absorption in the gut.",
    "topic": "Parathyroid Gland",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen032"
  },
  {
    "question_text": "Oxytocin and vasopressin are synthesized in the posterior pituitary.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Although oxytocin and vasopressin are released by the posterior pituitary, they are actually synthesized in the hypothalamus and then transported to the posterior pituitary for storage and release.",
    "topic": "Pituitary Gland",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen033"
  },
  {
    "question_text": "Cortisol produced by the adrenal cortex only acts to increase blood glucose levels.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "While cortisol does stimulate gluconeogenesis and can increase blood glucose levels, it also has anti-inflammatory properties and affects protein and lipid metabolism, among other functions.",
    "topic": "Adrenal Gland",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen034"
  },
  {
    "question_text": "The thymus is solely responsible for developing T-lymphocytes for cell-mediated immunity.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Although the thymus plays a major role in the differentiation of T-lymphocytes, it also indirectly promotes antibody production and hence supports both cell-mediated and humoral immunity.",
    "topic": "Thymus",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen035"
  },
  {
    "question_text": "Insulin lowers blood glucose levels by enhancing its uptake by cells.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Insulin facilitates the uptake of glucose by cells, particularly in the liver and adipose tissue, thereby reducing the blood glucose concentration.",
    "topic": "Pancreas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen036"
  },
  {
    "question_text": "Approximately what percentage of the pancreatic tissue is composed of the Islets of Langerhans?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1 to 2 percent",
    "explanation": "The Islets of Langerhans account for about 1 to 2 percent of the pancreatic tissue, despite containing vital endocrine cells.",
    "topic": "Pancreas",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen037"
  },
  {
    "question_text": "Into how many layers is the adrenal cortex divided?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Three",
    "explanation": "The adrenal cortex is divided into three layers: the zona glomerulosa, zona fasciculata, and zona reticularis, each responsible for secreting different types of hormones.",
    "topic": "Adrenal Gland",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo119",
    "section_id": "03_section_19_2",
    "question_id": "cbse_xi_kebo1dd_c119_gen038"
  }
]