[
  {
    "question_text": "Name the components of the formed elements in the blood and mention one major function of each of them.",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The formed elements of blood include erythrocytes, leucocytes, and platelets. Erythrocytes (red blood cells) are mainly responsible for gas transport (carrying oxygen and carbon dioxide); leucocytes (white blood cells) play a key role in defense mechanisms and immune responses; and platelets are crucial for blood clotting (coagulation).",
    "explanation": "This answer lists the three formed elements present in blood and explains the primary function of each. Erythrocytes are abundant and carry hemoglobin, leucocytes are involved in immunity and fighting infections, and platelets contribute to the clotting process necessary to prevent blood loss.",
    "topic": "Formed Elements in Blood",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex001"
  },
  {
    "question_text": "What is the importance of plasma proteins?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Plasma proteins serve several important functions: fibrinogen is essential for blood clotting, globulins function in the body’s defense mechanisms, and albumins help maintain osmotic balance. They also contribute to the transport of various substances in the blood.",
    "explanation": "Plasma proteins are significant because they perform multiple roles including coagulation (fibrinogen), immune response (globulins), and regulation of osmotic pressure (albumins) which is vital in maintaining fluid balance across blood vessels.",
    "topic": "Plasma",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex002"
  },
  {
    "question_text": "Match Column I with Column II:\n\nColumn I:\n(a) Eosinophils\n(b) RBC\n(c) AB Group\n(d) Platelets\n(e) Systole\n\nColumn II:\n(i) Coagulation\n(ii) Universal Recipient\n(iii) Resist Infections\n(iv) Contraction of Heart\n(v) Gas transport",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Option A: a - Resist Infections, b - Gas transport, c - Universal Recipient, d - Coagulation, e - Contraction of Heart",
      "Option B: a - Coagulation, b - Gas transport, c - Universal Recipient, d - Resist Infections, e - Contraction of Heart",
      "Option C: a - Resist Infections, b - Contraction of Heart, c - Gas transport, d - Coagulation, e - Universal Recipient",
      "Option D: a - Gas transport, b - Resist Infections, c - Universal Recipient, d - Contraction of Heart, e - Coagulation"
    ],
    "correct_answer": "Option A: a - Resist Infections, b - Gas transport, c - Universal Recipient, d - Coagulation, e - Contraction of Heart",
    "explanation": "Each element from Column I is correctly paired with its function or characteristic in Column II. Eosinophils help resist infections, RBCs transport gases due to hemoglobin, AB blood group individuals are universal recipients, platelets are involved in blood coagulation, and systole refers to the contraction phase of the heart.",
    "topic": "Blood Components & Cardiac Function",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex003"
  },
  {
    "question_text": "Why do we consider blood as a connective tissue?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Blood is considered a connective tissue because it originates from mesenchymal cells, consists of a fluid matrix (plasma) in which cells (formed elements) are suspended, and helps in connecting body systems by transporting nutrients, gases, waste products, and immune cells.",
    "explanation": "Unlike typical tissues, blood has a liquid extracellular matrix (plasma) that binds various cellular components, which is a key characteristic of connective tissues. Its role in transport and defense further supports its classification as connective tissue.",
    "topic": "Blood",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex004"
  },
  {
    "question_text": "What is the difference between lymph and blood?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Blood is a circulatory fluid composed of plasma and formed elements (cells and cell fragments) that contains clotting factors, whereas lymph is the tissue fluid that collects in the lymphatic system, is essentially similar to plasma in mineral content but lacks most of the formed elements and clotting factors.",
    "explanation": "The primary differences lie in composition and function. Blood contains components like red and white cells and platelets along with clotting factors and proteins, while lymph is mostly a filtrate of plasma, maintaining similar mineral balance but without the cellular elements and clotting proteins, and mainly carries lymphocytes for immune responses.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex005"
  },
  {
    "question_text": "What is meant by double circulation? What is its significance?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Double circulation refers to the separation of the circulatory pathway into two distinct circuits: one circuit carries deoxygenated blood from the heart to the lungs (pulmonary circulation) and the other circuit carries oxygenated blood from the heart to the body (systemic circulation). Its significance lies in allowing efficient oxygenation of blood and ensuring that oxygen-rich blood is delivered separately to the tissues, thereby maximizing the efficiency of nutrient and gas exchange.",
    "explanation": "By separating the flow of blood into pulmonary and systemic circuits, the heart ensures that deoxygenated and oxygenated blood do not mix, which increases the efficiency of gas exchange in the lungs and the delivery of oxygen to tissues. This separation is critical for maintaining high metabolic activity in organs.",
    "topic": "Circulatory Pathways",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex006"
  },
  {
    "question_text": "Write the differences between:\n(a) Blood and Lymph\n(b) Open and Closed system of circulation\n(c) Systole and Diastole\n(d) P-wave and T-wave",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "(a) Blood is a fluid connective tissue that contains plasma, cells, and clotting factors, whereas lymph is derived from the interstitial fluid, lacking most formed elements and clotting factors. (b) In an open circulatory system, blood flows freely into body cavities (sinuses) and is not confined entirely within vessels, while in a closed system, blood is contained within a network of vessels. (c) Systole is the phase of the cardiac cycle during which the heart muscles contract and pump blood out of the chambers, while diastole is the relaxation phase when the heart chambers fill with blood. (d) The P-wave of an ECG represents the depolarization (excitation) of the atria, whereas the T-wave represents the repolarization (return to resting state) of the ventricles.",
    "explanation": "Each part of the question requires comparing two related concepts. The answer clearly differentiates between blood and lymph by composition and function, distinguishes between the open and closed circulatory systems based on the confinement of blood, contrasts systole and diastole based on the phases of heart activity, and explains the distinct features of ECG segments (P-wave vs. T-wave).",
    "topic": "Blood, Circulatory System, and ECG",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex007"
  },
  {
    "question_text": "Describe the evolutionary change in the pattern of heart among the vertebrates.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The evolution of the heart in vertebrates shows a progression from simple to complex structures. Fishes possess a 2-chambered heart with a single circulation system. Amphibians and most reptiles have a 3-chambered heart with two atria and one ventricle, leading to incomplete separation of oxygenated and deoxygenated blood. In contrast, birds and mammals have a 4-chambered heart with complete separation of the atria and ventricles, which allows for double circulation and more efficient oxygenation.",
    "explanation": "This answer outlines the key changes in heart structure throughout vertebrate evolution. The addition of chambers and the development of complete separation in birds and mammals are critical adaptations that support higher metabolic demands and more efficient oxygen delivery.",
    "topic": "Circulatory Pathways",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex008"
  },
  {
    "question_text": "Why do we call our heart myogenic?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Our heart is called myogenic because it has the inherent ability to generate its own electrical impulses without any external stimulation, due to the specialized nodal tissues within the cardiac muscle.",
    "explanation": "The term myogenic refers to the spontaneous generation of electrical impulses by the heart muscle itself, particularly through structures like the sino-atrial node, which ensures continuous rhythmic contractions.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex009"
  },
  {
    "question_text": "Sino-atrial node is called the pacemaker of our heart. Why?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The sino-atrial node is called the pacemaker because it is capable of generating the highest number of action potentials (70–75 per minute) which initiates and regulates the heartbeat by setting the heart's rhythm.",
    "explanation": "The sino-atrial node's autoexcitable property and its ability to set the pace of the heart’s contractions make it the natural pacemaker, ensuring that the heart beats in a regular and coordinated manner.",
    "topic": "Electrocardiograph (ECG) and Cardiac Cycle",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex010"
  },
  {
    "question_text": "What is the significance of atrio-ventricular node and atrio-ventricular bundle in the functioning of heart?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The atrio-ventricular (AV) node and AV bundle are critical for the proper conduction and timing of electrical impulses. The AV node delays the impulse from the atria, allowing the ventricles enough time to fill with blood, while the AV bundle transmits the impulse through the ventricular septum to ensure that the ventricular contraction occurs in a coordinated manner.",
    "explanation": "The delay provided by the AV node ensures efficient filling of the ventricles, and the conduction through the AV bundle (and further branching into Purkinje fibers) guarantees that the contraction of the ventricles is synchronized, which is essential for effective pumping of blood.",
    "topic": "Human Circulatory System and Cardiac Cycle",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex011"
  },
  {
    "question_text": "Define a cardiac cycle and the cardiac output.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A cardiac cycle is the complete sequence of events in the heart involving both systole (contraction) and diastole (relaxation) of the atria and ventricles. Cardiac output is defined as the amount of blood pumped out by each ventricle per minute, typically about 5000 mL in a healthy individual.",
    "explanation": "The cardiac cycle encompasses all the phases of heart activity that occur with each beat. Cardiac output, calculated by multiplying the stroke volume by the heart rate, measures the efficiency of the heart in maintaining circulation.",
    "topic": "Cardiac Cycle",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex012"
  },
  {
    "question_text": "Explain heart sounds.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Heart sounds, commonly described as 'lub' and 'dub', are produced by the closing of heart valves. The first heart sound ('lub') is associated with the closure of the tricuspid and bicuspid (mitral) valves, while the second heart sound ('dub') is related to the closure of the semilunar valves. These sounds are important for diagnosing cardiac function.",
    "explanation": "The distinct 'lub-dub' sounds correspond to specific valve closures in the cardiac cycle. Their timing and quality provide crucial clinical insights into the functioning of the heart, making them valuable in physical examinations.",
    "topic": "Cardiac Cycle and Heart Sounds",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex013"
  },
  {
    "question_text": "Draw a standard ECG and explain the different segments in it.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A standard ECG tracing includes several key segments: the P-wave represents atrial depolarization, the QRS complex represents ventricular depolarization which leads to ventricular contraction, and the T-wave represents ventricular repolarization. The intervals and segments between these waves (such as the PR interval and ST segment) provide information about the conduction time and recovery of the heart muscle.",
    "explanation": "This answer outlines the major components of an ECG tracing, correlating each segment with specific electrical events in the heart. The P-wave, QRS complex, and T-wave are fundamental in diagnosing cardiac conditions, and their analysis helps in assessing the heart’s rhythm and function.",
    "topic": "Electrocardiograph (ECG)",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo115",
    "question_id": "cbse_xi_kebo1dd_c115_ex014"
  },
  {
    "question_text": "What is the fluid called that is released from blood capillaries into the spaces between tissue cells?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Interstitial fluid",
      "Lymph",
      "Plasma",
      "Serum"
    ],
    "correct_answer": "Interstitial fluid",
    "explanation": "The fluid that leaves the blood capillaries is called interstitial fluid, which has the same mineral distribution as plasma.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen021"
  },
  {
    "question_text": "Which of the following best describes the composition of lymph?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Colourless fluid with specialized lymphocytes",
      "Blood with a high concentration of red blood cells",
      "Interstitial fluid only",
      "A mixture of tissue debris and waste products"
    ],
    "correct_answer": "Colourless fluid with specialized lymphocytes",
    "explanation": "Lymph is a colourless fluid that contains specialized lymphocytes responsible for immune responses.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen022"
  },
  {
    "question_text": "Which system collects the interstitial fluid and returns it to the major veins?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Arterial system",
      "Lymphatic system",
      "Venous system",
      "Capillary system"
    ],
    "correct_answer": "Lymphatic system",
    "explanation": "The lymphatic system collects the tissue fluid (lymph) and drains it back into the major veins.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen023"
  },
  {
    "question_text": "Which statement best explains the difference between interstitial fluid and lymph?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Lymph is interstitial fluid that has been collected by the lymphatic system and contains lymphocytes",
      "Interstitial fluid contains more proteins than lymph",
      "Lymph is a type of blood plasma",
      "Interstitial fluid is only involved in waste removal"
    ],
    "correct_answer": "Lymph is interstitial fluid that has been collected by the lymphatic system and contains lymphocytes",
    "explanation": "While both fluids are similar in composition, lymph is essentially the interstitial fluid that has entered the lymphatic system and is characterized by the presence of specialized lymphocytes.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen024"
  },
  {
    "question_text": "Which type of nutrient is absorbed through the lymphatic system via lacteals located in the intestinal villi?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Carbohydrates",
      "Proteins",
      "Fats",
      "Vitamins"
    ],
    "correct_answer": "Fats",
    "explanation": "Fats are absorbed through the lymph in the lacteals of the intestinal villi, highlighting an important digestive role of the lymphatic system.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen025"
  },
  {
    "question_text": "Define interstitial fluid.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Interstitial fluid is the fluid that moves out of blood capillaries into the spaces between tissue cells and has the same mineral composition as plasma.",
    "explanation": "Interstitial fluid plays a crucial role in nutrient, gas, and waste exchange between blood and cells.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen026"
  },
  {
    "question_text": "Describe the function of the lymphatic system in relation to tissue fluid.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The lymphatic system collects interstitial fluid (lymph) from tissues and channels it back to the major veins, and also plays a role in immune response by transporting lymphocytes.",
    "explanation": "This system is key in maintaining fluid balance and supporting the immune system within the body.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen027"
  },
  {
    "question_text": "Explain why interstitial fluid is important for cell nutrient exchange.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Interstitial fluid surrounds cells and acts as a medium through which nutrients, gases, and waste products are exchanged between blood and cells.",
    "explanation": "This exchange is critical for cellular respiration, metabolism, and overall cell function.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen028"
  },
  {
    "question_text": "How do specialized lymphocytes in lymph contribute to the body's immune response?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Specialized lymphocytes in lymph identify and destroy pathogens, and also help in triggering and regulating immune responses.",
    "explanation": "Their role is essential in monitoring bodily fluids for infectious agents and in orchestrating a coordinated immune defense.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen029"
  },
  {
    "question_text": "Discuss the process of formation of tissue fluid from blood passing through capillaries, including the retention of larger proteins and formed elements in the vessels.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "As blood passes through the capillaries, water and small water-soluble substances move out into the surrounding tissues, forming interstitial fluid. Larger proteins and formed elements are retained in the blood vessels due to their size. This selective movement allows the interstitial fluid to maintain a similar mineral balance as plasma while facilitating the exchange of nutrients, gases, and wastes.",
    "explanation": "This explanation details the filtration process at the capillaries and highlights the importance of size-selective permeability in sustaining proper tissue function.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen030"
  },
  {
    "question_text": "Analyze the roles of lymph in nutrient and hormone transport, and its importance in immune response. Provide examples in your explanation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Lymph transports nutrients such as fats, absorbed through lacteals, as well as hormones to various parts of the body. Additionally, lymph contains specialized lymphocytes that detect and combat pathogens. For example, the absorption of dietary fats via lacteals prevents fats from accumulating in blood, and the presence of lymphocytes helps mount immune defenses against infections.",
    "explanation": "The answer connects the transport function of lymph with its role in immune surveillance, offering specific examples to illustrate these functions.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen031"
  },
  {
    "question_text": "Propose an experiment to study the absorption of fats through lymph in the lacteals of intestinal villi.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An experiment could involve labeling dietary fats with a non-radioactive, detectable marker and then feeding them to an animal model. Samples of lymph could be collected over time to measure the presence and concentration of the marker. Control groups would receive a diet without the labeled fats. Observations on the rate of marker appearance in lymph versus blood would help determine the efficiency of fat absorption via lacteals.",
    "explanation": "This experiment design includes variables, controls, and a method for tracking fat absorption, aligning with the concept of using lacteals in fat absorption.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen032"
  },
  {
    "question_text": "Tissue fluid is also known as lymph.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Tissue fluid is called interstitial fluid; it becomes lymph only after being collected by the lymphatic system.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen033"
  },
  {
    "question_text": "Interstitial fluid has the same mineral distribution as plasma.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The tissue fluid, or interstitial fluid, has the same mineral distribution as that found in plasma.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen034"
  },
  {
    "question_text": "Lymph contains specialized lymphocytes that play a role in the body's immune response.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Lymph is a colourless fluid that includes specialized lymphocytes, which are key players in immune defense.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen035"
  },
  {
    "question_text": "All proteins leave the capillary along with the tissue fluid.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Larger proteins are retained within the capillaries; only water and small water-soluble substances pass into the tissue fluid.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen036"
  },
  {
    "question_text": "The lymphatic system is not involved in transporting hormones.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Lymph is an important carrier for nutrients and hormones, meaning the lymphatic system does contribute to hormone transport.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen037"
  },
  {
    "question_text": "Fats are absorbed into the lymph through lacteals present in intestinal villi.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Fats are absorbed through lacteals in the intestinal villi, and then transported by lymph throughout the body.",
    "topic": "Lymph (Tissue Fluid)",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "03_section_15_2",
    "question_id": "cbse_xi_kebo1dd_c115_gen038"
  },
  {
    "question_text": "What does the term 'myogenic' mean in the context of cardiac activity?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Generated by nerve impulses",
      "Generated by specialized conduction system",
      "Spontaneously generated by cardiac muscle",
      "Controlled solely by hormones"
    ],
    "correct_answer": "Spontaneously generated by cardiac muscle",
    "explanation": "The term 'myogenic' indicates that the heart generates its own electrical impulses from the muscle tissue, rather than relying solely on external nerve signals.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen075"
  },
  {
    "question_text": "Which component of the autonomic nervous system increases the rate of the heartbeat?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Sympathetic nerves",
      "Parasympathetic nerves",
      "Enteric nerves",
      "Central nervous input only"
    ],
    "correct_answer": "Sympathetic nerves",
    "explanation": "The sympathetic nervous system sends neural signals that increase heart rate, the strength of ventricular contraction, and overall cardiac output.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen076"
  },
  {
    "question_text": "How do adrenal medullary hormones affect cardiac output?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "They increase cardiac output",
      "They decrease cardiac output",
      "They have no effect on cardiac output",
      "They only affect blood pressure"
    ],
    "correct_answer": "They increase cardiac output",
    "explanation": "Adrenal medullary hormones enhance cardiac output by increasing the force of ventricular contractions and heart rate.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen077"
  },
  {
    "question_text": "Which of the following best describes the dual mechanism regulating normal cardiac activity?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Neural control exclusively",
      "Myogenic origin exclusively",
      "Combined effects of specialized muscle tissue and the autonomic nervous system",
      "Hormonal control exclusively"
    ],
    "correct_answer": "Combined effects of specialized muscle tissue and the autonomic nervous system",
    "explanation": "The heart is regulated intrinsically by myogenic properties and extrinsically by the autonomic nervous system, which together ensure proper cardiac function.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen078"
  },
  {
    "question_text": "What does 'cardiac output' refer to?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The blood pressure generated by the heart",
      "The total volume of blood the heart pumps per minute",
      "The electrical conduction of the heart",
      "The strength of heart muscle contractions"
    ],
    "correct_answer": "The total volume of blood the heart pumps per minute",
    "explanation": "Cardiac output is defined as the volume of blood the heart pumps in one minute, determined by heart rate and stroke volume.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen079"
  },
  {
    "question_text": "Define what is meant by a myogenic heart.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A myogenic heart is one that generates its own electrical impulses due to specialized cardiac muscle tissue.",
    "explanation": "A myogenic heart does not require an external electrical stimulus for initiating contractions; the impulse originates within the heart muscle itself.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen080"
  },
  {
    "question_text": "Explain the role of the parasympathetic nervous system in regulating heart function.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The parasympathetic nervous system decreases the heart rate and the speed of conduction of action potentials, thereby reducing cardiac output.",
    "explanation": "By slowing down both the heart rate and the transmission of electrical impulses, the parasympathetic nervous system modulates cardiac activity to match the body's needs during rest.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen081"
  },
  {
    "question_text": "Describe how neural signals modify cardiac output.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Neural signals modify cardiac output by either increasing or decreasing the heart rate and the strength of contraction. Sympathetic signals increase both rate and contractility, while parasympathetic signals decrease them.",
    "explanation": "The autonomic nervous system adjusts cardiac output to meet bodily demands by altering the rate and force of the heart's contractions.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen082"
  },
  {
    "question_text": "Discuss the interplay between intrinsic cardiac regulation and extrinsic autonomic modulation in maintaining normal heart function.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Intrinsic regulation through myogenic impulses ensures that the heart can contract independently, while extrinsic autonomic modulation fine-tunes the rate and strength of contractions based on the body's needs.",
    "explanation": "The intrinsic ability of the heart to generate its own beat is essential for activity, but the autonomic nervous system provides necessary adjustments during various physiological states, highlighting a complex interplay.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen083"
  },
  {
    "question_text": "Discuss how sympathetic and parasympathetic signals influence heart rate.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sympathetic signals increase heart rate by enhancing the speed of depolarization and strengthening ventricular contractions, while parasympathetic signals decrease heart rate by slowing down the conduction of action potentials and reducing contractility.",
    "explanation": "This question requires an explanation of the dual role of the autonomic nervous system. The sympathetic branch prepares the heart for higher activity levels, whereas the parasympathetic branch promotes a rest state.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen084"
  },
  {
    "question_text": "Critically evaluate the importance of the myogenic property of the heart compared to extrinsic autonomic regulation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The myogenic property is crucial because it allows the heart to beat autonomously without external stimuli, ensuring a reliable and continuous rhythm. However, extrinsic autonomic regulation is equally important as it adjusts the heart’s performance according to bodily demands, ensuring optimal functioning under varying conditions.",
    "explanation": "The answer should compare the inherent ability of the heart to generate impulses with the modulatory role of the autonomic nervous system, emphasizing that both mechanisms are essential for balanced cardiac function.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen085"
  },
  {
    "question_text": "Propose a mechanism by which alterations in the autonomic balance could lead to cardiac dysfunction.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An imbalance, such as excessive sympathetic stimulation or diminished parasympathetic activity, could lead to persistent tachycardia and increased cardiac workload, eventually resulting in conditions like arrhythmias or heart failure. Alternatively, excessive parasympathetic activity might cause bradycardia, reducing cardiac output.",
    "explanation": "This answer involves creating a logical explanation that links changes in autonomic tone with potential clinical outcomes, reflecting a deeper analytical and creative understanding of cardiac regulation.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen086"
  },
  {
    "question_text": "True or False: The heart is regulated solely by external neural control without any intrinsic mechanism.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The heart is myogenic, meaning it possesses its own intrinsic mechanism of generating electrical impulses independent of external neural control.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen087"
  },
  {
    "question_text": "True or False: Parasympathetic neural signals increase the speed of conduction of action potentials in the heart.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Parasympathetic signals actually decrease the speed of conduction of action potentials, which helps lower the heart rate.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen088"
  },
  {
    "question_text": "True or False: Neural signals from sympathetic nerves directly increase heart rate.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Sympathetic stimulation increases heart rate through an increase in the rate of depolarization and the strength of ventricular contractions.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen089"
  },
  {
    "question_text": "True or False: The term 'myogenic' indicates that the heart muscle can initiate its own contractions.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The myogenic property means that the heart’s muscle tissue is capable of generating its own electrical impulses, leading to contraction without external stimulation.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen090"
  },
  {
    "question_text": "True or False: Adrenal medullary hormones have no role in regulating cardiac output.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Adrenal medullary hormones contribute to the regulation of cardiac output by increasing both heart rate and contractility, especially during stress.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen091"
  },
  {
    "question_text": "True or False: The autonomic nervous system only modifies the heart rate and has no influence on the force of ventricular contractions.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "The autonomic nervous system, particularly the sympathetic division, affects both the heart rate and the strength of ventricular contractions.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen092"
  },
  {
    "question_text": "True or False: The intrinsic regulation of the heart is mediated by specialized nodal tissue.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Intrinsic regulation of the heart relies on specialized nodal tissue that generates electrical impulses, making the heart myogenic.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen093"
  },
  {
    "question_text": "If a patient's baseline heart rate is 70 bpm, and sympathetic stimulation increases the heart rate by 20%, what is the new heart rate?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "84 bpm",
    "explanation": "A 20% increase on a baseline of 70 bpm is calculated as 70 x 1.20 = 84 bpm.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen094"
  },
  {
    "question_text": "Assume a drug decreases the conduction speed of action potentials by 15% and heart rate by 10%. If the original heart rate is 80 bpm, what is the new heart rate after the decrease?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "72 bpm",
    "explanation": "A 10% decrease in heart rate from an original 80 bpm results in 80 x 0.90 = 72 bpm. The conduction speed decrease is informational and does not affect the computed heart rate.",
    "topic": "Regulation of Cardiac Activity",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "06_section_15_5",
    "question_id": "cbse_xi_kebo1dd_c115_gen095"
  },
  {
    "question_text": "What is the standard normal blood pressure reading (systolic/diastolic) mentioned in the section?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "120/80",
      "140/90",
      "130/85",
      "110/70"
    ],
    "correct_answer": "120/80",
    "explanation": "The section states that a normal blood pressure reading is 120/80, where 120 mm Hg is the systolic pressure and 80 mm Hg is the diastolic pressure.",
    "topic": "Hypertension",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen096"
  },
  {
    "question_text": "At what blood pressure reading is an individual considered hypertensive, based on repeated checks?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "120/80",
      "130/85",
      "140/90",
      "150/100"
    ],
    "correct_answer": "140/90",
    "explanation": "The section indicates that if repeated checks show blood pressure of 140/90 or higher, it is considered hypertension.",
    "topic": "Hypertension",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen097"
  },
  {
    "question_text": "Which of the following best describes the cause of Coronary Artery Disease (CAD) as mentioned in the section?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Viruses causing inflammation",
      "Deposits of calcium, fat, cholesterol and fibrous tissues",
      "High sugar levels in blood",
      "Abnormal heart rate"
    ],
    "correct_answer": "Deposits of calcium, fat, cholesterol and fibrous tissues",
    "explanation": "Coronary Artery Disease, also known as atherosclerosis, is caused by deposits of calcium, fat, cholesterol and fibrous tissues that narrow the arteries.",
    "topic": "Coronary Artery Disease",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen098"
  },
  {
    "question_text": "Which of the following conditions is distinctly different from heart failure?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Congestive heart failure",
      "Cardiac arrest",
      "Heart failure",
      "Chronic angina"
    ],
    "correct_answer": "Cardiac arrest",
    "explanation": "The section clarifies that heart failure is not the same as cardiac arrest, where the heart stops beating.",
    "topic": "Heart Failure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen099"
  },
  {
    "question_text": "Which condition is commonly referred to as atherosclerosis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Hypertension",
      "Angina",
      "Heart Failure",
      "Coronary Artery Disease"
    ],
    "correct_answer": "Coronary Artery Disease",
    "explanation": "Atherosclerosis is another name for Coronary Artery Disease, which involves the deposition of materials that narrow the arteries.",
    "topic": "Coronary Artery Disease",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen100"
  },
  {
    "question_text": "True or False: High blood pressure leads to heart diseases and also affects vital organs such as the brain and kidneys.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section explicitly mentions that high blood pressure can result in heart diseases and impact vital organs like the brain and kidneys.",
    "topic": "Hypertension",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen101"
  },
  {
    "question_text": "True or False: Angina pectoris is a disease of the heart and not merely a symptom.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Angina, or angina pectoris, is described in the section as a symptom that manifests as acute chest pain, rather than a disease itself.",
    "topic": "Angina",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen102"
  },
  {
    "question_text": "True or False: Heart failure is synonymous with cardiac arrest.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text clarifies that heart failure is not the same as cardiac arrest; heart failure is a state where the heart does not pump efficiently, while cardiac arrest is when the heart stops entirely.",
    "topic": "Heart Failure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen103"
  },
  {
    "question_text": "True or False: Atherosclerosis causes narrowing of the arteries due to deposits of calcium, fat, cholesterol, and fibrous tissues.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section clearly states that deposits of calcium, fat, cholesterol, and fibrous tissues in the arteries lead to their narrowing, a process known as atherosclerosis.",
    "topic": "Coronary Artery Disease",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen104"
  },
  {
    "question_text": "True or False: Hypertension is defined by blood pressure readings of 140/90 or above when measured repeatedly.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "According to the section, repeated blood pressure checks showing 140/90 or above are indicative of hypertension.",
    "topic": "Hypertension",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen105"
  },
  {
    "question_text": "True or False: Heart failure always results in a heart attack.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The section differentiates heart failure from a heart attack. Heart failure is a state of reduced pumping efficiency, whereas a heart attack is sudden and involves damage to the heart muscle.",
    "topic": "Heart Failure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen106"
  },
  {
    "question_text": "Explain what is meant by 'systolic' pressure as used in measuring blood pressure.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Systolic pressure is the pressure in the arteries when the heart contracts, pumping blood out to the body.",
    "explanation": "Systolic pressure refers to the maximum arterial pressure during the contraction of the heart muscles, and the section identifies it as 120 mm Hg in a normal reading.",
    "topic": "Hypertension",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen107"
  },
  {
    "question_text": "Describe the changes that occur in the arteries that lead to Coronary Artery Disease (CAD).",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In Coronary Artery Disease, deposits of calcium, fat, cholesterol and fibrous tissues accumulate in the arteries, leading to a narrowing of their lumen.",
    "explanation": "The section explains that these deposits in the vessel walls reduce the space available for blood flow, thus affecting the heart muscle's blood supply.",
    "topic": "Coronary Artery Disease",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen108"
  },
  {
    "question_text": "What is the main symptom of angina pectoris as described in the section?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Acute chest pain due to insufficient oxygen reaching the heart muscle.",
    "explanation": "The section defines angina pectoris as a symptom characterized by acute chest pain when the heart muscle does not receive enough oxygen.",
    "topic": "Angina",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen109"
  },
  {
    "question_text": "Why is heart failure sometimes called congestive heart failure?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It is called congestive heart failure because one of its main symptoms is congestion in the lungs, due to blood backing up in the pulmonary circulation.",
    "explanation": "The section mentions that lung congestion is a prominent symptom in heart failure, hence the alternate term congestive heart failure.",
    "topic": "Heart Failure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen110"
  },
  {
    "question_text": "Discuss how high blood pressure can lead to serious complications in the body, detailing its effects on the heart and other vital organs.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "High blood pressure means the heart has to work harder to pump blood, which over time can lead to the thickening of the heart muscle and ultimately heart failure. Moreover, the increased pressure damages blood vessels, leading to reduced blood flow and possible damage to vital organs such as the brain and kidneys. This combination of effects increases the risk of heart disease, kidney disease, and stroke.",
    "explanation": "This answer addresses the effect of continuously elevated blood pressure on the cardiovascular system and related organs, outlining the progressive damage and complications as explained in the section.",
    "topic": "Hypertension",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen111"
  },
  {
    "question_text": "Compare and contrast heart failure with cardiac arrest and a heart attack. Detail the differences in their underlying pathologies and outcomes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Heart failure is a chronic condition where the heart is not pumping effectively, leading to symptoms such as lung congestion. In contrast, cardiac arrest is an acute event where the heart suddenly stops beating, and a heart attack involves sudden damage to the heart muscle due to a blockage in blood flow. While heart failure develops over time and may be managed, cardiac arrest and heart attacks are emergencies with immediate life-threatening consequences.",
    "explanation": "This answer requires a detailed comparison of the three conditions, emphasizing that heart failure is a long-term inefficiency, whereas cardiac arrest and heart attack are acute events with different pathologies and clinical implications.",
    "topic": "Heart Failure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen112"
  },
  {
    "question_text": "Evaluate the potential impact of lifestyle changes on preventing disorders of the circulatory system, specifically high blood pressure and coronary artery disease.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Lifestyle changes such as a balanced diet, regular exercise, stress management, and avoiding tobacco can significantly reduce the risk factors for high blood pressure and coronary artery disease. By managing weight, reducing cholesterol levels, and improving heart function, individuals can lower their blood pressure and limit the buildup of plaque in the arteries. These changes not only lessen the risk of developing these conditions but can also improve overall cardiovascular health.",
    "explanation": "This answer evaluates evidence-based interventions through lifestyle modification and explains how these changes may help in prevention and management of circulatory system disorders, as inferred from the context of the sections on hypertension and coronary artery disease.",
    "topic": "Disorders of Circulatory System",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen113"
  },
  {
    "question_text": "If an individual's systolic blood pressure is 145 mm Hg and diastolic pressure is 95 mm Hg, do these readings indicate hypertension? Provide your answer as 1 for Yes and 0 for No.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1",
    "explanation": "The reading of 145/95 is above the threshold of 140/90, thereby indicating hypertension as described in the section.",
    "topic": "Hypertension",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "07_section_15_6",
    "question_id": "cbse_xi_kebo1dd_c115_gen114"
  },
  {
    "question_text": "Which component of blood is described as a straw coloured, viscous fluid?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Erythrocytes",
      "Plasma",
      "Leucocytes",
      "Platelets"
    ],
    "correct_answer": "Plasma",
    "explanation": "Plasma is the straw coloured, viscous fluid that constitutes nearly 55 per cent of blood.",
    "topic": "Plasma",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen001"
  },
  {
    "question_text": "What percentage of plasma is made up of water?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "50-52 per cent",
      "70-75 per cent",
      "90-92 per cent",
      "95-97 per cent"
    ],
    "correct_answer": "90-92 per cent",
    "explanation": "The plasma is composed of 90-92 per cent water with proteins making up 6-8 per cent, as mentioned in the textbook.",
    "topic": "Plasma",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen002"
  },
  {
    "question_text": "Which blood group is known as the 'universal donor' based on the ABO grouping system?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A",
      "B",
      "AB",
      "O"
    ],
    "correct_answer": "O",
    "explanation": "Blood group 'O' is termed the 'universal donor' because its red blood cells lack A and B antigens, making it compatible with all other blood groups.",
    "topic": "Blood Groups, ABO grouping",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen003"
  },
  {
    "question_text": "Which enzyme converts fibrinogen to fibrin during the blood clotting process?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Thrombokinase",
      "Prothrombin",
      "Thrombin",
      "Fibrinolysin"
    ],
    "correct_answer": "Thrombin",
    "explanation": "Thrombin is the enzyme that converts fibrinogen into fibrin, leading to clot formation after injury.",
    "topic": "Coagulation of Blood",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen004"
  },
  {
    "question_text": "Which type of white blood cells are primarily involved in the adaptive immune response?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Neutrophils",
      "Basophils",
      "Lymphocytes",
      "Monocytes"
    ],
    "correct_answer": "Lymphocytes",
    "explanation": "Lymphocytes, which include T and B cells, are mainly responsible for the adaptive immune response.",
    "topic": "Formed Elements, Leucocytes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen005"
  },
  {
    "question_text": "Define plasma and list its main components.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Plasma is the straw coloured, viscous fluid in blood, composed mainly of water (90-92%), proteins (6-8%), minerals, glucose, amino acids, and other substances in transit. It also contains clotting factors in inactive form.",
    "explanation": "This answer covers the definition of plasma and outlines its components, as described in the textbook section.",
    "topic": "Plasma",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen006"
  },
  {
    "question_text": "What are the major proteins present in plasma and what functions do they serve?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The major proteins in plasma are fibrinogen, globulins, and albumins. Fibrinogen is essential for blood clotting, globulins are involved in defense mechanisms, and albumins help maintain osmotic balance.",
    "explanation": "This answer correctly identifies the major proteins in plasma and explains their specific roles.",
    "topic": "Plasma",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen007"
  },
  {
    "question_text": "State the differences between plasma and serum.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Plasma is the liquid component of blood containing clotting factors, while serum is the fluid that remains after the blood has clotted, thus lacking clotting factors.",
    "explanation": "This answer differentiates between plasma and serum based on the presence or absence of clotting factors.",
    "topic": "Plasma and Coagulation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen008"
  },
  {
    "question_text": "Describe the role of platelets in blood clotting.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Platelets, or thrombocytes, are cell fragments that release substances necessary for coagulation. They aggregate at the site of injury, aiding in the formation of a clot by releasing factors that activate the clotting cascade.",
    "explanation": "This answer describes the function of platelets in initiating and supporting the blood clotting process.",
    "topic": "Formed Elements, Coagulation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen009"
  },
  {
    "question_text": "Explain the mechanism of blood coagulation, including the roles of fibrinogen, thrombin, and platelets.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Blood coagulation is a cascade process that begins with an injury or trauma. Platelets at the injury site release substances that activate coagulation. Inactive fibrinogen in the plasma is converted by the enzyme thrombin into fibrin, forming a network of threads that trap blood cells, thereby forming a clot. Thrombin is itself generated from prothrombin through the action of thrombokinase, and calcium ions play an essential role in these reactions.",
    "explanation": "This detailed answer outlines the steps involved in blood coagulation, describing the conversion of fibrinogen to fibrin, the formation of thrombin, and the role of platelets in initiating the process.",
    "topic": "Coagulation of Blood",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen010"
  },
  {
    "question_text": "Discuss the significance of Rh incompatibility in pregnancies and how it is prevented.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Rh incompatibility occurs when an Rh negative mother carries an Rh positive fetus. During the first pregnancy, the mother might become sensitized to the fetal Rh antigens during delivery without affecting the first child. In subsequent pregnancies, the mother's anti-Rh antibodies can cross the placenta and destroy the fetal RBCs, leading to conditions like erythroblastosis foetalis. This condition is prevented by administering anti-Rh antibodies to the mother after the birth of the first child, thereby preventing sensitization.",
    "explanation": "This answer highlights the risk associated with Rh incompatibility in subsequent pregnancies and explains the prevention method using anti-Rh antibodies.",
    "topic": "Blood Groups, Rh Grouping",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen011"
  },
  {
    "question_text": "Analyze the relationship between blood composition and its functions in oxygen transport and immune defense.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The composition of blood is finely tuned to perform specialized functions. Erythrocytes, loaded with haemoglobin, are critical for the transport of oxygen, while various white blood cells (leucocytes) play key roles in immune defense. Neutrophils, eosinophils, and basophils respond quickly to pathogens as part of the innate immune system, whereas lymphocytes (T and B cells) are responsible for the adaptive immune responses. Platelets facilitate coagulation, preventing excessive blood loss. The interdependence of these components underscores the efficiency of blood in maintaining vital bodily functions.",
    "explanation": "This long answer examines how different components of blood contribute uniquely to oxygen transport and immune protection, thereby showing the integrated functions of the blood system.",
    "topic": "Formed Elements, Blood Function",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen012"
  },
  {
    "question_text": "True or False: Blood is considered a connective tissue because it has a matrix (plasma) and specialized cells.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Blood is indeed classified as a connective tissue since it consists of a fluid matrix (plasma) and formed elements (cells).",
    "topic": "Blood",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen013"
  },
  {
    "question_text": "True or False: Erythrocytes in most mammals contain a nucleus.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In most mammals, erythrocytes are anucleate (lack nuclei) which allows for more space to carry haemoglobin.",
    "topic": "Formed Elements, Erythrocytes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen014"
  },
  {
    "question_text": "True or False: An Rh negative individual will form antibodies if exposed to Rh positive blood.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Exposure of an Rh negative individual to Rh positive blood can lead to the formation of antibodies against the Rh factor.",
    "topic": "Blood Groups, Rh Grouping",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen015"
  },
  {
    "question_text": "True or False: Serum is obtained by removing clotting factors from plasma.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Serum is the fluid portion of blood that remains after clotting has occurred, and thus it does not contain clotting factors.",
    "topic": "Plasma and Coagulation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen016"
  },
  {
    "question_text": "True or False: Neutrophils are the most abundant white blood cells in the blood.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Neutrophils constitute 60-65 per cent of white blood cells, making them the most abundant type.",
    "topic": "Formed Elements, Leucocytes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen017"
  },
  {
    "question_text": "True or False: Platelets are complete cells that have a nucleus.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Platelets are not complete cells but rather cell fragments produced by megakaryocytes, and they do not contain a nucleus.",
    "topic": "Formed Elements, Platelets",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen018"
  },
  {
    "question_text": "Numerical: Calculate how many grams of haemoglobin are present in 500 ml of blood if a healthy individual has 15 gms of haemoglobin per 100 ml.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "75 gms",
    "explanation": "Since there is 15 g per 100 ml, for 500 ml the calculation is 15 x 5 = 75 gms.",
    "topic": "Formed Elements, Erythrocytes",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen019"
  },
  {
    "question_text": "Numerical: If a healthy adult man has on average 5.2 million RBCs per mm³, how many RBCs are present in 1 liter of blood? (Note: 1 liter = 1,000,000 mm³)",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "5.2 x 10^12 RBCs",
    "explanation": "Multiplying 5.2 million RBCs per mm³ by 1,000,000 mm³ gives 5.2 x 10^12 RBCs in 1 liter of blood.",
    "topic": "Formed Elements, Erythrocytes",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "02_section_15_1",
    "question_id": "cbse_xi_kebo1dd_c115_gen020"
  },
  {
    "question_text": "Which type of circulatory system is found in arthropods and molluscs?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Open circulatory system",
      "B. Closed circulatory system",
      "C. Double circulatory system",
      "D. Mixed circulatory system"
    ],
    "correct_answer": "A. Open circulatory system",
    "explanation": "Arthropods and molluscs possess an open circulatory system where blood is pumped into sinuses rather than confined vessels.",
    "topic": "Circulatory pathways",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen039"
  },
  {
    "question_text": "In vertebrates, which animals have a three-chambered heart?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Fishes",
      "B. Amphibians and reptiles (except crocodiles)",
      "C. Birds",
      "D. Mammals"
    ],
    "correct_answer": "B. Amphibians and reptiles (except crocodiles)",
    "explanation": "Amphibians and most reptiles have a three-chambered heart with two atria and one ventricle, except crocodiles which have a four-chambered heart.",
    "topic": "Circulatory pathways",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen040"
  },
  {
    "question_text": "What structure in the human heart generates action potentials automatically?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Atrioventricular node",
      "B. Purkinje fibres",
      "C. Sinoatrial node",
      "D. Atrial septum"
    ],
    "correct_answer": "C. Sinoatrial node",
    "explanation": "The sinoatrial node, located in the right atrium, is the pacemaker of the heart and generates action potentials without external stimuli.",
    "topic": "Human circulatory system",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen041"
  },
  {
    "question_text": "Which of the following best explains the advantage of a closed circulatory system compared to an open one?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It prevents blood from leaking into tissues",
      "B. It allows more precise control of blood flow",
      "C. It significantly increases blood pressure",
      "D. It restricts oxygen delivery only to the heart"
    ],
    "correct_answer": "B. It allows more precise control of blood flow",
    "explanation": "In a closed circulatory system, blood is confined to vessels, which allows precise regulation of the distribution and pressure of blood.",
    "topic": "Circulatory pathways",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen042"
  },
  {
    "question_text": "During ventricular systole, which of the following events occurs?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Opening of atrioventricular valves",
      "B. Closure of semilunar valves",
      "C. Closure of tricuspid and bicuspid valves",
      "D. Filling of ventricles with blood"
    ],
    "correct_answer": "C. Closure of tricuspid and bicuspid valves",
    "explanation": "During ventricular contraction, increased pressure causes the tricuspid and bicuspid valves to close, preventing backflow into the atria.",
    "topic": "Cardiac cycle",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen043"
  },
  {
    "question_text": "Define double circulation in birds and mammals.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Double circulation is a system in which oxygenated and deoxygenated blood are kept separate by having two distinct circulatory pathways - one for pulmonary circulation and one for systemic circulation.",
    "explanation": "In birds and mammals, the heart's four chambers allow the separation of oxygenated and deoxygenated blood, leading to efficient circulation through lungs and body.",
    "topic": "Human circulatory system",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen044"
  },
  {
    "question_text": "Explain the role of the cardiac valves in the heart.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The cardiac valves ensure unidirectional blood flow by opening and closing at specific times to prevent backflow from atria to ventricles and from ventricles to arteries.",
    "explanation": "The tricuspid, bicuspid, and semilunar valves coordinate the flow of blood, maintaining effective circulation and preventing mixing of oxygenated and deoxygenated blood.",
    "topic": "Human circulatory system",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen045"
  },
  {
    "question_text": "What is the stroke volume and how does it relate to cardiac output?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Stroke volume is the amount of blood pumped by each ventricle in one cardiac cycle, and cardiac output is calculated by multiplying the stroke volume by the heart rate.",
    "explanation": "The stroke volume indicates the efficiency of each heartbeat; when multiplied by the number of beats per minute, it provides the total blood volume pumped by the heart per minute.",
    "topic": "Cardiac cycle",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen046"
  },
  {
    "question_text": "Describe the sequence of events in the human cardiac cycle from diastole to systole and back.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The cardiac cycle begins with joint diastole, where both atria and ventricles are relaxed. Blood flows from the veins into the atria, and subsequently into the ventricles. The sinoatrial node fires, causing atrial systole, which boosts ventricular filling. The impulse then reaches the ventricles through the atrioventricular node and bundle, leading to ventricular systole. As the ventricles contract, the tricuspid and bicuspid valves close to prevent backflow, and increasing pressure opens the semilunar valves allowing blood to enter the pulmonary artery and aorta. After ejection, the ventricles relax (ventricular diastole), leading to closure of the semilunar valves. Finally, the pressure difference reopens the atrioventricular valves, allowing blood to refill the chambers, and the cycle starts anew.",
    "explanation": "This answer covers both phases of the cardiac cycle, detailing the roles of the heart valves and electrical conduction system, which are essential for maintaining efficient blood circulation.",
    "topic": "Cardiac cycle",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen047"
  },
  {
    "question_text": "Compare and contrast the circulatory systems of arthropods and chordates.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Arthropods have an open circulatory system where blood is pumped into sinuses or hemocoels, making direct contact with tissues. In contrast, chordates (and other animals with closed systems) have blood confined within vessels, allowing for precise regulation of blood flow and pressure. The closed system is more efficient in nutrient and gas transport due to confined pathways and regulated circulation.",
    "explanation": "This answer highlights the key differences and advantages of closed versus open circulatory systems, reflecting on aspects such as regulation, efficiency, and structural differences.",
    "topic": "Circulatory pathways",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen048"
  },
  {
    "question_text": "Discuss the physiological significance of the ECG tracing, including what the P-wave, QRS complex, and T-wave represent.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The ECG tracing is a vital tool that graphically represents the electrical activities of the heart. The P-wave corresponds to the depolarization of the atria, leading to their contraction. The QRS complex represents ventricular depolarization, which triggers ventricular contraction, while the T-wave shows ventricular repolarization, marking the recovery phase. This detailed representation is instrumental in diagnosing arrhythmias, myocardial infarctions, and other cardiac abnormalities.",
    "explanation": "This answer provides a thorough explanation linking electrical events seen in an ECG to specific mechanical events in the cardiac cycle, thereby underlining its diagnostic importance.",
    "topic": "Electrocardiograph (ECG)",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen049"
  },
  {
    "question_text": "The human heart has four chambers.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The human heart consists of two atria and two ventricles, making up four chambers in total.",
    "topic": "Human circulatory system",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen050"
  },
  {
    "question_text": "In fishes, the heart pumps oxygenated blood directly to the body tissues.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Fishes have a single circulatory system where the heart pumps deoxygenated blood to the gills for oxygenation before it reaches the body tissues.",
    "topic": "Circulatory pathways",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen051"
  },
  {
    "question_text": "The semilunar valves guard the openings of the ventricles to the pulmonary artery and the aorta, preventing backflow.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The semilunar valves open to allow blood to exit the ventricles and close immediately after to prevent any backflow into the ventricles.",
    "topic": "Human circulatory system",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen052"
  },
  {
    "question_text": "The sinoatrial node is also known as the pacemaker and can generate action potentials at a higher rate than any other nodal tissue in the heart.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The sinoatrial node, located in the right atrium, is the primary pacemaker of the heart and generates action potentials at the highest rate (70-75 per minute).",
    "topic": "Electrocardiograph (ECG)",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen053"
  },
  {
    "question_text": "An increase in heart rate always results in a proportional increase in cardiac output, regardless of changes in stroke volume.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Cardiac output is the product of stroke volume and heart rate. Changes in stroke volume can affect cardiac output even if there is an increase in heart rate.",
    "topic": "Cardiac cycle",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen054"
  },
  {
    "question_text": "If an average heart beats 72 times per minute and each ventricle pumps 70 mL of blood per beat, calculate the cardiac output per minute.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "5040 mL per minute (approximately 5 litres)",
    "explanation": "Cardiac output is calculated as heart rate multiplied by stroke volume. Therefore, 72 x 70 = 5040 mL per minute.",
    "topic": "Cardiac cycle",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "04_section_15_3",
    "question_id": "cbse_xi_kebo1dd_c115_gen055"
  },
  {
    "question_text": "What is the innermost layer of a blood vessel called?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Tunica externa",
      "B. Tunica media",
      "C. Tunica intima",
      "D. Tunica adventitia"
    ],
    "correct_answer": "C. Tunica intima",
    "explanation": "The innermost layer of a blood vessel is the tunica intima, which consists of squamous endothelium.",
    "topic": "Blood vessel structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen056"
  },
  {
    "question_text": "Which circulation carries deoxygenated blood from the right ventricle to the lungs?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Systemic circulation",
      "B. Coronary circulation",
      "C. Pulmonary circulation",
      "D. Hepatic portal system"
    ],
    "correct_answer": "C. Pulmonary circulation",
    "explanation": "Deoxygenated blood is pumped from the right ventricle via the pulmonary artery to the lungs, which is the pulmonary circulation.",
    "topic": "Blood circulation pathways",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen057"
  },
  {
    "question_text": "Which vessel directly carries oxygenated blood from the lungs to the heart?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Pulmonary artery",
      "B. Pulmonary vein",
      "C. Aorta",
      "D. Vena cava"
    ],
    "correct_answer": "B. Pulmonary vein",
    "explanation": "The pulmonary vein returns oxygenated blood from the lungs to the left atrium.",
    "topic": "Blood circulation pathways",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen058"
  },
  {
    "question_text": "In the systemic circulation, deoxygenated blood is collected by which of the following vessels?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Arteries",
      "B. Arterioles",
      "C. Capillaries",
      "D. Veins"
    ],
    "correct_answer": "D. Veins",
    "explanation": "Deoxygenated blood from the tissues is collected by venules and veins before being returned to the heart.",
    "topic": "Systemic circulation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen059"
  },
  {
    "question_text": "How does the thickness of the tunica media differ between arteries and veins?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. It is thicker in veins than in arteries",
      "B. It is of equal thickness in both",
      "C. It is thicker in arteries than in veins",
      "D. It is absent in veins"
    ],
    "correct_answer": "C. It is thicker in arteries than in veins",
    "explanation": "Arteries have a thicker tunica media to withstand high blood pressure, while veins have a comparatively thin tunica media.",
    "topic": "Blood vessel structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen060"
  },
  {
    "question_text": "Explain the route of deoxygenated blood from the right ventricle to the lungs.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The right ventricle pumps deoxygenated blood into the pulmonary artery, which carries it to the lungs for oxygenation.",
    "explanation": "This route, where deoxygenated blood moves from the heart to the lung via the pulmonary artery, is known as pulmonary circulation.",
    "topic": "Pulmonary circulation pathway",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen061"
  },
  {
    "question_text": "Describe the structure of an artery including its layers.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "An artery consists of three layers: the inner tunica intima (squamous endothelium), the middle tunica media (smooth muscle and elastic fibers), and the outer tunica externa (fibrous connective tissue with collagen fibers).",
    "explanation": "This three-layer structure is essential to the functioning of arteries, providing both a smooth lining for blood flow and the strength and elasticity needed to handle high pressure.",
    "topic": "Blood vessel structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen062"
  },
  {
    "question_text": "What is the function of the systemic circulation?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The systemic circulation delivers oxygenated blood, nutrients, and essential substances to body tissues and collects deoxygenated blood and waste products for elimination.",
    "explanation": "Systemic circulation is a critical process that supplies tissues with vital substances and removes metabolic waste.",
    "topic": "Systemic circulation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen063"
  },
  {
    "question_text": "Describe the role of the coronary system in blood circulation.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The coronary system consists of a network of blood vessels that supply oxygenated blood to the cardiac musculature and remove deoxygenated blood from it.",
    "explanation": "This specialized circulation ensures that the heart muscle receives adequate oxygen and nutrients to function efficiently.",
    "topic": "Coronary circulation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen064"
  },
  {
    "question_text": "Discuss the differences between pulmonary and systemic circulation, highlighting the pathways and functions of each circulation.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Pulmonary circulation begins with deoxygenated blood being pumped from the right ventricle via the pulmonary artery to the lungs for oxygenation; the oxygenated blood then returns to the left atrium through the pulmonary veins. In contrast, systemic circulation starts with the left ventricle pumping oxygenated blood into the aorta, which distributes it to body tissues, and then deoxygenated blood is collected by veins and returned to the right atrium. These two circulatory loops serve different functions: pulmonary circulation is dedicated to gas exchange, while systemic circulation is responsible for delivering nutrients and removing wastes.",
    "explanation": "This answer contrasts the two circulatory systems, emphasizing how each pathway supports specific physiological functions.",
    "topic": "Circulatory system",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen065"
  },
  {
    "question_text": "Analyze the structure of blood vessels, detailing the functions of each tunica layer, and compare their adaptations in arteries and veins.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Blood vessels are composed of three layers: the tunica intima, which provides a smooth surface for blood flow; the tunica media, made up of smooth muscle and elastic fibers, which regulates vessel diameter and blood pressure; and the tunica externa, which offers structural support. In arteries, the tunica media is thick to withstand high pressure and facilitate vasoconstriction and dilation, whereas in veins, it is much thinner as blood flows at lower pressure.",
    "explanation": "This response analyzes each layer's function and compares how arteries and veins are structurally adapted to their differing roles in blood circulation.",
    "topic": "Blood vessel structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen066"
  },
  {
    "question_text": "Evaluate the importance of the hepatic portal system in the context of blood circulation and metabolic processing.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The hepatic portal system is critical because it directs blood from the digestive tract to the liver before it enters the systemic circulation. This arrangement allows the liver to detoxify substances, metabolize nutrients, and store essential molecules before the blood is distributed to the rest of the body, making it a key player in both circulatory and metabolic processes.",
    "explanation": "This answer details the dual role of the hepatic portal system in filtering and processing nutrients and toxins, highlighting its importance in overall physiology.",
    "topic": "Hepatic portal system",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen067"
  },
  {
    "question_text": "True or False: The tunica media is thicker in veins than in arteries.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The tunica media is thicker in arteries to manage higher blood pressure, while in veins it is comparatively thin.",
    "topic": "Blood vessel structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen068"
  },
  {
    "question_text": "True or False: The pulmonary vein carries oxygenated blood from the lungs to the left atrium.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The pulmonary vein is responsible for transporting oxygenated blood from the lungs to the left atrium.",
    "topic": "Pulmonary circulation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen069"
  },
  {
    "question_text": "True or False: The systemic circulation solely delivers oxygenated blood to the tissues.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While systemic circulation delivers oxygenated blood to the tissues, it also collects deoxygenated blood and waste products for elimination.",
    "topic": "Systemic circulation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen070"
  },
  {
    "question_text": "True or False: The coronary circulation is dedicated exclusively to the blood supply of the cardiac musculature.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The coronary circulation is a specialized system that supplies the heart muscle with necessary oxygen and nutrients.",
    "topic": "Coronary circulation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen071"
  },
  {
    "question_text": "True or False: The pulmonary circulation is responsible for delivering nutrients to body tissues.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The pulmonary circulation is primarily involved in gas exchange in the lungs, not in delivering nutrients to tissues. Nutrient delivery is a function of the systemic circulation.",
    "topic": "Circulatory system",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen072"
  },
  {
    "question_text": "True or False: The hepatic portal system carries blood from the intestine to the liver before it enters the systemic circulation.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The hepatic portal system is unique in that it transports blood from the digestive tract to the liver for processing prior to joining the systemic circulation.",
    "topic": "Hepatic portal system",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen073"
  },
  {
    "question_text": "Given that the thickness of the tunica media in an artery is 2 mm and the tunica media in veins is noted to be 50% thinner, calculate the thickness of the tunica media in the vein.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1 mm",
    "explanation": "Being 50% thinner means the thickness is reduced by half. Therefore, 2 mm divided by 2 equals 1 mm.",
    "topic": "Blood vessel structure",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo115",
    "section_id": "05_section_15_4",
    "question_id": "cbse_xi_kebo1dd_c115_gen074"
  }
]