[
  {
    "question_text": "Which of the following structures in plants is primarily responsible for gas exchange during photosynthesis?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Xylem",
      "Phloem",
      "Stomata",
      "Roots"
    ],
    "correct_answer": "Stomata",
    "explanation": "Stomata are specialized openings on the surface of leaves that allow the exchange of gases such as oxygen and carbon dioxide during photosynthesis.",
    "topic": "Gas exchange in plants",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen001"
  },
  {
    "question_text": "Which structure helps facilitate gas exchange in thick, woody stems and roots?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Stomata",
      "Lenticels",
      "Chloroplasts",
      "Vascular tissue"
    ],
    "correct_answer": "Lenticels",
    "explanation": "Lenticels are small openings in the bark of woody stems and roots that allow gases to diffuse in and out, enabling respiration even in bulky plant parts.",
    "topic": "Respiration in plants",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen002"
  },
  {
    "question_text": "During the process of cellular respiration in plant cells, why is the controlled, stepwise oxidation of glucose important?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "To maximize oxygen uptake",
      "To reduce water production",
      "To allow coupling of energy release to ATP synthesis",
      "To produce only heat"
    ],
    "correct_answer": "To allow coupling of energy release to ATP synthesis",
    "explanation": "Stepwise oxidation ensures that only a manageable amount of energy is released at each stage, allowing the cell to capture energy in the form of ATP rather than losing it all as heat.",
    "topic": "Cellular respiration",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen003"
  },
  {
    "question_text": "The breakdown of glucose to pyruvic acid in the absence of oxygen is known as:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Fermentation",
      "Glycolysis",
      "Photosynthesis",
      "Calvin cycle"
    ],
    "correct_answer": "Glycolysis",
    "explanation": "Glycolysis is the metabolic pathway that breaks down glucose into pyruvic acid and does not require oxygen.",
    "topic": "Anaerobic respiration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen004"
  },
  {
    "question_text": "Why do plants not require specialized respiratory organs?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Plants do not use oxygen",
      "Each plant part manages its own gas exchange",
      "Water facilitates gas diffusion throughout the plant",
      "Plants have high metabolic rates that eliminate the need"
    ],
    "correct_answer": "Each plant part manages its own gas exchange",
    "explanation": "Plants have adapted so that each part, such as leaves, stems, and roots, has structures (stomata, lenticels) that allow adequate gas exchange without needing specialized organs.",
    "topic": "Plant structure and respiration",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen005"
  },
  {
    "question_text": "Explain the role of stomata in plant respiration.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Stomata allow gases such as oxygen to enter and carbon dioxide to exit the plant tissue, thereby facilitating respiration as well as photosynthesis.",
    "explanation": "Stomata are crucial for gas exchange, ensuring that plant cells receive the necessary oxygen for respiration and can expel carbon dioxide produced during the process.",
    "topic": "Gas exchange in plants",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen006"
  },
  {
    "question_text": "Describe how lenticels contribute to respiration in thick, woody stems.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Lenticels are openings in the bark of woody stems that allow gases to diffuse in and out. They enable oxygen to reach the living cells beneath the dead tissue, ensuring that respiration can occur even in thicker parts of the plant.",
    "explanation": "The presence of lenticels compensates for the reduced surface area in woody tissues by creating channels for gas exchange.",
    "topic": "Respiration in plants",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen007"
  },
  {
    "question_text": "What structural features allow large, bulky plants to ensure all living cells are within a short diffusion distance of air?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Plants have loosely packed parenchyma cells that form an interconnected network of air spaces, and most living cells are located close to the surface, including under the bark in thin layers.",
    "explanation": "These adaptations minimize the diffusion distance for gases, ensuring that even in large plants each cell is in contact with air.",
    "topic": "Gas exchange in plants",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen008"
  },
  {
    "question_text": "Why is oxygen availability not problematic for cells during photosynthesis?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Because oxygen is produced within the cell during the process of photosynthesis, ensuring an adequate supply for cellular processes.",
    "explanation": "The production of oxygen as a by-product of photosynthesis means that cells do not face an oxygen deficit during this process.",
    "topic": "Photosynthesis and respiration",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen009"
  },
  {
    "question_text": "Discuss in detail how plant structures such as stomata, lenticels, and parenchyma cells facilitate gas exchange and eliminate the need for specialized respiratory organs.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Plants utilize various structures for gas exchange; stomata on leaves allow direct exchange of gases during photosynthesis and respiration, lenticels in woody stems permit gas diffusion through the bark, and loosely packed parenchyma cells create intercellular air spaces. These adaptations ensure that every living cell is within a short distance from an air interface, thus eliminating the necessity for specialized respiratory organs.",
    "explanation": "The answer should integrate the roles of different plant structures, emphasizing how localized gas exchange is sufficient due to these anatomical features and the low metabolic demand of plant tissues.",
    "topic": "Plant structure and respiration",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen010"
  },
  {
    "question_text": "Analyze the significance of the stepwise oxidation of glucose in cellular respiration and its role in ATP synthesis in plant cells.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The stepwise oxidation of glucose allows the gradual release of energy, which can then be harnessed at each step to synthesize ATP. This controlled process prevents the wasteful loss of energy as heat and ensures that energy is efficiently captured to meet the cell’s metabolic demands.",
    "explanation": "The response should detail how intermediate steps in glucose oxidation are regulated to couple energy release with ATP production, emphasizing efficiency in energy utilization.",
    "topic": "Cellular respiration",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen011"
  },
  {
    "question_text": "Evaluate the adaptations of anaerobic organisms in relation to respiration and compare these mechanisms with the oxygen-dependent respiration found in plant cells.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Anaerobic organisms rely on processes like glycolysis to partially oxidize glucose when oxygen is scarce, yielding less energy and often producing byproducts such as lactic acid or ethanol. In contrast, plant cells under aerobic conditions carry out complete respiration, which fully oxidizes glucose, resulting in the production of CO2, H2O, and a high yield of ATP. The evaluation should compare efficiency and pathway adaptations in both types of organisms.",
    "explanation": "This answer must examine the differences in metabolic pathways between anaerobic and aerobic respiration, highlighting how each adaptation meets the energy requirements under varying oxygen conditions.",
    "topic": "Anaerobic respiration",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen012"
  },
  {
    "question_text": "In plants, respiration occurs exclusively in specialized organs dedicated to gas exchange.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Plants do not have specialized respiratory organs; instead, each plant part manages its own gas exchange through structures such as stomata and lenticels.",
    "topic": "Plant respiration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen013"
  },
  {
    "question_text": "Stomata are the only structures that facilitate gas exchange in plants.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Besides stomata, lenticels in stems and roots also play an important role in gas exchange, particularly in woody tissues.",
    "topic": "Gas exchange in plants",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen014"
  },
  {
    "question_text": "During the combustion of glucose in cellular respiration, most of the energy released is captured for ATP synthesis rather than being lost as heat.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In the combustion reaction, most of the energy is given out as heat; only controlled, smaller amounts of energy are captured during specific steps for ATP synthesis.",
    "topic": "Cellular respiration",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen015"
  },
  {
    "question_text": "The process of glycolysis requires oxygen to break down glucose into pyruvic acid.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Glycolysis is an anaerobic process that does not require oxygen and can occur in both aerobic and anaerobic conditions.",
    "topic": "Anaerobic respiration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen016"
  },
  {
    "question_text": "Loose packing of parenchyma cells in plant tissues provides an interconnected network of air spaces that aids in gas diffusion.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The loose arrangement of parenchyma cells creates channels for air to move through, which facilitates effective gas exchange in plant tissues.",
    "topic": "Plant structure and respiration",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen017"
  },
  {
    "question_text": "Using the complete combustion equation, 'C6H12O6 + 6 O2 -> 6 CO2 + 6 H2O + Energy', how many molecules of carbon dioxide are produced from one molecule of glucose?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "6",
    "explanation": "The balanced equation shows that for every molecule of glucose, 6 molecules of CO2 are produced.",
    "topic": "Cellular respiration",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen018"
  },
  {
    "question_text": "Given that the typical plant cell is approximately 20 micrometers in dimension and most cells are situated near the surface, estimate the minimum diffusion distance a gas molecule must travel to reach a living cell.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 20 micrometers",
    "explanation": "Since most living cells in a plant are located close to the surface and the typical size of a cell is about 20 micrometers, the minimum diffusion distance is likely around that value.",
    "topic": "Gas exchange in plants",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo112",
    "section_id": "02_section_12_1",
    "question_id": "cbse_xi_kebo1dd_c112_gen019"
  }
]