[
  {
    "question_text": "Which symbol in the floral formula stands for the calyx?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Br",
      "K",
      "C",
      "A"
    ],
    "correct_answer": "K",
    "explanation": "In the floral formula, the symbol 'K' represents the calyx, which is the outermost whorl of a flower.",
    "topic": "Floral formula symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen127"
  },
  {
    "question_text": "In the floral diagram, which part of the flower is depicted as cloud-like shapes?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Calyx",
      "Petals",
      "Androecium",
      "Gynoecium"
    ],
    "correct_answer": "Petals",
    "explanation": "The petals, which form the corolla, are shown as cloud-like shapes in the floral diagram.",
    "topic": "Floral diagram details",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen128"
  },
  {
    "question_text": "In a floral diagram, what does the dot on the top represent?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Fusion of floral parts",
      "Adhesion between whorls",
      "Position of the mother axis",
      "Zygomorphic symmetry"
    ],
    "correct_answer": "Position of the mother axis",
    "explanation": "The dot indicates the position of the mother axis relative to the flower in the floral diagram.",
    "topic": "Floral diagram symbols",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen129"
  },
  {
    "question_text": "What does enclosing the figure within brackets in a floral formula indicate?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Cohesion",
      "Fusion",
      "Adhesion",
      "Symmetry"
    ],
    "correct_answer": "Fusion",
    "explanation": "Enclosing parts of the floral formula within brackets is used to indicate that they are fused together.",
    "topic": "Floral formula notation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen130"
  },
  {
    "question_text": "Which floral part in the diagram is located in the center of the floral whorls?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Calyx",
      "Corolla",
      "Androecium",
      "Gynoecium"
    ],
    "correct_answer": "Gynoecium",
    "explanation": "The gynoecium is depicted at the center of the flower in the floral diagram, making it the innermost whorl.",
    "topic": "Arrangement of floral parts",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen131"
  },
  {
    "question_text": "Describe the sequence used for providing a semi-technical description of a flowering plant.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The description begins with the plant's habit, then covers vegetative characters including the roots, stem, and leaves, followed by floral characters such as the inflorescence and flower parts, and concludes with a floral diagram and floral formula.",
    "explanation": "The standard sequence starts broadly with general habits, moves to vegetative structures, then details the reproductive parts before presenting the summarizing diagram and formula.",
    "topic": "Plant description sequence",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen132"
  },
  {
    "question_text": "Explain the importance of the floral formula in flower morphology and plant taxonomy.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The floral formula concisely represents the number, arrangement, and relationships of floral parts using standardized symbols, which aids in classifying plants and comparing morphological traits across species.",
    "explanation": "It provides essential data on the structure of the flower, including details such as symmetry, fusion, and adhesion among parts, all of which are crucial for taxonomic analysis.",
    "topic": "Floral formula significance",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen133"
  },
  {
    "question_text": "What information can be inferred from the symbols used in a floral diagram?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The symbols can indicate the number of parts, their arrangement in whorls, the type of symmetry (actinomorphic or zygomorphic), as well as details on fusion (indicated by brackets) and adhesion (indicated by connecting lines) among the floral parts.",
    "explanation": "These symbols provide a visual shorthand for the detailed morphology of the flower, revealing key structural and taxonomical information.",
    "topic": "Interpreting floral diagrams",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen134"
  },
  {
    "question_text": "Discuss the steps involved in constructing a semi-technical description of a flowering plant and why each step is significant.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The steps begin with describing the overall habit of the plant, then detailing the vegetative characters like roots, stem, and leaves. Following this, the floral characters such as the inflorescence and flower parts are described. Finally, the floral diagram and floral formula are provided. Each step is significant because they build a complete profile of the plant, starting with general growth form and moving to specific reproductive structures that are critical for taxonomy and identification.",
    "explanation": "This systematic description allows for a clear and concise presentation of the plant's morphology, making it easier to identify specific features and compare them across different species, which is essential in plant taxonomy.",
    "topic": "Semi-technical plant description",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen135"
  },
  {
    "question_text": "Evaluate how the floral diagram and floral formula complement each other in understanding flower morphology, providing examples from the mustard plant to support your explanation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The floral diagram visually represents the spatial arrangement of the flower's parts in successive whorls, showing the relative position (calyx outside, followed by corolla, androecium, and gynoecium in the center), whereas the floral formula provides a symbolic representation of the number, symmetry, and fusion of these parts. For example, in the mustard plant (Family: Brassicaceae), the diagram reveals the orderly sequence of structures, and the formula uses specific symbols to detail the number of sepals, petals, stamens, and carpels. Together, they offer a complete picture by combining spatial and quantitative information.",
    "explanation": "This complementary use improves clarity and aids in taxonomic classification by presenting both detailed spatial relationships and numerical data, which helps in the identification and comparison of species.",
    "topic": "Complementarity of floral diagram and formula",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen136"
  },
  {
    "question_text": "True or False: The floral diagram provides information about the number and arrangement of the floral parts.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The floral diagram is specifically designed to illustrate the number, arrangement, and spatial relationships of the floral parts.",
    "topic": "Floral diagram details",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen137"
  },
  {
    "question_text": "True or False: Fusion of floral parts in the floral formula is indicated by drawing a line above their symbols.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In the floral formula, fusion is indicated by enclosing the figure within brackets, not by a line above the symbols. A line above the symbols represents adhesion between different parts.",
    "topic": "Floral formula notation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen138"
  },
  {
    "question_text": "True or False: In the floral formula, the symbol '⊕' is used to denote actinomorphic symmetry in flowers.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The symbol '⊕' in the floral formula represents actinomorphic symmetry, meaning the flower is radially symmetrical.",
    "topic": "Floral formula symbols",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen139"
  },
  {
    "question_text": "True or False: The outermost whorl in a floral diagram is the gynoecium.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The outermost whorl in a floral diagram is the calyx, not the gynoecium, which is positioned at the center.",
    "topic": "Arrangement of floral parts",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen140"
  },
  {
    "question_text": "True or False: The floral diagram and formula illustrate both cohesion within whorls and adhesion between different whorls.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "The floral formula explicitly shows both cohesion (within whorls) and adhesion (between different whorls) among floral parts, which is reflected in the diagram as well.",
    "topic": "Floral diagram and formula relationships",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen141"
  },
  {
    "question_text": "If a flower has 4 sepals, 4 petals, 6 stamens, and 2 carpels, represent its floral formula using the symbols K for sepals, C for petals, A for stamens, and G for carpels.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "K4 C4 A6 G2",
    "explanation": "The floral formula is constructed by writing the symbol for each floral tissue followed by the number of parts. In this case, 4 sepals (K4), 4 petals (C4), 6 stamens (A6), and 2 carpels (G2) combine to form the full formula.",
    "topic": "Floral formula construction",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "09_section_5_8",
    "question_id": "cbse_xi_kebo1dd_c105_gen142"
  }
]