[
  {
    "question_text": "What is the fruit in flowering plants, according to the text?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A mature or ripened ovary developed after fertilisation",
      "A vegetative structure used for photosynthesis",
      "An unfertilized ovary that remains unchanged",
      "A seed surrounded by endosperm"
    ],
    "correct_answer": "A mature or ripened ovary developed after fertilisation",
    "explanation": "The fruit is defined as a mature or ripened ovary that develops after fertilisation; this is a key characteristic of flowering plants.",
    "topic": "Fruit development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen094"
  },
  {
    "question_text": "Which of the following best describes the layers of the pericarp in fleshy fruits?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Epicarp, mesocarp, and endocarp",
      "Exocarp, mesocarp, and seed coat",
      "Mesocarp only",
      "Endocarp and seed only"
    ],
    "correct_answer": "Epicarp, mesocarp, and endocarp",
    "explanation": "Fleshy fruits have a pericarp which is differentiated into three layers: the outer epicarp, the middle mesocarp, and the inner endocarp.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen095"
  },
  {
    "question_text": "Mango and coconut are classified as drupes because they develop from monocarpellary superior ovaries and are one seeded. Which statement correctly differentiates their mesocarp characteristics?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Mango has a thin fibrous mesocarp while coconut has a thick fleshy mesocarp",
      "Mango has a thick, fleshy edible mesocarp while coconut has a fibrous mesocarp",
      "Both mango and coconut have identical mesocarp types",
      "Mango's mesocarp is stony while coconut's is edible and fleshy"
    ],
    "correct_answer": "Mango has a thick, fleshy edible mesocarp while coconut has a fibrous mesocarp",
    "explanation": "In mango, the pericarp is well differenti-ated with an edible mesocarp, whereas in coconut the mesocarp is fibrous, reflecting differences in their dispersal and nutritional roles.",
    "topic": "Drupes and mesocarp variation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen096"
  },
  {
    "question_text": "Identify the type of placentation shown in a longitudinal section of a pea pod, where ovules are attached along one margin of the ovary.",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Marginal placentation",
      "Axile placentation",
      "Parietal placentation",
      "Basal placentation"
    ],
    "correct_answer": "Marginal placentation",
    "explanation": "The pea pod's ovules are attached along one margin of the ovary, which is a classic example of marginal placentation.",
    "topic": "Placentation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen097"
  },
  {
    "question_text": "What is the primary function of the mesocarp in fruits such as coconut as described in the section?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "To provide structural support to the tree",
      "To protect the seed by forming a hard barrier",
      "To provide nutrition and attract animals for seed dispersal",
      "To produce pollen for fertilisation"
    ],
    "correct_answer": "To provide nutrition and attract animals for seed dispersal",
    "explanation": "The mesocarp plays an important role in providing nutrition and attracting animals, which assists in the process of seed dispersal.",
    "topic": "Fruit function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen098"
  },
  {
    "question_text": "Define parthenocarpic fruit.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A fruit that is formed without the fertilisation of the ovary.",
    "explanation": "A parthenocarpic fruit is one that develops without fertilisation, meaning no seeds are formed as a result of the process.",
    "topic": "Fruit development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen099"
  },
  {
    "question_text": "Describe the typical structure of a fruit in flowering plants.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A typical fruit consists of a pericarp (which may be dry or fleshy) and seeds. In fleshy fruits, the pericarp is usually divided into an outer epicarp, a middle mesocarp, and an inner endocarp.",
    "explanation": "The answer highlights that the fruit is made up of the pericarp and seeds, with fleshy fruits having a distinct three-layered pericarp.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen100"
  },
  {
    "question_text": "Explain how the different types of placentation, as illustrated in the diagrams, can be used to classify flowering plants.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The arrangement of ovules within the ovary (placentation) can help classify flowering plants. For example, marginal, axile, parietal, free central, and basal placentation offer insights into the internal structure of ovaries and can be used as a taxonomic feature.",
    "explanation": "Understanding placentation types assists botanists in distinguishing and classifying plant species based on the positional arrangement of ovules.",
    "topic": "Placentation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen101"
  },
  {
    "question_text": "Compare the pericarp structure of mango and coconut as explained in the section.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Mango possesses a pericarp that is differentiated into a thin epicarp, a fleshy, edible mesocarp, and a stony hard endocarp. In contrast, coconut has a pericarp where the mesocarp is fibrous, reflecting different adaptations for seed dispersal.",
    "explanation": "The answer compares the distinct layers of the pericarp in mango and coconut, noting differences in texture and function, which are crucial for their respective seed dispersal mechanisms.",
    "topic": "Fruit structure and function",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen102"
  },
  {
    "question_text": "Discuss the development of fruit from the ovary and its significance in plant reproduction.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Fruit development from the ovary is a critical process that follows fertilisation. It transforms the ovary into a structure that not only protects the developing seeds but also facilitates their dispersal. This process ensures the continuation of the species by safeguarding the genetic material and providing means for the seeds to reach new locations where they can germinate.",
    "explanation": "This answer covers both the developmental process of the ovary into a fruit after fertilisation and underscores its biological importance in protecting seeds and ensuring reproductive success.",
    "topic": "Fruit development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen103"
  },
  {
    "question_text": "Evaluate the role of the layered pericarp in protecting seeds and facilitating their dispersal, using examples from the text.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The layered pericarp plays a crucial role in seed protection and dispersal. The epicarp acts as an outer barrier, the mesocarp provides nourishment and attraction for dispersal agents (such as animals), and the endocarp offers a hard, protective layer around the seed. For example, in mango, a fleshy mesocarp attracts animals to help in seed dispersal, while in coconut, the fibrous mesocarp not only facilitates dispersal by water but also protects the seed during its journey.",
    "explanation": "This answer links the structure of the pericarp with its function in both seed protection and dispersal, using the specific examples provided in the text to demonstrate the varied adaptations in fruit morphology.",
    "topic": "Fruit function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen104"
  },
  {
    "question_text": "Propose a hypothetical experiment to study the differences in mesocarp composition between drupes like mango and coconut. Describe the methods you would use and the expected outcomes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One could design an experiment involving the collection of drupes (mango and coconut) at similar stages of maturity. The mesocarp tissue from each fruit would then be subjected to biochemical analyses, such as nutrient profiling and fiber content measurement. Microscopic examination would be used to characterize cell structure differences. The expected outcomes would include quantitative differences in nutrient and fiber composition, reflecting the functional adaptations for seed dispersal in different environments.",
    "explanation": "This answer outlines a clear experimental design with objectives, methods, and expected results, demonstrating the application of scientific investigation techniques to compare fruit mesocarp composition.",
    "topic": "Experimental design in fruit biology",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen105"
  },
  {
    "question_text": "True or False: The fruit is a ripened ovary that develops after fertilisation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The fruit is indeed defined as a mature or ripened ovary that develops after fertilisation.",
    "topic": "Fruit development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen106"
  },
  {
    "question_text": "True or False: A parthenocarpic fruit is formed after the fertilisation of the ovary.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "A parthenocarpic fruit is formed without fertilisation of the ovary.",
    "topic": "Fruit development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen107"
  },
  {
    "question_text": "True or False: In fleshy fruits, the pericarp is divided into three layers: epicarp, mesocarp, and endocarp.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Fleshy fruits typically have their pericarp differentiated into an outer epicarp, a middle mesocarp, and an inner endocarp.",
    "topic": "Fruit structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen108"
  },
  {
    "question_text": "True or False: Marginal placentation is characterized by ovules attached along the outer edge of the ovary.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Marginal placentation occurs when the ovules are attached along one margin of the ovary, as illustrated in the pea pod diagram.",
    "topic": "Placentation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen109"
  },
  {
    "question_text": "True or False: Drupes like mango and coconut develop from polycarpellary inferior ovaries.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Drupes such as mango and coconut develop from monocarpellary superior ovaries, not polycarpellary inferior ovaries.",
    "topic": "Drupes and ovary structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen110"
  },
  {
    "question_text": "True or False: The fibrous mesocarp in coconut is an adaptation that helps in seed dispersal by water.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "The fibrous nature of the coconut's mesocarp aids in buoyancy and helps in the dispersal of the seed by water.",
    "topic": "Fruit function and adaptation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo105",
    "section_id": "07_section_5_6",
    "question_id": "cbse_xi_kebo1dd_c105_gen111"
  }
]