[
  {
    "question_text": "Define the following: (a) Exocrine gland, (b) Endocrine gland, (c) Hormone.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Exocrine glands are glands that release their secretions through ducts onto an epithelial surface. Endocrine glands are ductless glands that secrete hormones directly into the bloodstream. Hormones are non-nutrient chemical messengers produced in trace amounts that regulate various body functions.",
    "explanation": "Exocrine glands use ducts to release secretions (like sweat and digestive enzymes) while endocrine glands release hormones directly into the blood. Hormones act as intercellular messengers to regulate functions such as growth, metabolism, and reproduction.",
    "topic": "Endocrine Glands and Hormones",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex001"
  },
  {
    "question_text": "Diagrammatically indicate the location of the various endocrine glands in our body.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A diagram should show: in the head - hypothalamus, pituitary, pineal; in the neck - thyroid and parathyroid; in the chest - thymus; in the abdominal region - pancreas and adrenal glands; and in the lower abdomen - testes in males and ovaries in females.",
    "explanation": "The diagram should accurately depict the locations of the major endocrine glands as described in the chapter to reflect their anatomic positions: brain structures (hypothalamus, pituitary, pineal), neck structures (thyroid, parathyroid), chest (thymus), abdominal organs (pancreas, adrenal glands) and the gonads in the lower abdomen.",
    "topic": "Human Endocrine System",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex002"
  },
  {
    "question_text": "List the hormones secreted by the following: (a) Hypothalamus, (b) Pituitary, (c) Thyroid, (d) Parathyroid, (e) Adrenal, (f) Pancreas, (g) Testis, (h) Ovary, (i) Thymus, (j) Atrium, (k) Kidney, (l) G-I Tract.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hypothalamus: releasing hormones (e.g., GnRH) and inhibiting hormones (e.g., somatostatin); Pituitary: Anterior – GH, PRL, TSH, ACTH, LH, FSH; Intermediate – MSH; Posterior – Oxytocin and Vasopressin; Thyroid: T3 and T4, and thyrocalcitonin (TCT); Parathyroid: PTH; Adrenal: Adrenal cortex – cortisol, aldosterone, and small amounts of androgens; Adrenal medulla – adrenaline and noradrenaline; Pancreas: Insulin (β-cells) and Glucagon (α-cells); Testis: Androgens (mainly testosterone); Ovary: Estrogens and Progesterone; Thymus: Thymosins; Atrium (heart): Atrial Natriuretic Factor (ANF); Kidney: Erythropoietin; G-I Tract: Gastrin, Secretin, Cholecystokinin (CCK), and Gastric Inhibitory Peptide (GIP).",
    "explanation": "Each organ produces specific hormones; the hypothalamus produces both releasing and inhibiting hormones which regulate the pituitary, the pituitary secretes multiple hormones affecting growth and metabolism, and each gland (thyroid, parathyroid, adrenal, etc.) has a unique set of hormones as detailed in the chapter content.",
    "topic": "Human Endocrine System",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex003"
  },
  {
    "question_text": "Fill in the blanks:\n(a) Hypothalamic hormones __________________\n(b) Thyrotrophin (TSH) __________________\n(c) Corticotrophin (ACTH) __________________\n(d) Gonadotrophins (LH, FSH) __________________\n(e) Melanotrophin (MSH) __________________",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "a) Act on the anterior pituitary to regulate hormone release, b) Act on the thyroid gland to stimulate the synthesis and secretion of thyroid hormones, c) Act on the adrenal cortex to stimulate the production of glucocorticoids, d) Act on the gonads (ovaries and testes) to regulate sex hormone production and gametogenesis, e) Act on melanocytes to regulate skin pigmentation.",
    "explanation": "The blanks should be filled by identifying the target organs for each hormone: hypothalamic hormones act on the pituitary; TSH on the thyroid; ACTH on the adrenal cortex; gonadotrophins on gonads; and MSH on melanocytes.",
    "topic": "Mechanism of Hormone Action and Gland Functions",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex004"
  },
  {
    "question_text": "Write short notes on the functions of the following hormones: (a) Parathyroid hormone (PTH), (b) Thyroid hormones, (c) Thymosins, (d) Androgens, (e) Estrogens, (f) Insulin and Glucagon.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Parathyroid hormone (PTH) increases blood calcium levels by stimulating bone resorption, enhancing calcium reabsorption by the kidneys, and increasing calcium absorption from the intestines. Thyroid hormones (T3 and T4) regulate basal metabolic rate, protein synthesis, and are essential for growth and development. Thymosins aid in the differentiation of T-lymphocytes, essential for cell-mediated immunity and antibody production. Androgens (e.g., testosterone) regulate male reproductive development, secondary sexual characteristics, and contribute to anabolic functions. Estrogens promote the development of female secondary sexual characteristics, regulate the menstrual cycle, and aid in the growth and function of reproductive tissues. Insulin reduces blood glucose levels by facilitating cellular uptake of glucose and stimulating glycogenesis, while glucagon increases blood glucose levels by promoting glycogenolysis and gluconeogenesis.",
    "explanation": "Each hormone has specific functions that help in maintaining homeostasis. PTH regulates calcium balance, thyroid hormones influence metabolism, thymosins are critical for immune function, and the sex hormones (androgens and estrogens) regulate reproductive and secondary sexual characteristics. Insulin and glucagon work in tandem to maintain blood glucose homeostasis.",
    "topic": "Hormone Functions and Regulation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex005"
  },
  {
    "question_text": "Give example(s) of:\n(a) a hyperglycemic hormone and a hypoglycemic hormone,\n(b) a hypercalcemic hormone,\n(c) gonadotrophic hormones,\n(d) a progestational hormone,\n(e) a blood pressure lowering hormone,\n(f) androgens and estrogens.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "a) Hyperglycemic hormone: Glucagon; hypoglycemic hormone: Insulin. b) Hypercalcemic hormone: Parathyroid hormone (PTH). c) Gonadotrophic hormones: Luteinizing hormone (LH) and Follicle stimulating hormone (FSH). d) Progestational hormone: Progesterone. e) Blood pressure lowering hormone: Atrial natriuretic factor (ANF). f) Androgens: Testosterone; Estrogens: Estradiol (and other forms of estrogen).",
    "explanation": "The examples are based on the specific roles of these hormones: glucagon raises blood sugar, insulin lowers it; PTH raises blood calcium; LH and FSH stimulate the gonads; progesterone supports pregnancy; ANF lowers blood pressure; androgens and estrogens are responsible for secondary sex characteristics in males and females respectively.",
    "topic": "Hormone Functions and Effects",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex006"
  },
  {
    "question_text": "Which hormonal deficiency is responsible for the following: (a) Diabetes mellitus, (b) Goitre, (c) Cretinism.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Diabetes mellitus is typically due to insulin deficiency; goitre is usually caused by iodine deficiency leading to reduced thyroid hormone synthesis; and cretinism is the result of hypothyroidism during pregnancy or in early childhood.",
    "explanation": "Insulin deficiency leads to impaired blood glucose regulation (diabetes mellitus). Iodine deficiency causes inadequate thyroid hormone production, resulting in goitre, and maternal or early life hypothyroidism leads to cretinism, marked by stunted growth and developmental delays.",
    "topic": "Endocrine Disorders",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex007"
  },
  {
    "question_text": "Briefly mention the mechanism of action of FSH.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "FSH binds to its specific receptors on the target cell membranes (e.g., ovarian cells in females) which triggers a second messenger cascade (such as cyclic AMP) that eventually leads to gene transcription changes and cellular responses involved in follicular growth and maturation.",
    "explanation": "FSH is a protein hormone that triggers its action by binding to membrane-bound receptors. This binding activates intracellular signaling pathways that result in changes in gene expression, promoting the growth and development of ovarian follicles.",
    "topic": "Mechanism of Hormone Action",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex008"
  },
  {
    "question_text": "Match the following:\nColumn I: (a) T4, (b) PTH, (c) GnRH, (d) LH\nColumn II: Options: (i) Hypothalamus, (ii) Thyroid, (iii) Pituitary.\nProvide the correct matching for each item in Column I.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "a) T4 - (ii) Thyroid, b) PTH - [Parathyroid], c) GnRH - (i) Hypothalamus, d) LH - (iii) Pituitary",
      "a) T4 - (i) Hypothalamus, b) PTH - (ii) Thyroid, c) GnRH - (iii) Pituitary, d) LH - (i) Hypothalamus",
      "a) T4 - (ii) Thyroid, b) PTH - (ii) Thyroid, c) GnRH - (i) Hypothalamus, d) LH - (iii) Pituitary",
      "a) T4 - (iii) Pituitary, b) PTH - (i) Hypothalamus, c) GnRH - (ii) Thyroid, d) LH - (iii) Pituitary"
    ],
    "correct_answer": "a) T4 - (ii) Thyroid, b) PTH - [Parathyroid], c) GnRH - (i) Hypothalamus, d) LH - (iii) Pituitary",
    "explanation": "T4 (thyroxine) is secreted by the thyroid gland, GnRH is produced by the hypothalamus, and LH (luteinizing hormone) is secreted by the anterior pituitary. Although PTH is secreted by the parathyroid glands, the provided options do not list 'parathyroid', which indicates an oversight in the provided options. The correct answer identifies the source of each hormone as per standard endocrine knowledge.",
    "topic": "Hormone Sources and Secretion",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo119",
    "question_id": "cbse_xi_kebo1dd_c119_ex009"
  }
]