[
  {
    "question_text": "What is the primary site for gas exchange in the human body?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Alveoli",
      "Bronchioles",
      "Trachea",
      "Nasal cavity"
    ],
    "correct_answer": "Alveoli",
    "explanation": "Alveoli are the tiny air sacs in the lungs where oxygen is exchanged for carbon dioxide, making them the primary site for gas exchange.",
    "topic": "Exchange of Gases",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen039"
  },
  {
    "question_text": "Which factor has a major influence on the rate of diffusion of gases in the lungs?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Partial pressure gradient",
      "Ion channel activity",
      "Enzymatic reaction",
      "Hormonal control"
    ],
    "correct_answer": "Partial pressure gradient",
    "explanation": "The rate of diffusion of gases is greatly influenced by the pressure or concentration gradient of the gases, which drives their movement.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen040"
  },
  {
    "question_text": "Which of the following is NOT a component of the alveolar diffusion membrane?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Squamous epithelium",
      "Capillary endothelium",
      "Basement substance",
      "Mucus layer"
    ],
    "correct_answer": "Mucus layer",
    "explanation": "The alveolar diffusion membrane consists of the squamous epithelium, the capillary endothelium, and the basement substance, not a mucus layer.",
    "topic": "Exchange of Gases",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen041"
  },
  {
    "question_text": "Gas exchange in tissues occurs primarily through which mechanism?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Pinocytosis",
      "Facilitated diffusion",
      "Simple diffusion",
      "Active transport"
    ],
    "correct_answer": "Simple diffusion",
    "explanation": "Gas exchange is based on simple diffusion, which operates along the concentration gradient without the need for energy.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen042"
  },
  {
    "question_text": "CO2 diffuses more rapidly through the alveolar membrane than O2 primarily because of its higher:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Density",
      "Resilience",
      "Solubility",
      "Volume"
    ],
    "correct_answer": "Solubility",
    "explanation": "CO2 has a much higher solubility in bodily fluids compared to O2, which enables it to diffuse more readily even with similar partial pressure differences.",
    "topic": "Exchange of Gases",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen043"
  },
  {
    "question_text": "Explain the concept of partial pressure in the context of gas mixtures.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Partial pressure is the pressure contributed by an individual gas within a mixture of gases.",
    "explanation": "Each gas in a mixture exerts its own pressure, known as its partial pressure, which is crucial for understanding gas diffusion based on concentration gradients.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen044"
  },
  {
    "question_text": "What is the role of the alveolar squamous epithelium in gas exchange?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It forms a thin barrier that facilitates rapid diffusion of gases between the alveolar air and capillary blood.",
    "explanation": "The thin squamous epithelium minimizes the distance for gas diffusion, making the gas exchange process more efficient.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen045"
  },
  {
    "question_text": "List two factors, other than the concentration gradient, that affect the rate of gas diffusion.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The solubility of the gas and the thickness of the membrane.",
    "explanation": "Both the solubility of the gas in the diffusion medium and the thickness of the diffusion membrane play significant roles in determining the rate at which a gas diffuses.",
    "topic": "Exchange of Gases",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen046"
  },
  {
    "question_text": "Describe how the concentration gradients for O2 and CO2 facilitate their movement between alveoli, blood, and tissues.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "O2 diffuses from areas of high partial pressure in the alveoli to lower levels in the blood and tissues, while CO2 diffuses in the opposite direction, from tissues and blood (with higher CO2 levels) to the alveoli (with lower CO2 levels).",
    "explanation": "The differing partial pressures of O2 and CO2 in the alveoli, blood, and tissues create concentration gradients that drive the diffusion of these gases in opposite directions to support respiration.",
    "topic": "Exchange of Gases",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen047"
  },
  {
    "question_text": "Describe the structure of the alveolar diffusion membrane and explain its significance in gas exchange.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The alveolar diffusion membrane consists of three layers: the thin squamous epithelium of the alveoli, the endothelial layer of the capillaries, and the basement substance that lies between them. This thin structure facilitates rapid diffusion of oxygen and carbon dioxide between the air in the alveoli and the blood.",
    "explanation": "The three-layer structure minimizes diffusion distance, thereby increasing the efficiency of gas exchange. The squamous epithelium and capillary endothelium offer minimal resistance, and the basement substance provides support while remaining thin enough to not hinder diffusion.",
    "topic": "Exchange of Gases",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen048"
  },
  {
    "question_text": "Compare and contrast gas exchange in the alveoli with that between blood and tissues, considering the roles of concentration gradients and differences in partial pressures.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In the alveoli, the partial pressure of O2 is high and that of CO2 is low compared to the blood, driving oxygen into the blood and carbon dioxide out. In contrast, in the systemic tissues, the partial pressure of O2 is low and CO2 is relatively high, resulting in the diffusion of O2 into tissues and CO2 into the blood. These differences create directional gradients that facilitate efficient gas exchange at both sites.",
    "explanation": "The key difference lies in the varying partial pressures at each site. In the lungs, alveolar air has high O2 and low CO2, favoring oxygen uptake and CO2 elimination; in the tissues, the opposite gradient ensures that oxygen reaches cells while CO2 is collected for removal. This contrast is central to efficient respiratory gas exchange.",
    "topic": "Exchange of Gases",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen049"
  },
  {
    "question_text": "Discuss how the difference in solubility between oxygen and carbon dioxide influences their diffusion rates across the alveolar membrane.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Carbon dioxide is 20-25 times more soluble than oxygen, meaning that even a small difference in its partial pressure can result in a large amount of CO2 diffusing per unit time. In contrast, oxygen’s lower solubility requires a greater partial pressure difference to drive its diffusion at a similar rate. This difference in solubility underpins the efficiency of CO2 removal from the blood even when partial pressure gradients are not extremely steep.",
    "explanation": "The higher solubility of CO2 means that it can be released and absorbed more quickly, ensuring that CO2 produced by the tissues is efficiently removed despite its lower partial pressure gradient compared with oxygen. This plays a vital role in maintaining proper respiratory function.",
    "topic": "Exchange of Gases",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen050"
  },
  {
    "question_text": "The alveoli are the primary sites of gas exchange in the human body.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Alveoli are specialized structures designed to maximize surface area and minimize diffusion distance, making them the primary sites of gas exchange in the lungs.",
    "topic": "Exchange of Gases",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen051"
  },
  {
    "question_text": "Differences in the solubility of gases have no effect on the rate of gas diffusion across membranes.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Solubility is a critical factor affecting the rate of diffusion; for example, CO2, which is much more soluble than O2, diffuses at a higher rate per unit partial pressure difference.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen052"
  },
  {
    "question_text": "The basement substance of the alveolar diffusion membrane is thicker than one millimetre.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The total thickness of the alveolar diffusion membrane, including the basement substance, is much less than one millimetre, allowing for rapid gas exchange.",
    "topic": "Exchange of Gases",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen053"
  },
  {
    "question_text": "The partial pressure of O2 in the atmosphere is higher than in the alveoli.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The table indicates that the partial pressure of O2 in the atmosphere (159 mm Hg) is higher than in the alveoli (104 mm Hg), establishing a concentration gradient for oxygen.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen054"
  },
  {
    "question_text": "CO2 always diffuses in the same direction as O2 across the gas exchange membranes.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While O2 diffuses from the alveoli to the blood, CO2 diffuses in the opposite direction, from the tissues and blood to the alveoli, following their respective concentration gradients.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen055"
  },
  {
    "question_text": "The high solubility of CO2 significantly contributes to its rapid diffusion compared to O2.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "CO2's high solubility in fluids means that even small differences in partial pressure lead to significant diffusion, facilitating its efficient removal.",
    "topic": "Exchange of Gases",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen056"
  },
  {
    "question_text": "Given the partial pressures of O2 in the atmosphere (159 mm Hg), alveoli (104 mm Hg), deoxygenated blood (40 mm Hg), and oxygenated blood (95 mm Hg), calculate the difference in O2 partial pressure between the alveoli and deoxygenated blood.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "64 mm Hg",
    "explanation": "Subtract the partial pressure of O2 in deoxygenated blood (40 mm Hg) from that in the alveoli (104 mm Hg). The resulting difference is 104 - 40 = 64 mm Hg, which drives the diffusion of oxygen into the blood.",
    "topic": "Exchange of Gases",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo114",
    "section_id": "04_section_14_3",
    "question_id": "cbse_xi_kebo1dd_c114_gen057"
  }
]