[
  {
    "question_text": "Briefly describe the structure of the Brain.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The brain is divided into three major parts: the forebrain, midbrain, and hindbrain. The forebrain includes the cerebrum, thalamus, and hypothalamus, with the cerebrum further divided into left and right hemispheres connected by the corpus callosum. It features a cerebral cortex (grey matter) and internal white matter. The midbrain is located between the forebrain and hindbrain and contains structures such as the corpora quadrigemina. The hindbrain consists of the pons, cerebellum, and medulla oblongata, with the medulla connecting to the spinal cord.",
    "explanation": "This answer describes the major divisions and structures of the brain as outlined in section 18.4 of the chapter, noting key features such as cerebral hemispheres, corpus callosum, and subdivision of the brain into forebrain, midbrain, and hindbrain.",
    "topic": "Central Neural System, Human Brain",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex001"
  },
  {
    "question_text": "Compare the following: (a) Central neural system (CNS) and Peripheral neural system (PNS); (b) Resting potential and action potential.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For (a) the CNS is comprised of the brain and spinal cord and serves as the main processing and control center, while the PNS includes all the nerves that branch out from the CNS and is divided into somatic and autonomic systems; for (b) resting potential is the electrical potential across a neuron's membrane when it is at rest, maintained by ion gradients and the sodium-potassium pump, whereas an action potential is a rapid reversal of this polarity (depolarization followed by repolarization) that travels along the axon.",
    "explanation": "The comparison highlights the fundamental differences in structure and function between CNS and PNS as described in section 18.2. It also explains that the resting potential is the stable state of the neuron and that the action potential is the active process of transmitting a signal along the nerve fibre as detailed in section 18.3.1.",
    "topic": "Human Neural System and Generation of Nerve Impulse",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex002"
  },
  {
    "question_text": "Explain the following processes: (a) Polarisation of the membrane of a nerve fibre; (b) Depolarisation of the membrane of a nerve fibre; (c) Transmission of a nerve impulse across a chemical synapse.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Polarisation refers to the state of a neuron when the inside of the axon has a negative charge relative to the outside, maintained by differential ion permeability and the sodium-potassium pump. Depolarisation is the process by which a stimulus causes the membrane to become permeable to Na+ ions, leading to an influx of Na+ and a reversal of the membrane’s potential at the stimulated site. Transmission across a chemical synapse involves the arrival of an action potential at the axon terminal, triggering the fusion of synaptic vesicles with the membrane and the release of neurotransmitters into the synaptic cleft, which then bind to receptors on the postsynaptic neuron to generate a new potential.",
    "explanation": "This answer covers the sequential events: the stabilised polarized state of the neuron (resting potential), the initiation of the action potential by depolarisation due to Na+ influx, and how the chemical synapse converts the electrical signal into a chemical signal, which then triggers a response in the next neuron. These processes are explained in sections 18.3.1 and 18.3.2.",
    "topic": "Generation and Conduction of Nerve Impulse, Transmission of Impulses",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex003"
  },
  {
    "question_text": "Draw labelled diagrams of the following: (a) Neuron; (b) Brain.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "For the neuron, the diagram should include the cell body (soma) with the nucleus and Nissl's granules, dendrites receiving signals, and a long axon with a myelin sheath (if myelinated), Nodes of Ranvier, and axon terminals (synaptic knobs). For the brain, the diagram should depict the major parts including the forebrain (with cerebrum, thalamus, and hypothalamus), midbrain, and hindbrain (including pons, cerebellum, and medulla).",
    "explanation": "The answer describes the essential labels and structures needed in the diagrams as per the descriptions in sections 18.3 and 18.4. Drawing these diagrams demonstrates comprehension of the spatial organisation and key features of the neuron and the human brain.",
    "topic": "Neuron Structure and Central Neural System",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex004"
  },
  {
    "question_text": "Write short notes on the following: (a) Neural coordination; (b) Forebrain; (c) Midbrain; (d) Hindbrain; (e) Synapse.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Neural coordination involves the rapid transmission of signals through neurons that enable reflex actions and complex processing in the brain. The forebrain consists of the cerebrum, thalamus, and hypothalamus, and is responsible for higher functions including sensory processing, voluntary movement, and regulation of autonomic functions. The midbrain is located between the forebrain and hindbrain, containing components such as the corpora quadrigemina. The hindbrain includes the pons, cerebellum, and medulla, where vital functions like respiration and balance are controlled. A synapse is the junction between two neurons where neurotransmitters are released to propagate nerve impulses.",
    "explanation": "These short notes summarize key information from the chapter regarding neural coordination and major brain regions, as well as the function of synapses, effectively capturing the essence of the topics in a concise format.",
    "topic": "Neural Coordination and Brain Regions",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex005"
  },
  {
    "question_text": "Give a brief account of Mechanism of synaptic transmission.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "When an action potential reaches the axon terminal of a presynaptic neuron, it triggers the fusion of synaptic vesicles with the membrane, leading to the release of neurotransmitters into the synaptic cleft. These neurotransmitters then bind to specific receptors on the postsynaptic membrane, causing ion channels to open and a new potential to be generated in the postsynaptic neuron, which can be either excitatory or inhibitory.",
    "explanation": "The explanation follows the process outlined in section 18.3.2, detailing how the electrical signal is converted to a chemical one at the synapse and then back to an electrical signal in the postsynaptic neuron.",
    "topic": "Transmission of Impulses, Synapse",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex006"
  },
  {
    "question_text": "Explain the role of Na+ in the generation of action potential.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Na+ plays a crucial role in the generation of an action potential by entering the neuron when a stimulus increases the membrane's permeability to sodium ions. This influx of Na+ reverses the resting negative potential of the neuron (depolarization), initiating the action potential that propagates along the axon.",
    "explanation": "The answer is based on the process described in section 18.3.1, where the rise in sodium permeability leads to depolarization, which is fundamental to nerve impulse generation.",
    "topic": "Generation and Conduction of Nerve Impulse",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex007"
  },
  {
    "question_text": "Differentiate between: (a) Myelinated and non-myelinated axons; (b) Dendrites and axons; (c) Thalamus and Hypothalamus; (d) Cerebrum and Cerebellum.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Myelinated axons are covered by a myelin sheath formed by Schwann cells, which speeds up impulse conduction, whereas non-myelinated axons lack this sheath and conduct impulses more slowly. Dendrites are short, branched processes that receive incoming signals and transmit them to the cell body, while axons are long projections that transmit impulses away from the cell body toward other neurons or effectors. The thalamus acts as a major relay station for sensory and motor signals to the cerebral cortex, whereas the hypothalamus is involved in regulating functions such as temperature, hunger, thirst, and the circadian rhythm, as well as controlling the endocrine system. The cerebrum, the largest part of the brain, is responsible for higher brain functions such as thought, emotion, and voluntary movement, while the cerebellum primarily regulates coordination, balance, and fine motor control.",
    "explanation": "The answer provides clear distinctions between pairs based on structure and function as discussed in sections 18.3 and 18.4 of the chapter. It highlights the importance of myelination, the roles of dendrites versus axons, and the specific responsibilities of different brain regions.",
    "topic": "Neuron Structure and Brain Organization",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex008"
  },
  {
    "question_text": "Answer the following: (a) Which part of the human brain is the most developed? (b) Which part of our central neural system acts as a master clock?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "(a) The cerebrum is the most developed part of the human brain. (b) The hypothalamus, particularly the suprachiasmatic nucleus within it, functions as the master clock regulating circadian rhythms.",
    "explanation": "The cerebrum is noted for its advanced structure and functions, making it the most developed part of the brain. The hypothalamus is responsible for regulating various autonomic functions, including circadian rhythms, by acting as a master clock.",
    "topic": "Forebrain, Central Neural System",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex009"
  },
  {
    "question_text": "Distinguish between: (a) Afferent neurons and efferent neurons; (b) Impulse conduction in a myelinated nerve fibre and an unmyelinated nerve fibre; (c) Cranial nerves and spinal nerves.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Afferent neurons transmit sensory information from peripheral tissues to the CNS, whereas efferent neurons relay motor commands from the CNS to peripheral effectors. In myelinated nerve fibres, the presence of a myelin sheath allows for saltatory conduction, which is much faster than the continuous conduction seen in unmyelinated nerve fibres. Cranial nerves emerge from the brain and primarily serve the head and neck, while spinal nerves emerge from the spinal cord and innervate the rest of the body.",
    "explanation": "The answer differentiates between the types of neurons based on the direction of impulse transmission, the conduction speed based on myelination, and the origin as well as target regions of cranial versus spinal nerves. These distinctions are drawn from the descriptions in sections 18.2 and 18.3.",
    "topic": "Neural Impulse Conduction and Peripheral Neural System",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo118",
    "question_id": "cbse_xi_kebo1dd_c118_ex010"
  },
  {
    "question_text": "Which layer of the cranial meninges is in direct contact with the brain tissue?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Dura mater",
      "Arachnoid",
      "Pia mater",
      "Corpus callosum"
    ],
    "correct_answer": "Pia mater",
    "explanation": "The pia mater is the innermost layer of the cranial meninges and lies in direct contact with the brain tissue, providing a delicate protective layer.",
    "topic": "Central Neural System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen054"
  },
  {
    "question_text": "Which structure connects the two cerebral hemispheres?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cerebral cortex",
      "Corpus callosum",
      "Thalamus",
      "Hypothalamus"
    ],
    "correct_answer": "Corpus callosum",
    "explanation": "The corpus callosum consists of a bundle of nerve fibers that connects the left and right cerebral hemispheres, facilitating interhemispheric communication.",
    "topic": "Forebrain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen055"
  },
  {
    "question_text": "Which of the following brain parts is primarily responsible for controlling hunger, thirst, and body temperature?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Cerebellum",
      "Amygdala",
      "Hypothalamus",
      "Medulla"
    ],
    "correct_answer": "Hypothalamus",
    "explanation": "The hypothalamus contains centers that regulate vital functions such as hunger, thirst, and thermoregulation, in addition to secreting hypothalamic hormones.",
    "topic": "Forebrain",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen056"
  },
  {
    "question_text": "Which brain region contains the corpora quadrigemina?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Forebrain",
      "Midbrain",
      "Hindbrain",
      "Limbic system"
    ],
    "correct_answer": "Midbrain",
    "explanation": "The corpora quadrigemina, which are four rounded swellings, are located in the dorsal part of the midbrain.",
    "topic": "Midbrain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen057"
  },
  {
    "question_text": "Define the function of the cerebral cortex.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The cerebral cortex is involved in processing sensory information, regulating motor functions, and executing complex functions such as memory, communication, and intersensory associations.",
    "explanation": "The cerebral cortex contains regions dedicated to sensory processing, motor control, as well as association areas that mediate advanced functions like memory and language.",
    "topic": "Forebrain",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen058"
  },
  {
    "question_text": "Name two major functions of the medulla oblongata.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Control of respiration and cardiovascular reflexes.",
    "explanation": "The medulla oblongata contains centers that regulate vital functions like breathing and heart rate, as well as aspects of gastric secretion.",
    "topic": "Hindbrain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen059"
  },
  {
    "question_text": "Explain the role of the thalamus in brain function.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The thalamus acts as a major coordinating center that relays sensory and motor signals to different parts of the cerebral cortex.",
    "explanation": "It is essential for processing sensory information and coordinating motor activity by serving as an intermediary between sensory input and higher cortical functions.",
    "topic": "Forebrain",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen060"
  },
  {
    "question_text": "Discuss the structural and functional differences between grey matter and white matter in the cerebrum.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Grey matter, which appears greyish due to the high concentration of neuron cell bodies, is primarily involved in processing and integrating information. In contrast, white matter consists of myelinated nerve fibers that facilitate communication between different brain regions.",
    "explanation": "This difference in composition leads to different appearances and functions: grey matter is key to local information processing through neuron bodies, while white matter provides the connectivity necessary for rapid signal transmission.",
    "topic": "Forebrain",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen061"
  },
  {
    "question_text": "Analyze the coordinated roles of the forebrain, midbrain, and hindbrain in controlling motor functions and vital processes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The forebrain, and specifically the cerebrum, is involved in planning and executing voluntary movements as well as processing sensory information. The midbrain contributes to controlling reflexive responses through structures like the corpora quadrigemina. The hindbrain, which includes the medulla oblongata and pons, is critical for regulating autonomic functions such as respiration and cardiovascular activities, thus integrating motor control with life-sustaining processes.",
    "explanation": "This integration ensures that voluntary motor actions are executed in harmony with involuntary, vital functions managed by the lower brain regions, demonstrating a complex network of communication across brain regions.",
    "topic": "Central Neural System",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen062"
  },
  {
    "question_text": "True or False: The brainstem is composed solely of the medulla oblongata.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The brainstem includes the midbrain, pons, and medulla oblongata, not just the medulla.",
    "topic": "Central Neural System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen063"
  },
  {
    "question_text": "True or False: The cerebral cortex is referred to as grey matter because it contains a high concentration of neuron cell bodies.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The grey appearance of the cerebral cortex is due to the dense packing of neuron cell bodies, which gives it its characteristic color.",
    "topic": "Forebrain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen064"
  },
  {
    "question_text": "True or False: The hypothalamus is located above the thalamus in the forebrain.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The hypothalamus is situated at the base of the thalamus, not above it.",
    "topic": "Forebrain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen065"
  },
  {
    "question_text": "True or False: The pons functions as a bridge connecting different regions of the brain.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The pons contains fiber tracts that interconnect various parts of the brain, serving as a major relay station.",
    "topic": "Hindbrain",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen066"
  },
  {
    "question_text": "True or False: The corpus callosum is part of the white matter of the brain.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The corpus callosum is composed of myelinated nerve fibers, which give it a white appearance, classifying it as white matter.",
    "topic": "Forebrain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen067"
  },
  {
    "question_text": "True or False: The cerebral aqueduct is found in the hindbrain.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "The cerebral aqueduct passes through the midbrain, not the hindbrain.",
    "topic": "Midbrain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen068"
  },
  {
    "question_text": "How many major parts is the human brain divided into?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "3",
    "explanation": "The human brain is divided into three major parts: the forebrain, midbrain, and hindbrain.",
    "topic": "Central Neural System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "05_section_18_4",
    "question_id": "cbse_xi_kebo1dd_c118_gen069"
  },
  {
    "question_text": "Which part of a neuron is primarily responsible for receiving signals from other neurons?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Dendrites",
      "B. Axon",
      "C. Cell Body",
      "D. Synaptic Knob"
    ],
    "correct_answer": "A. Dendrites",
    "explanation": "Dendrites are branching extensions of the neuron that receive signals from other cells.",
    "topic": "Neuron structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen034"
  },
  {
    "question_text": "Which of the following is not considered one of the three major parts of a neuron?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Cell body",
      "B. Dendrites",
      "C. Golgi apparatus",
      "D. Axon"
    ],
    "correct_answer": "C. Golgi apparatus",
    "explanation": "The major parts of a neuron are the cell body, dendrites, and axon. The Golgi apparatus is an organelle within the cell body, not a distinct part of the neuron structure.",
    "topic": "Neuron structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen035"
  },
  {
    "question_text": "What is the primary function of Schwann cells in the nervous system?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Transmitting nerve impulses",
      "B. Forming the myelin sheath around the axon",
      "C. Receiving neurotransmitters",
      "D. Generating the resting potential"
    ],
    "correct_answer": "B. Forming the myelin sheath around the axon",
    "explanation": "Schwann cells wrap around axons to form the myelin sheath, which insulates the axon and speeds up the transmission of nerve impulses.",
    "topic": "Neuron structure and nerve impulse conduction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen036"
  },
  {
    "question_text": "Which type of neuron is typically found in the retina of the eye?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Multipolar neuron",
      "B. Bipolar neuron",
      "C. Unipolar neuron",
      "D. Pseudounipolar neuron"
    ],
    "correct_answer": "B. Bipolar neuron",
    "explanation": "Bipolar neurons, characterized by one axon and one dendrite, are found in the retina of the eye.",
    "topic": "Neuron types",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen037"
  },
  {
    "question_text": "What event initiates the depolarization phase of an action potential in a neuron?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Increased permeability to potassium ions (K+)",
      "B. Increased permeability to sodium ions (Na+)",
      "C. Decreased permeability to calcium ions (Ca2+)",
      "D. Active transport of ions by the sodium-potassium pump"
    ],
    "correct_answer": "B. Increased permeability to sodium ions (Na+)",
    "explanation": "Depolarization begins when a stimulus increases membrane permeability to Na+, allowing Na+ ions to enter the neuron, causing the inside to become more positive.",
    "topic": "Generation of nerve impulse",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen038"
  },
  {
    "question_text": "Explain the role of Nissl granules in a neuron.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Nissl granules are essentially rough endoplasmic reticulum and ribosomes, and they are involved in protein synthesis within the neuron.",
    "explanation": "Nissl granules facilitate the synthesis of proteins, which are necessary for the growth, repair, and maintenance of neuronal functions.",
    "topic": "Neuron structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen039"
  },
  {
    "question_text": "Describe the mechanism by which the sodium-potassium pump maintains the neuronal resting potential.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The sodium-potassium pump actively transports 3 Na+ ions out of the cell and 2 K+ ions into the cell, maintaining a high concentration of Na+ outside and high K+ inside, which contributes to the resting membrane potential.",
    "explanation": "This active transport mechanism creates ionic gradients that are essential for maintaining the polarized state of the neuron.",
    "topic": "Generation and conduction of nerve impulse",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen040"
  },
  {
    "question_text": "What is saltatory conduction and how does it enhance nerve impulse transmission?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Saltatory conduction is the process by which an action potential jumps from one Node of Ranvier to the next along a myelinated axon, allowing for faster transmission of nerve impulses.",
    "explanation": "The presence of myelin sheaths and Nodes of Ranvier facilitates rapid, efficient conduction by reducing the need for continuous conduction along the entire axon membrane.",
    "topic": "Generation and conduction of nerve impulse",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen041"
  },
  {
    "question_text": "How do neurotransmitters function at a chemical synapse?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Neurotransmitters are released from the axon terminals of the presynaptic neuron into the synaptic cleft, where they bind to receptor sites on the postsynaptic membrane, leading to the opening of ion channels and the generation of a new electrical signal.",
    "explanation": "Their release and binding allow for the transmission of impulses across the synapse, ensuring communication between neurons.",
    "topic": "Transmission of impulses",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen042"
  },
  {
    "question_text": "Discuss the processes involved in the generation and propagation of an action potential along an axon.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An action potential is initiated when a stimulus causes the membrane at a specific site to become more permeable to Na+, leading to a rapid influx of Na+ and depolarization of the membrane. As the depolarization reaches a threshold, an action potential is generated. The depolarized region then influences adjacent regions, causing Na+ channels to open sequentially along the axon. Shortly after, K+ channels open, allowing K+ to flow out and repolarize the membrane. This cycle of depolarization and repolarization propagates along the axon until the impulse reaches the axon terminals.",
    "explanation": "This description outlines the critical events in the initiation and conduction of the nerve impulse, highlighting the roles of ion movements and the properties of the neuronal membrane.",
    "topic": "Generation and conduction of nerve impulse",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen043"
  },
  {
    "question_text": "Explain the differences between electrical and chemical synapses, including the advantages of each type.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Electrical synapses involve direct cytoplasmic connections between neurons, allowing for very rapid transmission of impulses via the flow of ions. In contrast, chemical synapses have a synaptic cleft between neurons, and impulse transmission occurs through the release of neurotransmitters, which then bind to receptors on the postsynaptic membrane. While electrical synapses allow for faster transmission, chemical synapses provide greater flexibility in modulating the signal, including excitatory and inhibitory responses.",
    "explanation": "This answer emphasizes both the structural differences and functional advantages of each synapse type, addressing speed and modulation of neural signals.",
    "topic": "Transmission of impulses",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen044"
  },
  {
    "question_text": "Describe the structure of a neuron and explain how each component contributes to its overall function.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A neuron consists of a cell body, dendrites, and an axon. The cell body contains the nucleus and Nissl granules for protein synthesis, which maintain cellular functions. Dendrites receive signals from other neurons, while the axon transmits these signals to other neurons or effectors. The axon terminals end in synaptic knobs containing neurotransmitters that facilitate communication at synapses. Myelin sheath produced by Schwann cells insulates the axon and enables faster signal transmission.",
    "explanation": "This response integrates the function of each structural component of the neuron and explains how they work together to ensure effective neural communication.",
    "topic": "Neuron structure and function",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen045"
  },
  {
    "question_text": "True or False: The resting potential of a neuron is maintained solely by passive diffusion of ions across the membrane.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The resting potential is maintained by both passive diffusion and the active transport of ions, particularly through the sodium-potassium pump.",
    "topic": "Generation of nerve impulse",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen046"
  },
  {
    "question_text": "True or False: Nissl granules in the cell body of a neuron are responsible for protein synthesis.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Nissl granules, which consist of rough endoplasmic reticulum and ribosomes, are the sites of protein synthesis in the neuron.",
    "topic": "Neuron structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen047"
  },
  {
    "question_text": "True or False: Myelinated nerve fibers transmit nerve impulses faster than non-myelinated fibers.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The myelin sheath insulates the axon and allows the impulse to jump between Nodes of Ranvier, resulting in faster signal transmission compared to non-myelinated fibers.",
    "topic": "Generation and conduction of nerve impulse",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen048"
  },
  {
    "question_text": "True or False: The Nodes of Ranvier play a crucial role in facilitating saltatory conduction along a myelinated axon.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Nodes of Ranvier are gaps in the myelin sheath where the action potential is regenerated, allowing rapid propagation of the impulse along the axon.",
    "topic": "Generation and conduction of nerve impulse",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen049"
  },
  {
    "question_text": "True or False: In a chemical synapse, neurotransmitters are released directly into the synaptic cleft to relay the nerve impulse to the postsynaptic neuron.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "At chemical synapses, neurotransmitters are released from the presynaptic axon terminal into the synaptic cleft where they bind to receptors on the postsynaptic membrane.",
    "topic": "Transmission of impulses",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen050"
  },
  {
    "question_text": "True or False: Unipolar neurons typically have multiple dendrites branching from the cell body.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Unipolar neurons have a single process emerging from the cell body, not multiple dendrites. Their structure is distinct from multipolar neurons.",
    "topic": "Neuron types",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen051"
  },
  {
    "question_text": "A single cycle of the sodium-potassium pump moves 3 Na+ ions out of the cell and 2 K+ ions into the cell. What is the net change in the distribution of positive charges in the cell per pump cycle?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "There is a net export of 1 positive charge per cycle.",
    "explanation": "Since 3 positive Na+ ions are pumped out and 2 positive K+ ions are pumped in, the net effect is the loss of 1 positive ion from the cell per cycle, contributing to the resting membrane potential.",
    "topic": "Generation of nerve impulse",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen052"
  },
  {
    "question_text": "If a neuron’s membrane potential changes from -70 mV to +30 mV during an action potential, what is the total magnitude of this change in membrane potential?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The total change is 100 mV.",
    "explanation": "The change is calculated by finding the difference between +30 mV and -70 mV, which equals 100 mV.",
    "topic": "Generation of nerve impulse",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "04_section_18_3",
    "question_id": "cbse_xi_kebo1dd_c118_gen053"
  },
  {
    "question_text": "Which part of the human neural system is responsible for information processing and control?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Brain",
      "Spinal Cord",
      "Central Neural System (CNS)",
      "Peripheral Neural System (PNS)"
    ],
    "correct_answer": "Central Neural System (CNS)",
    "explanation": "The CNS, which includes the brain and the spinal cord, is the site of information processing and control in the human neural system.",
    "topic": "Human Neural System: CNS and PNS",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen019"
  },
  {
    "question_text": "Which type of nerve fibers transmit impulses from tissues or organs to the CNS?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Efferent fibers",
      "Afferent fibers",
      "Somatic fibers",
      "Autonomic fibers"
    ],
    "correct_answer": "Afferent fibers",
    "explanation": "Afferent nerve fibers are responsible for transmitting impulses from tissues or organs to the central neural system.",
    "topic": "Human Neural System: Nerve Fibers",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen020"
  },
  {
    "question_text": "Which division of the peripheral neural system relays impulses from the CNS to skeletal muscles?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Autonomic neural system",
      "Somatic neural system",
      "Sympathetic neural system",
      "Visceral nervous system"
    ],
    "correct_answer": "Somatic neural system",
    "explanation": "The somatic neural system is responsible for relaying impulses from the CNS to skeletal muscles.",
    "topic": "Human Neural System: PNS Divisions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen021"
  },
  {
    "question_text": "What are the subdivisions of the autonomic neural system?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Brain and Spinal Cord",
      "Afferent and Efferent fibers",
      "Sympathetic and Parasympathetic neural systems",
      "Somatic and Visceral systems"
    ],
    "correct_answer": "Sympathetic and Parasympathetic neural systems",
    "explanation": "The autonomic neural system is further classified into the sympathetic neural system and the parasympathetic neural system, which regulate involuntary functions.",
    "topic": "Human Neural System: Autonomic Neural System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen022"
  },
  {
    "question_text": "Which of the following best describes the visceral nervous system?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It transmits impulses only to skeletal muscles.",
      "It processes information exclusively in the brain.",
      "It comprises the nerves, fibres, ganglia, and plexuses that connect the CNS with the viscera.",
      "It is responsible for voluntary motor control."
    ],
    "correct_answer": "It comprises the nerves, fibres, ganglia, and plexuses that connect the CNS with the viscera.",
    "explanation": "The visceral nervous system is part of the PNS and includes the complex network of nerves and other structures that transmit impulses between the CNS and the viscera.",
    "topic": "Human Neural System: Visceral Nervous System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen023"
  },
  {
    "question_text": "Describe the difference between afferent and efferent nerve fibers.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Afferent nerve fibers transmit impulses from tissues or organs to the central nervous system, while efferent nerve fibers transmit regulatory impulses from the central nervous system to the peripheral tissues or organs.",
    "explanation": "This answer distinguishes the direction of impulse transmission: afferent fibers carry information to the CNS; efferent fibers carry commands from the CNS to the body.",
    "topic": "Human Neural System: Nerve Fibers",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen024"
  },
  {
    "question_text": "What roles do the somatic neural system and the autonomic neural system play in the human body?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The somatic neural system relays impulses from the CNS to skeletal muscles for voluntary movements, while the autonomic neural system transmits impulses to involuntary organs and smooth muscles, regulating functions such as heart rate and digestion.",
    "explanation": "This answer highlights the functional differences between the two divisions of the PNS, distinguishing voluntary control from involuntary regulation.",
    "topic": "Human Neural System: PNS Divisions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen025"
  },
  {
    "question_text": "How does the peripheral neural system contribute to the overall neural communication in the body?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The peripheral neural system connects the central neural system with all other parts of the body through nerve fibers, ganglia, and other structures, allowing for the transmission of both sensory and regulatory impulses between the body and the CNS.",
    "explanation": "This answer explains the role of the PNS in linking the CNS with peripheral organs and tissues for effective communication and regulation.",
    "topic": "Human Neural System: CNS and PNS Integration",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen026"
  },
  {
    "question_text": "Explain in detail the structure and function of the central neural system (CNS) and the peripheral neural system (PNS).",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The CNS, comprising the brain and spinal cord, serves as the primary center for information processing and command control. In contrast, the PNS includes all nerves and related structures that connect the CNS to the rest of the body. The PNS is further divided into nerve fiber types (afferent and efferent) and functional divisions (somatic and autonomic). Afferent fibers carry sensory information to the CNS, while efferent fibers transmit responses from the CNS to the body. This division enables a structured and efficient communication network vital for both voluntary and involuntary actions.",
    "explanation": "This comprehensive answer covers the structural and functional aspects of both the CNS and PNS, emphasizing the roles of different nerve fibers and subdivisions in neural communication.",
    "topic": "Human Neural System: Structure and Function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen027"
  },
  {
    "question_text": "Discuss the subdivisions of the peripheral neural system, including the roles of the somatic and autonomic neural systems, and explain how the autonomic system is further divided.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The peripheral neural system is divided into two main subdivisions: the somatic neural system and the autonomic neural system. The somatic neural system is responsible for transmitting impulses from the CNS to skeletal muscles, enabling voluntary movements. The autonomic neural system, on the other hand, controls involuntary functions by transmitting impulses to smooth muscles and internal organs. The autonomic system is further subdivided into the sympathetic neural system, which prepares the body for 'fight or flight' responses, and the parasympathetic neural system, which promotes 'rest and digest' activities. Together, these subdivisions facilitate a finely tuned balance between voluntary actions and automatic physiological processes.",
    "explanation": "This answer elaborates on the structure and functional distinction between the divisions within the PNS, providing clear details on how each subdivision contributes to overall body regulation.",
    "topic": "Human Neural System: PNS Divisions",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen028"
  },
  {
    "question_text": "True or False: The central neural system includes both the brain and the spinal cord.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "This statement is correct because the CNS is made up of the brain and the spinal cord, which are essential for processing information and controlling body functions.",
    "topic": "Human Neural System: CNS",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen029"
  },
  {
    "question_text": "True or False: Efferent nerve fibers carry impulses from tissues and organs to the central neural system.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Efferent nerve fibers transmit impulses from the CNS to peripheral tissues and organs, not the other way around.",
    "topic": "Human Neural System: Nerve Fibers",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen030"
  },
  {
    "question_text": "True or False: The autonomic neural system exclusively controls voluntary muscle movements.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The autonomic neural system controls involuntary functions, such as those in internal organs and smooth muscles, not voluntary muscle movements.",
    "topic": "Human Neural System: Autonomic Neural System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen031"
  },
  {
    "question_text": "True or False: The sympathetic and parasympathetic neural systems are subdivisions of the autonomic neural system.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The autonomic neural system is divided into the sympathetic and parasympathetic neural systems, each regulating different involuntary functions.",
    "topic": "Human Neural System: Autonomic Neural System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen032"
  },
  {
    "question_text": "True or False: The visceral nervous system connects the viscera with the central neural system.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The visceral nervous system is part of the PNS that transmits impulses between the CNS and the viscera, thereby connecting them.",
    "topic": "Human Neural System: Visceral Nervous System",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "03_section_18_2",
    "question_id": "cbse_xi_kebo1dd_c118_gen033"
  },
  {
    "question_text": "What are the highly specialised cells in the neural system called?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Neurons",
      "Glial cells",
      "Epithelial cells",
      "Muscle cells"
    ],
    "correct_answer": "Neurons",
    "explanation": "Neurons are the specialised cells that detect, receive, and transmit stimuli in the neural system.",
    "topic": "Neural System",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen001"
  },
  {
    "question_text": "Which of the following correctly describes Hydra's neural organization?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A network of neurons",
      "A centralized brain",
      "Multiple ganglia",
      "None of the above"
    ],
    "correct_answer": "A network of neurons",
    "explanation": "Hydra possesses a basic neural organization made up of a network of neurons rather than a centralized brain.",
    "topic": "Neural System in Lower Invertebrates",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen002"
  },
  {
    "question_text": "In insects, which structure is present along with ganglia in their neural system?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Brain",
      "Spinal cord",
      "Cerebellum",
      "Medulla oblongata"
    ],
    "correct_answer": "Brain",
    "explanation": "Insects have a neural system that includes a brain in addition to several ganglia and neural tissues.",
    "topic": "Neural System in Insects",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen003"
  },
  {
    "question_text": "Compared to lower invertebrates, vertebrates have a neural system that is:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Less developed",
      "Equally developed",
      "More developed",
      "Non-existent"
    ],
    "correct_answer": "More developed",
    "explanation": "Vertebrates possess a neural system that is more developed than that of lower invertebrates.",
    "topic": "Neural System in Vertebrates",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen004"
  },
  {
    "question_text": "Identify the most accurate statement about the neural systems in animals:",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "All animals possess a highly specialized brain",
      "Invertebrates always have a centralized neural system",
      "Neurons are exclusively found in vertebrates",
      "Neural systems vary in organization, from simple networks to complex brains"
    ],
    "correct_answer": "Neural systems vary in organization, from simple networks to complex brains",
    "explanation": "The neural system shows variety across animals; lower invertebrates like Hydra have a simple network, while insects and vertebrates have more organized structures.",
    "topic": "Comparative Neural Systems",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen005"
  },
  {
    "question_text": "What is the main function of neurons in the neural system?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "To detect, receive, and transmit stimuli",
    "explanation": "Neurons are responsible for detecting, receiving, and transmitting various kinds of stimuli, which is fundamental to the neural system's operation.",
    "topic": "Neural Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen006"
  },
  {
    "question_text": "Describe the neural organization in Hydra.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Hydra has a simple neural organization that consists of a network of neurons.",
    "explanation": "The neural structure in Hydra is characterized by a network of neurons rather than centralized structures.",
    "topic": "Neural System in Lower Invertebrates",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen007"
  },
  {
    "question_text": "Explain the differences in neural system organization between insects and vertebrates.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Insects have a brain along with ganglia and other neural tissues, whereas vertebrates have a more developed neural system featuring complex structures such as a well-organized brain and spinal cord.",
    "explanation": "Insects' neural systems include a brain and ganglia which allow for more coordinated responses, while vertebrates possess even more complex neural frameworks.",
    "topic": "Comparative Neural Systems",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen008"
  },
  {
    "question_text": "Why might neural systems be considered specialized in different animals?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Because neurons in different animals are specialized to detect, receive, and transmit various kinds of stimuli, leading to unique neural organization based on the animal's complexity.",
    "explanation": "The specialization of neurons allows for diverse neural structures that accommodate the needs of the organism, from simple systems in Hydra to complex systems in vertebrates.",
    "topic": "Neural Specialization",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen009"
  },
  {
    "question_text": "Discuss the evolution of neural system complexity across animal species as described in the text.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The evolution of neural systems shows an increasing complexity from simple to complex organizations. Lower invertebrates like Hydra possess a basic network of neurons. Insects represent a more organized system with a brain and ganglia, facilitating integrated responses. Vertebrates further develop these systems with highly complex brains and spinal cords that support advanced functions.",
    "explanation": "This answer outlines the progression from simple neural networks in Hydra to more centralized and complex systems in insects and vertebrates, reflecting evolutionary improvements to support sophisticated behaviors.",
    "topic": "Evolution of Neural Systems",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen010"
  },
  {
    "question_text": "Compare and contrast the neural organization in Hydra and insects, and analyze how these differences reflect their respective biological complexities.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Hydra's neural system is a decentralized network of neurons, adapting to its simple body plan. In contrast, insects exhibit a more centralized neural organization that includes a brain and multiple ganglia, which supports more complex behaviors. The differences in organization are reflective of the organism's complexity, with more advanced systems needed for higher-level processing and behavioral coordination.",
    "explanation": "This response examines the structural differences between simple and more evolved neural systems, linking them to functional and biological complexity in the respective organisms.",
    "topic": "Comparative Neural Systems",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen011"
  },
  {
    "question_text": "Evaluate the importance of specialized neurons in the functioning of the neural system, using examples from the text.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Specialized neurons are crucial because they enable the detection, reception, and transmission of stimuli, which are fundamental to an organism's interaction with its environment. For example, the simple network of neurons in Hydra allows for basic responsiveness, whereas the more intricate neural structures in insects and vertebrates support higher-order functions and complex behaviors.",
    "explanation": "The answer emphasizes how the specialization of neurons contributes to the varied complexity of neural systems across different organisms and underscores its evolutionary benefits.",
    "topic": "Neural Function and Specialization",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen012"
  },
  {
    "question_text": "Hydra has a centralized brain.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Hydra possesses a simple network of neurons without a centralized brain.",
    "topic": "Neural System in Lower Invertebrates",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen013"
  },
  {
    "question_text": "Neurons are the primary cells responsible for transmitting stimuli throughout the neural system.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Neurons are specialized for detecting, receiving, and transmitting stimuli, making them key players in the neural system.",
    "topic": "Neural Function",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen014"
  },
  {
    "question_text": "Insects do not possess any ganglia in their neural system.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Insects have a neural system that includes both a brain and several ganglia.",
    "topic": "Neural System in Insects",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen015"
  },
  {
    "question_text": "Vertebrates have more developed neural systems compared to lower invertebrates.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text explicitly states that vertebrates possess a more developed neural system than lower invertebrates.",
    "topic": "Neural System in Vertebrates",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen016"
  },
  {
    "question_text": "All animals have a neural system composed exclusively of neurons.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "While the text emphasizes that the neural system is composed of specialized neurons, it does not exclude the presence or contribution of other cell types in different organisms.",
    "topic": "Neural System Composition",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen017"
  },
  {
    "question_text": "A greater degree of neural organization implies a more developed nervous system.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text indicates that as neural organization becomes more complex (e.g., development of brains and ganglia), the nervous system is considered more developed.",
    "topic": "Neural System Development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "kebo118",
    "section_id": "02_section_18_1",
    "question_id": "cbse_xi_kebo1dd_c118_gen018"
  }
]