[
  {
    "question_text": "Which of the following is not correct? (a) Robert Brown discovered the cell. (b) Schleiden and Schwann formulated the cell theory. (c) Virchow explained that cells are formed from pre-existing cells. (d) A unicellular organism carries out its life activities within a single cell.",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Robert Brown discovered the cell.",
      "Schleiden and Schwann formulated the cell theory.",
      "Virchow explained that cells are formed from pre-existing cells.",
      "A unicellular organism carries out its life activities within a single cell."
    ],
    "correct_answer": "Robert Brown discovered the cell.",
    "explanation": "Anton Von Leeuwenhoek was the first to see and describe a live cell, while Robert Brown is credited with discovering the nucleus. Thus, the statement that Robert Brown discovered the cell is not correct.",
    "topic": "Cell History and Cell Theory",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex001"
  },
  {
    "question_text": "New cells generate from",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "bacterial fermentation",
      "regeneration of old cells",
      "pre-existing cells",
      "abiotic materials"
    ],
    "correct_answer": "pre-existing cells",
    "explanation": "According to the cell theory as modified by Virchow, all cells arise from pre-existing cells, making option (c) the correct answer.",
    "topic": "Cell Theory",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex002"
  },
  {
    "question_text": "Match the following: (a) Cristae (i) Flat membranous sacs in stroma, (b) Cisternae (ii) Infoldings in mitochondria, (c) Thylakoids (iii) Disc-shaped sacs in Golgi apparatus.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Cristae: (ii), Cisternae: (iii), Thylakoids: (i)",
    "explanation": "Cristae are the infoldings of the inner mitochondrial membrane, cisternae are the disc-shaped sacs present in the Golgi apparatus, and thylakoids are the flat membranous sacs found in the chloroplast stroma.",
    "topic": "Cell Organelles",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex003"
  },
  {
    "question_text": "Which of the following is correct: (a) Cells of all living organisms have a nucleus. (b) Both animal and plant cells have a well defined cell wall. (c) In prokaryotes, there are no membrane bound organelles. (d) Cells are formed de novo from abiotic materials.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cells of all living organisms have a nucleus.",
      "Both animal and plant cells have a well defined cell wall.",
      "In prokaryotes, there are no membrane bound organelles.",
      "Cells are formed de novo from abiotic materials."
    ],
    "correct_answer": "In prokaryotes, there are no membrane bound organelles.",
    "explanation": "Prokaryotic cells lack a well-defined nucleus and other membrane-bound organelles, unlike eukaryotic cells. This makes option (c) the correct statement.",
    "topic": "Prokaryotic vs Eukaryotic Cells",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex004"
  },
  {
    "question_text": "What is a mesosome in a prokaryotic cell? Mention the functions that it performs.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A mesosome is a specialized infolding of the plasma membrane in prokaryotic cells. It is involved in functions such as cell wall formation, DNA replication, distribution of genetic material during cell division, and increasing the surface area for electron transport and enzymatic reactions related to respiration and secretion.",
    "explanation": "Mesosomes are unique to prokaryotes and serve multiple functions including enhancing the surface area of the plasma membrane and assisting in processes like cell division and respiration. Their structure as infoldings of the membrane supports these functions.",
    "topic": "Prokaryotic Cells",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex005"
  },
  {
    "question_text": "How do neutral solutes move across the plasma membrane? Can the polar molecules also move across it in the same way? If not, then how are these transported across the membrane?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Neutral solutes move across the plasma membrane by simple diffusion along the concentration gradient. Polar molecules, however, cannot easily pass through the nonpolar lipid bilayer and are transported by carrier proteins via facilitated diffusion or by active transport mechanisms when moving against a concentration gradient.",
    "explanation": "Simple diffusion allows neutral solutes to cross the lipid bilayer without assistance, but because polar molecules are repelled by the hydrophobic interior of the membrane, they require specialized transport proteins to help them cross.",
    "topic": "Cell Membrane and Transport",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex006"
  },
  {
    "question_text": "Name two cell-organelles that are double membrane bound. What are the characteristics of these two organelles? State their functions and draw labelled diagrams of both.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Mitochondria and Chloroplasts are two double membrane bound organelles. Mitochondria have an outer membrane and a highly folded inner membrane (cristae) that increase surface area, and they are the site of aerobic respiration and ATP production. Chloroplasts also have a double membrane; their inner membrane encloses the stroma, within which stacks of thylakoids (grana) are found, essential for photosynthesis.",
    "explanation": "Both mitochondria and chloroplasts are critical for energy conversion processes in the cell, with mitochondria generating ATP through respiration and chloroplasts carrying out photosynthesis to produce sugars. Their double membrane structure is crucial for compartmentalizing the processes.",
    "topic": "Mitochondria and Plastids",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex007"
  },
  {
    "question_text": "What are the characteristics of prokaryotic cells?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Prokaryotic cells are generally small, lack a well-defined nucleus, and do not possess membrane-bound organelles (except ribosomes). They have a cell envelope which includes a plasma membrane and usually a cell wall, and contain naked circular DNA, sometimes with additional plasmids. Some may have structures like mesosomes and flagella.",
    "explanation": "The defining features of prokaryotic cells include the absence of a nucleus and most organelles which are present in eukaryotic cells. Their structure is simpler, which relates to their rapid reproduction and adaptability.",
    "topic": "Prokaryotic Cells",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex008"
  },
  {
    "question_text": "Multicellular organisms have division of labour. Explain.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In multicellular organisms, cells are specialized to perform specific tasks. This division of labour increases the efficiency of the organism by allowing cells to focus on a narrow range of functions, which, when coordinated, support the survival, growth, and reproduction of the entire organism.",
    "explanation": "Cell specialization means that different cells, tissues, and organs perform distinct functions such as nutrient absorption, defense, and signal transmission. This integrated function is essential for the overall operation and efficiency of multicellular life forms.",
    "topic": "Cell Specialization and Organisation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex009"
  },
  {
    "question_text": "Cell is the basic unit of life. Discuss in brief.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The cell is considered the basic unit of life because it is the smallest unit that can perform all life functions. It carries out essential activities such as metabolism, energy conversion, and reproduction. Both unicellular and multicellular organisms are composed of cells, and their structure and function make them capable of independent living or participation in a larger, coordinated system.",
    "explanation": "This discussion covers the historical and functional significance of cells, emphasizing that all living organisms are made up of cells that support life functions. The cell’s role as a fundamental building block is central to biology.",
    "topic": "What is a Cell?",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex010"
  },
  {
    "question_text": "What are nuclear pores? State their function.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Nuclear pores are small openings found in the nuclear envelope that allow for the regulated exchange of molecules between the nucleus and the cytoplasm, such as the passage of RNA and proteins.",
    "explanation": "Nuclear pores are crucial for maintaining cellular function by controlling the flow of molecules, thereby regulating gene expression and the overall activity within the nucleus.",
    "topic": "Nucleus",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex011"
  },
  {
    "question_text": "Both lysosomes and vacuoles are endomembrane structures, yet they differ in terms of their functions. Comment.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Lysosomes are membrane-bound vesicles that contain hydrolytic enzymes for intracellular digestion, while vacuoles are storage organelles that hold water, sap, and waste products. Lysosomes function primarily in degradation and recycling of cellular components, whereas vacuoles are involved in storage and maintaining cell turgor.",
    "explanation": "Although both are part of the endomembrane system, lysosomes and vacuoles have distinct roles. Lysosomes break down macromolecules, while vacuoles store substances, which reflects their specialised functions in the cell.",
    "topic": "Endomembrane System",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex012"
  },
  {
    "question_text": "Describe the structure of the following with the help of labelled diagrams: (i) Nucleus (ii) Centrosome.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The nucleus is enclosed by a double membrane called the nuclear envelope, which contains nuclear pores, and houses chromatin and one or more nucleoli. The centrosome consists of a pair of centrioles surrounded by pericentriolar material and plays a key role in organizing microtubules during cell division.",
    "explanation": "This answer outlines the key structural components of the nucleus and centrosome, essential for understanding their roles in controlling genetic information and assisting in cell division respectively. Labelled diagrams typically highlight features such as the nuclear envelope, pores, chromatin, nucleoli, centrioles, and surrounding material.",
    "topic": "Nucleus and Centrosome",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex013"
  },
  {
    "question_text": "What is a centromere? How does the position of centromere form the basis of classification of chromosomes. Support your answer with a diagram showing the position of centromere on different types of chromosomes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A centromere is the primary constriction on a chromosome where two sister chromatids are held together. The position of the centromere divides the chromosome into arms and forms the basis for classification into metacentric (centromere in the middle), submetacentric (centromere slightly off center), acrocentric (centromere near one end), and telocentric (centromere at the very end) chromosomes.",
    "explanation": "The centromere is essential for proper chromosome segregation during cell division. Its location on the chromosome determines the relative lengths of the arms, which is used to classify chromosome types. A diagram typically illustrates these different positions to help visualise the classifications.",
    "topic": "Chromosomes",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "kebo108",
    "question_id": "cbse_xi_kebo1dd_c108_ex014"
  }
]