[
  {
    "question_text": "Which of the following best defines 'biodiversity' as popularized by Edward Wilson?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Combined diversity at the species level only",
      "Combined diversity at all levels of biological organization",
      "Genetic diversity within individual species",
      "Ecological diversity within a single habitat"
    ],
    "correct_answer": "Combined diversity at all levels of biological organization",
    "explanation": "Edward Wilson popularized biodiversity as the combined diversity present at all levels of biological organization, from genes to ecosystems.",
    "topic": "Definition of Biodiversity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen001"
  },
  {
    "question_text": "India is noted for its rich genetic resources because it has more than ______ genetically different strains of rice.",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "10,000",
      "20,000",
      "50,000",
      "100,000"
    ],
    "correct_answer": "50,000",
    "explanation": "The text clearly states that India has more than 50,000 genetically different strains of rice, highlighting its remarkable genetic diversity.",
    "topic": "Genetic Diversity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen002"
  },
  {
    "question_text": "Which of the following factors best explains why tropical regions harbor more species than temperate regions?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Frequent glaciations that promote speciation",
      "More seasonal variations creating distinct habitats",
      "Higher solar energy, longer evolutionary stability, and less seasonality",
      "Greater human intervention leading to habitat modifications"
    ],
    "correct_answer": "Higher solar energy, longer evolutionary stability, and less seasonality",
    "explanation": "Tropical regions have remained relatively undisturbed for millions of years, have stable and less seasonal climates, and receive more solar energy, all of which promote a high level of species diversification.",
    "topic": "Latitudinal Gradients",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen003"
  },
  {
    "question_text": "In the species-area relationship expressed as 'log S = log C + Z log A', what does the slope (Z) primarily indicate?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The total number of species in a small region",
      "The strength of the relationship between area and species richness",
      "The rate at which species become extinct",
      "The direct measurement of ecosystem productivity"
    ],
    "correct_answer": "The strength of the relationship between area and species richness",
    "explanation": "The slope (Z) in the species-area relationship indicates how rapidly species richness increases with area, reflecting the strength of the relationship between area size and the number of species present.",
    "topic": "Species-Area Relationship",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen004"
  },
  {
    "question_text": "Why are steeper slopes (with Z values between 0.6 and 1.2) observed when comparing species-area relationships at very large scales such as entire continents?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Because smaller areas have a higher rate of speciation",
      "Because larger areas contain more ecological niches and diverse habitats",
      "Due to uniform species distribution across continents",
      "Because human activities have no effect on large-scale biodiversity"
    ],
    "correct_answer": "Because larger areas contain more ecological niches and diverse habitats",
    "explanation": "When comparing large areas like continents, the diversity increases steeply due to greater habitat diversity and more available niches. This leads to higher Z values in the species-area relationship.",
    "topic": "Species-Area Relationship",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen005"
  },
  {
    "question_text": "Explain the difference between genetic diversity and species diversity, and provide one example of each as mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Genetic diversity refers to the variation in genetic makeup within a single species, such as differences in the potency and concentration of reserpine in Rauwolfia vomitoria. Species diversity refers to the variety and number of different species in a region, like the greater amphibian diversity in the Western Ghats compared to the Eastern Ghats.",
    "explanation": "Genetic diversity focuses on differences within a species while species diversity considers the variation among different species, both of which are crucial for ecosystem health.",
    "topic": "Biodiversity Levels",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen006"
  },
  {
    "question_text": "Describe two major factors that contribute to the greater biodiversity of tropical regions compared to temperate regions.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "One factor is the long-term evolutionary stability of the tropics, which have experienced fewer disturbances like glaciations, allowing more time for speciation. Another factor is the relatively constant environmental conditions and higher solar energy, which promote higher productivity and niche specialization.",
    "explanation": "Long evolutionary time without major disturbances allows more species to evolve, while stable conditions and higher energy availability boost productivity and diversity.",
    "topic": "Latitudinal Gradients",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen007"
  },
  {
    "question_text": "What is the rivet popper hypothesis, and how does it illustrate the importance of species diversity in ecosystems?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The rivet popper hypothesis compares species in an ecosystem to rivets in an airplane. While the loss of a few rivets may not immediately impair the function of the airplane, the removal of too many can jeopardize its structural integrity. Similarly, while the loss of a few species might not initially affect ecosystem functioning, continued species loss can eventually lead to a collapse in ecosystem stability.",
    "explanation": "The analogy emphasizes that even seemingly insignificant species play important roles, and their eventual loss can have cumulative negative effects on ecosystem health.",
    "topic": "Species Diversity and Ecosystem Function",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen008"
  },
  {
    "question_text": "Discuss the importance of species diversity to ecosystem stability and functioning, incorporating details from David Tilman's experiments and the rivet popper hypothesis.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Species diversity is crucial for ecosystem stability and productivity. David Tilman’s experiments demonstrated that plots with a greater number of species showed less year-to-year variation in biomass production and higher overall productivity. This suggests that diverse ecosystems are more resistant and resilient to disturbances. The rivet popper hypothesis further illustrates that each species plays a significant role in the ecosystem, much like each rivet is essential in maintaining the structural integrity of an airplane. The loss of multiple species may eventually lead to a breakdown in ecosystem functions similar to an airplane losing too many rivets. Together, these findings underscore the critical value of maintaining high species diversity for ecosystem health.",
    "explanation": "The answer integrates experimental evidence and analogical reasoning to highlight how species diversity contributes to ecosystem resilience and functionality, ensuring long-term sustainability.",
    "topic": "Importance of Species Diversity",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen009"
  },
  {
    "question_text": "Evaluate the major causes of biodiversity loss mentioned in the text and propose conservation strategies to mitigate these losses. Be sure to address habitat loss, overexploitation, alien species invasions, and co-extinctions in your answer.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The text identifies four major causes of biodiversity loss: habitat loss and fragmentation, overexploitation, alien species invasions, and co-extinctions. Habitat loss, notably in tropical rainforests, disrupts and diminishes the living space of countless species. Overexploitation depletes natural resources and can drive species to extinction. Alien species invasions introduce competitors, predators, or diseases that native species cannot withstand, while co-extinctions occur when the loss of one species leads to the loss of others that depend on it. Conservation strategies could include the establishment and effective management of protected areas, sustainable resource harvesting practices, strict controls on the introduction of non-native species, and the development of restoration programs to reconnect fragmented habitats. These strategies aim to preserve ecosystem integrity and ensure the survival of species, thereby maintaining overall biodiversity.",
    "explanation": "The answer provides a structured evaluation of the drivers behind biodiversity loss and outlines practical conservation strategies that target each cause, demonstrating an integrated approach to ecosystem management.",
    "topic": "Loss of Biodiversity and Conservation",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen010"
  },
  {
    "question_text": "More than 70% of all recorded species on Earth are animals.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text states that over 70% of the species recorded are animals, affirming the high diversity within the animal kingdom.",
    "topic": "Biodiversity Inventory",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen011"
  },
  {
    "question_text": "On a logarithmic scale, the species-area relationship becomes a linear relationship.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "When plotted on a logarithmic scale, the species-area relationship is described by the linear equation 'log S = log C + Z log A', indicating a straight-line relationship.",
    "topic": "Species-Area Relationship",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen012"
  },
  {
    "question_text": "The current rates of species extinction are estimated to be similar to those in pre-human times.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text explains that modern species extinction rates are estimated to be 100 to 1,000 times faster than those observed in pre-human times, largely due to human activities.",
    "topic": "Biodiversity Loss",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen013"
  },
  {
    "question_text": "Habitat fragmentation leads only to the loss of total habitat area and has no effect on species in the remaining fragments.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Habitat fragmentation not only reduces total habitat area but also disrupts the connectivity and size of remaining patches, adversely affecting species that require larger, continuous areas.",
    "topic": "Causes of Biodiversity Loss",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen014"
  },
  {
    "question_text": "The introduction of alien species can lead to the extinction of indigenous species.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Alien species, when they become invasive, can outcompete or prey upon native species. For example, the introduction of the Nile perch in Lake Victoria led to the extinction of many indigenous cichlid fish species.",
    "topic": "Alien Species Invasions",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen015"
  },
  {
    "question_text": "Conventional taxonomic methods have accurately catalogued the vast majority of prokaryotic species.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text notes that many prokaryotic species have not been accurately catalogued because conventional taxonomic methods are not well-suited for identifying microbial species, especially those that are not culturable.",
    "topic": "Prokaryotic Diversity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen016"
  },
  {
    "question_text": "If the currently recorded 1.5 million species represent approximately 22% of the total species estimated on Earth, calculate the total estimated number of species.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 7 million species",
    "explanation": "Using the proportion 1.5 million = 22% of total species, the total is calculated as 1.5 million divided by 0.22, which is roughly 6.8 million. This is conventionally rounded to about 7 million species.",
    "topic": "Species Inventories",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen017"
  },
  {
    "question_text": "Given that 45,000 plant species have been recorded in India, and this represents about 22% of the total plant species in the country, estimate the total number of plant species in India.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 204,500 plant species",
    "explanation": "If 45,000 species represent 22% of the total, the total number is calculated as 45,000 divided by 0.22, which is about 204,545. This value is approximated to 204,500 plant species.",
    "topic": "Biodiversity in India",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo113",
    "section_id": "02_section_13_1",
    "question_id": "cbse_xii_lebo1dd_c113_gen018"
  }
]