[
  {
    "question_text": "What structure forms the connection between the developing embryo and the maternal blood after implantation?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Yolk sac",
      "Umbilical cord",
      "Chorionic villi",
      "Endoderm"
    ],
    "correct_answer": "Chorionic villi",
    "explanation": "After implantation, finger-like projections called chorionic villi form on the trophoblast. These villi interdigitate with uterine tissue to form the placenta that connects the embryo with the maternal blood.",
    "topic": "Placenta formation and chorionic villi",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen093"
  },
  {
    "question_text": "Which of the following hormones is produced by the placenta to support pregnancy?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Human chorionic gonadotropin (hCG)",
      "Relaxin",
      "Cortisol",
      "Thyroxine"
    ],
    "correct_answer": "Human chorionic gonadotropin (hCG)",
    "explanation": "The placenta produces several hormones including hCG, which supports the maintenance of pregnancy by influencing the corpus luteum. Although relaxin is also important, it is secreted by the ovary in the later phase.",
    "topic": "Endocrine functions of the placenta",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen094"
  },
  {
    "question_text": "What is the primary function of the placenta in embryonic development?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It provides only oxygen to the embryo.",
      "It supplies only nutrients to the embryo.",
      "It facilitates the exchange of oxygen, nutrients, and waste products between the mother and the embryo.",
      "It produces waste products for the embryo."
    ],
    "correct_answer": "It facilitates the exchange of oxygen, nutrients, and waste products between the mother and the embryo.",
    "explanation": "The placenta functions as a critical interface between the developing embryo and maternal body, supplying oxygen and nutrients while removing carbon dioxide and waste materials.",
    "topic": "Placenta function",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen095"
  },
  {
    "question_text": "How do the chorionic villi and uterine tissue interact during pregnancy?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "They remain completely separate.",
      "They form a non-functional barrier.",
      "They become interdigitated to form a structural and functional unit called the placenta.",
      "They merge to form the yolk sac."
    ],
    "correct_answer": "They become interdigitated to form a structural and functional unit called the placenta.",
    "explanation": "After implantation, the interdigitation of chorionic villi with the uterine tissue creates the placenta, which is essential for nutrient exchange and hormonal functions.",
    "topic": "Placenta formation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen096"
  },
  {
    "question_text": "During which month of human pregnancy is the embryo's heart typically formed?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "First month",
      "Second month",
      "Third month",
      "Fourth month"
    ],
    "correct_answer": "First month",
    "explanation": "According to the content, the embryo’s heart is formed by the end of the first month of pregnancy.",
    "topic": "Timelines in embryonic development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen097"
  },
  {
    "question_text": "What role does the umbilical cord play in embryonic development?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It connects the embryo to the placenta, enabling the transport of oxygen, nutrients, and waste products.",
    "explanation": "The umbilical cord is the vital connection between the developing embryo and the placenta, facilitating the exchange of necessary substances.",
    "topic": "Roles of the umbilical cord",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen098"
  },
  {
    "question_text": "Name the three primary germ layers that appear during embryonic development.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Ectoderm, endoderm, and mesoderm",
    "explanation": "The three germ layers, ectoderm, endoderm, and mesoderm, form during early embryonic development and give rise to all tissues and organs in adults.",
    "topic": "Embryonic differentiation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen099"
  },
  {
    "question_text": "List two hormones produced by the placenta and describe one function for each during pregnancy.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Human chorionic gonadotropin (hCG) supports the corpus luteum to maintain pregnancy and human placental lactogen (hPL) modifies maternal metabolism to support fetal growth.",
    "explanation": "Both hCG and hPL are key hormones produced by the placenta. hCG helps maintain the corpus luteum, while hPL adjusts the mother's metabolism to better nourish the fetus.",
    "topic": "Placental hormones",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen100"
  },
  {
    "question_text": "Explain how stem cells in the inner cell mass contribute to the development of the embryo.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The stem cells in the inner cell mass have the potency to differentiate into all tissues and organs, serving as the foundation for the entire developmental process.",
    "explanation": "The inner cell mass is crucial because its stem cells can transform into any type of cell, leading to the formation of the embryo's various tissues and structures.",
    "topic": "Stem cell potency",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen101"
  },
  {
    "question_text": "Discuss the multiple roles of the placenta in embryonic development, including its function in nutrient exchange and hormone production.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The placenta serves as a critical interface by facilitating the supply of oxygen and nutrients while removing waste products from the embryo. Additionally, it functions as an endocrine tissue producing hormones like hCG, hPL, estrogens, and progestogens, which are essential for maintaining pregnancy and supporting fetal growth.",
    "explanation": "This answer should cover the dual role of the placenta in both physical and biochemical support, emphasizing its structure formed from interdigitating chorionic villi and uterine tissue and its significance in hormonal regulation.",
    "topic": "Placental functions",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen102"
  },
  {
    "question_text": "Evaluate the effects of hormonal changes during pregnancy on both fetal development and maternal physiology. Include the roles of increased estrogen, progesterone, cortisol, and other hormones.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "During pregnancy, increased levels of hormones such as estrogen, progesterone, cortisol, and prolactin support fetal development and cause significant metabolic changes in the mother. Estrogen and progesterone are crucial for uterine growth and maintaining the uterine lining; cortisol affects energy metabolism; and prolactin prepares the breasts for lactation. These hormonal changes create an optimal environment for the development of the fetus while adapting maternal physiology to meet the increased demands of pregnancy.",
    "explanation": "The response should detail how each hormone contributes to both fetal growth and maternal adaptations, linking endocrine changes directly to the biological requirements of pregnancy.",
    "topic": "Hormonal changes during pregnancy",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen103"
  },
  {
    "question_text": "Analyze the process of embryonic differentiation during the first trimester and explain the importance of the three germ layers in forming the organs and tissues of the fetus.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "During the first trimester, the inner cell mass differentiates into three primary germ layers: the ectoderm, mesoderm, and endoderm. The ectoderm gives rise to structures such as the nervous system and skin, the mesoderm forms muscles, bones, and the circulatory system, and the endoderm develops into internal organs like the liver and lungs. This process of differentiation is vital because it lays the foundation for all the tissues and organs in a fully developed fetus.",
    "explanation": "This answer should describe the sequence of events in embryonic development and highlight the critical roles of each germ layer in forming specific systems within the body.",
    "topic": "Embryonic differentiation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen104"
  },
  {
    "question_text": "True or False: The chorionic villi develop after implantation and are essential for forming the placenta.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Chorionic villi emerge following implantation and intertwine with the uterine tissue to form the placenta, which is crucial for the exchange of nutrients and waste products.",
    "topic": "Placenta formation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen105"
  },
  {
    "question_text": "True or False: The umbilical cord is solely responsible for supplying nutrients to the embryo.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The umbilical cord not only supplies nutrients but also transports oxygen to the embryo and removes waste products.",
    "topic": "Roles of the umbilical cord",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen106"
  },
  {
    "question_text": "True or False: During pregnancy, the levels of hormones such as estrogens, progestogens, cortisol, and prolactin decrease in maternal blood.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In reality, the levels of these hormones increase severalfold during pregnancy to support fetal growth and maternal adaptations.",
    "topic": "Hormonal changes during pregnancy",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen107"
  },
  {
    "question_text": "True or False: Cellular differentiation during the first trimester can be identified externally by the appearance of hair on the fetus.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Cellular differentiation occurs during the first trimester, but external signs like hair typically appear around the fifth month of pregnancy.",
    "topic": "Embryonic fetal development",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen108"
  },
  {
    "question_text": "True or False: Stem cells in the inner cell mass have the potential to differentiate into all tissues and organs in the adult.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The inner cell mass contains stem cells that are pluripotent, meaning they can give rise to all tissues and organs in an adult.",
    "topic": "Stem cell potency",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen109"
  },
  {
    "question_text": "If a human pregnancy lasts 9 months, how many weeks does that approximately equate to, given that 1 month is about 4 weeks?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 36 weeks",
    "explanation": "Multiplying 9 months by 4 weeks per month gives an approximate total of 36 weeks for a full-term pregnancy.",
    "topic": "Pregnancy duration",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen110"
  },
  {
    "question_text": "By the end of how many weeks is the first trimester of pregnancy typically completed in humans?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "12 weeks",
    "explanation": "The first trimester of pregnancy is usually considered complete by the end of 12 weeks, during which most major organ systems are formed.",
    "topic": "Timeline in embryonic development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo102",
    "section_id": "07_section_2_6",
    "question_id": "cbse_xii_lebo1dd_c102_gen111"
  }
]