[
  {
    "question_text": "According to Watson and Crick, what is the mechanism by which DNA replicates?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Conservative replication",
      "Semiconservative replication",
      "Dispersive replication",
      "Random replication"
    ],
    "correct_answer": "Semiconservative replication",
    "explanation": "Watson and Crick proposed that the two DNA strands separate and each serve as a template for a new strand, leading to one parental and one new strand in each daughter molecule. This is known as semiconservative replication.",
    "topic": "Replication mechanism",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen054"
  },
  {
    "question_text": "Which method did Meselson and Stahl use to separate DNA molecules based on density?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Centrifugation in a sucrose gradient",
      "Centrifugation in a CsCl density gradient",
      "Gel electrophoresis",
      "Chromatography"
    ],
    "correct_answer": "Centrifugation in a CsCl density gradient",
    "explanation": "The experiment relied on the different densities conferred by the 15N and 14N isotopes. A cesium chloride (CsCl) density gradient was used to resolve these differences.",
    "topic": "Experimental proof of semiconservative replication",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen055"
  },
  {
    "question_text": "Which enzyme catalyzes the polymerisation of deoxynucleotides during DNA replication in E. coli?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "DNA-dependent DNA polymerase",
      "Helicase",
      "DNA ligase",
      "Primase"
    ],
    "correct_answer": "DNA-dependent DNA polymerase",
    "explanation": "DNA-dependent DNA polymerase synthesizes the new DNA strand by adding deoxynucleotides complementary to the template strand, making it the main enzyme responsible for polymerisation.",
    "topic": "Replication machinery and enzymes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen056"
  },
  {
    "question_text": "Why is DNA synthesis discontinuous on one strand at the replication fork?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Because DNA polymerases function only in the 5' to 3' direction",
      "Due to degradation of one of the strands",
      "Because the replication fork is too narrow",
      "Owing to insufficient energy supply"
    ],
    "correct_answer": "Because DNA polymerases function only in the 5' to 3' direction",
    "explanation": "DNA polymerases add nucleotides in a 5' to 3' direction. Due to the antiparallel orientation of the two DNA strands, one strand (the lagging strand) must be synthesized in short fragments discontinuously.",
    "topic": "Replication machinery and enzymes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen057"
  },
  {
    "question_text": "In the Meselson-Stahl experiment, which heavy isotope was used to label the parental DNA?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "14N",
      "15N",
      "12N",
      "16N"
    ],
    "correct_answer": "15N",
    "explanation": "The researchers used 15N, a heavy isotope of nitrogen, to label the parental DNA. This allowed the DNA to be distinguished based on density during centrifugation.",
    "topic": "Experimental proof of semiconservative replication",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen058"
  },
  {
    "question_text": "Briefly describe semiconservative replication.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Semiconservative replication is the process where the two strands of the DNA double helix separate and each serves as a template for the synthesis of a new complementary strand, resulting in two DNA molecules that each contain one original and one newly synthesized strand.",
    "explanation": "This method of replication ensures that each new DNA molecule maintains half of the parental information, which is key to accurately transmitting genetic information.",
    "topic": "Replication mechanism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen059"
  },
  {
    "question_text": "What dual role do deoxyribonucleoside triphosphates play during DNA replication?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "They serve as the building blocks (substrates) for the synthesis of the DNA strand and provide the energy needed for the polymerisation reaction through their high-energy phosphate bonds.",
    "explanation": "Deoxyribonucleoside triphosphates not only supply the nucleotide sequence, but the hydrolysis of the two terminal high-energy phosphates drives the polymerisation reaction forward.",
    "topic": "Replication machinery and enzymes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen060"
  },
  {
    "question_text": "Define the replication fork in the context of DNA replication.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The replication fork is the localized region of the DNA double helix where the strands separate, allowing each to be used as a template for new DNA synthesis.",
    "explanation": "It is the area where multiple enzymes operate simultaneously to separate the DNA strands and synthesize new DNA, facilitating the replication process.",
    "topic": "Replication machinery and enzymes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen061"
  },
  {
    "question_text": "Explain how the Meselson-Stahl experiment demonstrated semiconservative replication of DNA.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Meselson and Stahl first grew E. coli in a medium containing 15N, a heavy isotope, so that the DNA became heavy. After transferring the cells into a medium with 14N and sampling the DNA at various time intervals, they used CsCl density gradient centrifugation to separate the DNA molecules. After one generation, all DNA showed an intermediate (hybrid) density, indicating that each DNA molecule consisted of one heavy and one light strand. In subsequent generations, a mix of hybrid and light DNA molecules was observed, confirming that each new molecule resulted from one old (template) strand and one newly synthesized strand, which supports the semiconservative model.",
    "explanation": "The experiment's design allowed the tracing of old versus new strands by their density, ultimately confirming that DNA replication is semiconservative.",
    "topic": "Experimental proof of semiconservative replication",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen062"
  },
  {
    "question_text": "Discuss the challenges and solutions associated with replicating long DNA molecules in cells.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Replicating long DNA molecules poses challenges such as the impracticality of separating the entire double helix at once due to high energy requirements. Cells overcome this by creating a replication fork, a small open region where the strands are unwound and only a portion of the molecule is replicated at any one time. Additionally, the antiparallel nature of the DNA necessitates that one strand (the lagging strand) be synthesized discontinuously in short fragments, which are later joined by DNA ligase. A coordinated assembly of multiple enzymes, including DNA polymerases, helicases, primases, and ligases, ensures both speed and high accuracy in replication.",
    "explanation": "This answer highlights the physical and biochemical constraints of replicating long DNA, and describes how the cell’s replication machinery addresses these challenges in a coordinated manner.",
    "topic": "Replication machinery and enzymes",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen063"
  },
  {
    "question_text": "True or False: The Meselson-Stahl experiment made use of radioactive isotopes to label the DNA.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The experiment used the heavy nitrogen isotope 15N for density labeling, not radioactive isotopes.",
    "topic": "Experimental proof of semiconservative replication",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen064"
  },
  {
    "question_text": "True or False: DNA-dependent DNA polymerases can initiate the DNA replication process on their own.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "DNA polymerases require a primer to provide a free 3' end for polymerisation; they cannot start the replication process de novo.",
    "topic": "Replication machinery and enzymes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen065"
  },
  {
    "question_text": "True or False: After one generation in 14N medium, all DNA molecules in E. coli become light in density.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "After one generation, the DNA molecules are of hybrid density, each containing one heavy (15N) and one light (14N) strand, not completely light.",
    "topic": "Experimental proof of semiconservative replication",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen066"
  },
  {
    "question_text": "True or False: The high-energy phosphate bonds found in deoxyribonucleoside triphosphates are used both as building blocks for DNA and as an energy source during polymerisation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Deoxyribonucleoside triphosphates provide both the nucleotide units for incorporation into DNA and the energy needed for the polymerisation reaction from their two terminal high-energy phosphate bonds.",
    "topic": "Replication machinery and enzymes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen067"
  },
  {
    "question_text": "True or False: Semiconservative replication implies that both strands of a DNA molecule in the daughter cells are entirely synthesized de novo.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In semiconservative replication, each daughter DNA molecule consists of one parental (old) strand and one newly synthesized strand, not two new strands.",
    "topic": "Replication mechanism",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen068"
  },
  {
    "question_text": "Given that E. coli completes replication of 4.6×10^6 base pairs in 18 minutes, calculate the approximate rate of polymerisation in base pairs per second.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 2000 base pairs per second",
    "explanation": "Dividing 4.6×10^6 base pairs by 18 minutes (which is 1080 seconds) gives roughly 4260 base pairs per second. However, the text mentions an average rate of approximately 2000 base pairs per second, indicating that this rate accounts for additional in vivo factors such as enzyme efficiency and processivity.",
    "topic": "Replication machinery and enzymes",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen069"
  },
  {
    "question_text": "If E. coli is allowed to grow for 80 minutes after being transferred to 14N medium, what are the expected proportions of DNA molecules with light and hybrid densities?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 87.5% light DNA and 12.5% hybrid DNA",
    "explanation": "After each generation, the fraction of molecules containing the parental heavy strand is halved. After one generation, all DNA is hybrid. After two generations, 50% is hybrid, 50% light. After three generations, 25% is hybrid and 75% light, and after four generations (80 minutes), approximately 12.5% will be hybrid and 87.5% light.",
    "topic": "Experimental proof of semiconservative replication",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo105",
    "section_id": "05_section_5_4",
    "question_id": "cbse_xii_lebo1dd_c105_gen070"
  }
]