[
  {
    "question_text": "Mention the advantages of selecting pea plant for experiment by Mendel.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Pea plants are advantageous because they have easily observable contrasting traits, are true-breeding, have a short generation time, are easy to self- and cross-pollinate, and provide large sample sizes for statistical accuracy.",
    "explanation": "Pea plants have many contrasting characters (such as tall/dwarf, yellow/green seeds), they are true breeding meaning their traits remain stable, and they are manageable in a lab setting with rapid generation cycles. This made it easier for Mendel to deduce patterns in inheritance.",
    "topic": "Mendel's experiments and characteristics of pea plants",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex001"
  },
  {
    "question_text": "Differentiate between the following: (a) Dominance and Recessive; (b) Homozygous and Heterozygous; (c) Monohybrid and Dihybrid.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Dominance refers to the phenomenon where one allele masks the expression of another in a heterozygous condition, while recessive alleles are masked in such pairings. Homozygous means having identical alleles for a trait, whereas heterozygous means possessing two different alleles. A monohybrid cross involves one pair of contrasting traits, while a dihybrid cross involves two pairs of traits.",
    "explanation": "The answer highlights the essential distinctions: dominance vs recessiveness in allele expression, homozygous vs heterozygous genetic makeup, and that monohybrid crosses study a single trait while dihybrid crosses observe two traits concurrently.",
    "topic": "Basic genetic concepts",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex002"
  },
  {
    "question_text": "A diploid organism is heterozygous for 4 loci, how many types of gametes can be produced?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "16",
    "explanation": "For each heterozygous locus, two types of gametes can be produced. For 4 loci, the total number of gametes is 2^4 = 16, due to independent segregation.",
    "topic": "Genetics – Gamete production",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex003"
  },
  {
    "question_text": "Explain the Law of Dominance using a monohybrid cross.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The Law of Dominance states that in a heterozygote, one allele (the dominant) masks the effect of the other allele (the recessive). In a monohybrid cross, for example, if a true-breeding tall plant (TT) is crossed with a dwarf plant (tt), the F1 progeny (Tt) will all display the tall phenotype because the tall allele is dominant over the dwarf allele.",
    "explanation": "By crossing true-breeding plants with contrasting traits, Mendel observed that the F1 generation uniformly exhibited the dominant trait. This observation led to the formulation of the Law of Dominance, a fundamental concept in Mendelian genetics.",
    "topic": "Law of Dominance",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex004"
  },
  {
    "question_text": "Define and design a test-cross.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A test cross is a genetic cross between an individual showing a dominant phenotype (but with an unknown genotype) and an individual that is homozygous recessive. The pattern of phenotypes in the offspring will reveal the genotype of the unknown parent.",
    "explanation": "The test cross is used to determine whether an individual displaying the dominant trait is homozygous dominant or heterozygous. If the offspring all display the dominant trait, the unknown parent is likely homozygous dominant; if recessive phenotypes appear, the unknown parent is heterozygous.",
    "topic": "Test cross",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex005"
  },
  {
    "question_text": "Using a Punnett Square, work out the distribution of phenotypic features in the first filial generation after a cross between a homozygous female and a heterozygous male for a single locus.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "If we assume the trait is governed by a dominant allele, crossing a homozygous dominant female (TT) with a heterozygous male (Tt) would produce offspring that are 50% homozygous dominant (TT) and 50% heterozygous (Tt), resulting in 100% displaying the dominant phenotype.",
    "explanation": "The Punnett Square for this cross shows that each offspring receives one allele from each parent. Since both TT and Tt express the dominant trait, all progeny will show that phenotype.",
    "topic": "Punnett Square & Monohybrid Cross",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex006"
  },
  {
    "question_text": "When a cross is made between a tall plant with yellow seeds (TtYy) and a tall plant with green seeds (Ttyy), what proportions of phenotype in the offspring could be expected to be (a) tall and green, (b) dwarf and green.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Tall and green: 3/8 of the offspring; Dwarf and green: 1/8 of the offspring.",
    "explanation": "Tallying the gametes from both parents and using the Punnett Square method shows that among the 8 equally likely outcomes, 3 result in tall plants with the yy genotype (green seeds) and 1 outcome results in dwarf plants with yy (since dwarf is expressed only when tt).",
    "topic": "Dihybrid Cross & Phenotypic Ratios",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex007"
  },
  {
    "question_text": "Two heterozygous parents are crossed. If the two loci are linked, what would be the distribution of phenotypic features in the F2 generation for a dihybrid cross?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "When the genes are linked, the parental phenotypes will appear in higher proportions than the recombinant phenotypes. In the extreme case of complete linkage (no crossing over), only the two parental phenotypes would appear in the F2 generation, typically in a 1:1 ratio. With partial linkage, recombinant phenotypes would appear at a lower frequency than expected under independent assortment.",
    "explanation": "Linkage means that the genes are located close together on the same chromosome and tend to be inherited together. This disrupts the standard 9:3:3:1 ratio seen when genes assort independently, resulting in a skewed distribution emphasizing parental gene combinations.",
    "topic": "Linkage and Recombination",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex008"
  },
  {
    "question_text": "Briefly mention the contribution of T.H. Morgan in genetics.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "T.H. Morgan used fruit flies (Drosophila melanogaster) in his experiments to establish the chromosomal theory of inheritance, demonstrated that genes are located on chromosomes, and laid the foundation for modern genetics by mapping gene locations.",
    "explanation": "Morgan's work with Drosophila provided empirical evidence for the behavior of chromosomes during inheritance and revealed the principles of linkage and recombination, confirming that genes are arranged on chromosomes.",
    "topic": "Chromosomal Theory of Inheritance",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex009"
  },
  {
    "question_text": "What is pedigree analysis? Suggest how such an analysis can be useful.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Pedigree analysis is the study of family histories through diagrammatic representations (pedigrees) to trace the inheritance patterns of specific traits or genetic disorders. It is useful for diagnosing genetic diseases, determining modes of inheritance (autosomal dominant, recessive, or sex-linked), and for genetic counseling.",
    "explanation": "By marking affected and unaffected individuals across generations, pedigree analysis helps in visualizing how traits are transmitted in families, which provides insight into genetic risks and assists in planning medical interventions.",
    "topic": "Genetic Disorders & Pedigree Analysis",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex010"
  },
  {
    "question_text": "How is sex determined in human beings?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Sex in human beings is determined by the combination of sex chromosomes; females have XX and males have XY. The sex of the offspring is determined by the sperm, which carries either an X or a Y chromosome.",
    "explanation": "During fertilization, the ovum (which always contributes an X chromosome) is fertilized by a sperm that can contribute either an X or a Y chromosome. If the sperm contributes an X, the result is XX (female); if a Y is contributed, the result is XY (male).",
    "topic": "Sex Determination in Humans",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex011"
  },
  {
    "question_text": "A child has blood group O. If the father has blood group A and the mother blood group B, work out the genotypes of the parents and the possible genotypes of the other offsprings.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The child with blood group O must have genotype ii. For the child to have genotype ii, the father (with blood group A) must be heterozygous (IAi) and the mother (with blood group B) must also be heterozygous (IBi). The possible offspring genotypes from this cross are: IAIB (AB blood group), IAi (blood group A), IBi (blood group B), and ii (blood group O), each occurring with approximately equal probability.",
    "explanation": "Since the O blood type is recessive (ii), both parents must carry the recessive allele. Their heterozygous condition allows for a chance that an offspring inherits the recessive allele from both parents, leading to blood group O. The cross yields four possible genotypes in a typical 1:1:1:1 ratio.",
    "topic": "Blood Group Inheritance, Co-dominance",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex012"
  },
  {
    "question_text": "Explain the following terms with example: (a) Co-dominance, (b) Incomplete dominance.",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Co-dominance is a form of inheritance in which both alleles in a heterozygote are fully expressed, as seen in the human ABO blood group system where alleles IA and IB express together to form type AB blood. Incomplete dominance is when the heterozygous phenotype is an intermediate blend of the two homozygous phenotypes; for example, crossing red-flowered snapdragons (RR) with white-flowered ones (rr) produces pink-flowered offspring (Rr).",
    "explanation": "The answer distinguishes between co-dominance, where both alleles contribute equally without blending, and incomplete dominance where the phenotype of heterozygotes falls between those of the homozygotes. Specific examples clarify these concepts.",
    "topic": "Co-dominance and Incomplete Dominance",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex013"
  },
  {
    "question_text": "What is point mutation? Give one example.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A point mutation is a change in a single nucleotide base in the DNA sequence. An example is the mutation in the beta-globin gene that leads to sickle-cell anemia.",
    "explanation": "Point mutations affect only one nucleotide and can have profound effects when they occur in a gene coding for an essential protein. The substitution in the beta-globin gene alters an amino acid, resulting in the sickled shape of red blood cells.",
    "topic": "Mutation",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex014"
  },
  {
    "question_text": "Who had proposed the chromosomal theory of inheritance?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The chromosomal theory of inheritance was proposed by Walter Sutton and Theodor Boveri.",
    "explanation": "Sutton and Boveri independently observed that the behavior of chromosomes during meiosis resembled Mendel's laws, thereby linking genetic inheritance with chromosomal behavior.",
    "topic": "Chromosomal Theory of Inheritance",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex015"
  },
  {
    "question_text": "Mention any two autosomal genetic disorders with their symptoms.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Two autosomal genetic disorders are: 1) Sickle-cell anemia, which is characterized by abnormally shaped red blood cells that can lead to pain crises and anemia; 2) Thalassemia, which involves reduced synthesis of hemoglobin chains leading to anemia, weakness, and other complications.",
    "explanation": "Both disorders are inherited in a Mendelian fashion from autosomal genes. Sickle-cell anemia is due to a point mutation causing a change in the beta-globin gene, while thalassemia results from mutations or deletions that reduce the production of globin chains.",
    "topic": "Mendelian Disorders",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex016"
  }
]