[
  {
    "question_text": "Which statement best explains the advantage of using recombinant DNA technology in therapeutic drug production?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "It allows for genetic material to be briefly stored.",
      "It enables mass production of safe, human-compatible drugs.",
      "It reduces the need for any regulatory approvals.",
      "It completely eliminates any cost associated with drug production."
    ],
    "correct_answer": "It enables mass production of safe, human-compatible drugs.",
    "explanation": "Recombinant DNA technology is beneficial because it makes mass production of therapeutic drugs that are safe and more effective. It also reduces immunological reactions compared to products isolated from non-human sources.",
    "topic": "Biotechnological Applications in Medicine",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen019"
  },
  {
    "question_text": "Which of the following best describes why animal-derived insulin is not ideal for diabetic patients?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Animal insulin is less effective in controlling blood glucose levels.",
      "Animal insulin is more expensive than recombinant insulin.",
      "Animal insulin may elicit an unwanted immunological response.",
      "Animal insulin cannot be isolated in large quantities."
    ],
    "correct_answer": "Animal insulin may elicit an unwanted immunological response.",
    "explanation": "Insulin extracted from animals can cause allergic reactions or other types of immunological responses because it is recognized as foreign by the human immune system, unlike human insulin produced using recombinant DNA technology.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen020"
  },
  {
    "question_text": "What component is removed from proinsulin to form mature insulin?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "N-terminal peptide",
      "C-peptide",
      "Signal peptide",
      "B-chain peptide"
    ],
    "correct_answer": "C-peptide",
    "explanation": "During the maturation process of proinsulin, the C-peptide is removed to form the active insulin molecule, which consists of A and B chains connected by disulphide bridges.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen021"
  },
  {
    "question_text": "Which technique is routinely used to detect low concentrations of viral or bacterial DNA?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Southern blotting",
      "Polymerase Chain Reaction (PCR)",
      "Western blotting",
      "Mass spectrometry"
    ],
    "correct_answer": "Polymerase Chain Reaction (PCR)",
    "explanation": "PCR amplifies small amounts of DNA, making it possible to detect very low concentrations of pathogenic DNA before the appearance of clinical symptoms.",
    "topic": "Molecular Diagnosis",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen022"
  },
  {
    "question_text": "Why is insulin not administered orally to diabetic patients?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Because it cannot be absorbed through the intestines.",
      "Because it is too potent for oral dosage.",
      "Because its peptide structure would be degraded in the digestive system.",
      "Because it causes severe gastrointestinal reactions."
    ],
    "correct_answer": "Because its peptide structure would be degraded in the digestive system.",
    "explanation": "Insulin is a peptide hormone which would be broken down by the digestive enzymes in the gastrointestinal tract, making oral administration ineffective.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen023"
  },
  {
    "question_text": "Explain how the use of separate bacterial cultures for producing insulin's A and B chains simplifies its production.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The separate production allows for easier control and purification of each chain. Once purified, the A and B chains are combined under conditions that favor the formation of disulphide bridges, resulting in functional human insulin.",
    "explanation": "The method involves cloning the DNA sequences for chain A and chain B into plasmids, which are individually introduced into bacteria. This separated production allows for effective purification and control over disulphide bond formation to produce mature insulin.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen024"
  },
  {
    "question_text": "Describe the basic principle behind gene therapy and how it attempts to correct hereditary disorders.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Gene therapy involves delivering a functional copy of a defective gene into a patient’s cells. By replacing or compensating for the mutated gene, the normal function of the gene product can be restored, alleviating or curing the hereditary disorder.",
    "explanation": "Gene therapy strategies include direct insertion of a normal gene into the affected cells using vectors, such as retroviruses, thereby allowing the normal gene to take over the function of the defective gene.",
    "topic": "Gene Therapy",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen025"
  },
  {
    "question_text": "What is one major disadvantage of extracting insulin from animal sources compared to recombinant human insulin?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Animal-derived insulin can trigger immune responses and allergies in humans because it is recognized as a foreign protein.",
    "explanation": "Insulin from animals such as pigs and cattle may cause allergic reactions in patients due to slight differences in its structure when compared to human insulin.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen026"
  },
  {
    "question_text": "Outline how the ELISA technique is used in the early diagnosis of infections.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "ELISA detects infections by using the specific binding of antibodies to antigens. The technique allows the identification of either antigens from pathogens or antibodies generated against them, providing early diagnosis even when pathogen loads are low.",
    "explanation": "ELISA is based on antigen-antibody interactions. The presence of antigens or antibodies indicates an infection, enabling early diagnosis before the onset of serious symptoms.",
    "topic": "Molecular Diagnosis",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen027"
  },
  {
    "question_text": "Discuss in detail the process by which recombinant human insulin is produced using rDNA technology.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Recombinant human insulin production begins by separately cloning the DNA sequences corresponding to the A and B chains into plasmids and inserting them into Escherichia coli. The bacteria are cultured to produce large quantities of each chain, which are then isolated and combined under conditions that facilitate the formation of disulphide bonds. This results in the formation of mature, active insulin that mimics naturally produced human insulin.",
    "explanation": "The process involves using bacterial systems to achieve high yield production of insulin chains. The key challenge addressed was assembling the isolated chains into a functionally active insulin molecule, which is successfully managed by controlled chemical formation of disulphide linkages.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen028"
  },
  {
    "question_text": "Evaluate the potential and limitations of gene therapy as a curative treatment for hereditary diseases.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Gene therapy holds significant potential because it addresses the underlying genetic defects causing diseases. By inserting a functional gene into affected cells, it can potentially offer a long-term cure. However, limitations include the need for repeated treatments if cells are not immortal, immune responses to vectors, and challenges in efficiently delivering the gene to all affected tissues.",
    "explanation": "Gene therapy can correct genetic defects at their source rather than merely managing symptoms. Its success depends on effective gene delivery and stable integration, and while early clinical successes are promising, technical and safety challenges remain.",
    "topic": "Gene Therapy",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen029"
  },
  {
    "question_text": "Analyze how molecular diagnostic techniques such as PCR and ELISA contribute to early disease detection and better patient outcomes.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "PCR and ELISA significantly improve early diagnosis by detecting infections at low pathogen loads. PCR amplifies minute amounts of nucleic acids, enabling the detection of pathogens before symptoms appear. ELISA, through antigen-antibody interactions, confirms the presence of pathogens or the immune response to them. Together, they facilitate early treatment and better disease management, leading to improved patient outcomes.",
    "explanation": "Early detection through these techniques allows clinicians to initiate treatment sooner, reducing disease progression and improving recovery rates. The sensitivity of PCR combined with the specificity of ELISA provides a comprehensive diagnostic approach.",
    "topic": "Molecular Diagnosis",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen030"
  },
  {
    "question_text": "True or False: Recombinant therapeutics obtained via rDNA technology are less likely to cause unwanted immunological responses compared to drugs derived from non-human sources.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Recombinant therapeutics are engineered to be identical to human proteins, thereby reducing the likelihood of immunological reactions that can occur with foreign (non-human) proteins.",
    "topic": "Biotechnological Applications in Medicine",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen031"
  },
  {
    "question_text": "True or False: The use of PCR in molecular diagnosis is limited to detecting only viral infections.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "PCR can be used to amplify and detect both viral and bacterial DNA, as well as mutations in genes, making it a versatile tool in molecular diagnosis for various pathogens and genetic disorders.",
    "topic": "Molecular Diagnosis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen032"
  },
  {
    "question_text": "True or False: Gene therapy involves the insertion of a normal gene into the patient's cells to compensate for a defective gene.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Gene therapy corrects genetic disorders by introducing a functional gene into the patient’s cells, thereby compensating for the defective or missing gene.",
    "topic": "Gene Therapy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen033"
  },
  {
    "question_text": "True or False: In the recombinant production of insulin, the two chains (A and B) are produced in the same bacterial culture.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The production strategy involves cloning and expressing the A and B chains separately in different bacterial cultures. They are later extracted and chemically combined to form mature insulin.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen034"
  },
  {
    "question_text": "True or False: The C-peptide present in proinsulin is essential for the mature function of insulin.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The C-peptide is not present in mature insulin; it is removed during the conversion from proinsulin to active insulin. Its removal is necessary to form the biologically active molecule, though it may have other roles in the body.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen035"
  },
  {
    "question_text": "True or False: ELISA works by amplifying the nucleic acids of a pathogen for detection.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "ELISA is based on the antigen-antibody interaction, not on the amplification of nucleic acids. Techniques such as PCR are used for nucleic acid amplification.",
    "topic": "Molecular Diagnosis",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen036"
  },
  {
    "question_text": "True or False: Early gene therapy for ADA deficiency required periodic infusions of genetically engineered lymphocytes because the modified cells were not immortal.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "In early gene therapy attempts, lymphocytes were modified to express functional ADA; however, since these cells did not have the capacity for unlimited division, repeated infusions were necessary to maintain therapeutic effects.",
    "topic": "Gene Therapy",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen037"
  },
  {
    "question_text": "Calculate the difference between the total number of recombinant therapeutics approved globally and the number currently marketed in India.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "18",
    "explanation": "There are about 30 recombinant therapeutics approved globally and 12 marketed in India. The difference is 30 - 12 = 18.",
    "topic": "Biotechnological Applications in Medicine",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen038"
  },
  {
    "question_text": "In what year did Eli Lilly, an American company, first prepare the DNA sequences corresponding to the A and B chains of human insulin for recombinant production?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1983",
    "explanation": "Eli Lilly was the first company to successfully prepare the separate DNA sequences for the A and B chains of human insulin in 1983. This milestone was essential for the development of recombinant human insulin.",
    "topic": "Genetically Engineered Insulin",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo110",
    "section_id": "03_section_10_2",
    "question_id": "cbse_xii_lebo1dd_c110_gen039"
  }
]