[
  {
    "question_text": "Which cell divides repeatedly to form the triploid endosperm tissue in angiosperms?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Primary endosperm cell",
      "Zygote",
      "Micropyle",
      "Ovule"
    ],
    "correct_answer": "Primary endosperm cell",
    "explanation": "The primary endosperm cell divides repeatedly to form a triploid tissue that stores reserve food materials for the developing embryo.",
    "topic": "Endosperm development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen052"
  },
  {
    "question_text": "Which of the following seeds is known to have persistent endosperm that is not completely consumed during embryo development?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Pea",
      "Groundnut",
      "Castor",
      "Beans"
    ],
    "correct_answer": "Castor",
    "explanation": "Seeds like castor (and coconut) retain part of the endosperm after embryo development, unlike peas, groundnuts, and beans which consume the endosperm completely.",
    "topic": "Endosperm development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen053"
  },
  {
    "question_text": "In a typical dicotyledonous embryo, which structure at the embryonal axis is responsible for giving rise to the stem and leaves?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Hypocotyl",
      "Cotyledon",
      "Plumule",
      "Radicle"
    ],
    "correct_answer": "Plumule",
    "explanation": "The plumule, located at the tip of the epicotyl, develops into the shoot by forming the stem and leaves.",
    "topic": "Embryo development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen054"
  },
  {
    "question_text": "Which structure in the developing embryo is responsible for protecting the radicle (embryonic root) during growth?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Coleorhiza",
      "Coleoptile",
      "Root cap",
      "Micropyle"
    ],
    "correct_answer": "Root cap",
    "explanation": "The root cap covers the radicle, protecting it as it pushes through the soil during germination.",
    "topic": "Embryo development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen055"
  },
  {
    "question_text": "A mature seed in angiosperms typically consists of which three major components?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Zygote, micropyle, nucellus",
      "Cotyledons, embryo axis, seed coat",
      "Endosperm, perisperm, ovule",
      "Anther, filament, stigma"
    ],
    "correct_answer": "Cotyledons, embryo axis, seed coat",
    "explanation": "A typical angiosperm seed is composed of the embryo (with cotyledons and embryonal axis) and a protective seed coat, while the endosperm or perisperm may be present or absent depending on the type.",
    "topic": "Seed structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen056"
  },
  {
    "question_text": "Define free-nuclear endosperm and explain its significance in seed development.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Free-nuclear endosperm is the stage during which the primary endosperm cell undergoes successive nuclear divisions without cell wall formation. It is significant because this phase produces numerous nuclei that later become cellular, thereby providing ample nutrient reserve for the developing embryo.",
    "explanation": "The free-nuclear state allows rapid multiplication of nuclei which later form a nutritive tissue essential for embryo growth before cellularisation occurs.",
    "topic": "Endosperm development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen057"
  },
  {
    "question_text": "Describe the structural differences between dicotyledonous and monocotyledonous embryos as mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Dicotyledonous embryos possess two cotyledons, an epicotyl (above the cotyledons) ending in a plumule, a hypocotyl, and a radicle with a root cap. Monocotyledonous embryos have a single cotyledon, often termed a scutellum, with a coleoptile protecting the emerging shoot, and a coleorhiza that encloses the radicle and root cap.",
    "explanation": "These structural differences are crucial for understanding the divergent developmental patterns in flowering plants, affecting how seedlings emerge and establish.",
    "topic": "Embryo development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen058"
  },
  {
    "question_text": "Explain the significance of seed dehydration and dormancy in agriculture and seed storage.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Seed dehydration reduces the water content, which slows down metabolic activity, while dormancy prevents seeds from germinating immediately. These adaptations are essential for long-term storage, ensuring that seeds remain viable until conditions are favorable for germination, which is crucial for agriculture and maintaining seed banks.",
    "explanation": "Dehydration and dormancy allow seeds to be stored over time without losing viability, enabling farmers to sow crops in the appropriate season and maintain genetic diversity.",
    "topic": "Seed development and agriculture",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen059"
  },
  {
    "question_text": "Discuss the process of embryogeny in dicotyledonous plants, including the stages from zygote formation to the mature embryo.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Embryogeny in dicotyledonous plants begins with the formation of a zygote at the micropylar end of the embryo sac. Once a sufficient amount of endosperm has developed, the zygote divides to form a proembryo. This proembryo then undergoes further cell divisions to form a globular stage, which transitions into a heart-shaped stage before developing into a mature embryo. The mature embryo consists of an embryonal axis with the plumule forming the future shoot, and cotyledons that store food reserves. The hypocotyl connects the cotyledons to the radicle, which is protected by a root cap.",
    "explanation": "This answer highlights the sequential stages of embryo development and the morphological adaptations that facilitate the transition from a single cell to a complex, differentiated embryo.",
    "topic": "Embryo development",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen060"
  },
  {
    "question_text": "Evaluate the adaptations found in angiosperm seeds that contribute to their successful dispersal and survival. Include in your discussion the roles of seed coat, endosperm/persistence of nucellus, and dormancy.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Angiosperm seeds exhibit several adaptations that enhance their survival and dispersal. The tough seed coat, derived from the integuments of the ovule, provides protection against physical damage and desiccation, and the micropyle allows controlled entry of water and oxygen during germination. In nonalbuminous seeds, the complete consumption of the endosperm ensures efficient use of stored nutrients, whereas albuminous seeds retain part of the endosperm to nourish the embryo during germination. Additionally, seed dormancy prevents premature germination under unfavorable conditions, ensuring that seedlings emerge when environmental conditions are optimal. These adaptations collectively facilitate the survival of the species by promoting effective dispersal, prolonged viability, and successful establishment in new habitats.",
    "explanation": "This discussion covers the multiple strategies angiosperms employ to protect and nourish their embryos, ensuring that seeds can be stored and dispersed effectively, which is fundamental for plant colonization and agriculture.",
    "topic": "Seed structure and dispersal",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen061"
  },
  {
    "question_text": "True or False: The primary endosperm cell divides to form a diploid endosperm tissue.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The primary endosperm cell divides to form a triploid tissue, not a diploid one, due to the fusion of one sperm with the central cell which contains two polar nuclei.",
    "topic": "Endosperm development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen062"
  },
  {
    "question_text": "True or False: Free-nuclear endosperm represents the stage in which numerous nuclei form before being partitioned by cell walls during cellularisation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Free-nuclear endosperm is characterized by successive nuclear divisions without cell wall formation, preceding the cellularisation process.",
    "topic": "Endosperm development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen063"
  },
  {
    "question_text": "True or False: Dicotyledonous embryos are characterized by a single cotyledon called the scutellum.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Dicotyledonous embryos have two cotyledons. The term scutellum is used to describe the single cotyledon in monocotyledonous embryos.",
    "topic": "Embryo development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen064"
  },
  {
    "question_text": "True or False: In nonalbuminous seeds, the endosperm is completely consumed during embryo development.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Nonalbuminous seeds are defined by the complete consumption of the endosperm during the development of the embryo, leaving no nutritive tissue in the mature seed.",
    "topic": "Seed structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen065"
  },
  {
    "question_text": "True or False: Fruits that develop solely from the ovary are known as false fruits.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Fruits that develop solely from the ovary are referred to as true fruits. False fruits involve contributions from other floral parts, such as the thalamus in apple and strawberry.",
    "topic": "Fruit formation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen066"
  },
  {
    "question_text": "If a fruit contains 200 ovules and every ovule develops into a seed, how many seeds would the fruit have?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "200",
    "explanation": "Assuming that every ovule successfully develops into a seed, the fruit will contain 200 seeds.",
    "topic": "Seed and fruit development",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen067"
  },
  {
    "question_text": "A Ficus tree produces 3 billion seeds and only 1 in every 1,000,000 seeds successfully germinates. Approximately how many seedlings can potentially emerge?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "3000",
    "explanation": "Dividing 3,000,000,000 (3 billion) seeds by 1,000,000 gives 3000 potential seedlings.",
    "topic": "Seed dispersal and viability",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen068"
  },
  {
    "question_text": "What is the record dormancy period mentioned for the viable seed of Lupinus arcticus?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 10,000 years",
    "explanation": "The text states that a Lupinus arcticus seed was excavated from the Arctic Tundra and successfully germinated after an estimated 10,000 years of dormancy.",
    "topic": "Seed longevity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen069"
  }
]