[
  {
    "question_text": "Which process describes the fusion of a male gamete with the egg cell nucleus in flowering plants?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Triple fusion",
      "B: Double fertilisation",
      "C: Syngamy",
      "D: Mitosis"
    ],
    "correct_answer": "C: Syngamy",
    "explanation": "Syngamy is the process where one male gamete fuses with the egg cell nucleus to form a diploid zygote.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen034"
  },
  {
    "question_text": "After triple fusion, the central cell becomes which structure that develops into the endosperm?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Zygote",
      "B: Primary Endosperm Cell (PEC)",
      "C: Synergid cell",
      "D: Antipodal cell"
    ],
    "correct_answer": "B: Primary Endosperm Cell (PEC)",
    "explanation": "The central cell undergoes triple fusion to become the primary endosperm cell, which later develops into the endosperm.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen035"
  },
  {
    "question_text": "Double fertilisation in flowering plants involves two distinct fusion events. Which of the following pairs best describes these events?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Syngamy and double fusion",
      "B: Syngamy and triple fusion",
      "C: Triple fusion and quadruple fusion",
      "D: Double fusion and triple fusion"
    ],
    "correct_answer": "B: Syngamy and triple fusion",
    "explanation": "Double fertilisation involves syngamy (fusion of one male gamete with the egg cell) and triple fusion (fusion of the other male gamete with the two polar nuclei).",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen036"
  },
  {
    "question_text": "Double fertilisation is unique to flowering plants because it results in the formation of which two structures?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Only a zygote",
      "B: Only an endosperm",
      "C: Both a zygote and an endosperm",
      "D: Secretory tissues and embryo"
    ],
    "correct_answer": "C: Both a zygote and an endosperm",
    "explanation": "It is unique because one fusion forms the zygote (embryo) and the other produces the primary endosperm nucleus which develops into the endosperm providing nutrition to the embryo.",
    "topic": "Double Fertilisation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen037"
  },
  {
    "question_text": "Which statement best describes the roles of the two male gametes during double fertilisation?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Both gametes fuse with the egg cell",
      "B: One gamete fuses with the egg cell while the other fuses with the two polar nuclei",
      "C: Both gametes fuse with the polar nuclei",
      "D: One gamete fuses with the synergid cell while the other initiates embryo development"
    ],
    "correct_answer": "B: One gamete fuses with the egg cell while the other fuses with the two polar nuclei",
    "explanation": "In double fertilisation, one male gamete fuses with the egg cell (syngamy) and the other fuses with the two polar nuclei (triple fusion) to form the triploid primary endosperm nucleus.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen038"
  },
  {
    "question_text": "Define double fertilisation in flowering plants.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Double fertilisation is the process in which two male gametes are involved; one fuses with the egg cell to form a diploid zygote, while the other fuses with the two polar nuclei in the central cell to form a triploid primary endosperm nucleus.",
    "explanation": "This definition clearly explains the two distinct fusion events that occur during double fertilisation, a unique process in angiosperms.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen039"
  },
  {
    "question_text": "What happens during triple fusion in the process of double fertilisation?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "During triple fusion, one male gamete fuses with the two haploid polar nuclei from the central cell, resulting in the formation of a triploid primary endosperm nucleus.",
    "explanation": "This answer explains the key event in triple fusion, highlighting the fusion of three haploid nuclei to yield a triploid nucleus.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen040"
  },
  {
    "question_text": "Name the products formed as a result of syngamy and triple fusion during double fertilisation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Syngamy produces a diploid zygote, and triple fusion produces a triploid primary endosperm nucleus.",
    "explanation": "This answer identifies the two outcomes of double fertilisation, clearly associating each fusion event with its resultant product.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen041"
  },
  {
    "question_text": "What is the role of the endosperm in plant development?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The endosperm acts as a nutrient source for the developing embryo.",
    "explanation": "This answer explains that the endosperm provides essential nutrients to the embryo, supporting its growth during seed development.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen042"
  },
  {
    "question_text": "Describe the process of double fertilisation and explain its significance in flowering plants.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Double fertilisation begins when a pollen tube enters one of the synergids and releases two male gametes. One gamete fuses with the egg cell to form a diploid zygote (syngamy), while the other fuses with the two polar nuclei in the central cell to form a triploid primary endosperm nucleus (triple fusion). The zygote develops into the embryo, and the primary endosperm nucleus gives rise to the endosperm, which nourishes the developing embryo. This coordinated process ensures both the formation of a new plant and the provision of nutrients for its initial growth, making it pivotal to the reproductive success of angiosperms.",
    "explanation": "This detailed explanation covers the sequential events of double fertilisation and underlines its importance in producing both embryonic and nutritional structures, exclusive to flowering plants.",
    "topic": "Double Fertilisation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen043"
  },
  {
    "question_text": "Explain the steps from the entry of the pollen tube into the embryo sac to the development of a mature embryo, referring to the diagram provided in the textbook.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The process starts when the pollen tube enters one of the synergids and releases two male gametes. One gamete fuses with the egg cell (syngamy) forming a diploid zygote, while the other fuses with the two polar nuclei (triple fusion) forming a triploid primary endosperm nucleus. The zygote then begins cell division, progressing from a globular to a heart-shaped embryo. Eventually, the mature embryo forms complete with a radicle, plumule, and cotyledons. Simultaneously, the primary endosperm nucleus develops into the endosperm, which supplies nutrients to the growing embryo.",
    "explanation": "This answer integrates the sequence of events from fertilisation to embryogenesis and references the diagram that illustrates these developmental stages.",
    "topic": "Double Fertilisation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen044"
  },
  {
    "question_text": "Compare and contrast syngamy and triple fusion in the context of double fertilisation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Syngamy and triple fusion are both critical events in double fertilisation. Syngamy involves the fusion of one male gamete with the egg cell, resulting in the formation of a diploid zygote that will develop into the embryo. In contrast, triple fusion involves the fusion of the other male gamete with two haploid polar nuclei in the central cell, forming a triploid primary endosperm nucleus that becomes the endosperm. While syngamy directly leads to the zygote formation, triple fusion is responsible for creating the nutritive tissue that supports embryo development. Thus, both processes are interdependent and essential for successful seed development in flowering plants.",
    "explanation": "The answer highlights the distinct roles and outcomes of syngamy and triple fusion, demonstrating their complementary functions and importance in plant reproduction.",
    "topic": "Double Fertilisation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen045"
  },
  {
    "question_text": "If each haploid nucleus contains n chromosomes, what will be the chromosome numbers of the zygote and the primary endosperm nucleus after double fertilisation?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The zygote will have 2n chromosomes and the primary endosperm nucleus will have 3n chromosomes.",
    "explanation": "Syngamy results in the fusion of two haploid gametes to form a diploid zygote (2n), while triple fusion combines one male gamete with two haploid polar nuclei to form a triploid nucleus (3n).",
    "topic": "Double Fertilisation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen046"
  },
  {
    "question_text": "Double fertilisation occurs only in angiosperms.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Double fertilisation is a unique reproductive process found exclusively in flowering plants (angiosperms).",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen047"
  },
  {
    "question_text": "Both male gametes fuse with the egg cell during double fertilisation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Only one male gamete fuses with the egg cell, while the other fuses with the two polar nuclei.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen048"
  },
  {
    "question_text": "Triple fusion involves the fusion of three haploid nuclei.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Triple fusion involves one male gamete and the two haploid polar nuclei fusing, resulting in a triploid nucleus.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen049"
  },
  {
    "question_text": "The primary endosperm nucleus eventually develops into the embryo.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The primary endosperm nucleus develops into the endosperm, which serves as a nutritional tissue, while the zygote develops into the embryo.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen050"
  },
  {
    "question_text": "The diagram in Figure (page 17 Figure 4.jpeg) illustrates both fertilisation and subsequent embryogenesis in dicots.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The diagram shows the fertilised embryo sac with the zygote and primary endosperm nucleus, as well as the stages of dicot embryogenesis, thus covering both fertilisation and embryo development.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen051"
  }
]