[
  {
    "question_text": "Fruit production without fertilisation is called:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Apomixis",
      "Polyembryony",
      "Fertilisation",
      "Vegetative propagation"
    ],
    "correct_answer": "Apomixis",
    "explanation": "Apomixis is the process by which seeds are produced without fertilisation, representing a form of asexual reproduction that mimics sexual reproduction.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen070"
  },
  {
    "question_text": "Which of the following plant groups has evolved the mechanism of apomixis?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Asteraceae and grasses",
      "Legumes and ferns",
      "Mosses and liverworts",
      "Conifers and cycads"
    ],
    "correct_answer": "Asteraceae and grasses",
    "explanation": "The text mentions that some species of Asteraceae and grasses have evolved apomixis as a special mechanism to produce seeds without fertilisation.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen071"
  },
  {
    "question_text": "Polyembryony is best described as:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Production of multiple embryos in a single seed",
      "Fusion of two gametes to form an embryo",
      "Development of a single embryo from a fertilised egg",
      "Formation of seeds without any embryo"
    ],
    "correct_answer": "Production of multiple embryos in a single seed",
    "explanation": "Polyembryony refers to the occurrence of more than one embryo in a seed, a phenomenon observed when several nucellar cells start dividing and developing into embryos within a single ovule.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen072"
  },
  {
    "question_text": "How can apomixis benefit the hybrid seed industry?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "By eliminating genetic segregation, allowing farmers to use seeds repeatedly",
      "By increasing genetic variation among progeny",
      "By reducing seed production costs through sexual reproduction",
      "By enhancing the need for annual seed purchase"
    ],
    "correct_answer": "By eliminating genetic segregation, allowing farmers to use seeds repeatedly",
    "explanation": "Converting hybrids into apomicts maintains the hybrid characters without segregation among progeny, so farmers can repeatedly use the seeds rather than purchasing new ones each year.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen073"
  },
  {
    "question_text": "What is the genetic nature of apomictic embryos in relation to the mother plant?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "They are genetically identical clones of the mother plant",
      "They are genetically diverse due to mutation",
      "They are half clones with contributions from a pollen donor",
      "They show increased variation due to spontaneous recombination"
    ],
    "correct_answer": "They are genetically identical clones of the mother plant",
    "explanation": "Since apomictic embryos are produced asexually without fertilisation, they are clones of the mother plant, exhibiting genetic uniformity.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen074"
  },
  {
    "question_text": "Define apomixis.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Apomixis is a form of asexual reproduction in flowering plants where seeds are produced without fertilisation.",
    "explanation": "This definition summarizes the concept by stating that apomixis involves seed formation without the fusion of gametes.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen075"
  },
  {
    "question_text": "Explain polyembryony and its occurrence in some plant species.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Polyembryony is the occurrence of more than one embryo within a single seed. It occurs when nucellar cells around the embryo sac divide and develop into additional embryos.",
    "explanation": "The answer describes the process and phenomenon of polyembryony as outlined in the section, indicating the developmental process from nucellar cells.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen076"
  },
  {
    "question_text": "What is the main advantage of using apomictic reproduction in hybrid seed cultivation?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It prevents genetic segregation, allowing farmers to reuse seeds year after year while maintaining the hybrid characteristics.",
    "explanation": "The major benefit is that apomixis produces progeny identical to the hybrid parent, reducing the need to purchase new seeds every season.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen077"
  },
  {
    "question_text": "Describe one mode of apomictic seed development observed in Citrus and Mango varieties.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In many Citrus and Mango varieties, some nucellar cells that surround the embryo sac begin dividing independently. These cells protrude into the embryo sac and develop into embryos, resulting in polyembryony within each ovule.",
    "explanation": "This mode of development, known as nucellar embryony, is clearly described in the section and underlines the process through which multiple embryos form in one seed.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen078"
  },
  {
    "question_text": "Discuss the process of nucellar embryony and its implications for seed composition.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Nucellar embryony involves the division of nucellar cells adjacent to the embryo sac, which then protrude into the embryo sac and develop into additional embryos. This process results in the formation of polyembryonic seeds containing embryos of varying sizes and shapes. The implication is that a single seed can generate several, genetically identical embryos, which might affect the nutritive allocation and overall seed structure.",
    "explanation": "The response should detail that nucellar cells, distinct from the gametic lineage, undergo a division process that leads to multiple embryo formation within a single seed. It also touches on the biological and agricultural implications of such a reproductive strategy.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen079"
  },
  {
    "question_text": "Evaluate the potential benefits and challenges of transferring apomictic genes into hybrid varieties.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The potential benefits include maintaining hybrid vigor by preventing genetic segregation, which allows farmers to use the same seeds year after year, thereby reducing costs and ensuring consistent crop quality. On the other hand, challenges include the complexity of genetic control of apomixis, ensuring the stability of apomictic traits under diverse environmental conditions, and the risk of reduced genetic diversity which may affect the crop's ability to adapt to diseases and changing climates.",
    "explanation": "This answer presents a balanced evaluation by outlining both the advantages, such as cost reduction and trait stability, as well as the challenges, like genetic complexity and potential loss of diversity, which are critical considerations in agricultural biotechnology.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen080"
  },
  {
    "question_text": "True or False: Apomixis is a form of sexual reproduction.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Apomixis is a form of asexual reproduction, as it produces seeds without fertilisation.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen081"
  },
  {
    "question_text": "True or False: Polyembryony refers to the occurrence of more than one embryo in a seed.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The definition of polyembryony is the occurrence of multiple embryos in a single seed, as explained in the section.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen082"
  },
  {
    "question_text": "True or False: In apomixis, the diploid egg cell always undergoes reduction division before developing into an embryo.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In apomixis, the diploid egg cell is sometimes formed without reduction division, and in other cases, nucellar cells may develop into embryos without any reduction division process.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen083"
  },
  {
    "question_text": "True or False: Although hybrid varieties increase productivity, hybrid seeds must be produced every year due to the segregation of characters.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Hybrid plants segregate in the progeny if their seeds are saved, meaning farmers have to produce or purchase new hybrid seeds every year to maintain hybrid traits.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen084"
  },
  {
    "question_text": "True or False: Transferring apomictic genes into hybrid crops would eliminate genetic segregation in subsequent generations.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "If hybrid crops become apomictic, the progeny will be clones of the hybrid parent and genetic segregation would be eliminated, preserving the desirable traits.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen085"
  },
  {
    "question_text": "If an orange seed contains 4 embryos and 5 such seeds yield a total of 20 embryos, what is the average number of embryos per seed?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "4",
    "explanation": "The average is calculated by dividing the total number of embryos by the number of seeds (20 รท 5 = 4).",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen086"
  },
  {
    "question_text": "Describe an observational experiment to study polyembryony in orange seeds.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An experiment to study polyembryony in orange seeds involves extracting several orange seeds, gently squeezing them to expose the embryos, and then observing and counting the number and variation in the embryos across different seeds.",
    "explanation": "This experimental procedure aligns with the textbook instruction to observe multiple embryos in each seed and to record variations in size and shape.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen087"
  }
]