[
  {
    "question_text": "Can you list 10 recombinant proteins which are used in medical practice? Find out where they are used as therapeutics (use the internet).",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Possible answers include: human insulin (for diabetes), human growth hormone (for growth deficiencies), erythropoietin (for anemia), interferons (for viral infections), tissue plasminogen activator (for clot dissolution), factor VIII (for hemophilia), granulocyte colony stimulating factor (for neutropenia), monoclonal antibodies (for cancer and autoimmune disorders), etanercept (for rheumatoid arthritis), and others as discovered by research.",
    "explanation": "Recombinant proteins are produced using recombinant DNA technology. Their use as therapeutics depends on their biological activity in addressing specific medical conditions. The answer requires independent research to compile a list based on current medical practice.",
    "topic": "Recombinant protein therapeutics",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex001"
  },
  {
    "question_text": "Make a chart (with diagrammatic representation) showing a restriction enzyme, the substrate DNA on which it acts, the site at which it cuts DNA and the product it produces.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A diagram could show, for example, EcoRI acting on its substrate with the recognition sequence GAATTC by cutting between the G and A nucleotides to produce DNA fragments with sticky ends.",
    "explanation": "This exercise requires you to visually represent the mechanism of a restriction enzyme. The diagram should include the enzyme, the specific nucleotide sequence where the cut occurs, and the resulting sticky-ended fragments, reinforcing your understanding of how recombinant DNA molecules are created.",
    "topic": "Restriction enzymes in recombinant DNA technology",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex002"
  },
  {
    "question_text": "From what you have learnt, can you tell whether enzymes are bigger or DNA is bigger in molecular size? How did you know?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "DNA is generally larger in molecular size than enzymes.",
    "explanation": "Although enzymes are complex proteins, DNA molecules are long polymers composed of thousands to billions of nucleotides. This high molecular weight and length make DNA, in most cases, larger than individual enzyme molecules. This conclusion can be reached by comparing typical molecular weights and the nature of polymers versus proteins.",
    "topic": "Molecular size comparison in biotechnology",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex003"
  },
  {
    "question_text": "What would be the molar concentration of human DNA in a human cell? Consult your teacher.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 10 mM (0.01 M) is a rough estimate, though the exact value should be determined with a proper calculation based on genome size and nuclear volume.",
    "explanation": "The molar concentration can be approximated by using the total number of nucleotides in the genome and the volume of the nucleus. Since the human genome has billions of base pairs and the nucleus occupies a very small volume, the concentration is relatively high. However, precise calculation requires detailed data and consultation.",
    "topic": "Molar concentration of DNA in cells",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex004"
  },
  {
    "question_text": "Do eukaryotic cells have restriction endonucleases? Justify your answer.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "No, eukaryotic cells do not naturally have restriction endonucleases as part of their cellular machinery.",
    "explanation": "Restriction endonucleases are primarily found in prokaryotes where they serve as a defense mechanism against invading viral DNA. Eukaryotic cells lack these enzymes because their mechanisms for regulating and protecting their genomic DNA are different.",
    "topic": "Restriction enzymes",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex005"
  },
  {
    "question_text": "Besides better aeration and mixing properties, what other advantages do stirred tank bioreactors have over shake flasks?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Stirred tank bioreactors provide enhanced control over parameters such as temperature, pH, oxygen supply, and nutrient distribution, and they allow for easier scale-up and continuous operation.",
    "explanation": "Stirred tank bioreactors are designed to maintain optimal growth conditions. Their advanced control systems and design features enable more reproducible cultivation conditions with higher yields of the desired product compared to shake flasks.",
    "topic": "Bioreactors and downstream processing",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex006"
  },
  {
    "question_text": "Collect 5 examples of palindromic DNA sequences by consulting your teacher. Better try to create a palindromic sequence by following base-pair rules.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Examples may include: GAATTC (EcoRI), AAGCTT (HindIII), GGATCC (BamHI), GCGGCCGC (NotI), and TTAATTAA. You might also generate a new one following base-pair rules.",
    "explanation": "Palindromic sequences read the same in the 5' to 3' direction on both strands. This property is important for the function of restriction enzymes which recognize and cut these specific sequences. The exercise encourages exploration and application of base-pairing rules.",
    "topic": "Palindromic sequences in DNA",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex007"
  },
  {
    "question_text": "Can you recall meiosis and indicate at what stage a recombinant DNA is made?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "During prophase I of meiosis, homologous chromosomes undergo crossing over, which is the natural process of recombination.",
    "explanation": "In biological systems, genetic recombination occurs during prophase I of meiosis through crossing over between homologous chromosomes. It is important to note that while this natural process creates recombinant chromosomes, recombinant DNA technology is an in vitro technique that mimics the concept of recombination.",
    "topic": "Meiosis and genetic recombination",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex008"
  },
  {
    "question_text": "Can you think and answer how a reporter enzyme can be used to monitor transformation of host cells by foreign DNA in addition to a selectable marker?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A reporter enzyme such as β-galactosidase can be fused to a gene of interest so that its expression produces a detectable color change (for example, blue/white screening) in the presence of a chromogenic substrate, thereby indicating successful transformation.",
    "explanation": "Reporter enzymes serve as visual indicators of gene expression. When fused to a gene inserted in the host, they provide a means to quickly assess transformation efficiency and distinguish between recombinant and non-recombinant cells.",
    "topic": "Transformation and reporter systems",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex009"
  },
  {
    "question_text": "Describe briefly the following:\n(a) Origin of replication\n(b) Bioreactors\n(c) Downstream processing",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) Origin of replication is a specific DNA sequence where replication initiates and which controls plasmid copy number. (b) Bioreactors are vessels that provide an optimal environment for the large-scale cultivation of cells and production of biotechnological products by controlling parameters such as temperature, pH, and oxygen. (c) Downstream processing encompasses the steps taken after biosynthesis, including separation, purification, formulation, and quality control of the final product.",
    "explanation": "These terms are fundamental in recombinant DNA technology and bioprocessing. The origin of replication ensures DNA multiplication; bioreactors enable efficient scale-up; and downstream processing is critical for obtaining a purified, market-ready product.",
    "topic": "Molecular biology and bioprocessing",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex010"
  },
  {
    "question_text": "Explain briefly:\n(a) PCR\n(b) Restriction enzymes and DNA\n(c) Chitinase",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) PCR (Polymerase Chain Reaction) is a technique used to amplify specific DNA segments through repeated cycles of denaturation, annealing, and extension. (b) Restriction enzymes are nucleases that cleave DNA at specific palindromic sequences, generating fragments with sticky or blunt ends useful in recombinant DNA technology. (c) Chitinase is an enzyme that breaks down chitin, a key component of fungal cell walls and the exoskeletons of insects.",
    "explanation": "Each part of the question targets a fundamental tool or process in biotechnology. PCR is essential for DNA amplification, restriction enzymes are central to gene cloning, and chitinase plays an important role in degrading chitin, highlighting its biological functions and applications.",
    "topic": "Molecular techniques and enzymes",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex011"
  },
  {
    "question_text": "Discuss with your teacher and find out how to distinguish between:\n(a) Plasmid DNA and Chromosomal DNA\n(b) RNA and DNA\n(c) Exonuclease and Endonuclease",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) Plasmid DNA is typically circular, smaller, and replicates independently from chromosomal DNA, which is linear (in eukaryotes) and contains the majority of genetic information. (b) RNA differs from DNA in that RNA contains ribose sugar, uses uracil in place of thymine, and is usually single-stranded compared to the double-stranded nature of DNA. (c) Exonucleases remove nucleotides from the ends of DNA strands, while endonucleases cleave at specific positions within the DNA molecule.",
    "explanation": "This question requires a comparative understanding of various molecular components and enzymes. Recognizing the structural and functional differences between these molecules is critical for their manipulation in biotechnology applications.",
    "topic": "Molecular biology distinctions",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex012"
  },
  {
    "question_text": "Which of the following are the two core techniques that enabled the birth of modern biotechnology?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Genetic engineering and Bioprocess engineering",
      "Cloning and Hybridisation",
      "Recombinant DNA and DNA ligase",
      "Restriction enzymes and Plasmid vectors"
    ],
    "correct_answer": "Genetic engineering and Bioprocess engineering",
    "explanation": "The two core techniques discussed are Genetic engineering, which involves altering the chemistry of genetic material, and Bioprocess engineering, which deals with maintaining sterile conditions to cultivate desired cells.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen001"
  },
  {
    "question_text": "In comparison to asexual reproduction, what is the main advantage of sexual reproduction as discussed in the text?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It preserves genetic information exactly",
      "It provides variation and unique genetic combinations",
      "It reduces the possibility of mutation",
      "It increases the rate of cloning"
    ],
    "correct_answer": "It provides variation and unique genetic combinations",
    "explanation": "Sexual reproduction allows mixing of genetic material, providing variations and unique combinations that can be beneficial, unlike asexual reproduction which preserves existing genetic information.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen002"
  },
  {
    "question_text": "Why must an alien piece of DNA be linked with an origin of replication for it to be maintained and multiplied in a host?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Because it contains the gene for antibiotic resistance",
      "Because the origin of replication initiates DNA synthesis",
      "Because it is structurally similar to host DNA",
      "Because it encodes for ligase enzymes"
    ],
    "correct_answer": "Because the origin of replication initiates DNA synthesis",
    "explanation": "An alien DNA needs to be integrated with an origin of replication, a specific sequence that initiates replication, enabling the replication and inheritance of the transferred DNA in the host's progeny.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen003"
  },
  {
    "question_text": "What advantage does genetic engineering have over traditional hybridisation procedures in altering an organism's genotype?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "It allows introduction of multiple unwanted genes along with desired ones",
      "It enables isolation and introduction of only desirable genes",
      "It makes the process of sexual reproduction faster",
      "It uses plasmids to eliminate any form of gene transfer errors"
    ],
    "correct_answer": "It enables isolation and introduction of only desirable genes",
    "explanation": "Genetic engineering overcomes the limitation of traditional hybridisation which often includes undesirable genes by allowing the isolation and insertion of only the required gene(s) into the target organism.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen004"
  },
  {
    "question_text": "Which enzyme is responsible for joining the cut fragments of DNA during the construction of recombinant DNA?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Restriction enzyme",
      "DNA polymerase",
      "DNA ligase",
      "Helicase"
    ],
    "correct_answer": "DNA ligase",
    "explanation": "DNA ligase is the enzyme that seals the nick between the cut fragments of DNA, effectively joining them to create a recombinant DNA molecule.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen005"
  },
  {
    "question_text": "List the three basic steps in genetically modifying an organism.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Identification of DNA with desirable genes; introduction of the identified DNA into the host; maintenance of the introduced DNA in the host and its transfer to progeny.",
    "explanation": "The text outlines that the process involves identifying desirable genes, transferring them to the host organism, and ensuring that the introduced DNA is maintained and inherited by future cells.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen006"
  },
  {
    "question_text": "Explain the concept of cloning in Escherichia coli as it relates to recombinant DNA.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Cloning in E. coli refers to the process where the recombinant plasmid, containing the gene of interest (such as an antibiotic resistance gene), is introduced into E. coli. The host cell replicates the plasmid along with its own DNA, resulting in multiple copies of the inserted gene.",
    "explanation": "The explanation involves understanding that once the recombinant DNA is transferred into E. coli, the host's cellular machinery replicates the entire plasmid DNA, thereby multiplying the gene of interest.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen007"
  },
  {
    "question_text": "Why is the antibiotic resistance gene effectively used as a marker in genetic engineering experiments?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The antibiotic resistance gene is used as a marker because it allows for the easy identification and selection of transformed cells. Cells that successfully incorporate the recombinant DNA containing the resistance gene survive in the presence of the antibiotic, distinguishing them from non-transformed cells.",
    "explanation": "This strategy provides a clear and efficient way to isolate and propagate cells that have taken up the recombinant DNA, ensuring that only modified cells are selected for further study.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen008"
  },
  {
    "question_text": "Discuss the process of constructing recombinant DNA using plasmids as vectors, including the roles of restriction enzymes and DNA ligase.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The process begins with the isolation of a gene of interest, such as an antibiotic resistance gene, from a donor DNA. This gene is cut out using restriction enzymes, which act as molecular scissors. The donor gene is then inserted into a plasmid vector, which has been linearized by the same or compatible enzymes. DNA ligase then joins the donor DNA to the vector, forming a circular recombinant DNA molecule. This recombinant DNA is introduced into a host cell, like E. coli, where it replicates, allowing for propagation of the gene.",
    "explanation": "This answer outlines how the combination of restriction enzymes to cut DNA, plasmid vectors to carry the gene, and DNA ligase to join the DNA fragments work together to create a functional recombinant DNA molecule.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen009"
  },
  {
    "question_text": "Evaluate the current techniques in genetic engineering and propose modifications that could improve the specificity of gene transfer processes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One could consider improvements such as utilizing CRISPR-based targeting for more precise gene integration, optimizing vector design to minimize off-target effects, and developing better regulatory elements that only express the gene of interest in specific tissues. Additionally, integrating real-time monitoring of gene integration events might help in selecting the most accurate modifications.",
    "explanation": "This response not only evaluates the current technology but also incorporates modern techniques like CRISPR, suggesting innovative modifications to enhance specificity and control, reflecting a higher-order analysis and creation process.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen010"
  },
  {
    "question_text": "Compare the outcomes and limitations of traditional hybridisation methods with recombinant DNA technologies in the context of genetic modifications.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Traditional hybridisation methods involve crossing organisms which often results in the inclusion of undesirable genes along with the desired ones. In contrast, recombinant DNA technology specifically isolates and transfers only the gene(s) of interest. This precision minimizes unwanted genetic variations; however, it requires advanced tools and techniques such as restriction enzymes and plasmid vectors. Each approach has its own practical applications and limitations regarding efficiency, specificity, and regulatory considerations.",
    "explanation": "The answer contrasts the indiscriminate nature of traditional hybridisation with the targeted approach of recombinant DNA technology while discussing the benefits and challenges associated with each method.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen011"
  },
  {
    "question_text": "True or False: Restriction enzymes are known as molecular scissors because they cleave DNA at specific sites.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Restriction enzymes are nicknamed molecular scissors because they cut DNA at specific sequences, enabling the creation of specific fragments for recombinant DNA.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen012"
  },
  {
    "question_text": "True or False: For an alien piece of DNA to be replicated in a host, it must be linked with the origin of replication.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Linkage with the origin of replication is essential because it allows the alien DNA to be recognized by the host's replication machinery and properly duplicated.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen013"
  },
  {
    "question_text": "True or False: Mosquitoes serve as vectors only for malarial parasites and have no analogy in genetic engineering techniques.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "While mosquitoes are natural vectors for the malarial parasite, in genetic engineering, plasmids serve as analogous vectors for transferring DNA, highlighting distinct roles in natural versus engineered contexts.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen014"
  },
  {
    "question_text": "True or False: Genetic engineering introduces entire genomes into host organisms rather than individual genes.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Genetic engineering typically involves the insertion of specific gene(s) of interest rather than whole genomes, which allows for more precise modifications.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen015"
  },
  {
    "question_text": "True or False: Bioprocess engineering is integral to biotechnology because it ensures the growth of desired cells by maintaining a sterile environment.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "This statement is false because bioprocess engineering is indeed integral to biotechnology as it ensures that only desired cells grow by preventing microbial contamination. The false option here tests understanding of the statement and its context.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen016"
  },
  {
    "question_text": "True or False: Recombinant DNA molecules are created in vitro through the assembly of DNA fragments.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Recombinant DNA is assembled outside the living organism (in vitro) by joining DNA fragments using enzymes such as restriction enzymes and DNA ligase.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen017"
  },
  {
    "question_text": "If a single copy of a plasmid with an antibiotic resistance gene replicates every 30 minutes, how many copies will there be after 2 hours?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "16 copies",
    "explanation": "2 hours equals 120 minutes. Since the plasmid replicates every 30 minutes, there are 120/30 = 4 replication cycles. Each cycle doubles the copies: 2^4 = 16 copies.",
    "topic": "Principles of Biotechnology",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "02_section_9_1",
    "question_id": "cbse_xii_lebo1dd_c109_gen018"
  },
  {
    "question_text": "In genetic engineering, which enzyme specifically cuts double-stranded DNA at its recognition sites?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "DNA ligase",
      "Restriction endonuclease",
      "Polymerase enzyme",
      "Exonuclease"
    ],
    "correct_answer": "Restriction endonuclease",
    "explanation": "Restriction endonucleases cut DNA at specific palindromic sequences, creating sticky ends essential for recombinant DNA formation.",
    "topic": "Restriction Enzymes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen019"
  },
  {
    "question_text": "Which of the following is a key feature required in a cloning vector to allow replication of inserted DNA?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Selectable marker",
      "Shuttle vector",
      "Origin of replication",
      "Amplification site"
    ],
    "correct_answer": "Origin of replication",
    "explanation": "The origin of replication (ori) is necessary because it directs the starting point of replication, ensuring the cloned DNA is multiplied inside the host cell.",
    "topic": "Cloning Vectors",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen020"
  },
  {
    "question_text": "In the cloning vector pBR322, insertion of foreign DNA into the tetR gene leads to:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A gain of antibiotic resistance",
      "Loss of ampicillin resistance",
      "Loss of tetracycline resistance",
      "Improved replication efficiency"
    ],
    "correct_answer": "Loss of tetracycline resistance",
    "explanation": "When foreign DNA is inserted into the tetR gene, it disrupts the gene's function, causing the loss of tetracycline resistance, which can then be used as a selection marker.",
    "topic": "Cloning Vectors",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen021"
  },
  {
    "question_text": "In gel electrophoresis, DNA fragments separate based on their:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Charge only",
      "Shape only",
      "Size only",
      "Size and charge"
    ],
    "correct_answer": "Size only",
    "explanation": "While DNA molecules have a uniform charge-to-mass ratio, the agarose gel acts as a sieve allowing smaller fragments to travel farther, thus separation is primarily based on size.",
    "topic": "Gel Electrophoresis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen022"
  },
  {
    "question_text": "Which process involves the removal of specific DNA bands from an agarose gel for further purification?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Ligation",
      "Transformation",
      "Elution",
      "Digestion"
    ],
    "correct_answer": "Elution",
    "explanation": "Elution is the process by which specific DNA fragments are cut out from the gel and extracted for use in further experiments.",
    "topic": "Gel Electrophoresis",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen023"
  },
  {
    "question_text": "Define palindromic nucleotide sequences in the context of restriction enzyme recognition sites.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Palindromic nucleotide sequences are stretches of DNA where the sequence on one strand reads the same in the 5' to 3' direction as the complementary strand does in the 5' to 3' direction.",
    "explanation": "This symmetry in the sequence is what allows restriction enzymes to recognize and bind to specific double-stranded DNA regions.",
    "topic": "Restriction Enzymes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen024"
  },
  {
    "question_text": "Explain the role of sticky ends in recombinant DNA technology.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sticky ends are single-stranded overhangs generated by restriction enzymes that facilitate the annealing of complementary DNA fragments, allowing for the efficient ligation of DNA pieces from different sources.",
    "explanation": "The complementary base pairing between sticky ends makes it possible to join DNA fragments together, an essential step in creating recombinant DNA.",
    "topic": "Restriction Enzymes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen025"
  },
  {
    "question_text": "How does a divalent cation like calcium contribute to making a bacterial cell competent for transformation?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Calcium ions interact with the bacterial cell membrane to alter its permeability, thereby facilitating the uptake of foreign DNA into the cell during transformation.",
    "explanation": "The treatment with calcium creates pores in the cell membrane that allow DNA to enter, a critical step in the transformation process.",
    "topic": "Competent Host",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen026"
  },
  {
    "question_text": "List two alternative methods used for introducing recombinant DNA into eukaryotic cells.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Two common methods are micro-injection, where DNA is directly injected into the nucleus, and biolistics (gene gun), where DNA-coated micro-particles are bombarded into the cells.",
    "explanation": "These methods provide efficient means to deliver recombinant DNA into eukaryotic cells, bypassing the limitations of natural cell membrane permeability.",
    "topic": "Competent Host / Gene Delivery",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen027"
  },
  {
    "question_text": "Discuss the steps involved in constructing recombinant DNA using restriction enzymes and ligases.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The process starts with isolating the DNA from the target source and the vector DNA. Both DNA molecules are then cut with the same restriction enzyme to produce compatible sticky ends. These sticky ends facilitate the annealing of the foreign DNA with the vector DNA. Finally, DNA ligase is used to seal the nicks, resulting in a stable recombinant DNA molecule that can be introduced into a host organism for replication.",
    "explanation": "Each step—from digestion, generation of sticky ends, and ligation—is crucial to ensure the formation of a stable recombinant DNA molecule that can be successfully replicated within the host cell.",
    "topic": "Recombinant DNA Technology",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen028"
  },
  {
    "question_text": "Describe the selection process for recombinant colonies using antibiotic resistance markers in a cloning vector such as pBR322, including the principles behind insertional inactivation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The selection process involves using a cloning vector that carries two antibiotic resistance genes. When foreign DNA is inserted into one of these genes (e.g., tetR), that gene becomes inactivated, while the other remains functional. Bacterial colonies are plated on medium containing one antibiotic to select for transformants, and then replica plated on medium containing the second antibiotic. Recombinant colonies, which have lost one resistance due to insertional inactivation, will not grow on the second antibiotic medium. This strategy enables the identification and isolation of recombinant colonies.",
    "explanation": "By using the differential expression of antibiotic resistance—affected by insertional inactivation—researchers can distinguish between recombinant and non-recombinant colonies efficiently.",
    "topic": "Cloning Vectors",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen029"
  },
  {
    "question_text": "Evaluate the advantages and disadvantages of using pathogen-derived vectors, such as the disarmed Ti plasmid of Agrobacterium tumifaciens, in plant genetic engineering.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Advantages of using pathogen-derived vectors include their natural efficiency in delivering DNA to host cells and their evolved mechanisms for gene transfer. However, disadvantages include potential biosafety and regulatory concerns, possible off-target effects in the host plant, and the need to ensure that all pathogenic factors are completely inactivated to avoid disease.",
    "explanation": "An evaluation of these vectors must balance the high efficiency of gene delivery against the risks and challenges associated with using components originally derived from pathogenic organisms.",
    "topic": "Cloning Vectors / Gene Delivery",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen030"
  },
  {
    "question_text": "Restriction enzymes always cut DNA in a non-specific manner.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Restriction enzymes are highly specific; they recognize specific palindromic sequences in the DNA and cut at defined positions.",
    "topic": "Restriction Enzymes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen031"
  },
  {
    "question_text": "Gel electrophoresis separates DNA fragments based on their size due to the sieving effect of agarose.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The agarose gel acts as a molecular sieve, allowing smaller fragments to migrate farther than larger ones, which is the basis for size-based separation.",
    "topic": "Gel Electrophoresis",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen032"
  },
  {
    "question_text": "Competent cells naturally have a high ability to take up foreign DNA without any treatment.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Bacterial cells are not naturally competent; they require treatment (such as exposure to calcium ions) to become capable of taking up foreign DNA.",
    "topic": "Competent Host",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen033"
  },
  {
    "question_text": "In a typical cloning vector, the presence of multiple cloning sites complicates the cloning process due to the generation of multiple fragments.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Multiple cloning sites can lead to several fragments upon digestion, making the ligation process more complicated. Ideally, vectors are designed with a minimal number of restriction sites to ensure efficient cloning.",
    "topic": "Cloning Vectors",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen034"
  },
  {
    "question_text": "If a cloning vector has a copy number of 100 per cell and a non-replicative foreign DNA fragment is successfully ligated to it, how many copies of the foreign DNA would you expect to find in one bacterial cell after replication?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "100 copies",
    "explanation": "Since the foreign DNA is ligated to the vector, and the vector replicates to a copy number of 100 per cell, there will be 100 copies of the recombinant plasmid carrying the foreign DNA.",
    "topic": "Cloning Vectors",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen035"
  },
  {
    "question_text": "Name two types of enzymes categorized under nucleases and briefly describe their functions in DNA modification.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The two types are exonucleases, which remove nucleotides from the ends of DNA, and endonucleases, which cut DNA at specific internal sites.",
    "explanation": "Exonucleases trim DNA from the ends, while endonucleases make cuts within the DNA strand; restriction enzymes are a type of endonuclease.",
    "topic": "Restriction Enzymes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "03_section_9_2",
    "question_id": "cbse_xii_lebo1dd_c109_gen036"
  },
  {
    "question_text": "Which enzyme is used to break down bacterial cell walls during the isolation of DNA?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Lysozyme",
      "B. Cellulase",
      "C. Chitinase",
      "D. Protease"
    ],
    "correct_answer": "A. Lysozyme",
    "explanation": "Lysozyme is used to break down the bacterial cell wall, releasing the DNA along with other macromolecules.",
    "topic": "Isolation of the Genetic Material (DNA)",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen037"
  },
  {
    "question_text": "What is the function of restriction endonucleases in recombinant DNA technology?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Amplify DNA segments",
      "B. Cut DNA at specific sequences",
      "C. Ligate DNA fragments into vectors",
      "D. Facilitate DNA replication"
    ],
    "correct_answer": "B. Cut DNA at specific sequences",
    "explanation": "Restriction endonucleases recognize specific sequences in DNA and cleave the DNA at those locations, which is crucial for fragmenting DNA and isolating the gene of interest.",
    "topic": "Cutting of DNA at Specific Locations",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen038"
  },
  {
    "question_text": "During PCR, why is a thermostable DNA polymerase essential?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. It can ligate DNA fragments at high temperature",
      "B. It remains active during the high temperature denaturation step",
      "C. It prevents the formation of primer-dimers",
      "D. It enhances DNA purification"
    ],
    "correct_answer": "B. It remains active during the high temperature denaturation step",
    "explanation": "Thermostable DNA polymerase, such as Taq polymerase, is necessary because it can withstand the high temperatures used during the denaturation phase of PCR without losing activity.",
    "topic": "Amplification of Gene of Interest using PCR",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen039"
  },
  {
    "question_text": "What is the purpose of including a selectable marker in recombinant DNA vectors?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. To increase the size of the vector DNA",
      "B. To produce a visible colored product",
      "C. To identify and select transformed cells",
      "D. To enhance restriction enzyme activity"
    ],
    "correct_answer": "C. To identify and select transformed cells",
    "explanation": "Selectable markers, such as an antibiotic resistance gene, allow only cells that have taken up the recombinant DNA to survive under selective conditions.",
    "topic": "Insertion of Recombinant DNA into the Host Cell/Organism",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen040"
  },
  {
    "question_text": "Which of the following components is NOT typically found in a stirred-tank bioreactor?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. Agitator system",
      "B. pH control system",
      "C. Foam control system",
      "D. Restriction enzyme infusion system"
    ],
    "correct_answer": "D. Restriction enzyme infusion system",
    "explanation": "Bioreactors contain systems for agitation, pH control, and foam control, but they do not include any mechanism for adding restriction enzymes, which are used in earlier steps of genetic manipulation.",
    "topic": "Obtaining the Foreign Gene Product",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen041"
  },
  {
    "question_text": "Explain the role and importance of ethanol precipitation during DNA isolation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Ethanol precipitation is used to precipitate and separate purified DNA from other macromolecules in the solution. By adding chilled ethanol, DNA becomes insoluble and can be collected as fine threads, allowing further processing.",
    "explanation": "Ethanol reduces the solubility of DNA, facilitating its recovery from the solution after contaminants have been removed by enzymatic treatments.",
    "topic": "Isolation of the Genetic Material (DNA)",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen042"
  },
  {
    "question_text": "Describe how Taq polymerase contributes to the PCR process.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Taq polymerase is a thermostable enzyme that synthesizes new DNA strands by extending primers during PCR. Its ability to remain active at high temperatures during the denaturation step makes it essential for repeated cycles of DNA amplification.",
    "explanation": "The thermostability of Taq polymerase ensures that it can function during the high-temperature phase of PCR without denaturing, enabling efficient amplification of the target DNA sequence.",
    "topic": "Amplification of Gene of Interest using PCR",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen043"
  },
  {
    "question_text": "What is the significance of making recipient cells 'competent' before introducing recombinant DNA?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Competent cells are treated to become more permeable to DNA, allowing them to take up recombinant DNA efficiently during transformation. This step is essential for successful gene insertion and subsequent expression.",
    "explanation": "Making cells competent increases the probability that foreign DNA will enter the cells, which is a critical step in achieving genetic transformation.",
    "topic": "Insertion of Recombinant DNA into the Host Cell/Organism",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen044"
  },
  {
    "question_text": "List two key challenges that may be encountered during downstream processing of recombinant protein products.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Challenges include effective separation and purification of the product from the fermentation broth, as well as maintaining product stability through appropriate formulation and quality control testing.",
    "explanation": "Downstream processing requires overcoming technical issues related to isolation, purification, formulation, and quality assurance to ensure that the final product is safe and effective for use.",
    "topic": "Downstream Processing",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen045"
  },
  {
    "question_text": "Discuss the sequential steps involved in recombinant DNA technology and explain the importance of each step.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The steps include: (1) Isolation of DNA, which requires breaking open cells and purifying the DNA; (2) Cutting of DNA using restriction enzymes to obtain fragments; (3) Ligation of the desired gene fragment into a vector to prepare recombinant DNA; (4) Insertion of recombinant DNA into host cells, facilitated by making cells competent and using selectable markers; (5) Amplification of the gene of interest by culturing the host cells or using PCR; and (6) Downstream processing, which involves large-scale culturing in bioreactors and purification of the final product. Each step is essential to ensure that the target gene is accurately isolated, inserted, multiplied, and finally expressed to yield a usable product.",
    "explanation": "This question covers the entire process of recombinant DNA technology, ensuring that students understand the interdependence of each step and the role it plays in producing a recombinant product.",
    "topic": "Processes of Recombinant DNA Technology",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen046"
  },
  {
    "question_text": "Evaluate the advantages and potential drawbacks of using bioreactors for large-scale recombinant protein production.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Bioreactors offer advantages such as controlled environment (optimal temperature, pH, oxygenation), increased biomass production, and scalability which are essential for industrial-scale protein production. However, potential drawbacks can include high initial setup cost, operational complexity, and the requirement for precise monitoring and control to avoid contamination and ensure consistent product quality.",
    "explanation": "This answer discusses both the benefits and challenges of bioreactors, underscoring their importance in industrial biotechnology while acknowledging the technical and economic considerations.",
    "topic": "Obtaining the Foreign Gene Product",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen047"
  },
  {
    "question_text": "Compare and contrast the use of restriction enzymes for DNA fragmentation with the use of PCR for gene amplification.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Restriction enzymes are used to cut DNA at specific recognition sequences, thus generating fragments that can be isolated and cloned. This is a precise cutting method but does not increase the number of copies of the gene. In contrast, PCR amplifies the target gene exponentially using repeated cycles of denaturation, primer annealing, and extension, creating millions to billions of copies of the gene in vitro. While restriction digestion is crucial for preparing DNA fragments for cloning, PCR is vital for quickly amplifying small amounts of DNA.",
    "explanation": "This response highlights the distinct roles and mechanisms of enzyme-mediated DNA cutting versus amplification, comparing their techniques, applications, and outcomes in recombinant DNA technology.",
    "topic": "Cutting and Amplification of DNA",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen048"
  },
  {
    "question_text": "True or False: Taq polymerase is used in PCR because it denatures at high temperatures.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Taq polymerase is used because it does not denature at high temperatures but remains stable and active during the denaturation step of PCR.",
    "topic": "Amplification of Gene of Interest using PCR",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen049"
  },
  {
    "question_text": "True or False: DNA moves towards the positive electrode during agarose gel electrophoresis.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "DNA is negatively charged and therefore migrates towards the positive electrode when an electric field is applied during electrophoresis.",
    "topic": "Cutting of DNA at Specific Locations",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen050"
  },
  {
    "question_text": "True or False: Competent cells are prepared to enhance the uptake of foreign DNA during transformation.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Making cells competent increases their permeability, allowing them to take up foreign recombinant DNA more efficiently during transformation.",
    "topic": "Insertion of Recombinant DNA into the Host Cell/Organism",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen051"
  },
  {
    "question_text": "True or False: The primary goal in most recombinant DNA techniques is to express a desirable protein.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Recombinant DNA technology is often employed for the production of specific proteins, which are expressed in host cells after gene cloning.",
    "topic": "Obtaining the Foreign Gene Product",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen052"
  },
  {
    "question_text": "True or False: Downstream processing does not require quality control testing for each product produced.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Downstream processing includes quality control testing as a critical step to ensure product safety, consistency, and efficacy before marketing.",
    "topic": "Downstream Processing",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen053"
  },
  {
    "question_text": "True or False: Ribonuclease is used during DNA isolation to remove RNA contaminants from the sample.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Ribonuclease degrades RNA molecules, ensuring that the isolated DNA is free from RNA contamination.",
    "topic": "Isolation of the Genetic Material (DNA)",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen054"
  },
  {
    "question_text": "If a PCR process amplifies a DNA fragment to approximately one billion copies after 30 cycles, what is the average multiplication factor per cycle assuming exponential amplification? Round to the nearest whole number.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 2",
    "explanation": "Exponential amplification implies a doubling of the amount of DNA each cycle. Since 2 raised to the 30th power is approximately one billion, the average multiplication factor is about 2 per cycle.",
    "topic": "Amplification of Gene of Interest using PCR",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo109",
    "section_id": "04_section_9_3",
    "question_id": "cbse_xii_lebo1dd_c109_gen055"
  }
]