[
  {
    "question_text": "What is the predominant gas in biogas produced by microbial activity?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Oxygen",
      "Carbon dioxide",
      "Methane",
      "Nitrogen"
    ],
    "correct_answer": "Methane",
    "explanation": "Biogas is primarily composed of methane produced by microbial activity during anaerobic digestion.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen060"
  },
  {
    "question_text": "Which of the following bacteria is known for its production of methane during the anaerobic digestion of cellulosic material?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Lactic acid bacteria",
      "Acetobacter",
      "Methanobacterium",
      "Bacillus subtilis"
    ],
    "correct_answer": "Methanobacterium",
    "explanation": "Methanobacterium is a common methanogen that produces methane and is found in anaerobic environments such as cattle rumen and sewage sludge.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen061"
  },
  {
    "question_text": "In a biogas plant, which component is responsible for the collection of the produced biogas?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Inlet chamber",
      "Gas holder",
      "Digester",
      "Outlet chamber"
    ],
    "correct_answer": "Gas holder",
    "explanation": "The gas holder is the part of the plant where biogas accumulates as it is produced by the action of anaerobic bacteria.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen062"
  },
  {
    "question_text": "What is the role of anaerobic bacteria in the digester of a biogas plant?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Absorb carbon dioxide",
      "Break down organic matter to produce biogas",
      "Prevent the escape of gas",
      "Neutralize toxins in the slurry"
    ],
    "correct_answer": "Break down organic matter to produce biogas",
    "explanation": "Anaerobic bacteria in the digester break down organic matter, resulting in the production of biogas, which is mainly methane and carbon dioxide.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen063"
  },
  {
    "question_text": "Define biogas and list two common uses of biogas.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Biogas is a mixture of gases, primarily containing methane, produced by the microbial breakdown of organic materials. It is commonly used for cooking and lighting.",
    "explanation": "The definition highlights its microbial origin and composition, and the uses include cooking and lighting as mentioned in the text.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen064"
  },
  {
    "question_text": "What are methanogens and what role do they play in biogas production?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Methanogens are a group of bacteria that produce methane as a metabolic by-product under anaerobic conditions. In biogas production, they break down cellulosic materials, such as cattle dung, to generate methane along with other gases.",
    "explanation": "The answer explains that methanogens are responsible for converting organic substances into methane during anaerobic digestion, a key process in biogas production.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen065"
  },
  {
    "question_text": "Explain the importance of 'gobar' in the context of biogas production.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Gobar, or cattle dung, is important in biogas production because it is rich in methanogenic bacteria that help in the anaerobic digestion process. It provides the organic material needed as a substrate and also contributes to the microbial population that generates methane.",
    "explanation": "The answer connects the availability of methanogens in cattle dung with its use in producing biogas, making it an essential resource in biogas plants.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen066"
  },
  {
    "question_text": "Why are biogas plants more commonly established in rural areas?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Biogas plants are more common in rural areas because cattle dung, a key substrate for biogas production, is abundantly available. This rural waste can be effectively managed and converted into renewable energy.",
    "explanation": "Rural areas typically have ample cattle waste, making them ideal for biogas production, while also benefiting from renewable energy solutions.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen067"
  },
  {
    "question_text": "Describe the process of biogas production in a typical biogas plant as outlined in the text.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A typical biogas plant involves collecting bio-wastes, particularly cattle dung, and mixing it with water in an inlet chamber. This slurry is then fed into a concrete digester where anaerobic bacteria break down the organic matter. As the process continues, biogas, primarily methane and carbon dioxide, is produced and rises, causing a floating cover to move. The gas is then collected in a gas holder and directed through a pipe to be utilized for cooking and lighting. The remaining digested material, called sludge, is removed via an outlet and can be used as fertilizer.",
    "explanation": "The answer covers the entire process from waste collection, anaerobic digestion, gas production, gas collection, and the usage of by-products, reflecting the detailed diagram in the text.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen068"
  },
  {
    "question_text": "Discuss the role of methanogens in both the cattle rumen and biogas plants, and explain how their activity can benefit the environment.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Methanogens such as Methanobacterium play a critical role in both the cattle rumen and biogas plants by breaking down cellulosic material to produce methane. In the cattle rumen, they help in the breakdown of cellulose, aiding digestion and providing necessary nutrients to the animal. In biogas plants, the same microbes facilitate the anaerobic digestion process, converting organic waste into biogas, a renewable source of energy. This process not only generates clean energy for cooking and lighting but also helps in managing organic waste, thereby reducing environmental pollution and offering an eco-friendly alternative to fossil fuels.",
    "explanation": "The response illustrates the dual role of methanogens in animal nutrition and renewable energy production, and connects the microbial process with broader environmental benefits.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen069"
  },
  {
    "question_text": "Design an experiment to demonstrate biogas production using cattle dung. What factors would you consider to optimize the biogas output?",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "An experiment could involve setting up a small-scale biogas digester using cattle dung mixed with water. Key factors to consider include maintaining strict anaerobic conditions, controlling the temperature, ensuring an optimal ratio of dung to water, and allowing sufficient retention time for the digestion process. Monitoring the pH and adjusting the substrate concentration can also help improve methane production. Safety measures and proper collection of the gas in a gas holder are essential. The experiment should include control samples and repeated trials to verify the consistency of the biogas production.",
    "explanation": "This answer outlines a practical experimental design while considering various factors such as environmental conditions, substrate ratios, and safety precautions for optimizing biogas production.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen070"
  },
  {
    "question_text": "Biogas is mainly composed of oxygen.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Biogas is primarily composed of methane and carbon dioxide, not oxygen.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen071"
  },
  {
    "question_text": "Methanobacterium, a type of methanogen, is found in the cattle rumen and in anaerobic sludge during sewage treatment.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text states that Methanobacterium is found in both the cattle rumen and the anaerobic sludge of sewage, indicating its role in various anaerobic environments.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen072"
  },
  {
    "question_text": "The floating cover in a biogas plant is used to collect the biogas produced.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The floating cover is placed over the slurry and rises as gas is produced, which helps in the collection of the biogas.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen073"
  },
  {
    "question_text": "Biogas production is an anaerobic process.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The production of biogas occurs through the anaerobic fermentation of organic matter by bacteria.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen074"
  },
  {
    "question_text": "Humans can effectively digest cellulose in their foods due to the presence of methanogens in the human gut.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Unlike cattle, humans lack the necessary enzymes and a significant population of methanogens in their digestive system to break down cellulose effectively.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen075"
  },
  {
    "question_text": "The residual sludge from the biogas plant can be used as fertilizer.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "After the anaerobic digestion process, the remaining sludge is nutrient-rich and can be used as an effective fertilizer.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen076"
  },
  {
    "question_text": "Biogas plants are more effectively built in urban areas because of the high availability of organic waste.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Biogas plants are more commonly built in rural areas, where cattle dung, a key ingredient for biogas production, is abundantly available.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen077"
  },
  {
    "question_text": "A small village biogas plant processes 200 liters of dung slurry and produces 40 liters of biogas in one hour. Calculate the average biogas production per minute (in liters).",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 0.67 liters per minute",
    "explanation": "Since 40 liters of biogas are produced in one hour (60 minutes), the production per minute is calculated as 40 รท 60, which is approximately 0.67 liters per minute.",
    "topic": "Microbes in Production of Biogas",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo108",
    "section_id": "05_section_8_4",
    "question_id": "cbse_xii_lebo1dd_c108_gen078"
  }
]