[
  {
    "question_text": "Can you list 10 recombinant proteins which are used in medical practice? Find out where they are used as therapeutics (use the internet).",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Possible answers include: human insulin (for diabetes), human growth hormone (for growth deficiencies), erythropoietin (for anemia), interferons (for viral infections), tissue plasminogen activator (for clot dissolution), factor VIII (for hemophilia), granulocyte colony stimulating factor (for neutropenia), monoclonal antibodies (for cancer and autoimmune disorders), etanercept (for rheumatoid arthritis), and others as discovered by research.",
    "explanation": "Recombinant proteins are produced using recombinant DNA technology. Their use as therapeutics depends on their biological activity in addressing specific medical conditions. The answer requires independent research to compile a list based on current medical practice.",
    "topic": "Recombinant protein therapeutics",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex001"
  },
  {
    "question_text": "Make a chart (with diagrammatic representation) showing a restriction enzyme, the substrate DNA on which it acts, the site at which it cuts DNA and the product it produces.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A diagram could show, for example, EcoRI acting on its substrate with the recognition sequence GAATTC by cutting between the G and A nucleotides to produce DNA fragments with sticky ends.",
    "explanation": "This exercise requires you to visually represent the mechanism of a restriction enzyme. The diagram should include the enzyme, the specific nucleotide sequence where the cut occurs, and the resulting sticky-ended fragments, reinforcing your understanding of how recombinant DNA molecules are created.",
    "topic": "Restriction enzymes in recombinant DNA technology",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex002"
  },
  {
    "question_text": "From what you have learnt, can you tell whether enzymes are bigger or DNA is bigger in molecular size? How did you know?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "DNA is generally larger in molecular size than enzymes.",
    "explanation": "Although enzymes are complex proteins, DNA molecules are long polymers composed of thousands to billions of nucleotides. This high molecular weight and length make DNA, in most cases, larger than individual enzyme molecules. This conclusion can be reached by comparing typical molecular weights and the nature of polymers versus proteins.",
    "topic": "Molecular size comparison in biotechnology",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex003"
  },
  {
    "question_text": "What would be the molar concentration of human DNA in a human cell? Consult your teacher.",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Approximately 10 mM (0.01 M) is a rough estimate, though the exact value should be determined with a proper calculation based on genome size and nuclear volume.",
    "explanation": "The molar concentration can be approximated by using the total number of nucleotides in the genome and the volume of the nucleus. Since the human genome has billions of base pairs and the nucleus occupies a very small volume, the concentration is relatively high. However, precise calculation requires detailed data and consultation.",
    "topic": "Molar concentration of DNA in cells",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex004"
  },
  {
    "question_text": "Do eukaryotic cells have restriction endonucleases? Justify your answer.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "No, eukaryotic cells do not naturally have restriction endonucleases as part of their cellular machinery.",
    "explanation": "Restriction endonucleases are primarily found in prokaryotes where they serve as a defense mechanism against invading viral DNA. Eukaryotic cells lack these enzymes because their mechanisms for regulating and protecting their genomic DNA are different.",
    "topic": "Restriction enzymes",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex005"
  },
  {
    "question_text": "Besides better aeration and mixing properties, what other advantages do stirred tank bioreactors have over shake flasks?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Stirred tank bioreactors provide enhanced control over parameters such as temperature, pH, oxygen supply, and nutrient distribution, and they allow for easier scale-up and continuous operation.",
    "explanation": "Stirred tank bioreactors are designed to maintain optimal growth conditions. Their advanced control systems and design features enable more reproducible cultivation conditions with higher yields of the desired product compared to shake flasks.",
    "topic": "Bioreactors and downstream processing",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex006"
  },
  {
    "question_text": "Collect 5 examples of palindromic DNA sequences by consulting your teacher. Better try to create a palindromic sequence by following base-pair rules.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Examples may include: GAATTC (EcoRI), AAGCTT (HindIII), GGATCC (BamHI), GCGGCCGC (NotI), and TTAATTAA. You might also generate a new one following base-pair rules.",
    "explanation": "Palindromic sequences read the same in the 5' to 3' direction on both strands. This property is important for the function of restriction enzymes which recognize and cut these specific sequences. The exercise encourages exploration and application of base-pairing rules.",
    "topic": "Palindromic sequences in DNA",
    "bloom_level": "Create",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex007"
  },
  {
    "question_text": "Can you recall meiosis and indicate at what stage a recombinant DNA is made?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "During prophase I of meiosis, homologous chromosomes undergo crossing over, which is the natural process of recombination.",
    "explanation": "In biological systems, genetic recombination occurs during prophase I of meiosis through crossing over between homologous chromosomes. It is important to note that while this natural process creates recombinant chromosomes, recombinant DNA technology is an in vitro technique that mimics the concept of recombination.",
    "topic": "Meiosis and genetic recombination",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex008"
  },
  {
    "question_text": "Can you think and answer how a reporter enzyme can be used to monitor transformation of host cells by foreign DNA in addition to a selectable marker?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A reporter enzyme such as β-galactosidase can be fused to a gene of interest so that its expression produces a detectable color change (for example, blue/white screening) in the presence of a chromogenic substrate, thereby indicating successful transformation.",
    "explanation": "Reporter enzymes serve as visual indicators of gene expression. When fused to a gene inserted in the host, they provide a means to quickly assess transformation efficiency and distinguish between recombinant and non-recombinant cells.",
    "topic": "Transformation and reporter systems",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex009"
  },
  {
    "question_text": "Describe briefly the following:\n(a) Origin of replication\n(b) Bioreactors\n(c) Downstream processing",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) Origin of replication is a specific DNA sequence where replication initiates and which controls plasmid copy number. (b) Bioreactors are vessels that provide an optimal environment for the large-scale cultivation of cells and production of biotechnological products by controlling parameters such as temperature, pH, and oxygen. (c) Downstream processing encompasses the steps taken after biosynthesis, including separation, purification, formulation, and quality control of the final product.",
    "explanation": "These terms are fundamental in recombinant DNA technology and bioprocessing. The origin of replication ensures DNA multiplication; bioreactors enable efficient scale-up; and downstream processing is critical for obtaining a purified, market-ready product.",
    "topic": "Molecular biology and bioprocessing",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex010"
  },
  {
    "question_text": "Explain briefly:\n(a) PCR\n(b) Restriction enzymes and DNA\n(c) Chitinase",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) PCR (Polymerase Chain Reaction) is a technique used to amplify specific DNA segments through repeated cycles of denaturation, annealing, and extension. (b) Restriction enzymes are nucleases that cleave DNA at specific palindromic sequences, generating fragments with sticky or blunt ends useful in recombinant DNA technology. (c) Chitinase is an enzyme that breaks down chitin, a key component of fungal cell walls and the exoskeletons of insects.",
    "explanation": "Each part of the question targets a fundamental tool or process in biotechnology. PCR is essential for DNA amplification, restriction enzymes are central to gene cloning, and chitinase plays an important role in degrading chitin, highlighting its biological functions and applications.",
    "topic": "Molecular techniques and enzymes",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex011"
  },
  {
    "question_text": "Discuss with your teacher and find out how to distinguish between:\n(a) Plasmid DNA and Chromosomal DNA\n(b) RNA and DNA\n(c) Exonuclease and Endonuclease",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "(a) Plasmid DNA is typically circular, smaller, and replicates independently from chromosomal DNA, which is linear (in eukaryotes) and contains the majority of genetic information. (b) RNA differs from DNA in that RNA contains ribose sugar, uses uracil in place of thymine, and is usually single-stranded compared to the double-stranded nature of DNA. (c) Exonucleases remove nucleotides from the ends of DNA strands, while endonucleases cleave at specific positions within the DNA molecule.",
    "explanation": "This question requires a comparative understanding of various molecular components and enzymes. Recognizing the structural and functional differences between these molecules is critical for their manipulation in biotechnology applications.",
    "topic": "Molecular biology distinctions",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo109",
    "question_id": "cbse_xii_lebo1dd_c109_ex012"
  }
]