[
  {
    "question_text": "Mention the advantages of selecting pea plant for experiment by Mendel.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Pea plants are advantageous because they have easily observable contrasting traits, are true-breeding, have a short generation time, are easy to self- and cross-pollinate, and provide large sample sizes for statistical accuracy.",
    "explanation": "Pea plants have many contrasting characters (such as tall/dwarf, yellow/green seeds), they are true breeding meaning their traits remain stable, and they are manageable in a lab setting with rapid generation cycles. This made it easier for Mendel to deduce patterns in inheritance.",
    "topic": "Mendel's experiments and characteristics of pea plants",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex001"
  },
  {
    "question_text": "Differentiate between the following: (a) Dominance and Recessive; (b) Homozygous and Heterozygous; (c) Monohybrid and Dihybrid.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Dominance refers to the phenomenon where one allele masks the expression of another in a heterozygous condition, while recessive alleles are masked in such pairings. Homozygous means having identical alleles for a trait, whereas heterozygous means possessing two different alleles. A monohybrid cross involves one pair of contrasting traits, while a dihybrid cross involves two pairs of traits.",
    "explanation": "The answer highlights the essential distinctions: dominance vs recessiveness in allele expression, homozygous vs heterozygous genetic makeup, and that monohybrid crosses study a single trait while dihybrid crosses observe two traits concurrently.",
    "topic": "Basic genetic concepts",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex002"
  },
  {
    "question_text": "A diploid organism is heterozygous for 4 loci, how many types of gametes can be produced?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "16",
    "explanation": "For each heterozygous locus, two types of gametes can be produced. For 4 loci, the total number of gametes is 2^4 = 16, due to independent segregation.",
    "topic": "Genetics – Gamete production",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex003"
  },
  {
    "question_text": "Explain the Law of Dominance using a monohybrid cross.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The Law of Dominance states that in a heterozygote, one allele (the dominant) masks the effect of the other allele (the recessive). In a monohybrid cross, for example, if a true-breeding tall plant (TT) is crossed with a dwarf plant (tt), the F1 progeny (Tt) will all display the tall phenotype because the tall allele is dominant over the dwarf allele.",
    "explanation": "By crossing true-breeding plants with contrasting traits, Mendel observed that the F1 generation uniformly exhibited the dominant trait. This observation led to the formulation of the Law of Dominance, a fundamental concept in Mendelian genetics.",
    "topic": "Law of Dominance",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex004"
  },
  {
    "question_text": "Define and design a test-cross.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A test cross is a genetic cross between an individual showing a dominant phenotype (but with an unknown genotype) and an individual that is homozygous recessive. The pattern of phenotypes in the offspring will reveal the genotype of the unknown parent.",
    "explanation": "The test cross is used to determine whether an individual displaying the dominant trait is homozygous dominant or heterozygous. If the offspring all display the dominant trait, the unknown parent is likely homozygous dominant; if recessive phenotypes appear, the unknown parent is heterozygous.",
    "topic": "Test cross",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex005"
  },
  {
    "question_text": "Using a Punnett Square, work out the distribution of phenotypic features in the first filial generation after a cross between a homozygous female and a heterozygous male for a single locus.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "If we assume the trait is governed by a dominant allele, crossing a homozygous dominant female (TT) with a heterozygous male (Tt) would produce offspring that are 50% homozygous dominant (TT) and 50% heterozygous (Tt), resulting in 100% displaying the dominant phenotype.",
    "explanation": "The Punnett Square for this cross shows that each offspring receives one allele from each parent. Since both TT and Tt express the dominant trait, all progeny will show that phenotype.",
    "topic": "Punnett Square & Monohybrid Cross",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex006"
  },
  {
    "question_text": "When a cross is made between a tall plant with yellow seeds (TtYy) and a tall plant with green seeds (Ttyy), what proportions of phenotype in the offspring could be expected to be (a) tall and green, (b) dwarf and green.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Tall and green: 3/8 of the offspring; Dwarf and green: 1/8 of the offspring.",
    "explanation": "Tallying the gametes from both parents and using the Punnett Square method shows that among the 8 equally likely outcomes, 3 result in tall plants with the yy genotype (green seeds) and 1 outcome results in dwarf plants with yy (since dwarf is expressed only when tt).",
    "topic": "Dihybrid Cross & Phenotypic Ratios",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex007"
  },
  {
    "question_text": "Two heterozygous parents are crossed. If the two loci are linked, what would be the distribution of phenotypic features in the F2 generation for a dihybrid cross?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "When the genes are linked, the parental phenotypes will appear in higher proportions than the recombinant phenotypes. In the extreme case of complete linkage (no crossing over), only the two parental phenotypes would appear in the F2 generation, typically in a 1:1 ratio. With partial linkage, recombinant phenotypes would appear at a lower frequency than expected under independent assortment.",
    "explanation": "Linkage means that the genes are located close together on the same chromosome and tend to be inherited together. This disrupts the standard 9:3:3:1 ratio seen when genes assort independently, resulting in a skewed distribution emphasizing parental gene combinations.",
    "topic": "Linkage and Recombination",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex008"
  },
  {
    "question_text": "Briefly mention the contribution of T.H. Morgan in genetics.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "T.H. Morgan used fruit flies (Drosophila melanogaster) in his experiments to establish the chromosomal theory of inheritance, demonstrated that genes are located on chromosomes, and laid the foundation for modern genetics by mapping gene locations.",
    "explanation": "Morgan's work with Drosophila provided empirical evidence for the behavior of chromosomes during inheritance and revealed the principles of linkage and recombination, confirming that genes are arranged on chromosomes.",
    "topic": "Chromosomal Theory of Inheritance",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex009"
  },
  {
    "question_text": "What is pedigree analysis? Suggest how such an analysis can be useful.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Pedigree analysis is the study of family histories through diagrammatic representations (pedigrees) to trace the inheritance patterns of specific traits or genetic disorders. It is useful for diagnosing genetic diseases, determining modes of inheritance (autosomal dominant, recessive, or sex-linked), and for genetic counseling.",
    "explanation": "By marking affected and unaffected individuals across generations, pedigree analysis helps in visualizing how traits are transmitted in families, which provides insight into genetic risks and assists in planning medical interventions.",
    "topic": "Genetic Disorders & Pedigree Analysis",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex010"
  },
  {
    "question_text": "How is sex determined in human beings?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Sex in human beings is determined by the combination of sex chromosomes; females have XX and males have XY. The sex of the offspring is determined by the sperm, which carries either an X or a Y chromosome.",
    "explanation": "During fertilization, the ovum (which always contributes an X chromosome) is fertilized by a sperm that can contribute either an X or a Y chromosome. If the sperm contributes an X, the result is XX (female); if a Y is contributed, the result is XY (male).",
    "topic": "Sex Determination in Humans",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex011"
  },
  {
    "question_text": "A child has blood group O. If the father has blood group A and the mother blood group B, work out the genotypes of the parents and the possible genotypes of the other offsprings.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The child with blood group O must have genotype ii. For the child to have genotype ii, the father (with blood group A) must be heterozygous (IAi) and the mother (with blood group B) must also be heterozygous (IBi). The possible offspring genotypes from this cross are: IAIB (AB blood group), IAi (blood group A), IBi (blood group B), and ii (blood group O), each occurring with approximately equal probability.",
    "explanation": "Since the O blood type is recessive (ii), both parents must carry the recessive allele. Their heterozygous condition allows for a chance that an offspring inherits the recessive allele from both parents, leading to blood group O. The cross yields four possible genotypes in a typical 1:1:1:1 ratio.",
    "topic": "Blood Group Inheritance, Co-dominance",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex012"
  },
  {
    "question_text": "Explain the following terms with example: (a) Co-dominance, (b) Incomplete dominance.",
    "type": "Long Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Co-dominance is a form of inheritance in which both alleles in a heterozygote are fully expressed, as seen in the human ABO blood group system where alleles IA and IB express together to form type AB blood. Incomplete dominance is when the heterozygous phenotype is an intermediate blend of the two homozygous phenotypes; for example, crossing red-flowered snapdragons (RR) with white-flowered ones (rr) produces pink-flowered offspring (Rr).",
    "explanation": "The answer distinguishes between co-dominance, where both alleles contribute equally without blending, and incomplete dominance where the phenotype of heterozygotes falls between those of the homozygotes. Specific examples clarify these concepts.",
    "topic": "Co-dominance and Incomplete Dominance",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex013"
  },
  {
    "question_text": "What is point mutation? Give one example.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A point mutation is a change in a single nucleotide base in the DNA sequence. An example is the mutation in the beta-globin gene that leads to sickle-cell anemia.",
    "explanation": "Point mutations affect only one nucleotide and can have profound effects when they occur in a gene coding for an essential protein. The substitution in the beta-globin gene alters an amino acid, resulting in the sickled shape of red blood cells.",
    "topic": "Mutation",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex014"
  },
  {
    "question_text": "Who had proposed the chromosomal theory of inheritance?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The chromosomal theory of inheritance was proposed by Walter Sutton and Theodor Boveri.",
    "explanation": "Sutton and Boveri independently observed that the behavior of chromosomes during meiosis resembled Mendel's laws, thereby linking genetic inheritance with chromosomal behavior.",
    "topic": "Chromosomal Theory of Inheritance",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex015"
  },
  {
    "question_text": "Mention any two autosomal genetic disorders with their symptoms.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Two autosomal genetic disorders are: 1) Sickle-cell anemia, which is characterized by abnormally shaped red blood cells that can lead to pain crises and anemia; 2) Thalassemia, which involves reduced synthesis of hemoglobin chains leading to anemia, weakness, and other complications.",
    "explanation": "Both disorders are inherited in a Mendelian fashion from autosomal genes. Sickle-cell anemia is due to a point mutation causing a change in the beta-globin gene, while thalassemia results from mutations or deletions that reduce the production of globin chains.",
    "topic": "Mendelian Disorders",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo104",
    "question_id": "cbse_xii_lebo1dd_c104_ex016"
  },
  {
    "question_text": "What is the definition of a pleiotropic gene?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A gene that affects one trait only",
      "A gene that affects multiple phenotypes or traits",
      "Different genes affecting a similar phenotype",
      "A gene with no phenotypic effect"
    ],
    "correct_answer": "A gene that affects multiple phenotypes or traits",
    "explanation": "Pleiotropy refers to a single gene influencing multiple phenotypic traits, which is the basis of this concept.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen071"
  },
  {
    "question_text": "What is the underlying mechanism of pleiotropy mentioned in the section?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Affecting DNA replication processes",
      "Affecting metabolic pathways that contribute to different phenotypes",
      "Altering protein folding in the endoplasmic reticulum",
      "Changing gene splicing mechanisms"
    ],
    "correct_answer": "Affecting metabolic pathways that contribute to different phenotypes",
    "explanation": "The section states that the mechanism in most cases is the gene's effect on metabolic pathways, influencing multiple phenotypes.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen072"
  },
  {
    "question_text": "Which of the following diseases is an example of pleiotropy due to a single gene mutation?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Cystic fibrosis",
      "Sickle cell anemia",
      "Phenylketonuria",
      "Hemophilia"
    ],
    "correct_answer": "Phenylketonuria",
    "explanation": "Phenylketonuria is cited in the section as an example where a single gene mutation in phenylalanine hydroxylase causes multiple phenotypic effects.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen073"
  },
  {
    "question_text": "Considering pleiotropy, if a mutation in the gene coding for phenylalanine hydroxylase leads to reduced hair and skin pigmentation, which additional symptom is associated with the disease?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Impaired liver function",
      "Mental retardation",
      "Cardiovascular issues",
      "Muscle weakness"
    ],
    "correct_answer": "Mental retardation",
    "explanation": "The text states that the mutation leads to phenotypic expressions including mental retardation and a reduction in hair and skin pigmentation.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen074"
  },
  {
    "question_text": "Why is the gene causing phenylketonuria considered pleiotropic?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "It only impacts enzyme production.",
      "It influences multiple aspects of physiology including mental development and pigmentation.",
      "It only causes problems in a single metabolic pathway.",
      "It does not affect metabolic pathways."
    ],
    "correct_answer": "It influences multiple aspects of physiology including mental development and pigmentation.",
    "explanation": "The gene is considered pleiotropic because its mutation affects several phenotypes, as seen in the manifestation of phenylketonuria.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen075"
  },
  {
    "question_text": "Define pleiotropy in your own words.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Pleiotropy is when a single gene affects multiple phenotypes or traits.",
    "explanation": "This answer captures the basic definition, emphasizing that one gene can impact several different characteristics.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen076"
  },
  {
    "question_text": "Explain the relationship between a gene's effect on metabolic pathways and its pleiotropic effects.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A gene's effect on metabolic pathways can lead to multiple downstream impacts on various biological processes, thereby causing multiple phenotypic outcomes.",
    "explanation": "The answer describes how an alteration in metabolic pathways due to a gene mutation can manifest as various traits, which is the essence of pleiotropy.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen077"
  },
  {
    "question_text": "List two phenotypic expressions that occur in phenylketonuria.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mental retardation and a reduction in hair and skin pigmentation.",
    "explanation": "The section explicitly mentions these two traits as manifestations of the mutation in the phenylalanine hydroxylase gene.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen078"
  },
  {
    "question_text": "Assess why understanding pleiotropy is important in the study of genetic diseases.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Understanding pleiotropy is important because a single mutation can cause multiple effects, which impacts diagnosis, treatment, and research strategies in genetic diseases.",
    "explanation": "This answer highlights the complexity of genetic disorders and the necessity for multi-faceted approaches due to the multiple effects of one gene.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen079"
  },
  {
    "question_text": "Discuss the concept of pleiotropy with reference to phenylketonuria including the underlying metabolic mechanism.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Pleiotropy occurs when one gene mutation affects multiple phenotypes. In phenylketonuria, a mutation in the gene coding for phenylalanine hydroxylase disrupts the metabolism of phenylalanine, leading to its accumulation. This metabolic disruption is responsible for various symptoms, such as mental retardation and reduced hair and skin pigmentation.",
    "explanation": "The answer should incorporate the link between metabolic pathways and the multiple phenotypic manifestations observed in phenylketonuria.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen080"
  },
  {
    "question_text": "Evaluate how pleiotropy complicates the treatment of genetic disorders with reference to the example provided in the text.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Pleiotropy complicates treatment because a single mutation can lead to a range of symptoms, requiring therapeutic strategies that address multiple systems simultaneously. In phenylketonuria, the mutation affects both mental development and pigmentation, demonstrating that treatment must be multifaceted rather than targeting a single symptom.",
    "explanation": "This answer should explore the challenges posed by multiple phenotypic effects, indicating that standard single-target interventions may not be sufficient.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen081"
  },
  {
    "question_text": "Propose a hypothetical research study to investigate further effects of the phenylalanine hydroxylase gene mutation in phenylketonuria.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A proposed study could involve metabolic profiling of individuals with the phenylalanine hydroxylase mutation versus healthy controls using techniques such as metabolomics and advanced imaging. The goal would be to identify additional pleiotropic effects, possibly impacting other physiological systems, thereby broadening our understanding of the mutation's impact.",
    "explanation": "This answer should outline a clear study framework, including objectives, methods, and expected outcomes, linking it back to the concept of pleiotropy.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen082"
  },
  {
    "question_text": "A pleiotropic gene affects only one trait. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "By definition, a pleiotropic gene influences multiple traits, not just one.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen083"
  },
  {
    "question_text": "The mutation in the gene for phenylalanine hydroxylase only affects the pigmentation of hair and skin. True or False?",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The mutation also leads to mental retardation, showing that it has multiple phenotypic effects.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen084"
  },
  {
    "question_text": "Phenylketonuria is caused by a mutation in a single gene. True or False?",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section explicitly mentions that phenylketonuria is due to a mutation in the gene coding for phenylalanine hydroxylase.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen085"
  },
  {
    "question_text": "Mutations in pleiotropic genes can lead to a cascade of effects across different metabolic pathways. True or False?",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "Since pleiotropic genes influence metabolic pathways, a single mutation can indeed trigger multiple downstream effects across various systems.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen086"
  },
  {
    "question_text": "Understanding pleiotropy has little impact on the approach to genetic disease management. True or False?",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Knowledge of pleiotropy is crucial as it informs diagnosis, treatment, and management strategies by highlighting multiple effects caused by a single gene mutation.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen087"
  },
  {
    "question_text": "If a mutation in a pleiotropic gene affects 2 out of 5 metabolic pathways, what fraction of the pathways is affected? Provide your answer as a reduced fraction.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "2/5",
    "explanation": "The mutation influences 2 of the 5 metabolic pathways, yielding the fraction 2/5 in simplest terms.",
    "topic": "PLEIOTROPY",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "06_section_4_5",
    "question_id": "cbse_xii_lebo1dd_c104_gen088"
  },
  {
    "question_text": "During human reproduction, which gamete determines the sex of the offspring?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Egg",
      "B: Sperm",
      "C: Both egg and sperm equally",
      "D: Neither egg nor sperm"
    ],
    "correct_answer": "Sperm",
    "explanation": "In humans, the egg always contributes an X-chromosome while the sperm can contribute either an X or a Y chromosome, making the sperm the determinant of the offspring's sex.",
    "topic": "Sex Determination in Humans",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen089"
  },
  {
    "question_text": "Which of the following statements is true about the XY sex determination system seen in humans and Drosophila?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Males have two X-chromosomes",
      "B: Females have an X and a Y chromosome",
      "C: Males have an X and a Y chromosome",
      "D: Both sexes have identical sex chromosomes"
    ],
    "correct_answer": "Males have an X and a Y chromosome",
    "explanation": "In the XY system, males are heterogametic with one X and one Y chromosome, while females are homogametic with two X-chromosomes.",
    "topic": "Sex Determination in Humans",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen090"
  },
  {
    "question_text": "In the XO type of sex determination seen in many insects, which of the following best describes gamete formation?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Both sperm and eggs have an extra X-chromosome",
      "B: Sperm are produced with or without an X-chromosome while all eggs have an additional X-chromosome",
      "C: All sperm contain an X-chromosome and eggs vary",
      "D: Both sperm and eggs have no variation in the X-chromosome content"
    ],
    "correct_answer": "Sperm are produced with or without an X-chromosome while all eggs have an additional X-chromosome",
    "explanation": "In the XO system, every egg carries an X-chromosome. Males produce two types of sperm: one type carries the X-chromosome and the other lacks it, leading to female (XX) or male (XO) offspring.",
    "topic": "XO Sex Determination",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen091"
  },
  {
    "question_text": "Which of the following best describes the mechanism of sex determination in birds?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A: Males have XY chromosomes while females have XX chromosomes",
      "B: Females have ZW chromosomes, and the sperm determines the sex",
      "C: Females have ZW chromosomes, and the egg determines the sex",
      "D: Males have ZZ chromosomes, and both gametes carry different sex chromosomes"
    ],
    "correct_answer": "Females have ZW chromosomes, and the egg determines the sex",
    "explanation": "Birds use a female heterogametic system where females have one Z and one W chromosome. Since females produce gametes that carry either a Z or a W, the egg determines the sex of the offspring.",
    "topic": "Sex Determination in Birds",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen092"
  },
  {
    "question_text": "Which chromosomes are considered autosomes in humans?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: X and Y chromosomes",
      "B: All chromosomes involved in sex determination",
      "C: Chromosomes that are not involved in sex determination",
      "D: Only the smaller chromosomes"
    ],
    "correct_answer": "Chromosomes that are not involved in sex determination",
    "explanation": "Autosomes are chromosomes that have the same form in both sexes and are not involved in determining the sex of the individual.",
    "topic": "Autosomes and Sex Chromosomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen093"
  },
  {
    "question_text": "Explain the role of the sperm in determining the sex of a human offspring.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The sperm contributes either an X or a Y chromosome, while the egg always provides an X chromosome; thus, the sperm's chromosome determines whether the offspring will be male or female.",
    "explanation": "Since the egg always carries an X chromosome, the sperm's contribution (X or Y) is the deciding factor in the sex of the child.",
    "topic": "Sex Determination in Humans",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen094"
  },
  {
    "question_text": "Why are the chromosomes not involved in sex determination referred to as autosomes?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "They are called autosomes because they are not involved in determining the sex of an organism and are present in identical number and form in both males and females.",
    "explanation": "Autosomes are the non-sex chromosomes that are similar between sexes and do not participate in the process of sex determination.",
    "topic": "Autosomes and Sex Chromosomes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen095"
  },
  {
    "question_text": "Define 'male heterogamety' as observed in both the XY and XO sex determination systems.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Male heterogamety refers to a system in which males produce two types of gametes differing in their sex chromosome composition (either X and Y in the XY system or with and without the X in the XO system), while females produce only one type of gamete.",
    "explanation": "This definition highlights that males have a varied sex chromosome set in their gametes, which determines the sex of the offspring.",
    "topic": "Male Heterogamety",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen096"
  },
  {
    "question_text": "Describe parthenogenesis in honey bees and its role in sex determination.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Parthenogenesis in honey bees is the process by which an unfertilized egg develops into a male (drone), resulting in a haploid individual, while fertilized eggs develop into diploid females (queens or workers).",
    "explanation": "This process explains how honey bees develop different sexes based on whether the egg is fertilized or not, emphasizing the haplodiploid system.",
    "topic": "Sex Determination in Honey Bee",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen097"
  },
  {
    "question_text": "Compare and contrast the XY and XO sex determination systems.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In the XY system, observed in humans and Drosophila, both sexes have an equal number of chromosomes with females having two X chromosomes and males having one X and one Y chromosome, with the sperm determining the sex. In the XO system, seen in many insects like grasshoppers, all eggs carry an X-chromosome and males produce two types of sperm—one with an X-chromosome and the other without—resulting in females (XX) and males (XO). The primary differences lie in the total chromosome number and the mechanism by which gametes vary.",
    "explanation": "The answer highlights the differences in gamete production and chromosome composition between the two systems, illustrating how each mechanism determines sex uniquely.",
    "topic": "Sex Determination Mechanisms",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen098"
  },
  {
    "question_text": "Discuss the differences in sex determination between mammals and birds.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In mammals, sex determination is achieved through male heterogamety (XY system), where males produce two types of gametes (one carrying X and one carrying Y) while females contribute only an X chromosome. In birds, however, the system is reversed (female heterogamety); females possess two distinct sex chromosomes (Z and W) and produce gametes with either chromosome, whereas males have two identical Z chromosomes. Thus, in mammals, the sperm dictates the sex of the offspring, while in birds, the egg plays that role.",
    "explanation": "This response explains both systems in detail, clarifying how the roles of egg and sperm differ between mammals and birds in sex determination.",
    "topic": "Sex Determination in Mammals and Birds",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen099"
  },
  {
    "question_text": "Analyze the significance of haplodiploidy in honey bees and its effect on colony social structure.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Haplodiploidy in honey bees means that females are diploid (arising from fertilized eggs) and males are haploid (arising from unfertilized eggs via parthenogenesis). This system results in higher genetic relatedness among female siblings, which is thought to promote cooperative behavior and altruism in the colony. Additionally, because males do not have fathers and cannot produce sons, their role in the colony dynamics is distinct, influencing reproductive strategies and social organization.",
    "explanation": "The answer details how the haplodiploid system impacts genetic relatedness and social behavior, underpinning the evolution of complex social structures in honey bee colonies.",
    "topic": "Sex Determination in Honey Bee",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen100"
  },
  {
    "question_text": "True or False: In each human pregnancy, there is a 50% probability of producing a male child and a 50% probability of producing a female child.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Since each sperm has an equal chance of carrying an X or a Y chromosome and the egg always carries an X, there is a 50% chance for either outcome.",
    "topic": "Sex Determination in Humans",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen101"
  },
  {
    "question_text": "True or False: In the XO sex determination system, males possess two X-chromosomes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In the XO system, males have only one X-chromosome, while females have two.",
    "topic": "XO Sex Determination",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen102"
  },
  {
    "question_text": "True or False: Male heterogamety means that males produce gametes with different sex chromosome compositions.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Male heterogamety refers to the production of two distinct types of gametes by males (e.g., one carrying X and the other Y in the XY system, or with/without X in the XO system).",
    "topic": "Male Heterogamety",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen103"
  },
  {
    "question_text": "True or False: In birds, it is the sperm that determines the sex of the offspring.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In birds, females are heterogametic (ZW) and produce gametes that determine the sex, while males produce only one type of gamete (Z), making the egg the determinant of sex.",
    "topic": "Sex Determination in Birds",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen104"
  },
  {
    "question_text": "True or False: Honey bees exhibit haplodiploid sex determination where males are produced through parthenogenesis.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "In honey bees, unfertilized eggs develop into haploid males (drones) via parthenogenesis, while fertilized eggs develop into diploid females.",
    "topic": "Sex Determination in Honey Bee",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen105"
  },
  {
    "question_text": "True or False: Both males and females always have an identical number of autosomes regardless of their sex.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Autosomes are not involved in sex determination and are present in equal numbers in both males and females.",
    "topic": "Autosomes and Sex Chromosomes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen106"
  },
  {
    "question_text": "Calculate the number of chromosomes in a diploid female honey bee if a queen has 32 chromosomes and each gamete carries half that amount.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "32",
    "explanation": "A diploid individual has two sets of chromosomes. Since each gamete carries 16 chromosomes (half of 32), the diploid number in a female is 32.",
    "topic": "Sex Determination in Honey Bee",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "07_section_4_6",
    "question_id": "cbse_xii_lebo1dd_c104_gen107"
  },
  {
    "question_text": "Who conducted hybridisation experiments on pea plants between 1856 and 1863 to understand inheritance?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Gregor Mendel",
      "Charles Darwin",
      "Alfred Wallace",
      "Louis Pasteur"
    ],
    "correct_answer": "Gregor Mendel",
    "explanation": "Gregor Mendel is famous for his pea plant experiments, which led to the formulation of his laws of inheritance.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen001"
  },
  {
    "question_text": "What aspect of Mendel's experimental design allowed him to establish general rules of inheritance?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Random observations",
      "Large sampling size and experiments on successive generations",
      "Immediate conclusions from single generation data",
      "Focus on multiple species simultaneously"
    ],
    "correct_answer": "Large sampling size and experiments on successive generations",
    "explanation": "Mendel's use of a large sample size and confirmation through experiments on successive generations ensured that his findings were statistically credible and generally applicable.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen002"
  },
  {
    "question_text": "In Mendel's experiments, what does a 'true-breeding' line refer to?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Plants with mixed traits",
      "Plants that show variable traits in each generation",
      "Plants that consistently express a stable trait after self-pollination",
      "Plants resulting from cross-species pollination"
    ],
    "correct_answer": "Plants that consistently express a stable trait after self-pollination",
    "explanation": "A true-breeding line is one in which continuous self-pollination has led to a stable expression of traits over several generations.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen003"
  },
  {
    "question_text": "How did Mendel's use of contrasting traits in pea plants contribute to his analysis of inheritance patterns?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "It allowed identification of genetic linkages",
      "It provided clear differences making the tracking of traits easier",
      "It proved genetic mutations were frequent",
      "It complicated his results due to overlapping characteristics"
    ],
    "correct_answer": "It provided clear differences making the tracking of traits easier",
    "explanation": "By studying clear contrasting traits such as tall versus dwarf or yellow versus green, Mendel was able to track and analyze how traits were passed on, leading to his formulation of inheritance laws.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen004"
  },
  {
    "question_text": "Which one of the following is not a contrasting trait studied by Mendel in his pea plant experiments?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Stem height",
      "Seed texture",
      "Flower position",
      "Pod colour"
    ],
    "correct_answer": "Seed texture",
    "explanation": "Mendel studied traits like stem height, flower position, and pod colour, but seed texture was not one of the contrasting traits he focused on in his experiments.",
    "topic": "Principles of Inheritance and Variation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen005"
  },
  {
    "question_text": "What method did Mendel use to establish a true-breeding line in his experiments?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Continuous self-pollination",
    "explanation": "Mendel used continuous self-pollination to ensure that a line consistently expressed the same trait over generations.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen006"
  },
  {
    "question_text": "Explain the significance of using statistically large sample sizes in Mendel's pea plant experiments.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Using large sample sizes increases the credibility of the data and helps establish general rules of inheritance by reducing random error.",
    "explanation": "A larger sample size minimizes the impact of anomalies and strengthens the reliability of the conclusions drawn from the experiment.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen007"
  },
  {
    "question_text": "List two contrasting traits studied by Mendel in pea plants and briefly describe what each trait pair represented.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Examples include tall/dwarf which represents differences in stem height, and yellow/green seeds which represent variations in seed colour.",
    "explanation": "These contrasting traits were chosen because they were distinct and easily observable, which facilitated the tracking of inheritance patterns.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen008"
  },
  {
    "question_text": "Discuss how Mendel's application of mathematical logic and statistical analysis changed the way biological inheritance was studied.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Mendel's integration of mathematical logic and extensive statistical analysis transformed biology by establishing a quantitative approach to track the inheritance of traits, thus providing a systematic framework for genetic research.",
    "explanation": "This integration allowed for reproducible and verifiable experimental results, paving the way for modern genetics.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen009"
  },
  {
    "question_text": "Evaluate the impact of Mendel's findings and experimental design on the development of modern genetics, considering his use of statistical methods and true-breeding lines.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mendel's meticulous planning using true-breeding lines and large sample sizes, combined with his innovative use of statistical methods, laid the foundation for modern genetics. His approach allowed for the prediction of inheritance patterns and influenced subsequent research in genetics, medicine, and agriculture.",
    "explanation": "Mendel's work not only provided the basic laws of inheritance but also demonstrated the importance of statistical analysis in scientific experimentation, thereby revolutionizing the study of biological inheritance.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen010"
  },
  {
    "question_text": "Create a hypothetical experiment using true-breeding pea plant lines to investigate a new trait, such as leaf pattern. Describe your experimental design, including controls, the method of cross-pollination, and the expected outcomes.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "One could select two true-breeding pea lines that differ only in leaf pattern (e.g., spotted vs. plain). After performing controlled cross-pollination, the first generation (F1) would be analyzed for uniformity in leaf pattern. Self-pollinating F1 plants would produce subsequent generations (F2) in which the appearance of both leaf patterns could be assessed. Controls would include pure lines maintained separately. Expected outcomes might show a ratio indicative of dominant and recessive relationships, similar to Mendelian ratios.",
    "explanation": "This experimental design applies Mendel's methods to a new trait, demonstrating how his techniques can be adapted to study varied genetic characteristics.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen011"
  },
  {
    "question_text": "Describe in detail the experimental process that Mendel followed in his pea plant studies and explain why his findings are considered foundational for the field of genetics.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mendel began by selecting pure-breeding pea varieties that differed in one contrasting trait, such as tall vs. dwarf plants. He performed controlled cross-pollinations and observed the traits in the offspring over successive generations. By applying statistical analysis to large sample sizes, he identified consistent patterns of inheritance. This systematic approach laid the groundwork for the laws of segregation and independent assortment, establishing a foundation for the field of genetics.",
    "explanation": "The rigorous design and consistent observation across generations proved that genetic traits are inherited in predictable ways, which revolutionized biological research.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen012"
  },
  {
    "question_text": "Mendel's experiments on pea plants were conducted over the span of several growing seasons, totaling seven years.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Mendel conducted his experiments from 1856 to 1863, which spans seven years.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen013"
  },
  {
    "question_text": "True or False: True-breeding lines in Mendel's experiments were established through continuous self-pollination.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "True-breeding lines are achieved by continuous self-pollination, resulting in stable trait inheritance over generations.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen014"
  },
  {
    "question_text": "True or False: The application of mathematical logic in studying biological inheritance was a novel approach introduced by Mendel.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Before Mendel, biological studies rarely applied mathematical and statistical methods, making his approach innovative.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen015"
  },
  {
    "question_text": "True or False: The large sample size used in Mendel's experiments contributed significantly to the credibility of his conclusions.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "A larger sample size reduces the impact of random errors and strengthens the reliability of experimental findings.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen016"
  },
  {
    "question_text": "True or False: Mendel's method of studying one characteristic at a time in his cross-pollination experiments limits its applicability to only simple traits.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Although Mendel focused on one trait at a time, his methods have been extended and adapted to study more complex traits using additional evidence and techniques.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen017"
  },
  {
    "question_text": "True or False: Mendel's laws of inheritance account for all aspects of genetic inheritance in every organism.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Mendel's laws primarily describe patterns observed in simple traits. They do not account for the complexities of genetic inheritance found in all organisms.",
    "topic": "MENDEL'S LAWS OF INHERITANCE",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "02_section_4_1",
    "question_id": "cbse_xii_lebo1dd_c104_gen018"
  },
  {
    "question_text": "Which symbol in a pedigree analysis represents a female?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Square",
      "Circle",
      "Diamond",
      "Triangle"
    ],
    "correct_answer": "Circle",
    "explanation": "In pedigree analysis, a circle is used to represent a female.",
    "topic": "Pedigree Analysis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen124"
  },
  {
    "question_text": "In pedigree charts, what does a single horizontal line connecting a male and a female indicate?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Sibling relationship",
      "Mating relationship",
      "Parent-child relationship",
      "A consanguineous mating"
    ],
    "correct_answer": "Mating relationship",
    "explanation": "A single horizontal line in pedigree analysis indicates that a male and a female are mating, forming a couple.",
    "topic": "Pedigree Analysis",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen125"
  },
  {
    "question_text": "Which of the following disorders is an X-linked recessive disorder?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cystic fibrosis",
      "Sickle cell anaemia",
      "Phenylketonuria",
      "Colour blindness"
    ],
    "correct_answer": "Colour blindness",
    "explanation": "Colour blindness is due to mutations in genes on the X chromosome, making it an X-linked recessive disorder.",
    "topic": "Mendelian Disorders",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen126"
  },
  {
    "question_text": "In a pedigree, if affected individuals have unaffected parents and the trait appears in alternating generations, which pattern of inheritance is most likely?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Autosomal dominant",
      "Autosomal recessive",
      "X-linked dominant",
      "Mitochondrial inheritance"
    ],
    "correct_answer": "Autosomal recessive",
    "explanation": "An autosomal recessive trait often appears when unaffected parents have affected offspring and the trait can skip generations.",
    "topic": "Pedigree Analysis / Mendelian Disorders",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen127"
  },
  {
    "question_text": "Down's syndrome is caused by which chromosomal abnormality?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Monosomy 21",
      "Trisomy 21",
      "Polyploidy",
      "Chromosomal translocation"
    ],
    "correct_answer": "Trisomy 21",
    "explanation": "Down's syndrome results from an extra copy of chromosome 21, known as trisomy 21.",
    "topic": "Chromosomal Disorders",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen128"
  },
  {
    "question_text": "Explain what pedigree analysis is and how it is used in studying human genetics.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Pedigree analysis is the study of the inheritance patterns of traits within families over several generations. It helps in tracing the transmission of genetic disorders, abnormalities, or specific traits by using standard symbols to represent family members.",
    "explanation": "This answer explains that pedigree analysis involves mapping traits or genetic disorders through family trees, making it a vital tool in human genetics.",
    "topic": "Pedigree Analysis",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen129"
  },
  {
    "question_text": "Define mutation and discuss its significance in the context of genetic disorders.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A mutation is a change or alteration in the genetic material, which can result in changes in the gene sequence. These changes (if they occur in crucial regions or affect gene function) can lead to genetic disorders by altering the way proteins are produced or function.",
    "explanation": "This answer highlights the concept of mutation as a change in DNA which may lead to disorders if the mutation adversely affects gene function.",
    "topic": "Genetic Mutations / Mendelian Disorders",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen130"
  },
  {
    "question_text": "What distinguishes Mendelian disorders from chromosomal disorders?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mendelian disorders are caused by single gene mutations inherited according to Mendel's laws, whereas chromosomal disorders are due to abnormalities in the number or structure of entire chromosomes, such as deletions, duplications, or extra chromosomes.",
    "explanation": "The answer emphasizes that Mendelian disorders involve single genes, while chromosomal disorders concern the entire chromosome alterations.",
    "topic": "Mendelian Disorders vs Chromosomal Disorders",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen131"
  },
  {
    "question_text": "Describe the inheritance pattern of haemophilia.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Haemophilia is inherited in an X-linked recessive manner. Carrier females can pass the defective gene to their children, and since males have only one X chromosome, they are more likely to express the disorder.",
    "explanation": "This answer notes that haemophilia is X-linked recessive, explaining why males are usually affected while females are typically carriers.",
    "topic": "Mendelian Disorders",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen132"
  },
  {
    "question_text": "Discuss the principles of pedigree analysis and its application in understanding genetic disorders. In your answer, include specific examples of Mendelian disorders that can be traced using pedigree charts.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Pedigree analysis involves tracking the inheritance of traits across generations by using a standardized chart that marks affected and unaffected individuals. This method allows geneticists to determine patterns of inheritance, such as autosomal dominant, autosomal recessive, or X-linked traits. For example, diseases like haemophilia and colour blindness, which are X-linked recessive, can be traced through family history to identify carriers and affected individuals. Similarly, autosomal recessive disorders like sickle-cell anaemia and phenylketonuria show specific patterns in pedigrees where the trait may skip generations.",
    "explanation": "This answer provides a comprehensive overview of pedigree analysis, its applications, and examples of how specific Mendelian disorders are identified through analyzing the family tree.",
    "topic": "Pedigree Analysis / Mendelian Disorders",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen133"
  },
  {
    "question_text": "Compare and contrast the molecular basis of sickle-cell anaemia with thalassemia, and explain how each affects haemoglobin structure or synthesis.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Sickle-cell anaemia is caused by a specific point mutation in the beta globin gene, where glutamic acid is replaced by valine at the sixth position, leading to the production of abnormal hemoglobin (HbS) that polymerizes under low oxygen conditions. Thalassemia, on the other hand, is due to mutations or deletions that affect the production of one or more globin chains (α or β), leading to reduced synthesis of hemoglobin. Whereas sickle-cell anaemia is a qualitative defect (abnormal structure), thalassemia is a quantitative defect (reduced production).",
    "explanation": "The answer highlights the differences: sickle-cell anaemia involves a single amino acid substitution resulting in a structural defect, and thalassemia results from mutations that reduce the quantity of hemoglobin produced.",
    "topic": "Mendelian Disorders",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen134"
  },
  {
    "question_text": "A diamond symbol in a pedigree chart represents a female.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "A diamond is used to represent an individual whose sex is unspecified, not specifically a female.",
    "topic": "Pedigree Analysis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen135"
  },
  {
    "question_text": "In pedigree analysis, a double horizontal line indicates consanguineous mating.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "A double horizontal line between a male and a female in a pedigree chart represents consanguineous mating.",
    "topic": "Pedigree Analysis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen136"
  },
  {
    "question_text": "Down's syndrome is due to a deletion of chromosome 21.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Down's syndrome is caused by trisomy 21 (an extra copy of chromosome 21), not by a deletion.",
    "topic": "Chromosomal Disorders",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen137"
  },
  {
    "question_text": "Haemophilia predominantly affects males because the defective gene is located on the X chromosome and males have only one X chromosome.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Since males possess a single X chromosome, the presence of a mutated gene on it leads to the manifestation of haemophilia, while in females the normal allele on the second X can mask the defect.",
    "topic": "Mendelian Disorders",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen138"
  },
  {
    "question_text": "Sickle-cell anaemia results from a qualitative defect in the hemoglobin molecule, whereas thalassemia results from a quantitative defect in hemoglobin synthesis.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Sickle-cell anaemia is due to an abnormal hemoglobin structure caused by a point mutation, while thalassemia involves reduced production of one of the globin chains, constituting a quantitative defect.",
    "topic": "Mendelian Disorders",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen139"
  },
  {
    "question_text": "Turner's syndrome is characterized by the presence of only one X chromosome in females.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Turner's syndrome occurs when there is a missing X chromosome in females, resulting in a 45, X0 karyotype.",
    "topic": "Chromosomal Disorders",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen140"
  },
  {
    "question_text": "If two carriers of the sickle-cell trait (HbA/HbS) have a child, what is the probability (in percent) that the child will have sickle-cell anaemia (HbS/HbS), assuming complete penetrance?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "25%",
    "explanation": "When both parents are heterozygous for the sickle-cell trait, a Punnett square shows a 1 in 4 chance, or 25%, that the child will be homozygous for the mutation (HbS/HbS) and thus exhibit the disease.",
    "topic": "Mendelian Disorders",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "09_section_4_8",
    "question_id": "cbse_xii_lebo1dd_c104_gen141"
  },
  {
    "question_text": "In the cross between a pea plant with yellow seeds and one with green seeds, which trait is dominant?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Yellow is dominant over green",
      "Green is dominant over yellow",
      "Both are co-dominant",
      "Neither is dominant"
    ],
    "correct_answer": "Yellow is dominant over green",
    "explanation": "Mendel's experiments demonstrated that yellow seed color is dominant over green seed color in pea plants.",
    "topic": "Inheritance of two genes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen037"
  },
  {
    "question_text": "Which of the following lists correctly represents the gametes produced by an F1 plant with genotype RrYy?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "RY, rY, Ry, ry",
      "RR, YY, rr, yy",
      "RY, RY, ry, ry",
      "Rr, Yy, RR, yy"
    ],
    "correct_answer": "RY, rY, Ry, ry",
    "explanation": "An F1 plant with genotype RrYy produces four types of gametes, each with a frequency of one quarter: RY, rY, Ry, and ry, due to independent assortment.",
    "topic": "Inheritance of two genes",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen038"
  },
  {
    "question_text": "What is the expected phenotypic ratio when a dihybrid cross (RrYy self-fertilized) is performed?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "9:3:3:1",
      "3:1",
      "1:2:1",
      "1:1:1:1"
    ],
    "correct_answer": "9:3:3:1",
    "explanation": "The F2 generation from a dihybrid cross typically shows a phenotypic ratio of 9 round yellow : 3 round green : 3 wrinkled yellow : 1 wrinkled green.",
    "topic": "Inheritance of two genes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen039"
  },
  {
    "question_text": "Which statement best explains the Law of Independent Assortment?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Alleles for different traits segregate independently of one another during gamete formation",
      "Only one allele from each gene pair is present in the gamete",
      "Genes located on the same chromosome are always inherited together",
      "Traits blend together in the offspring"
    ],
    "correct_answer": "Alleles for different traits segregate independently of one another during gamete formation",
    "explanation": "Mendel's Law of Independent Assortment states that the segregation of alleles for one trait is independent of the segregation of alleles for another trait, as observed in dihybrid crosses.",
    "topic": "Law of Independent Assortment",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen040"
  },
  {
    "question_text": "In Morgan's experiments with Drosophila, which pair of genes showed very low recombination?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "White and yellow",
      "White and miniature wing",
      "Brown and red",
      "Round and green"
    ],
    "correct_answer": "White and yellow",
    "explanation": "Morgan's studies revealed that the genes for white eyes and yellow body in Drosophila were very tightly linked, showing only about 1.3% recombination.",
    "topic": "Linkage and Recombination",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen041"
  },
  {
    "question_text": "Define Mendel's Law of Independent Assortment in your own words.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Alleles of different genes segregate independently during the formation of gametes.",
    "explanation": "The answer should note that during gamete formation, the alleles for one trait segregate independently of the alleles for another trait, allowing for genetic variation.",
    "topic": "Law of Independent Assortment",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen042"
  },
  {
    "question_text": "Write the genotypes of the parental generation in the dihybrid cross described in the text.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "RRYY (round yellow) and rryy (wrinkled green)",
    "explanation": "The parental genotypes are clearly stated in the text as RRYY for the round, yellow pea plant and rryy for the wrinkled, green pea plant.",
    "topic": "Inheritance of two genes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen043"
  },
  {
    "question_text": "Explain in one sentence the significance of chromosome behavior during meiosis in relation to the segregation of genes.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Chromosome behavior during meiosis ensures that genes, which are located on homologous chromosomes, segregate into gametes in an orderly and independent manner.",
    "explanation": "This emphasizes the connection between the physical separation of chromosomes and Mendel's observed patterns of gene segregation.",
    "topic": "Chromosomal Theory of Inheritance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen044"
  },
  {
    "question_text": "Discuss how a Punnett square is used to derive the 9:3:3:1 phenotypic ratio in a dihybrid cross. Include in your answer an explanation of independent assortment.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A Punnett square for a dihybrid cross of RrYy individuals shows all 16 possible allele combinations. Independent assortment allows each gene's alleles to segregate separately, resulting in four gamete types (RY, Ry, rY, ry) each occurring with equal frequency. When these gametes combine, the resulting offspring exhibit a phenotypic ratio of 9 round yellow : 3 round green : 3 wrinkled yellow : 1 wrinkled green.",
    "explanation": "Your answer should describe how the four types of gametes produced by an F1 plant combine in the Punnett square. The independent segregation of alleles leads to combinations that, when categorized by phenotype, yield the well-known 9:3:3:1 ratio.",
    "topic": "Inheritance of two genes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen045"
  },
  {
    "question_text": "Evaluate how Morgan's experiments with Drosophila contributed to the development of the chromosomal theory of inheritance. In your answer, compare his findings with Mendel's earlier work.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Morgan's experiments with Drosophila provided physical evidence linking specific genes to chromosomes by demonstrating that genes could be mapped on chromosomes based on recombination frequencies. Unlike Mendel's work, which was purely based on phenotypic ratios from controlled crosses, Morgan's findings showed that genes located on the same chromosome were linked and did not assort independently. This realignment of genetic observations with the behavior of chromosomes during meiosis validated and extended Mendel's principles, leading to the chromosomal theory of inheritance.",
    "explanation": "An effective answer will compare Mendel's abstract factors with Morgan's empirical mapping of genes on chromosomes, highlighting how the observation of recombination and linkage in Drosophila confirmed that genes are physically located on chromosomes.",
    "topic": "Chromosomal Theory of Inheritance",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen046"
  },
  {
    "question_text": "True or False: In a dihybrid cross, the segregation of alleles for one gene affects the segregation of alleles for a second gene.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "According to Mendel's Law of Independent Assortment, the segregation of alleles for one gene is independent of the segregation of alleles for a different gene.",
    "topic": "Law of Independent Assortment",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen047"
  },
  {
    "question_text": "True or False: The genotype RrYy represents the F1 generation resulting from a cross between a plant with genotype RRYY and a plant with genotype rryy.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Crossing RRYY with rryy results in F1 hybrids that are heterozygous for both traits, with genotype RrYy.",
    "topic": "Inheritance of two genes",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen048"
  },
  {
    "question_text": "True or False: Both chromosomes and genes occur in pairs, reflecting the way genetic information is organized in the cell.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Both chromosomes and genes exist in pairs, which is fundamental to the processes of meiosis and genetic inheritance.",
    "topic": "Chromosomal Theory of Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen049"
  },
  {
    "question_text": "True or False: The 9:3:3:1 ratio applies to both the genotypic and phenotypic ratios in an F2 generation of a dihybrid cross.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While the 9:3:3:1 ratio accurately describes the phenotypic distribution, there are actually 16 possible genotype combinations in the F2 generation from a dihybrid cross.",
    "topic": "Inheritance of two genes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen050"
  },
  {
    "question_text": "True or False: Gene linkage means that genes on the same chromosome will always be inherited together with no chance for recombination.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While linkage refers to genes being located on the same chromosome, recombination through crossing over can result in non-parental gene combinations, meaning they are not always inherited together.",
    "topic": "Linkage and Recombination",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen051"
  },
  {
    "question_text": "Calculate the probability that an F2 plant, produced by self-fertilization of an F1 RrYy plant, will have the genotype RrYy.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "25%",
    "explanation": "In a dihybrid cross, the probability of obtaining a heterozygote (Rr) for one trait is 1/2 and similarly 1/2 for the other trait. Multiplying these probabilities gives (1/2) x (1/2) = 1/4 or 25%.",
    "topic": "Inheritance of two genes",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen052"
  },
  {
    "question_text": "If two linked genes exhibit a recombination frequency of 1.3%, how many recombinant offspring would you expect out of 1000 total offspring?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 13 offspring",
    "explanation": "A recombination frequency of 1.3% means that 1.3 out of every 100 gametes are recombinant. Out of 1000 offspring, about 1.3% (which is approximately 13) would be expected to show recombinant phenotypes.",
    "topic": "Linkage and Recombination",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "04_section_4_3",
    "question_id": "cbse_xii_lebo1dd_c104_gen053"
  },
  {
    "question_text": "Mendel referred to the units that are passed unchanged from parent to offspring as what?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Factors",
      "B) Alleles",
      "C) Chromosomes",
      "D) Proteins"
    ],
    "correct_answer": "A) Factors",
    "explanation": "Mendel called these units 'factors', which we now refer to as genes.",
    "topic": "Inheritance of one gene - Basic Concepts",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen019"
  },
  {
    "question_text": "A monohybrid cross in pea plants is usually performed between which types of organisms?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Heterozygous tall (Tt) x Heterozygous tall (Tt)",
      "B) True-breeding tall (TT) x True-breeding dwarf (tt)",
      "C) True-breeding tall (TT) x Heterozygous tall (Tt)",
      "D) True-breeding dwarf (tt) x Heterozygous tall (Tt)"
    ],
    "correct_answer": "B) True-breeding tall (TT) x True-breeding dwarf (tt)",
    "explanation": "Mendel’s monohybrid experiment involved crossing true-breeding tall and dwarf plants (TT x tt).",
    "topic": "Monohybrid Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen020"
  },
  {
    "question_text": "What is the expected genotypic ratio in the F2 generation of a monohybrid cross?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) 1:1:1:1",
      "B) 3:1",
      "C) 1:2:1",
      "D) 9:3:3:1"
    ],
    "correct_answer": "C) 1:2:1",
    "explanation": "In a monohybrid self-cross of a heterozygote (Tt), the genotypic ratio is 1 TT : 2 Tt : 1 tt or 1:2:1.",
    "topic": "Punnett Square Analysis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen021"
  },
  {
    "question_text": "In a test cross between a tall pea plant with genotype Tt and a dwarf plant (tt), what is the expected phenotypic ratio among the offspring?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) 3:1",
      "B) 1:1",
      "C) 1:2",
      "D) 2:1"
    ],
    "correct_answer": "B) 1:1",
    "explanation": "A test cross between Tt and tt results in 50% tall (Tt) and 50% dwarf (tt) offspring, producing a 1:1 ratio.",
    "topic": "Test Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen022"
  },
  {
    "question_text": "Which of the following best describes co-dominance?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) The heterozygote shows a phenotype intermediate between the two homozygotes",
      "B) The dominant allele completely masks the recessive allele",
      "C) Both alleles in the heterozygote are fully expressed simultaneously",
      "D) One allele is only partially expressed in the heterozygote"
    ],
    "correct_answer": "C) Both alleles in the heterozygote are fully expressed simultaneously",
    "explanation": "In co-dominance, both alleles contribute to the phenotype; an example is the AB blood group where both A and B antigens are expressed.",
    "topic": "Co-dominance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen023"
  },
  {
    "question_text": "Define a monohybrid cross and provide an example using pea plants.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A monohybrid cross is the mating between two organisms that differ in one specific trait. For example, crossing a true-breeding tall pea plant (TT) with a true-breeding dwarf pea plant (tt) produces an F1 generation all having the heterozygous genotype (Tt).",
    "explanation": "This definition highlights the focus on one trait and uses pea plants as an illustrative example representing the concept of dominant and recessive alleles.",
    "topic": "Monohybrid Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen024"
  },
  {
    "question_text": "What is a test cross and why is it performed?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A test cross involves crossing an individual showing the dominant phenotype with a homozygous recessive individual. It is performed to determine whether the dominant phenotype individual is homozygous or heterozygous.",
    "explanation": "The test cross is a diagnostic method in genetics to reveal the unknown genotype of an organism displaying the dominant trait.",
    "topic": "Test Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen025"
  },
  {
    "question_text": "Briefly explain the principle of segregation as proposed by Mendel.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The principle of segregation states that during the formation of gametes, the two alleles of a gene separate so that each gamete receives only one allele. This random separation ensures that offspring have a 50% chance of inheriting either allele.",
    "explanation": "This explanation emphasizes the mechanism by which alleles segregate during gamete formation, ensuring genetic diversity.",
    "topic": "Law of Segregation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen026"
  },
  {
    "question_text": "Discuss Mendel's experiments with pea plants that led to the formulation of the laws of dominance and segregation. Include details of his observations in the F1 and F2 generations.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mendel's experiments involved crossing true-breeding tall (TT) and dwarf (tt) pea plants. In the F1 generation, all offspring exhibited the tall phenotype, suggesting that the tall allele was dominant over the dwarf allele. Upon self-pollinating the F1 hybrids (Tt), the F2 generation yielded both tall and dwarf plants in a 3:1 phenotypic ratio. This led him to propose that alleles segregate during gamete formation, and that one allele can mask the presence of the other, thereby formulating the laws of dominance and segregation.",
    "explanation": "This answer details the experimental design, observations, and interpretations that led Mendel to establish his fundamental genetic laws.",
    "topic": "Laws of Inheritance",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen027"
  },
  {
    "question_text": "Compare and contrast incomplete dominance and co-dominance with examples provided in the text.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Incomplete dominance is a genetic phenomenon where the heterozygote exhibits a phenotype that is an intermediate blend of both homozygous forms, as seen in the snapdragon flower color where red (RR) and white (rr) produce pink (Rr) flowers. In contrast, co-dominance occurs when both alleles in the heterozygote are fully expressed, as in the human ABO blood grouping system where alleles IA and IB both express in individuals with the AB blood type. These differences highlight that in incomplete dominance the phenotype is a mix, while in co-dominance both traits appear distinctly.",
    "explanation": "This answer clearly differentiates between the two phenomena by describing the phenotype outcomes and providing specific examples from snapdragons and human blood groups.",
    "topic": "Dominance Variations",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen028"
  },
  {
    "question_text": "True or False: In the F1 generation of a cross between true-breeding tall and dwarf pea plants, all offspring display the tall phenotype.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "All the F1 offspring exhibit the tall trait since the tall allele is dominant over the dwarf allele.",
    "topic": "Mendelian Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen029"
  },
  {
    "question_text": "True or False: During gamete formation, alleles segregate in a 1:1 ratio, ensuring that each gamete receives one allele from a gene pair.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Mendel's law of segregation indicates that each gamete receives one allele from a gene pair, with a 50% chance for either allele.",
    "topic": "Law of Segregation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen030"
  },
  {
    "question_text": "True or False: A test cross involves breeding an organism with unknown genotype with a homozygous dominant individual.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "A test cross is performed by crossing the organism with a homozygous recessive individual, not a homozygous dominant one, to reveal the unknown genotype.",
    "topic": "Test Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen031"
  },
  {
    "question_text": "True or False: In incomplete dominance, the heterozygote's phenotype is identical to that of one of the homozygotes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In incomplete dominance, the heterozygote exhibits an intermediate phenotype, not one identical to either homozygote.",
    "topic": "Incomplete Dominance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen032"
  },
  {
    "question_text": "True or False: Co-dominance is illustrated by the human ABO blood group system, where both A and B antigens are expressed in individuals with the AB blood type.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "In co-dominance, both alleles are fully expressed, as seen in the AB blood group where both A and B antigens are present.",
    "topic": "Co-dominance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen033"
  },
  {
    "question_text": "Using a Punnett square, calculate the probability of obtaining a heterozygous tall (Tt) plant from a self-fertilized heterozygous tall (Tt) plant.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "50%",
    "explanation": "A self-cross of Tt results in a genotypic ratio of 1 TT : 2 Tt : 1 tt. Therefore, the probability of a heterozygous tall (Tt) plant is 2 out of 4 or 50%.",
    "topic": "Punnett Square Analysis",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen034"
  },
  {
    "question_text": "Express the binomial expansion of (½T + ½t)² and state the percentage distribution of each genotype.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1/4 TT, 1/2 Tt, and 1/4 tt (25% TT, 50% Tt, 25% tt)",
    "explanation": "Expanding (½T + ½t)² gives: (½T + ½t) x (½T + ½t) = 1/4 TT + 1/2 Tt + 1/4 tt. This means there is a 25% chance for TT, 50% chance for Tt, and 25% chance for tt.",
    "topic": "Mathematical Analysis in Genetics",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen035"
  },
  {
    "question_text": "How does a test cross help differentiate between homozygous dominant and heterozygous individuals? Illustrate your answer with an example from pea plants.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A test cross is used to determine the genotype of an organism with a dominant phenotype by crossing it with a homozygous recessive individual. For example, if a tall pea plant (displaying the dominant trait) is crossed with a dwarf plant (tt), the resulting offspring will reveal the unknown genotype. If all offspring are tall, the tested plant is likely homozygous dominant (TT); if about half are tall and half dwarf, the plant is heterozygous (Tt).",
    "explanation": "By observing the phenotypes of the progeny, a test cross can reveal whether the dominant individual carries a hidden recessive allele or not.",
    "topic": "Test Cross",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen036"
  },
  {
    "question_text": "Which statement best defines polygenic inheritance?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "It involves a single gene with two alleles.",
      "It requires one or more genes with a dominant-recessive relationship.",
      "It involves three or more genes and environmental influences with additive effects.",
      "It is solely determined by environmental factors."
    ],
    "correct_answer": "It involves three or more genes and environmental influences with additive effects.",
    "explanation": "Polygenic inheritance involves multiple genes (typically three or more) and environmental influences. The phenotype reflects the additive contribution of each allele.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen054"
  },
  {
    "question_text": "In polygenic inheritance, what does it mean that the allele effects are 'additive'?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Each allele cancels out the effect of another allele.",
      "The effect of one allele is independent of other alleles.",
      "The phenotype is determined by the sum of the effects of individual alleles.",
      "Dominant alleles override all recessive alleles."
    ],
    "correct_answer": "The phenotype is determined by the sum of the effects of individual alleles.",
    "explanation": "Additive effects mean that the phenotype is a cumulative result of all contributing alleles.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen055"
  },
  {
    "question_text": "Which genotype would likely result in the darkest skin colour according to the presented example?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "AABBCC",
      "AABbCc",
      "AaBbCc",
      "aabbcc"
    ],
    "correct_answer": "AABBCC",
    "explanation": "AABBCC consists entirely of dominant alleles (A, B, and C), which are responsible for darker skin colour in the given example.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen056"
  },
  {
    "question_text": "Which of the following human traits is most likely controlled by polygenic inheritance?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Blood type",
      "Pea flower colour",
      "Human height",
      "Ear lobe attachment"
    ],
    "correct_answer": "Human height",
    "explanation": "Human height is a trait that exhibits a range of variation and is controlled by multiple genes, making it an example of polygenic inheritance.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen057"
  },
  {
    "question_text": "In the provided example of human skin colour, what role does the environment play in polygenic inheritance?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "It has no role as genotype solely determines the phenotype.",
      "It may modify or influence the expression of the additive genetic effects.",
      "It determines the genotype completely.",
      "It reverses the effects of recessive alleles."
    ],
    "correct_answer": "It may modify or influence the expression of the additive genetic effects.",
    "explanation": "Even though multiple genes contribute to the trait, environmental factors can also affect the final phenotype, e.g., by influencing melanin production in the skin.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen058"
  },
  {
    "question_text": "Explain the concept of polygenic inheritance in your own words.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Polygenic inheritance is the genetic phenomenon where multiple genes contribute to a single trait, and the overall phenotype is determined by the additive effects of these genes as well as environmental influences.",
    "explanation": "This answer captures the idea that more than one gene is involved in forming the phenotype, with each gene adding a small effect, and environmental factors may also shape the outcome.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen059"
  },
  {
    "question_text": "Describe how multiple genes can affect a trait such as human skin colour using the example provided in the text.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "In the example, three genes (A, B, and C) control human skin colour. Each gene has a dominant allele that produces darker skin and a recessive allele that produces lighter skin. The overall skin colour of an individual depends on the number of dominant alleles present, with more dominant alleles resulting in darker skin and a mix leading to intermediate shades.",
    "explanation": "This response explains how each gene contributes to the final phenotype and how the combination of these genetic effects, along with the potential role of environmental factors, leads to a range of skin colours.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen060"
  },
  {
    "question_text": "What is the significance of environmental influence in the context of polygenic inheritance?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Environmental factors can modify the expression of genes that control a polygenic trait, which means that even with the same genotype, the phenotype can vary due to external conditions.",
    "explanation": "This answer highlights that while the genotype establishes a framework for a trait, environmental factors are significant in determining the final phenotype in polygenic traits.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen061"
  },
  {
    "question_text": "Discuss the differences between Mendelian inheritance and polygenic inheritance, providing examples mentioned in the section.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mendelian inheritance involves traits that are controlled by single genes with distinct dominant and recessive alleles, such as flower colour in pea plants. In contrast, polygenic inheritance involves multiple genes contributing in an additive manner, which results in a continuous range of phenotypes. Examples include human height and skin colour, where the genotype is a combination of alleles from several genes, and environmental influences may also affect the outcome.",
    "explanation": "This answer elaborates on the key differences between the two modes of inheritance, pointing out that Mendelian traits are discrete while polygenic traits are continuous and affected by multiple factors.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen062"
  },
  {
    "question_text": "Evaluate the importance of studying polygenic inheritance in understanding human traits such as skin colour and height.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Studying polygenic inheritance is crucial for understanding the complex interplay between multiple genes and environmental factors in determining human traits. This knowledge helps in comprehending how small variations in many genes can lead to a wide range of phenotypes. For example, human skin colour and height are influenced by the additive effects of several genes, which explains the diversity seen in populations. Such insights are essential for advancements in genetic counseling, personalized medicine, and understanding evolutionary biology.",
    "explanation": "This response evaluates the broader significance of polygenic inheritance, discussing its implications for human variability and its practical applications in medicine and research.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen063"
  },
  {
    "question_text": "If a trait is controlled by three unlinked genes, each with two alleles, calculate the total number of possible genotype combinations for this polygenic trait.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "27",
    "explanation": "Each gene has three possible genotypes (homozygous dominant, heterozygous, homozygous recessive), so for three genes the total number of genotype combinations is 3 x 3 x 3 = 27.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen064"
  },
  {
    "question_text": "True or False: Polygenic inheritance involves only one gene influencing a trait.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Polygenic inheritance involves the contribution of multiple genes, not just one, which is why traits show a range of phenotypes.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen065"
  },
  {
    "question_text": "True or False: In polygenic traits, the phenotype is a result of the additive effects of each allele.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The phenotype in polygenic inheritance reflects the cumulative, additive effect of multiple alleles.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen066"
  },
  {
    "question_text": "True or False: Environmental factors have no influence on traits controlled by polygenic inheritance.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Environmental factors can modify the expression of polygenic traits, contributing to the variation seen in phenotypes.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen067"
  },
  {
    "question_text": "True or False: Human height and skin colour are examples of traits that exhibit a continuous range due to polygenic inheritance.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Human height and skin colour display a continuous range of phenotypes, which is a hallmark of polygenic inheritance.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen068"
  },
  {
    "question_text": "True or False: A genotype with all recessive alleles (aabbcc) will have the lightest skin colour based on the discussed example.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "According to the example provided, the genotype with all recessive alleles would result in the lightest skin colour.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen069"
  },
  {
    "question_text": "True or False: The presence of a heterozygous combination in one gene will not affect the intermediate phenotype in a polygenic trait.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "A heterozygous combination contributes an intermediate effect to the phenotype; thus, even a single gene being heterozygous can influence the overall trait.",
    "topic": "Polygenic Inheritance",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "05_section_4_4",
    "question_id": "cbse_xii_lebo1dd_c104_gen070"
  },
  {
    "question_text": "What is mutation as defined in the text?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. A process that solely repairs DNA sequences",
      "B. An alteration of DNA sequences resulting in changes in genotype and phenotype",
      "C. A mechanism that removes defective genes",
      "D. A recombination process between chromatids"
    ],
    "correct_answer": "B. An alteration of DNA sequences resulting in changes in genotype and phenotype",
    "explanation": "The text defines mutation as an alteration of DNA sequences, which leads to changes in both genotype and phenotype.",
    "topic": "Mutation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen108"
  },
  {
    "question_text": "Which of the following is a classical example of a point mutation mentioned in the section?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. Deletion of a large DNA segment",
      "B. Chromosomal duplication",
      "C. Sickle cell anemia",
      "D. Frame-shift mutation"
    ],
    "correct_answer": "C. Sickle cell anemia",
    "explanation": "The section cites sickle cell anemia as a classical example of a point mutation, which is a change in a single base pair of DNA.",
    "topic": "Mutation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen109"
  },
  {
    "question_text": "Which mutagen is specifically mentioned in the text as capable of causing mutations in organisms?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "A. X-rays",
      "B. UV radiations",
      "C. Chemical agents",
      "D. Heat"
    ],
    "correct_answer": "B. UV radiations",
    "explanation": "The text states that UV radiations are mutagens that can cause mutations in organisms.",
    "topic": "Mutation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen110"
  },
  {
    "question_text": "How do deletions or insertions of DNA segments affect chromosomes as discussed in the text?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A. They have no effect on chromosomes",
      "B. They lead to alteration in chromosomes",
      "C. They only affect non-coding regions",
      "D. They always improve gene function"
    ],
    "correct_answer": "B. They lead to alteration in chromosomes",
    "explanation": "The section explains that loss or gain of a segment of DNA (deletions or insertions/duplications) results in alterations in chromosomes.",
    "topic": "Mutation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen111"
  },
  {
    "question_text": "A point mutation involves:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A. Insertion of a base pair",
      "B. Deletion of a large segment",
      "C. Change in a single base pair of DNA",
      "D. Duplication of an entire chromosome"
    ],
    "correct_answer": "C. Change in a single base pair of DNA",
    "explanation": "A point mutation is defined as a change in a single base pair of DNA as described in the text.",
    "topic": "Mutation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen112"
  },
  {
    "question_text": "Define mutation and explain its effect on the genotype and phenotype.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Mutation is an alteration in the DNA sequence that leads to changes in an organism's genotype and, consequently, its phenotype.",
    "explanation": "This answer reflects the textbook definition provided, emphasizing that changes in the DNA sequence alter genetic makeup and observable traits.",
    "topic": "Mutation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen113"
  },
  {
    "question_text": "Explain how the insertion or deletion of a segment of DNA can lead to chromosomal aberrations.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Insertion or deletion of DNA segments can alter the structure of the DNA helix that runs continuously in each chromatid. Since genes are located on chromosomes, any alteration in the chromosome structure leads to chromosomal aberrations.",
    "explanation": "The answer highlights that any gain or loss of DNA segments affects the highly supercoiled DNA helix structure, causing structural chromosome changes that can result in abnormalities.",
    "topic": "Mutation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen114"
  },
  {
    "question_text": "What is a frame-shift mutation and how does it occur according to the text?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A frame-shift mutation is caused by the deletion or insertion of base pairs of DNA. This type of mutation alters the reading frame of the gene, leading to misinterpretation or malfunctioning of the gene product.",
    "explanation": "The text states that deletions and insertions of base pairs cause frame-shift mutations, which disrupt the normal reading frame of a gene.",
    "topic": "Mutation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen115"
  },
  {
    "question_text": "Describe the relationship between chromosomes and the manifestation of genetic abnormalities as discussed in the section.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Chromosomes carry genes, and any alteration in their structure, such as those caused by deletions, insertions, or other mutations, can lead to genetic abnormalities. This is particularly evident in cancer cells where chromosomal aberrations are commonly observed.",
    "explanation": "This answer connects the concept that genes reside on chromosomes and alterations in chromosome structure directly result in abnormalities, as highlighted in the text.",
    "topic": "Mutation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen116"
  },
  {
    "question_text": "Discuss the role of mutation in genetic variation and compare it with recombination.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mutation introduces new variations in the DNA sequence, leading to changes in both genotype and phenotype. Unlike recombination, which shuffles existing genetic material to create diversity, mutation creates entirely new genetic changes. Both processes contribute to genetic variation, but mutation can introduce novel changes that may have profound effects on an organism’s characteristics.",
    "explanation": "The answer should elaborate on how mutation is a source of new genetic variants, comparing it to recombination, which rearranges existing DNA without necessarily introducing new mutations.",
    "topic": "Mutation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen117"
  },
  {
    "question_text": "Critically evaluate the impact of different types of mutations on genetic diseases and discuss their potential role in cancer development.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Different types of mutations, including point mutations and frame-shift mutations, can have varied impacts on gene function. For example, point mutations, which involve a single base pair change, can lead to diseases such as sickle cell anemia, while frame-shift mutations often result in more severe protein malfunctions. Furthermore, chromosomal aberrations caused by deletions or insertions can lead to significant genetic abnormalities and are commonly observed in cancer cells. Evaluating these mutation types provides insights into how seemingly small changes at the molecular level can drive disease pathology and cancer progression.",
    "explanation": "The answer discusses the severity of different mutation types and their direct link to genetic disorders and cancer, emphasizing that changes in the genome can have widespread effects on cellular function and health.",
    "topic": "Mutation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen118"
  },
  {
    "question_text": "Mutation leads to changes only in the genotype of an organism.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text indicates that mutations result in changes in both the genotype and the phenotype, not just the genotype.",
    "topic": "Mutation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen119"
  },
  {
    "question_text": "Point mutation refers to a change in a single base pair of DNA.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section clearly defines point mutation as a change in a single base pair of DNA.",
    "topic": "Mutation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen120"
  },
  {
    "question_text": "Deletions and insertions of base pairs of DNA cause frame-shift mutations.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The text states that deletions and insertions of base pairs lead to frame-shift mutations, affecting the reading frame of the gene.",
    "topic": "Mutation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen121"
  },
  {
    "question_text": "Chromosomal aberrations are exclusively observed in cancer cells.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "While chromosomal aberrations are commonly observed in cancer cells, the text does not state that they occur exclusively in cancer cells.",
    "topic": "Mutation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen122"
  },
  {
    "question_text": "UV radiation is a physical factor that can induce mutations in organisms.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "The section identifies UV radiations as mutagens, which are physical factors capable of inducing mutations in organisms.",
    "topic": "Mutation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "08_section_4_7",
    "question_id": "cbse_xii_lebo1dd_c104_gen123"
  }
]