[
  {
    "question_text": "Mendel referred to the units that are passed unchanged from parent to offspring as what?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Factors",
      "B) Alleles",
      "C) Chromosomes",
      "D) Proteins"
    ],
    "correct_answer": "A) Factors",
    "explanation": "Mendel called these units 'factors', which we now refer to as genes.",
    "topic": "Inheritance of one gene - Basic Concepts",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen019"
  },
  {
    "question_text": "A monohybrid cross in pea plants is usually performed between which types of organisms?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) Heterozygous tall (Tt) x Heterozygous tall (Tt)",
      "B) True-breeding tall (TT) x True-breeding dwarf (tt)",
      "C) True-breeding tall (TT) x Heterozygous tall (Tt)",
      "D) True-breeding dwarf (tt) x Heterozygous tall (Tt)"
    ],
    "correct_answer": "B) True-breeding tall (TT) x True-breeding dwarf (tt)",
    "explanation": "Mendel’s monohybrid experiment involved crossing true-breeding tall and dwarf plants (TT x tt).",
    "topic": "Monohybrid Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen020"
  },
  {
    "question_text": "What is the expected genotypic ratio in the F2 generation of a monohybrid cross?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) 1:1:1:1",
      "B) 3:1",
      "C) 1:2:1",
      "D) 9:3:3:1"
    ],
    "correct_answer": "C) 1:2:1",
    "explanation": "In a monohybrid self-cross of a heterozygote (Tt), the genotypic ratio is 1 TT : 2 Tt : 1 tt or 1:2:1.",
    "topic": "Punnett Square Analysis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen021"
  },
  {
    "question_text": "In a test cross between a tall pea plant with genotype Tt and a dwarf plant (tt), what is the expected phenotypic ratio among the offspring?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A) 3:1",
      "B) 1:1",
      "C) 1:2",
      "D) 2:1"
    ],
    "correct_answer": "B) 1:1",
    "explanation": "A test cross between Tt and tt results in 50% tall (Tt) and 50% dwarf (tt) offspring, producing a 1:1 ratio.",
    "topic": "Test Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen022"
  },
  {
    "question_text": "Which of the following best describes co-dominance?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A) The heterozygote shows a phenotype intermediate between the two homozygotes",
      "B) The dominant allele completely masks the recessive allele",
      "C) Both alleles in the heterozygote are fully expressed simultaneously",
      "D) One allele is only partially expressed in the heterozygote"
    ],
    "correct_answer": "C) Both alleles in the heterozygote are fully expressed simultaneously",
    "explanation": "In co-dominance, both alleles contribute to the phenotype; an example is the AB blood group where both A and B antigens are expressed.",
    "topic": "Co-dominance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen023"
  },
  {
    "question_text": "Define a monohybrid cross and provide an example using pea plants.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A monohybrid cross is the mating between two organisms that differ in one specific trait. For example, crossing a true-breeding tall pea plant (TT) with a true-breeding dwarf pea plant (tt) produces an F1 generation all having the heterozygous genotype (Tt).",
    "explanation": "This definition highlights the focus on one trait and uses pea plants as an illustrative example representing the concept of dominant and recessive alleles.",
    "topic": "Monohybrid Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen024"
  },
  {
    "question_text": "What is a test cross and why is it performed?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "A test cross involves crossing an individual showing the dominant phenotype with a homozygous recessive individual. It is performed to determine whether the dominant phenotype individual is homozygous or heterozygous.",
    "explanation": "The test cross is a diagnostic method in genetics to reveal the unknown genotype of an organism displaying the dominant trait.",
    "topic": "Test Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen025"
  },
  {
    "question_text": "Briefly explain the principle of segregation as proposed by Mendel.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The principle of segregation states that during the formation of gametes, the two alleles of a gene separate so that each gamete receives only one allele. This random separation ensures that offspring have a 50% chance of inheriting either allele.",
    "explanation": "This explanation emphasizes the mechanism by which alleles segregate during gamete formation, ensuring genetic diversity.",
    "topic": "Law of Segregation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen026"
  },
  {
    "question_text": "Discuss Mendel's experiments with pea plants that led to the formulation of the laws of dominance and segregation. Include details of his observations in the F1 and F2 generations.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Mendel's experiments involved crossing true-breeding tall (TT) and dwarf (tt) pea plants. In the F1 generation, all offspring exhibited the tall phenotype, suggesting that the tall allele was dominant over the dwarf allele. Upon self-pollinating the F1 hybrids (Tt), the F2 generation yielded both tall and dwarf plants in a 3:1 phenotypic ratio. This led him to propose that alleles segregate during gamete formation, and that one allele can mask the presence of the other, thereby formulating the laws of dominance and segregation.",
    "explanation": "This answer details the experimental design, observations, and interpretations that led Mendel to establish his fundamental genetic laws.",
    "topic": "Laws of Inheritance",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen027"
  },
  {
    "question_text": "Compare and contrast incomplete dominance and co-dominance with examples provided in the text.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Incomplete dominance is a genetic phenomenon where the heterozygote exhibits a phenotype that is an intermediate blend of both homozygous forms, as seen in the snapdragon flower color where red (RR) and white (rr) produce pink (Rr) flowers. In contrast, co-dominance occurs when both alleles in the heterozygote are fully expressed, as in the human ABO blood grouping system where alleles IA and IB both express in individuals with the AB blood type. These differences highlight that in incomplete dominance the phenotype is a mix, while in co-dominance both traits appear distinctly.",
    "explanation": "This answer clearly differentiates between the two phenomena by describing the phenotype outcomes and providing specific examples from snapdragons and human blood groups.",
    "topic": "Dominance Variations",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen028"
  },
  {
    "question_text": "True or False: In the F1 generation of a cross between true-breeding tall and dwarf pea plants, all offspring display the tall phenotype.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "All the F1 offspring exhibit the tall trait since the tall allele is dominant over the dwarf allele.",
    "topic": "Mendelian Inheritance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen029"
  },
  {
    "question_text": "True or False: During gamete formation, alleles segregate in a 1:1 ratio, ensuring that each gamete receives one allele from a gene pair.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Mendel's law of segregation indicates that each gamete receives one allele from a gene pair, with a 50% chance for either allele.",
    "topic": "Law of Segregation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen030"
  },
  {
    "question_text": "True or False: A test cross involves breeding an organism with unknown genotype with a homozygous dominant individual.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "A test cross is performed by crossing the organism with a homozygous recessive individual, not a homozygous dominant one, to reveal the unknown genotype.",
    "topic": "Test Cross",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen031"
  },
  {
    "question_text": "True or False: In incomplete dominance, the heterozygote's phenotype is identical to that of one of the homozygotes.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "In incomplete dominance, the heterozygote exhibits an intermediate phenotype, not one identical to either homozygote.",
    "topic": "Incomplete Dominance",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen032"
  },
  {
    "question_text": "True or False: Co-dominance is illustrated by the human ABO blood group system, where both A and B antigens are expressed in individuals with the AB blood type.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "In co-dominance, both alleles are fully expressed, as seen in the AB blood group where both A and B antigens are present.",
    "topic": "Co-dominance",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen033"
  },
  {
    "question_text": "Using a Punnett square, calculate the probability of obtaining a heterozygous tall (Tt) plant from a self-fertilized heterozygous tall (Tt) plant.",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "50%",
    "explanation": "A self-cross of Tt results in a genotypic ratio of 1 TT : 2 Tt : 1 tt. Therefore, the probability of a heterozygous tall (Tt) plant is 2 out of 4 or 50%.",
    "topic": "Punnett Square Analysis",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen034"
  },
  {
    "question_text": "Express the binomial expansion of (½T + ½t)² and state the percentage distribution of each genotype.",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "1/4 TT, 1/2 Tt, and 1/4 tt (25% TT, 50% Tt, 25% tt)",
    "explanation": "Expanding (½T + ½t)² gives: (½T + ½t) x (½T + ½t) = 1/4 TT + 1/2 Tt + 1/4 tt. This means there is a 25% chance for TT, 50% chance for Tt, and 25% chance for tt.",
    "topic": "Mathematical Analysis in Genetics",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen035"
  },
  {
    "question_text": "How does a test cross help differentiate between homozygous dominant and heterozygous individuals? Illustrate your answer with an example from pea plants.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A test cross is used to determine the genotype of an organism with a dominant phenotype by crossing it with a homozygous recessive individual. For example, if a tall pea plant (displaying the dominant trait) is crossed with a dwarf plant (tt), the resulting offspring will reveal the unknown genotype. If all offspring are tall, the tested plant is likely homozygous dominant (TT); if about half are tall and half dwarf, the plant is heterozygous (Tt).",
    "explanation": "By observing the phenotypes of the progeny, a test cross can reveal whether the dominant individual carries a hidden recessive allele or not.",
    "topic": "Test Cross",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo104",
    "section_id": "03_section_4_2",
    "question_id": "cbse_xii_lebo1dd_c104_gen036"
  }
]