[
  {
    "question_text": "Name the parts of an angiosperm flower in which development of male and female gametophyte take place.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "The anther (where male gametophytes or pollen grains develop) and the ovary (which contains the ovules where the female gametophyte develops).",
    "explanation": "In angiosperms, the male gametophyte develops within the anther of the stamen, while the female gametophyte develops within the ovule located in the ovary. This fundamental division of reproductive structures is crucial for sexual reproduction in flowering plants.",
    "topic": "Flower structure and gametophyte development",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex001"
  },
  {
    "question_text": "Differentiate between microsporogenesis and megasporogenesis. Which type of cell division occurs during these events? Name the structures formed at the end of these two events.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Microsporogenesis is the process by which pollen mother cells in the anther undergo meiotic division to form microspore tetrads, which subsequently develop into pollen grains (male gametophytes). In contrast, megasporogenesis is the process by which the megaspore mother cell in the ovule undergoes meiosis to form a megaspore tetrad, from which one functional megaspore develops into the embryo sac (female gametophyte). The cell division common to both processes is meiosis.",
    "explanation": "Both microsporogenesis and megasporogenesis involve a reduction division (meiosis) that results in the formation of haploid cells. In microsporogenesis, the end product is a microspore tetrad that eventually gives rise to mature pollen grains. In megasporogenesis, although a tetrad is initially formed, usually only one megaspore survives and develops into the embryo sac.",
    "topic": "Microsporogenesis and megasporogenesis",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex002"
  },
  {
    "question_text": "Arrange the following terms in the correct developmental sequence: Pollen grain, sporogenous tissue, microspore tetrad, pollen mother cell, male gametes.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Sporogenous tissue → Pollen mother cell → Microspore tetrad → Pollen grain → Male gametes",
    "explanation": "The development of the male gametophyte begins with the sporogenous tissue, which differentiates into pollen mother cells. These cells undergo meiosis to form microspore tetrads. The microspores then mature into pollen grains, and finally, pollen grains give rise to male gametes.",
    "topic": "Pollen development",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex003"
  },
  {
    "question_text": "With a neat, labelled diagram, describe the parts of a typical angiosperm ovule.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "A typical angiosperm ovule consists of a funicle (stalk attaching the ovule to the placenta), a hilum (the junction between the ovule and funicle), one or two integuments (protective envelopes), a micropyle (an opening at the tip for pollen entry), a chalaza (the basal part opposite the micropyle), a nucellus (nutritive tissue), and the embryo sac (female gametophyte).",
    "explanation": "The ovule is the megasporangium and is essential for the development of the female gametophyte. Each part of the ovule has a specific function, such as protection (integuments), nutrient storage (nucellus), and facilitating fertilization (micropyle). A diagram would typically show these structures clearly labeled.",
    "topic": "Angiosperm ovule structure",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex004"
  },
  {
    "question_text": "What is meant by monosporic development of female gametophyte?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Monosporic development refers to the formation of the entire female gametophyte (embryo sac) from a single functional megaspore.",
    "explanation": "During megasporogenesis in most flowering plants, although four megaspores are initially produced, only one survives. This single megaspore undergoes mitotic divisions to form the embryo sac, leading to monosporic development.",
    "topic": "Embryo sac development",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex005"
  },
  {
    "question_text": "With a neat diagram explain the 7-celled, 8-nucleate nature of the female gametophyte.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The female gametophyte starts as a functional megaspore that undergoes three successive rounds of free-nuclear mitosis, forming a structure with eight nuclei. Subsequently, cell walls partition these nuclei into seven cells: one egg cell, two synergids (forming the egg apparatus), three antipodal cells, and a large central cell containing two polar nuclei.",
    "explanation": "The process involves free nuclear divisions before cytokinesis occurs. The final spatial arrangement is crucial for successful double fertilization, where the egg apparatus and the polar nuclei play their roles in forming the zygote and the endosperm, respectively.",
    "topic": "Embryo sac development",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex006"
  },
  {
    "question_text": "What are chasmogamous flowers? Can cross-pollination occur in cleistogamous flowers? Give reasons for your answer.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Chasmogamous flowers are open, well-developed flowers that facilitate cross-pollination by exposing their reproductive structures. Cleistogamous flowers are closed and self-pollinate, making cross-pollination unlikely because the anthers and stigma are positioned very close together, preventing the entry of foreign pollen.",
    "explanation": "Chasmogamous flowers attract pollinators and allow pollen from different plants to fertilize the ovule, increasing genetic diversity. In contrast, cleistogamous flowers remain closed, ensuring that the pollen transfers to the stigma within the same flower, thus excluding cross-pollination.",
    "topic": "Pollination mechanisms",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex007"
  },
  {
    "question_text": "Mention two strategies evolved to prevent self-pollination in flowers.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Temporal separation of pollen release and stigma receptivity (dichogamy) and spatial separation of the anthers and stigma (herkogamy) are two strategies to prevent self-pollination. Additionally, self-incompatibility is a genetic mechanism that prevents fertilization by self-pollen.",
    "explanation": "These strategies ensure that self-pollen does not fertilize the ovules, thereby promoting cross-pollination, which enhances genetic diversity and reduces the chances of inbreeding depression.",
    "topic": "Pollination mechanisms",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex008"
  },
  {
    "question_text": "What is self-incompatibility? Why does self-pollination not lead to seed formation in self-incompatible species?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Self-incompatibility is a genetic mechanism by which a plant’s pistil can recognize and reject its own pollen or pollen from genetically similar individuals. In self-incompatible species, self-pollination does not lead to seed formation because the pistil prevents pollen germination or pollen tube growth, thereby stopping fertilization.",
    "explanation": "This mechanism ensures that only genetically diverse pollen can fertilize the ovule, promoting outcrossing and reducing the negative effects of inbreeding.",
    "topic": "Pollination mechanisms",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex009"
  },
  {
    "question_text": "What is bagging technique? How is it useful in a plant breeding programme?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Bagging technique involves covering emasculated or unisexual flowers with a bag to prevent contamination by unwanted pollen. It is useful in plant breeding because it ensures controlled pollination and prevents accidental self-pollination or cross-pollination from undesired sources.",
    "explanation": "By isolating the target flower, breeders can carefully apply selected pollen, thereby increasing the accuracy of hybridization and ensuring that only desired genetic crosses occur.",
    "topic": "Plant breeding techniques",
    "bloom_level": "Apply",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex010"
  },
  {
    "question_text": "What is triple fusion? Where and how does it take place? Name the nuclei involved in triple fusion.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Triple fusion is the process in double fertilization where one of the male gametes fuses with the two polar nuclei in the central cell of the embryo sac to form a triploid primary endosperm nucleus. This fusion takes place inside the ovule immediately after the pollen tube enters and delivers the male gametes.",
    "explanation": "In double fertilization, one sperm cell fuses with the egg cell to form the diploid zygote (syngamy), while the other sperm cell fuses with the two polar nuclei to produce the triploid primary endosperm nucleus, which later develops into the endosperm to nourish the embryo.",
    "topic": "Double fertilisation",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex011"
  },
  {
    "question_text": "Why do you think the zygote is dormant for sometime in a fertilised ovule?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The zygote remains dormant initially to allow time for the primary endosperm to develop and accumulate nutrients necessary for supporting the subsequent development of the embryo.",
    "explanation": "This dormancy ensures that the embryo has adequate nutritional support from the endosperm once it resumes active cell division and growth. It is an adaptive strategy to enhance the chances of successful embryogenesis.",
    "topic": "Embryo development",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex012"
  },
  {
    "question_text": "Differentiate between: (a) hypocotyl and epicotyl; (b) coleoptile and coleorrhiza; (c) integument and testa; (d) perisperm and pericarp.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "a) The hypocotyl is the part of the embryonic axis below the cotyledons that later develops into the root, while the epicotyl is the portion above the cotyledons that gives rise to the shoot system. b) The coleoptile is the protective sheath covering the emerging shoot in monocotyledons, whereas the coleorrhiza is the protective sheath that covers the emerging radicle. c) Integuments are the protective layers of the ovule that later develop into the seed coat (testa). The term 'testa' specifically refers to the hardened seed coat. d) Perisperm is tissue derived from the nucellus that persists in the mature seed, while the pericarp is the ovary wall that develops into the fruit.",
    "explanation": "These differences highlight the distinct roles and origins of various seed and embryo-related structures. Understanding these distinctions is crucial for comprehending seed development and the protective mechanisms associated with plant reproduction.",
    "topic": "Seed and embryo structure",
    "bloom_level": "Analyze",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex013"
  },
  {
    "question_text": "Why is apple called a false fruit? Which part(s) of the flower forms the fruit?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Apple is called a false fruit because, in addition to the ovary, other parts of the flower such as the receptacle (thalamus) contribute significantly to the fruit formation.",
    "explanation": "In true fruits, only the ovary develops into the fruit. However, in apples, the expanded base of the flower (receptacle) also develops and forms the bulk of the edible fruit, making it a composite or false fruit.",
    "topic": "Fruit development",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex014"
  },
  {
    "question_text": "What is meant by emasculation? When and why does a plant breeder employ this technique?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Emasculation is the removal of the anthers from a flower before they release pollen. It is employed by plant breeders to prevent unwanted self-pollination and to facilitate controlled cross-pollination by ensuring that only the desired pollen fertilizes the ovule.",
    "explanation": "By removing the anthers from the flower (especially in bisexual flowers), plant breeders can prevent self-fertilization and ensure that only controlled, hand-pollinated crosses occur, which is essential for developing hybrids with desirable traits.",
    "topic": "Plant breeding techniques",
    "bloom_level": "Remember",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex015"
  },
  {
    "question_text": "If one can induce parthenocarpy through the application of growth substances, which fruits would you select to induce parthenocarpy and why?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Fruits such as banana and citrus can be selected for inducing parthenocarpy because they are commercially important and consumers generally prefer seedless varieties. For instance, bananas are typically parthenocarpic and seedless, and inducing parthenocarpy in citrus can lead to seedless, market-preferred fruits.",
    "explanation": "Parthenocarpy, the formation of fruit without fertilization, results in seedless fruits. This is highly desirable in commercial fruit production because it enhances consumer appeal and reduces the need for pollination. Fruits that are already partly predisposed to parthenocarpy or that benefit significantly from being seedless are ideal candidates.",
    "topic": "Apomixis and parthenocarpy",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex016"
  },
  {
    "question_text": "Explain the role of tapetum in the formation of pollen-grain wall.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The tapetum is a nutritive tissue in the anther that provides essential nutrients and precursors, such as sporopollenin, required for the formation of the pollen grain’s outer wall (exine).",
    "explanation": "Tapetal cells possess dense cytoplasm and are crucial for nourishing developing microspores. They contribute materials necessary for building the tough, protective exine that ensures the durability and viability of pollen grains.",
    "topic": "Pollen development",
    "bloom_level": "Understand",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex017"
  },
  {
    "question_text": "What is apomixis and what is its importance?",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Apomixis is a form of asexual reproduction in which seeds are produced without fertilization. Its importance lies in its potential to produce genetically identical offspring (clones) of a superior genotype, which is highly valuable in agriculture for maintaining hybrid vigor across generations without segregation.",
    "explanation": "By bypassing the usual sexual reproduction process, apomixis ensures that offspring retain the exact genetic makeup of the parent, which is beneficial for propagating desired traits in hybrid varieties. This technique can reduce the cost and variability associated with seed production in commercial crops.",
    "topic": "Apomixis and polyembryony",
    "bloom_level": "Evaluate",
    "source": "exercise",
    "chapter_id": "lebo101",
    "question_id": "cbse_xii_lebo1dd_c101_ex018"
  },
  {
    "question_text": "Which cell divides repeatedly to form the triploid endosperm tissue in angiosperms?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Primary endosperm cell",
      "Zygote",
      "Micropyle",
      "Ovule"
    ],
    "correct_answer": "Primary endosperm cell",
    "explanation": "The primary endosperm cell divides repeatedly to form a triploid tissue that stores reserve food materials for the developing embryo.",
    "topic": "Endosperm development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen052"
  },
  {
    "question_text": "Which of the following seeds is known to have persistent endosperm that is not completely consumed during embryo development?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Pea",
      "Groundnut",
      "Castor",
      "Beans"
    ],
    "correct_answer": "Castor",
    "explanation": "Seeds like castor (and coconut) retain part of the endosperm after embryo development, unlike peas, groundnuts, and beans which consume the endosperm completely.",
    "topic": "Endosperm development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen053"
  },
  {
    "question_text": "In a typical dicotyledonous embryo, which structure at the embryonal axis is responsible for giving rise to the stem and leaves?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Hypocotyl",
      "Cotyledon",
      "Plumule",
      "Radicle"
    ],
    "correct_answer": "Plumule",
    "explanation": "The plumule, located at the tip of the epicotyl, develops into the shoot by forming the stem and leaves.",
    "topic": "Embryo development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen054"
  },
  {
    "question_text": "Which structure in the developing embryo is responsible for protecting the radicle (embryonic root) during growth?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Coleorhiza",
      "Coleoptile",
      "Root cap",
      "Micropyle"
    ],
    "correct_answer": "Root cap",
    "explanation": "The root cap covers the radicle, protecting it as it pushes through the soil during germination.",
    "topic": "Embryo development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen055"
  },
  {
    "question_text": "A mature seed in angiosperms typically consists of which three major components?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Zygote, micropyle, nucellus",
      "Cotyledons, embryo axis, seed coat",
      "Endosperm, perisperm, ovule",
      "Anther, filament, stigma"
    ],
    "correct_answer": "Cotyledons, embryo axis, seed coat",
    "explanation": "A typical angiosperm seed is composed of the embryo (with cotyledons and embryonal axis) and a protective seed coat, while the endosperm or perisperm may be present or absent depending on the type.",
    "topic": "Seed structure",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen056"
  },
  {
    "question_text": "Define free-nuclear endosperm and explain its significance in seed development.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Free-nuclear endosperm is the stage during which the primary endosperm cell undergoes successive nuclear divisions without cell wall formation. It is significant because this phase produces numerous nuclei that later become cellular, thereby providing ample nutrient reserve for the developing embryo.",
    "explanation": "The free-nuclear state allows rapid multiplication of nuclei which later form a nutritive tissue essential for embryo growth before cellularisation occurs.",
    "topic": "Endosperm development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen057"
  },
  {
    "question_text": "Describe the structural differences between dicotyledonous and monocotyledonous embryos as mentioned in the text.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Dicotyledonous embryos possess two cotyledons, an epicotyl (above the cotyledons) ending in a plumule, a hypocotyl, and a radicle with a root cap. Monocotyledonous embryos have a single cotyledon, often termed a scutellum, with a coleoptile protecting the emerging shoot, and a coleorhiza that encloses the radicle and root cap.",
    "explanation": "These structural differences are crucial for understanding the divergent developmental patterns in flowering plants, affecting how seedlings emerge and establish.",
    "topic": "Embryo development",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen058"
  },
  {
    "question_text": "Explain the significance of seed dehydration and dormancy in agriculture and seed storage.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Seed dehydration reduces the water content, which slows down metabolic activity, while dormancy prevents seeds from germinating immediately. These adaptations are essential for long-term storage, ensuring that seeds remain viable until conditions are favorable for germination, which is crucial for agriculture and maintaining seed banks.",
    "explanation": "Dehydration and dormancy allow seeds to be stored over time without losing viability, enabling farmers to sow crops in the appropriate season and maintain genetic diversity.",
    "topic": "Seed development and agriculture",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen059"
  },
  {
    "question_text": "Discuss the process of embryogeny in dicotyledonous plants, including the stages from zygote formation to the mature embryo.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Embryogeny in dicotyledonous plants begins with the formation of a zygote at the micropylar end of the embryo sac. Once a sufficient amount of endosperm has developed, the zygote divides to form a proembryo. This proembryo then undergoes further cell divisions to form a globular stage, which transitions into a heart-shaped stage before developing into a mature embryo. The mature embryo consists of an embryonal axis with the plumule forming the future shoot, and cotyledons that store food reserves. The hypocotyl connects the cotyledons to the radicle, which is protected by a root cap.",
    "explanation": "This answer highlights the sequential stages of embryo development and the morphological adaptations that facilitate the transition from a single cell to a complex, differentiated embryo.",
    "topic": "Embryo development",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen060"
  },
  {
    "question_text": "Evaluate the adaptations found in angiosperm seeds that contribute to their successful dispersal and survival. Include in your discussion the roles of seed coat, endosperm/persistence of nucellus, and dormancy.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Angiosperm seeds exhibit several adaptations that enhance their survival and dispersal. The tough seed coat, derived from the integuments of the ovule, provides protection against physical damage and desiccation, and the micropyle allows controlled entry of water and oxygen during germination. In nonalbuminous seeds, the complete consumption of the endosperm ensures efficient use of stored nutrients, whereas albuminous seeds retain part of the endosperm to nourish the embryo during germination. Additionally, seed dormancy prevents premature germination under unfavorable conditions, ensuring that seedlings emerge when environmental conditions are optimal. These adaptations collectively facilitate the survival of the species by promoting effective dispersal, prolonged viability, and successful establishment in new habitats.",
    "explanation": "This discussion covers the multiple strategies angiosperms employ to protect and nourish their embryos, ensuring that seeds can be stored and dispersed effectively, which is fundamental for plant colonization and agriculture.",
    "topic": "Seed structure and dispersal",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen061"
  },
  {
    "question_text": "True or False: The primary endosperm cell divides to form a diploid endosperm tissue.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The primary endosperm cell divides to form a triploid tissue, not a diploid one, due to the fusion of one sperm with the central cell which contains two polar nuclei.",
    "topic": "Endosperm development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen062"
  },
  {
    "question_text": "True or False: Free-nuclear endosperm represents the stage in which numerous nuclei form before being partitioned by cell walls during cellularisation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Free-nuclear endosperm is characterized by successive nuclear divisions without cell wall formation, preceding the cellularisation process.",
    "topic": "Endosperm development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen063"
  },
  {
    "question_text": "True or False: Dicotyledonous embryos are characterized by a single cotyledon called the scutellum.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Dicotyledonous embryos have two cotyledons. The term scutellum is used to describe the single cotyledon in monocotyledonous embryos.",
    "topic": "Embryo development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen064"
  },
  {
    "question_text": "True or False: In nonalbuminous seeds, the endosperm is completely consumed during embryo development.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Nonalbuminous seeds are defined by the complete consumption of the endosperm during the development of the embryo, leaving no nutritive tissue in the mature seed.",
    "topic": "Seed structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen065"
  },
  {
    "question_text": "True or False: Fruits that develop solely from the ovary are known as false fruits.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "Fruits that develop solely from the ovary are referred to as true fruits. False fruits involve contributions from other floral parts, such as the thalamus in apple and strawberry.",
    "topic": "Fruit formation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen066"
  },
  {
    "question_text": "If a fruit contains 200 ovules and every ovule develops into a seed, how many seeds would the fruit have?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "200",
    "explanation": "Assuming that every ovule successfully develops into a seed, the fruit will contain 200 seeds.",
    "topic": "Seed and fruit development",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen067"
  },
  {
    "question_text": "A Ficus tree produces 3 billion seeds and only 1 in every 1,000,000 seeds successfully germinates. Approximately how many seedlings can potentially emerge?",
    "type": "Numerical",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "3000",
    "explanation": "Dividing 3,000,000,000 (3 billion) seeds by 1,000,000 gives 3000 potential seedlings.",
    "topic": "Seed dispersal and viability",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen068"
  },
  {
    "question_text": "What is the record dormancy period mentioned for the viable seed of Lupinus arcticus?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Approximately 10,000 years",
    "explanation": "The text states that a Lupinus arcticus seed was excavated from the Arctic Tundra and successfully germinated after an estimated 10,000 years of dormancy.",
    "topic": "Seed longevity",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "05_section_1_4",
    "question_id": "cbse_xii_lebo1dd_c101_gen069"
  },
  {
    "question_text": "Which process describes the fusion of a male gamete with the egg cell nucleus in flowering plants?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "A: Triple fusion",
      "B: Double fertilisation",
      "C: Syngamy",
      "D: Mitosis"
    ],
    "correct_answer": "C: Syngamy",
    "explanation": "Syngamy is the process where one male gamete fuses with the egg cell nucleus to form a diploid zygote.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen034"
  },
  {
    "question_text": "After triple fusion, the central cell becomes which structure that develops into the endosperm?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Zygote",
      "B: Primary Endosperm Cell (PEC)",
      "C: Synergid cell",
      "D: Antipodal cell"
    ],
    "correct_answer": "B: Primary Endosperm Cell (PEC)",
    "explanation": "The central cell undergoes triple fusion to become the primary endosperm cell, which later develops into the endosperm.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen035"
  },
  {
    "question_text": "Double fertilisation in flowering plants involves two distinct fusion events. Which of the following pairs best describes these events?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Syngamy and double fusion",
      "B: Syngamy and triple fusion",
      "C: Triple fusion and quadruple fusion",
      "D: Double fusion and triple fusion"
    ],
    "correct_answer": "B: Syngamy and triple fusion",
    "explanation": "Double fertilisation involves syngamy (fusion of one male gamete with the egg cell) and triple fusion (fusion of the other male gamete with the two polar nuclei).",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen036"
  },
  {
    "question_text": "Double fertilisation is unique to flowering plants because it results in the formation of which two structures?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Only a zygote",
      "B: Only an endosperm",
      "C: Both a zygote and an endosperm",
      "D: Secretory tissues and embryo"
    ],
    "correct_answer": "C: Both a zygote and an endosperm",
    "explanation": "It is unique because one fusion forms the zygote (embryo) and the other produces the primary endosperm nucleus which develops into the endosperm providing nutrition to the embryo.",
    "topic": "Double Fertilisation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen037"
  },
  {
    "question_text": "Which statement best describes the roles of the two male gametes during double fertilisation?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "A: Both gametes fuse with the egg cell",
      "B: One gamete fuses with the egg cell while the other fuses with the two polar nuclei",
      "C: Both gametes fuse with the polar nuclei",
      "D: One gamete fuses with the synergid cell while the other initiates embryo development"
    ],
    "correct_answer": "B: One gamete fuses with the egg cell while the other fuses with the two polar nuclei",
    "explanation": "In double fertilisation, one male gamete fuses with the egg cell (syngamy) and the other fuses with the two polar nuclei (triple fusion) to form the triploid primary endosperm nucleus.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen038"
  },
  {
    "question_text": "Define double fertilisation in flowering plants.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Double fertilisation is the process in which two male gametes are involved; one fuses with the egg cell to form a diploid zygote, while the other fuses with the two polar nuclei in the central cell to form a triploid primary endosperm nucleus.",
    "explanation": "This definition clearly explains the two distinct fusion events that occur during double fertilisation, a unique process in angiosperms.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen039"
  },
  {
    "question_text": "What happens during triple fusion in the process of double fertilisation?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "During triple fusion, one male gamete fuses with the two haploid polar nuclei from the central cell, resulting in the formation of a triploid primary endosperm nucleus.",
    "explanation": "This answer explains the key event in triple fusion, highlighting the fusion of three haploid nuclei to yield a triploid nucleus.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen040"
  },
  {
    "question_text": "Name the products formed as a result of syngamy and triple fusion during double fertilisation.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Syngamy produces a diploid zygote, and triple fusion produces a triploid primary endosperm nucleus.",
    "explanation": "This answer identifies the two outcomes of double fertilisation, clearly associating each fusion event with its resultant product.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen041"
  },
  {
    "question_text": "What is the role of the endosperm in plant development?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The endosperm acts as a nutrient source for the developing embryo.",
    "explanation": "This answer explains that the endosperm provides essential nutrients to the embryo, supporting its growth during seed development.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen042"
  },
  {
    "question_text": "Describe the process of double fertilisation and explain its significance in flowering plants.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Double fertilisation begins when a pollen tube enters one of the synergids and releases two male gametes. One gamete fuses with the egg cell to form a diploid zygote (syngamy), while the other fuses with the two polar nuclei in the central cell to form a triploid primary endosperm nucleus (triple fusion). The zygote develops into the embryo, and the primary endosperm nucleus gives rise to the endosperm, which nourishes the developing embryo. This coordinated process ensures both the formation of a new plant and the provision of nutrients for its initial growth, making it pivotal to the reproductive success of angiosperms.",
    "explanation": "This detailed explanation covers the sequential events of double fertilisation and underlines its importance in producing both embryonic and nutritional structures, exclusive to flowering plants.",
    "topic": "Double Fertilisation",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen043"
  },
  {
    "question_text": "Explain the steps from the entry of the pollen tube into the embryo sac to the development of a mature embryo, referring to the diagram provided in the textbook.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The process starts when the pollen tube enters one of the synergids and releases two male gametes. One gamete fuses with the egg cell (syngamy) forming a diploid zygote, while the other fuses with the two polar nuclei (triple fusion) forming a triploid primary endosperm nucleus. The zygote then begins cell division, progressing from a globular to a heart-shaped embryo. Eventually, the mature embryo forms complete with a radicle, plumule, and cotyledons. Simultaneously, the primary endosperm nucleus develops into the endosperm, which supplies nutrients to the growing embryo.",
    "explanation": "This answer integrates the sequence of events from fertilisation to embryogenesis and references the diagram that illustrates these developmental stages.",
    "topic": "Double Fertilisation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen044"
  },
  {
    "question_text": "Compare and contrast syngamy and triple fusion in the context of double fertilisation.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Syngamy and triple fusion are both critical events in double fertilisation. Syngamy involves the fusion of one male gamete with the egg cell, resulting in the formation of a diploid zygote that will develop into the embryo. In contrast, triple fusion involves the fusion of the other male gamete with two haploid polar nuclei in the central cell, forming a triploid primary endosperm nucleus that becomes the endosperm. While syngamy directly leads to the zygote formation, triple fusion is responsible for creating the nutritive tissue that supports embryo development. Thus, both processes are interdependent and essential for successful seed development in flowering plants.",
    "explanation": "The answer highlights the distinct roles and outcomes of syngamy and triple fusion, demonstrating their complementary functions and importance in plant reproduction.",
    "topic": "Double Fertilisation",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen045"
  },
  {
    "question_text": "If each haploid nucleus contains n chromosomes, what will be the chromosome numbers of the zygote and the primary endosperm nucleus after double fertilisation?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The zygote will have 2n chromosomes and the primary endosperm nucleus will have 3n chromosomes.",
    "explanation": "Syngamy results in the fusion of two haploid gametes to form a diploid zygote (2n), while triple fusion combines one male gamete with two haploid polar nuclei to form a triploid nucleus (3n).",
    "topic": "Double Fertilisation",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen046"
  },
  {
    "question_text": "Double fertilisation occurs only in angiosperms.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Double fertilisation is a unique reproductive process found exclusively in flowering plants (angiosperms).",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen047"
  },
  {
    "question_text": "Both male gametes fuse with the egg cell during double fertilisation.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Only one male gamete fuses with the egg cell, while the other fuses with the two polar nuclei.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen048"
  },
  {
    "question_text": "Triple fusion involves the fusion of three haploid nuclei.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Triple fusion involves one male gamete and the two haploid polar nuclei fusing, resulting in a triploid nucleus.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen049"
  },
  {
    "question_text": "The primary endosperm nucleus eventually develops into the embryo.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "The primary endosperm nucleus develops into the endosperm, which serves as a nutritional tissue, while the zygote develops into the embryo.",
    "topic": "Double Fertilisation",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen050"
  },
  {
    "question_text": "The diagram in Figure (page 17 Figure 4.jpeg) illustrates both fertilisation and subsequent embryogenesis in dicots.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "The diagram shows the fertilised embryo sac with the zygote and primary endosperm nucleus, as well as the stages of dicot embryogenesis, thus covering both fertilisation and embryo development.",
    "topic": "Double Fertilisation",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "04_section_1_3",
    "question_id": "cbse_xii_lebo1dd_c101_gen051"
  },
  {
    "question_text": "Which part of the stamen is the long, slender structure that supports the anther?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Filament",
      "Anther",
      "Pollen grain",
      "Ovule"
    ],
    "correct_answer": "Filament",
    "explanation": "The stamen comprises the filament, a long slender stalk, and the anther at its tip. The filament supports the anther where pollen grains are produced.",
    "topic": "Stamen, Microsporangium and Pollen Grain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen017"
  },
  {
    "question_text": "Which tissue in a microsporangium is responsible for nourishing the developing pollen grains?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Epidermis",
      "Tapetum",
      "Endothecium",
      "Middle layers"
    ],
    "correct_answer": "Tapetum",
    "explanation": "The tapetum is the innermost layer of the microsporangium wall and provides nutrients to the developing pollen grains.",
    "topic": "Stamen, Microsporangium and Pollen Grain",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen018"
  },
  {
    "question_text": "What is the primary component of the hard outer layer (exine) of pollen grains that gives it exceptional resistance?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Cellulose",
      "Pectin",
      "Sporopollenin",
      "Lignin"
    ],
    "correct_answer": "Sporopollenin",
    "explanation": "Sporopollenin, a highly resistant organic polymer, forms the exine of pollen grains, enabling them to withstand extreme conditions.",
    "topic": "Pollen Grain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen019"
  },
  {
    "question_text": "Which of the following is not considered an abiotic pollination agent?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Wind",
      "Water",
      "Bees",
      "None of the above"
    ],
    "correct_answer": "Bees",
    "explanation": "Wind and water are abiotic agents; bees are biotic agents involved in pollination.",
    "topic": "Pollination",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen020"
  },
  {
    "question_text": "Which mechanism prevents self-pollination by inhibiting the pollen tube growth within the pistil?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Cleistogamy",
      "Self-incompatibility",
      "Geitonogamy",
      "Xenogamy"
    ],
    "correct_answer": "Self-incompatibility",
    "explanation": "Self-incompatibility is a genetic mechanism where the pistil rejects self-pollen by preventing its germination or pollen tube growth.",
    "topic": "Pollination and Pollen-Pistil Interaction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen021"
  },
  {
    "question_text": "How could tapetal cells possibly become binucleate?",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "They might become binucleate by a failure of cytokinesis during cell division or by cell fusion.",
    "explanation": "In plants, tapetal cells sometimes become binucleate possibly due to an incomplete cytokinesis process or by the fusion of two nuclei in a single cell, ensuring efficient nutrient transfer.",
    "topic": "Stamen, Microsporangium and Pollen Grain",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen022"
  },
  {
    "question_text": "What is the ploidy level of the cells within a microspore tetrad formed during microsporogenesis?",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Haploid",
    "explanation": "During microsporogenesis, the pollen mother cell undergoes meiosis to produce haploid microspores arranged in tetrads.",
    "topic": "Microsporogenesis",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen023"
  },
  {
    "question_text": "Explain the significance of anther dehiscence in the process of plant reproduction.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Anther dehiscence is the process by which the anther opens to release pollen grains.",
    "explanation": "Anther dehiscence is crucial for releasing the mature pollen grains into the environment, thereby enabling contact with the stigma for pollination and subsequent fertilization.",
    "topic": "Microsporogenesis and Pollen Release",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen024"
  },
  {
    "question_text": "Describe the structure of a typical microsporangium, including all its wall layers and their functions.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A typical microsporangium, when seen in transverse section, is nearly circular in outline and is surrounded by four wall layers: the outermost epidermis, endothecium, middle layers, and the innermost tapetum. The epidermis, endothecium, and middle layers provide protection and aid in anther dehiscence, while the tapetum supplies nutrients to the developing pollen grains.",
    "explanation": "This answer covers the detailed internal structure of the microsporangium: the protective role of the outer layers and the nutritive function of the tapetum. Understanding these layers is crucial to comprehend how pollen development is supported.",
    "topic": "Microsporangium Structure",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen025"
  },
  {
    "question_text": "Discuss the process of pollen-pistil interaction and its significance in preventing self-pollination in flowering plants.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Pollen-pistil interaction involves the germination of the pollen grain on the stigma, the growth of the pollen tube through the style, and its entry into the ovule via the micropyle and synergids. This process is guided by structures such as the filiform apparatus and involves a biochemical dialogue between pollen and pistil. It is significant in preventing self-pollination through mechanisms like self-incompatibility and spatial separation of reproductive structures.",
    "explanation": "The detailed answer explains the sequential events from pollen deposition to fertilization and highlights the molecular and structural mechanisms by which the pistil can accept compatible pollen while rejecting self or incompatible pollen. This ensures genetic diversity and avoids inbreeding.",
    "topic": "Pollen-Pistil Interaction",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen026"
  },
  {
    "question_text": "Gynoecium is the male reproductive part of the flower.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The gynoecium is the female reproductive part of the flower, whereas the stamen represents the male reproductive part.",
    "topic": "Floral Structures",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen027"
  },
  {
    "question_text": "In many angiosperms, pollen grains are shed at a 2-celled stage. This is true in over 60% of cases.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "According to the text, in over 60% of angiosperms, the pollen grains are released at the 2-celled stage, consisting of a vegetative cell and a generative cell.",
    "topic": "Pollen Grain Development",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen028"
  },
  {
    "question_text": "Most water-pollinated plants possess colourful flowers that produce nectar.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Water-pollinated plants typically do not have colourful flowers or produce nectar because their pollination relies on passive water currents rather than visual or chemical attraction of pollinators.",
    "topic": "Pollination",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen029"
  },
  {
    "question_text": "The filiform apparatus present at the micropylar end of synergid cells helps to guide the pollen tube into the ovule.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The filiform apparatus is a specialized structure in the synergid cells that plays an important role in directing the pollen tube towards the embryo sac.",
    "topic": "Pollen-Pistil Interaction",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen030"
  },
  {
    "question_text": "Cleistogamous flowers self-pollinate without opening, ensuring seed set even in the absence of pollinators.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "Cleistogamous flowers are designed to self-pollinate because they do not open, thereby ensuring that pollination and seed set occur even when pollinators are not available.",
    "topic": "Pollination",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen031"
  },
  {
    "question_text": "Sporopollenin in the pollen exine is known to be one of the most resistant organic compounds, capable of withstanding extreme conditions.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Sporopollenin is highly resistant to high temperatures, strong acids, and alkalis, which allows pollen grains to be well-preserved as fossils.",
    "topic": "Pollen Grain Structure",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen032"
  },
  {
    "question_text": "What is the typical diameter range of pollen grains in flowering plants (in micrometers)?",
    "type": "Numerical",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "25-50 micrometers",
    "explanation": "Pollen grains in flowering plants are generally spherical and measure approximately 25 to 50 micrometers in diameter.",
    "topic": "Pollen Grain",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "03_section_1_2",
    "question_id": "cbse_xii_lebo1dd_c101_gen033"
  },
  {
    "question_text": "Which part of the flower is the receptive surface for pollen?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Stigma",
      "Sepals",
      "Anther",
      "Petals"
    ],
    "correct_answer": "Stigma",
    "explanation": "The stigma is the part of the flower that receives pollen, making it essential for the pollination process.",
    "topic": "Flower reproductive structures",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen001"
  },
  {
    "question_text": "Which two parts of a typical flower are directly involved in the development of the most important units of sexual reproduction?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Petals and Sepals",
      "Stigma and Ovary",
      "Anther and Filament",
      "Stigma and Anther"
    ],
    "correct_answer": "Stigma and Ovary",
    "explanation": "The stigma receives pollen and the ovary houses the ovules, which are key to the process of fertilization.",
    "topic": "Reproductive organs in flowers",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen002"
  },
  {
    "question_text": "Which of the following is NOT a value mentioned in the text for which human beings have had an intimate relationship with flowers?",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Aesthetic",
      "Ornamental",
      "Culinary",
      "Religious"
    ],
    "correct_answer": "Culinary",
    "explanation": "The text emphasizes aesthetic, ornamental, social, religious, and cultural values, but does not mention culinary value.",
    "topic": "Human-flower relationship",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen003"
  },
  {
    "question_text": "What does the term 'floriculture' refer to?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "The study of flower anatomy",
      "The cultivation of flowers",
      "The worship of flowers",
      "The genetic modification of flowers"
    ],
    "correct_answer": "The cultivation of flowers",
    "explanation": "Floriculture is defined as the cultivation of flowers, playing a key role in horticulture and the production of ornamental plants.",
    "topic": "Floriculture",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen004"
  },
  {
    "question_text": "Which statement best explains the multifaceted relationship between humans and flowers?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "Flowers are only used as ornamentals",
      "Flowers serve symbolic, cultural, and reproductive functions",
      "Flowers are solely a subject of biological study",
      "Flowers are independent of human expression"
    ],
    "correct_answer": "Flowers serve symbolic, cultural, and reproductive functions",
    "explanation": "The text indicates that flowers are not only valued for their physical beauty but also used to express deep human emotions and cultural traditions.",
    "topic": "Human-flower interaction",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen005"
  },
  {
    "question_text": "Name two parts of a flower that are responsible for its sexual reproduction.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Stigma and Ovary",
    "explanation": "The stigma receives the pollen while the ovary houses the ovules, making them critical in the reproductive process.",
    "topic": "Flower reproductive structures",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen006"
  },
  {
    "question_text": "Identify at least three parts of the flower diagram shown in Figure 1.1 and briefly describe their functions.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Possible answers include: Stigma (receives pollen), Anther (produces pollen), Petals (attract pollinators), Sepals (protect the flower), and Filament (supports the anther).",
    "explanation": "The question requires naming and describing parts shown in the diagram, emphasizing their roles in reproduction and attraction.",
    "topic": "Flower anatomy",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen007"
  },
  {
    "question_text": "Give examples of ornamental flowers commonly cultivated in homes and gardens in your region.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Examples may include roses, lilies, tulips, daisies, and marigolds.",
    "explanation": "This answer should list examples that are typically used for decorative purposes in home gardens, based on common regional preferences.",
    "topic": "Ornamental flowers",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen008"
  },
  {
    "question_text": "Discuss why flowers hold such significant cultural and religious value in human societies.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "Flowers hold cultural and religious value because they are symbols of human emotions and are used in various rituals, celebrations, and traditions. Their beauty and delicate nature evoke sentiments of love, honor, and remembrance.",
    "explanation": "The answer should explore the symbolic meanings of flowers and how they are integrated into cultural practices and religious ceremonies.",
    "topic": "Cultural significance of flowers",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen009"
  },
  {
    "question_text": "Explain the role of each reproductive part in a flower (stigma, style, ovary, anther, filament) in the process of pollination and fertilization. Provide examples to support your explanation.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "The stigma serves as the landing surface for pollen; the style is the tube through which pollen travels to reach the ovary; the ovary contains the ovules, which, upon fertilization, develop into seeds; the anther produces pollen; and the filament supports the anther. For example, in many flowering plants, the arrangement of these structures facilitates effective pollination by insects.",
    "explanation": "This answer demonstrates understanding by explaining the functions of each part during reproduction, linking structure to function with supportive examples.",
    "topic": "Flower reproductive structures and processes",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen010"
  },
  {
    "question_text": "Design a research study to explore how human emotions and cultural values influence the cultivation and use of ornamental flowers in different geographic regions. Include your hypothesis, key variables, and potential methodologies.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "A suitable study would involve a cross-cultural survey collecting data on the types and uses of ornamental flowers in different regions. The hypothesis might be: 'Cultural and emotional factors significantly influence the ornamental flower choices in various regions.' Key variables include cultural traditions, emotional significance, and types of flowers cultivated. Methodologies could include questionnaires, interviews, and analysis of regional horticultural data to establish correlations.",
    "explanation": "This answer is comprehensive and details a research design that considers hypothesis formulation, variable identification, and methodological approaches, demonstrating higher-order thinking skills.",
    "topic": "Cultural and emotional significance of flowers",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen011"
  },
  {
    "question_text": "Flowers are only valued for their aesthetic appeal.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text points out that flowers also carry ornamental, social, religious, and cultural values beyond just aesthetic appeal.",
    "topic": "Human-flower relationship",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen012"
  },
  {
    "question_text": "The style in a flower connects the stigma to the ovary.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The style is the tube-like structure that connects the stigma to the ovary, allowing pollen to travel for fertilization.",
    "topic": "Flower anatomy",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen013"
  },
  {
    "question_text": "Floriculture is the study of the genetic makeup of flowers.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "Floriculture refers to the cultivation of flowers, not the study of their genetic makeup.",
    "topic": "Floriculture",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen014"
  },
  {
    "question_text": "The diagram in Figure 1.1 is used to illustrate the reproductive structures of a flower.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Figure 1.1 clearly labels the parts of the flower involved in reproduction, such as the stigma, style, ovary, anther, and filament.",
    "topic": "Flower anatomy and reproduction",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen015"
  },
  {
    "question_text": "The use of flowers in cultural ceremonies is limited to only one or two cultures.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "False",
    "explanation": "The text suggests that the use of flowers in social and cultural celebrations is widespread, reflecting diverse traditions across many cultures.",
    "topic": "Cultural significance of flowers",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "02_section_1_1",
    "question_id": "cbse_xii_lebo1dd_c101_gen016"
  },
  {
    "question_text": "Fruit production without fertilisation is called:",
    "type": "MCQ",
    "difficulty": "Easy",
    "options": [
      "Apomixis",
      "Polyembryony",
      "Fertilisation",
      "Vegetative propagation"
    ],
    "correct_answer": "Apomixis",
    "explanation": "Apomixis is the process by which seeds are produced without fertilisation, representing a form of asexual reproduction that mimics sexual reproduction.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen070"
  },
  {
    "question_text": "Which of the following plant groups has evolved the mechanism of apomixis?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Asteraceae and grasses",
      "Legumes and ferns",
      "Mosses and liverworts",
      "Conifers and cycads"
    ],
    "correct_answer": "Asteraceae and grasses",
    "explanation": "The text mentions that some species of Asteraceae and grasses have evolved apomixis as a special mechanism to produce seeds without fertilisation.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen071"
  },
  {
    "question_text": "Polyembryony is best described as:",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "Production of multiple embryos in a single seed",
      "Fusion of two gametes to form an embryo",
      "Development of a single embryo from a fertilised egg",
      "Formation of seeds without any embryo"
    ],
    "correct_answer": "Production of multiple embryos in a single seed",
    "explanation": "Polyembryony refers to the occurrence of more than one embryo in a seed, a phenomenon observed when several nucellar cells start dividing and developing into embryos within a single ovule.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen072"
  },
  {
    "question_text": "How can apomixis benefit the hybrid seed industry?",
    "type": "MCQ",
    "difficulty": "Hard",
    "options": [
      "By eliminating genetic segregation, allowing farmers to use seeds repeatedly",
      "By increasing genetic variation among progeny",
      "By reducing seed production costs through sexual reproduction",
      "By enhancing the need for annual seed purchase"
    ],
    "correct_answer": "By eliminating genetic segregation, allowing farmers to use seeds repeatedly",
    "explanation": "Converting hybrids into apomicts maintains the hybrid characters without segregation among progeny, so farmers can repeatedly use the seeds rather than purchasing new ones each year.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen073"
  },
  {
    "question_text": "What is the genetic nature of apomictic embryos in relation to the mother plant?",
    "type": "MCQ",
    "difficulty": "Medium",
    "options": [
      "They are genetically identical clones of the mother plant",
      "They are genetically diverse due to mutation",
      "They are half clones with contributions from a pollen donor",
      "They show increased variation due to spontaneous recombination"
    ],
    "correct_answer": "They are genetically identical clones of the mother plant",
    "explanation": "Since apomictic embryos are produced asexually without fertilisation, they are clones of the mother plant, exhibiting genetic uniformity.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen074"
  },
  {
    "question_text": "Define apomixis.",
    "type": "Short Answer",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "Apomixis is a form of asexual reproduction in flowering plants where seeds are produced without fertilisation.",
    "explanation": "This definition summarizes the concept by stating that apomixis involves seed formation without the fusion of gametes.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen075"
  },
  {
    "question_text": "Explain polyembryony and its occurrence in some plant species.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Polyembryony is the occurrence of more than one embryo within a single seed. It occurs when nucellar cells around the embryo sac divide and develop into additional embryos.",
    "explanation": "The answer describes the process and phenomenon of polyembryony as outlined in the section, indicating the developmental process from nucellar cells.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen076"
  },
  {
    "question_text": "What is the main advantage of using apomictic reproduction in hybrid seed cultivation?",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "It prevents genetic segregation, allowing farmers to reuse seeds year after year while maintaining the hybrid characteristics.",
    "explanation": "The major benefit is that apomixis produces progeny identical to the hybrid parent, reducing the need to purchase new seeds every season.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen077"
  },
  {
    "question_text": "Describe one mode of apomictic seed development observed in Citrus and Mango varieties.",
    "type": "Short Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "In many Citrus and Mango varieties, some nucellar cells that surround the embryo sac begin dividing independently. These cells protrude into the embryo sac and develop into embryos, resulting in polyembryony within each ovule.",
    "explanation": "This mode of development, known as nucellar embryony, is clearly described in the section and underlines the process through which multiple embryos form in one seed.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen078"
  },
  {
    "question_text": "Discuss the process of nucellar embryony and its implications for seed composition.",
    "type": "Long Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "Nucellar embryony involves the division of nucellar cells adjacent to the embryo sac, which then protrude into the embryo sac and develop into additional embryos. This process results in the formation of polyembryonic seeds containing embryos of varying sizes and shapes. The implication is that a single seed can generate several, genetically identical embryos, which might affect the nutritive allocation and overall seed structure.",
    "explanation": "The response should detail that nucellar cells, distinct from the gametic lineage, undergo a division process that leads to multiple embryo formation within a single seed. It also touches on the biological and agricultural implications of such a reproductive strategy.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Analyze",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen079"
  },
  {
    "question_text": "Evaluate the potential benefits and challenges of transferring apomictic genes into hybrid varieties.",
    "type": "Long Answer",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "The potential benefits include maintaining hybrid vigor by preventing genetic segregation, which allows farmers to use the same seeds year after year, thereby reducing costs and ensuring consistent crop quality. On the other hand, challenges include the complexity of genetic control of apomixis, ensuring the stability of apomictic traits under diverse environmental conditions, and the risk of reduced genetic diversity which may affect the crop's ability to adapt to diseases and changing climates.",
    "explanation": "This answer presents a balanced evaluation by outlining both the advantages, such as cost reduction and trait stability, as well as the challenges, like genetic complexity and potential loss of diversity, which are critical considerations in agricultural biotechnology.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen080"
  },
  {
    "question_text": "True or False: Apomixis is a form of sexual reproduction.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "False",
    "explanation": "Apomixis is a form of asexual reproduction, as it produces seeds without fertilisation.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen081"
  },
  {
    "question_text": "True or False: Polyembryony refers to the occurrence of more than one embryo in a seed.",
    "type": "True/False",
    "difficulty": "Easy",
    "options": null,
    "correct_answer": "True",
    "explanation": "The definition of polyembryony is the occurrence of multiple embryos in a single seed, as explained in the section.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Remember",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen082"
  },
  {
    "question_text": "True or False: In apomixis, the diploid egg cell always undergoes reduction division before developing into an embryo.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "False",
    "explanation": "In apomixis, the diploid egg cell is sometimes formed without reduction division, and in other cases, nucellar cells may develop into embryos without any reduction division process.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen083"
  },
  {
    "question_text": "True or False: Although hybrid varieties increase productivity, hybrid seeds must be produced every year due to the segregation of characters.",
    "type": "True/False",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "True",
    "explanation": "Hybrid plants segregate in the progeny if their seeds are saved, meaning farmers have to produce or purchase new hybrid seeds every year to maintain hybrid traits.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Understand",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen084"
  },
  {
    "question_text": "True or False: Transferring apomictic genes into hybrid crops would eliminate genetic segregation in subsequent generations.",
    "type": "True/False",
    "difficulty": "Hard",
    "options": null,
    "correct_answer": "True",
    "explanation": "If hybrid crops become apomictic, the progeny will be clones of the hybrid parent and genetic segregation would be eliminated, preserving the desirable traits.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Evaluate",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen085"
  },
  {
    "question_text": "If an orange seed contains 4 embryos and 5 such seeds yield a total of 20 embryos, what is the average number of embryos per seed?",
    "type": "Numerical",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "4",
    "explanation": "The average is calculated by dividing the total number of embryos by the number of seeds (20 ÷ 5 = 4).",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Apply",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen086"
  },
  {
    "question_text": "Describe an observational experiment to study polyembryony in orange seeds.",
    "type": "Short Answer",
    "difficulty": "Medium",
    "options": null,
    "correct_answer": "An experiment to study polyembryony in orange seeds involves extracting several orange seeds, gently squeezing them to expose the embryos, and then observing and counting the number and variation in the embryos across different seeds.",
    "explanation": "This experimental procedure aligns with the textbook instruction to observe multiple embryos in each seed and to record variations in size and shape.",
    "topic": "Apomixis and Polyembryony",
    "bloom_level": "Create",
    "source": "generated",
    "chapter_id": "lebo101",
    "section_id": "06_section_1_5",
    "question_id": "cbse_xii_lebo1dd_c101_gen087"
  }
]